title: File Creation Date Changed to Another Year
id: 558eebe5-f2ba-4104-b339-36f7902bcc1a
status: test
description: |
  Attackers may change the file creation time of a backdoor to make it look like it was installed with the operating system.
  Note that many processes legitimately change the creation time of a file; it does not necessarily indicate malicious activity.
references:
- https://www.inversecos.com/2022/04/defence-evasion-technique-timestomping.html
author: frack113, Florian Roth (Nextron Systems)
date: 2022-08-12
modified: 2022-10-25
tags:
- attack.t1070.006
- attack.defense-evasion
logsource:
  category: file_change
  product: windows
detection:
  selection1:
    PreviousCreationUtcTime|startswith: '2022'
  filter1:
    CreationUtcTime|startswith: '2022'
  selection2:
    PreviousCreationUtcTime|startswith: '202'
  filter2:
    CreationUtcTime|startswith: '202'
  gen_filter_updates:
  - Image:
    - 'C:\Windows\system32\ProvTool.exe'
    - 'C:\Windows\System32\usocoreworker.exe'
    - 'C:\Windows\ImmersiveControlPanel\SystemSettings.exe'
  - TargetFilename|startswith: 'C:\ProgramData\USOPrivate\UpdateStore\'
  - TargetFilename|endswith:
    - '.tmp'
    - '.temp'
  gen_filter_tiworker:
    Image|startswith: 'C:\WINDOWS\'
    Image|endswith: '\TiWorker.exe'
    TargetFilename|endswith: '.cab'
  condition: (( selection1 and not filter1 ) or ( selection2 and not filter2 )) and
    not 1 of gen_filter*
falsepositives:
- Changes made to or by the local NTP service
level: high
notes: |
  ### Technical Context
  This Sigma rule detects potential timestomping behavior, where an attacker alters the file creation date of a malicious executable to disguise its true installation time. It works by analyzing file change logs on Windows systems, specifically looking for changes in the `CreationUtcTime` and `PreviousCreationUtcTime` attributes of files. The rule tracks whether these timestamps start with '2022', which may indicate attempts to obfuscate the origin of the file. The detection logic includes various filters to account for legitimate processes (like `ProvTool.exe` and `TiWorker.exe`) and file paths associated with routine system updates, minimizing false positives caused by regular system operations. 
  ### Investigation Steps
  - Review the EDR process creation logs to identify if any suspicious processes were executed around the same time as the timestamp change.
  - Check the file existence and its change history using the file integrity monitoring feature in the SIEM to understand the timeline of the file's modifications. 
  - Utilize the proxy logs to ascertain if there are any related external communications that could tie back to the modified file, especially if it is a known backdoor.
  - Cross-reference cloud logs (if applicable) to determine if the file or similar files were accessed or modified in cloud environments, which could indicate coordinated malicious activity.
