title: Unusual Parent Process For Cmd.EXE
id: 4b991083-3d0e-44ce-8fc4-b254025d8d4b
status: test
description: Detects suspicious parent process for cmd.exe
references:
- https://www.elastic.co/guide/en/security/current/unusual-parent-process-for-cmd.exe.html
author: Tim Rauch, Elastic (idea)
date: 2022-09-21
modified: 2023-12-05
tags:
- attack.execution
- attack.t1059
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith: '\cmd.exe'
    ParentImage|endswith:
    - '\csrss.exe'
    - '\ctfmon.exe'
    - '\dllhost.exe'
    - '\epad.exe'
    - '\FlashPlayerUpdateService.exe'
    - '\GoogleUpdate.exe'
    - '\jucheck.exe'
    - '\jusched.exe'
    - '\LogonUI.exe'
    - '\lsass.exe'
    - '\regsvr32.exe'
    - '\SearchIndexer.exe'
    - '\SearchProtocolHost.exe'
    - '\SIHClient.exe'
    - '\sihost.exe'
    - '\slui.exe'
    - '\spoolsv.exe'
    - '\sppsvc.exe'
    - '\taskhostw.exe'
    - '\unsecapp.exe'
    - '\WerFault.exe'
    - '\wermgr.exe'
    - '\wlanext.exe'
    - '\WUDFHost.exe'
  condition: selection
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  The Sigma rule "Unusual Parent Process For Cmd.EXE" detects potentially malicious activity based on the context in which `cmd.exe` is executed. Specifically, it focuses on identifying instances where `cmd.exe` is launched by atypical parent processes that are not normally associated with command-line execution. This detection is crucial because attackers may leverage `cmd.exe` to execute commands or scripts, but they often do so in a stealthy or abnormal manner by chaining processes through unusual parent executables. The primary data source for this detection is process creation logs, which capture details about new processes, including the executable that was run and its parent process. By examining the relationship between `cmd.exe` and its parent processes, the rule can trigger alerts on suspicious behavior indicative of potential exploitation or post-exploitation activity.
  ### Investigation Steps
  - Review the process creation logs in your EDR solution to identify the alerts generated by this rule, focusing on the specific instances where `cmd.exe` was spawned.
  - Analyze the parent processes associated with each detected instance of `cmd.exe`, comparing them against a baseline of normal operational behavior in the environment.
  - Utilize the cloud platform's logging (if applicable) to cross-reference any suspicious activity with user account actions and service requests to ascertain legitimate or illegitimate usage.
  - Conduct further investigation on affected systems by examining command-line parameters used with `cmd.exe`, as well as network activity linked to the alert, to understand the potential scope of the incident.
