title: Wusa.EXE Executed By Parent Process Located In Suspicious Location
id: ef64fc9c-a45e-43cc-8fd8-7d75d73b4c99
status: experimental
description: |
  Detects execution of the "wusa.exe" (Windows Update Standalone Installer) utility by a parent process that is located in a suspicious location.
  Attackers could instantiate an instance of "wusa.exe" in order to bypass User Account Control (UAC). They can duplicate the access token from "wusa.exe" to gain elevated privileges.
references:
- https://www.fortinet.com/blog/threat-research/konni-campaign-distributed-via-malicious-document
author: X__Junior (Nextron Systems)
date: 2023-11-26
modified: 2024-08-15
tags:
- attack.execution
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
    Image|endswith: '\wusa.exe'
  selection_paths_1:
    ParentImage|contains:
            # Note: Add additional suspicious locations to increase coverage
    - ':\Perflogs\'
    - ':\Users\Public\'
    - ':\Windows\Temp\'
    - '\Appdata\Local\Temp\'
    - '\Temporary Internet'
  selection_paths_2:
  - ParentImage|contains|all:
    - ':\Users\'
    - '\Favorites\'
  - ParentImage|contains|all:
    - ':\Users\'
    - '\Favourites\'
  - ParentImage|contains|all:
    - ':\Users\'
    - '\Contacts\'
  - ParentImage|contains|all:
    - ':\Users\'
    - '\Pictures\'
  filter_main_msu:
        # Note: We exclude MSU extension files. A better approach is to baseline installation of updates in your env to avoid false negatives.
    CommandLine|contains: '.msu'
  condition: selection_img and 1 of selection_paths_* and not 1 of filter_main_*
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This detection rule aims to identify the execution of `wusa.exe`, the Windows Update Standalone Installer, when it is initiated by a parent process that resides in suspicious file paths commonly exploited by attackers. The rationale behind this is that adversaries may utilize `wusa.exe` to bypass User Account Control (UAC) and escalate privileges by leveraging tokens from its successful execution. The rule analyzes process creation logs, focusing specifically on the images of running processes and their parent processes' paths. It flags any `wusa.exe` executions initiated by a parent process located in directories such as `C:\Perflogs\`, `C:\Users\Public\`, and various subdirectories under `C:\Users\`, indicating potential malicious behavior.
  ### Investigation Steps
  - Use EDR tools to investigate the execution history and parent process details of `wusa.exe`. Check if it was launched from any of the suspicious directories specified in the detection rule.
  - Review command-line parameters associated with the `wusa.exe` execution through process creation logs. Look for indicators that might suggest an attempt to manipulate the update process or bypass security features.
  - Perform a search across the endpoint for other instances of `wusa.exe` or related files in unusual locations. This can indicate widespread exploitation or an ongoing attack.
  - If applicable, examine alert histories in SIEM for related events around the time of the alert. Correlate this with user activity logs from Proxy or VPN to assess potential malicious access or lateral movement.
