title: Potential Crypto Mining Activity
id: 66c3b204-9f88-4d0a-a7f7-8a57d521ca55
status: stable
description: Detects command line parameters or strings often used by crypto miners
references:
- https://www.poolwatch.io/coin/monero
author: Florian Roth (Nextron Systems)
date: 2021-10-26
modified: 2023-02-13
tags:
- attack.impact
- attack.t1496
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|contains:
    - ' --cpu-priority='
    - '--donate-level=0'
    - ' -o pool.'
    - ' --nicehash'
    - ' --algo=rx/0 '
    - 'stratum+tcp://'
    - 'stratum+udp://'
            # base64 encoded: --donate-level=
    - 'LS1kb25hdGUtbGV2ZWw9'
    - '0tZG9uYXRlLWxldmVsP'
    - 'tLWRvbmF0ZS1sZXZlbD'
            # base64 encoded: stratum+tcp:// and stratum+udp://
    - 'c3RyYXR1bSt0Y3A6Ly'
    - 'N0cmF0dW0rdGNwOi8v'
    - 'zdHJhdHVtK3RjcDovL'
    - 'c3RyYXR1bSt1ZHA6Ly'
    - 'N0cmF0dW0rdWRwOi8v'
    - 'zdHJhdHVtK3VkcDovL'
  filter:
    CommandLine|contains:
    - ' pool.c '
    - ' pool.o '
    - 'gcc -'
  condition: selection and not filter
falsepositives:
- Legitimate use of crypto miners
- Some build frameworks
level: high
notes: |
  ### Technical Context
  This detection rule is designed to identify potential crypto mining activities on Windows systems by analyzing process creation logs for specific command-line parameters and strings commonly associated with such tools. The rule looks for indicators such as variations of mining pool addresses (e.g., `stratum+tcp://`), parameters that dictate CPU priority and donation levels, as well as base64 encoded versions of these strings to cover various evasion techniques employed by attackers. By monitoring process creation logs, incident responders can detect unauthorized or suspicious mining behavior that may signify misuse of corporate resources, thus impacting both performance and security.
  ### Investigation Steps
  - Utilize EDR tools to review the process tree related to the detected command-line parameters, checking for unusual parent processes that may indicate malicious intent. 
  - Analyze the command line arguments in detail to confirm they match known crypto mining software patterns and are not legitimate business applications.
  - Examine network traffic logs in your NDR or firewall to identify outbound connections made to the mining pools noted in the alerts, cross-referencing them against a list of reputable services.
  - Investigate user accounts associated with the process creation, looking for anomalies such as unauthorized use or accounts with excessive privileges that could enable crypto mining activities.
