title: File Encoded To Base64 Via Certutil.EXE
id: e62a9f0c-ca1e-46b2-85d5-a6da77f86d1a
status: test
description: Detects the execution of certutil with the "encode" flag to encode a
  file to base64. This can be abused by threat actors and attackers for data exfiltration
references:
- https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/certutil
- https://unit42.paloaltonetworks.com/new-babyshark-malware-targets-u-s-national-security-think-tanks/
- https://lolbas-project.github.io/lolbas/Binaries/Certutil/
author: Florian Roth (Nextron Systems), Jonhnathan Ribeiro, oscd.community, Nasreddine
  Bencherchali (Nextron Systems)
date: 2019-02-24
modified: 2024-03-05
tags:
- attack.defense-evasion
- attack.t1027
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: '\certutil.exe'
  - OriginalFileName: 'CertUtil.exe'
  selection_cli:
    CommandLine|contains|windash: '-encode'
  condition: all of selection_*
falsepositives:
- As this is a general purpose rule, legitimate usage of the encode functionality
  will trigger some false positives. Apply additional filters accordingly
level: medium
notes: |
  ### Technical Context
  This Sigma rule is designed to detect the use of the `certutil.exe` command-line utility with the `-encode` flag, which is commonly employed for Base64 encoding of files. Attackers may misuse this technique for data exfiltration efforts, as encoding files in Base64 can obscure their contents and bypass detection mechanisms. The rule examines process creation logs from Windows systems, focusing on specific characteristics of the `certutil.exe` process, notably the image path and the command-line parameters used during execution. When a process matches the criteria of using `certutil.exe` with the `-encode` argument, an alert is generated, indicating potential malicious activity that warrants further investigation.
  ### Investigation Steps
  - Review the process creation logs in the EDR to identify the timestamp, user context, and parent process associated with the execution of `certutil.exe` with the `-encode` flag.
  - Examine the command-line parameters used during the execution to assess if any sensitive files or directories were targeted for encoding, indicating potential data exfiltration intentions.
  - Conduct a search on the endpoint and surrounding network environments to identify any subsequent network activity or connections that could indicate data exfiltration attempts following the use of `certutil.exe`.
  - Utilize SIEM and proxy logs to trace any outbound communications from the endpoint to verify whether encoded data was transmitted externally or to suspicious destinations.
