title: Suspicious AgentExecutor PowerShell Execution
id: c0b40568-b1e9-4b03-8d6c-b096da6da9ab
related:
- id: 7efd2c8d-8b18-45b7-947d-adfe9ed04f61
  type: similar
status: test
description: Detects execution of the AgentExecutor.exe binary. Which can be abused
  as a LOLBIN to execute powershell scripts with the ExecutionPolicy "Bypass" or any
  binary named "powershell.exe" located in the path provided by 6th positional argument
author: Nasreddine Bencherchali (Nextron Systems), memory-shards
references:
- https://twitter.com/lefterispan/status/1286259016436514816
- https://lolbas-project.github.io/lolbas/OtherMSBinaries/Agentexecutor/
- https://learn.microsoft.com/en-us/mem/intune/apps/intune-management-extension
- https://twitter.com/jseerden/status/1247985304667066373/photo/1
date: 2022-12-24
modified: 2024-08-07
tags:
- attack.defense-evasion
- attack.t1218
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: '\AgentExecutor.exe'
  - OriginalFileName: 'AgentExecutor.exe'
  selection_cli:
        # Example:
        #   AgentExecutor.exe -powershell [scriptPath] [outputFilePath] [errorFilePath] [timeoutFilePath] [timeoutSeconds] [powershellPath] [enforceSignatureCheck] [runAs32BitOn64]
        # Note:
        #   - If [timeoutSeconds] is NULL then it defaults to 60000
        #   - If [enforceSignatureCheck] is:
        #       - "NULL" or "1" then a PowerShell instance is spawned with the args: "-NoProfile -executionPolicy allsigned -file "
        #       - Else a PowerShell instance is spawned with the args: "-NoProfile -executionPolicy bypass -file "
        #   - [powershellPath] is always concatendated to "powershell.exe"
    CommandLine|contains:
    - ' -powershell'         # Also covers the "-powershellDetection" flag
    - ' -remediationScript'
  filter_main_pwsh:
    CommandLine|contains:
    - 'C:\Windows\System32\WindowsPowerShell\v1.0\'
    - 'C:\Windows\SysWOW64\WindowsPowerShell\v1.0\'
  filter_main_intune:
    ParentImage|endswith: '\Microsoft.Management.Services.IntuneWindowsAgent.exe'
  condition: all of selection_* and not 1 of filter_main_*
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  The "Suspicious AgentExecutor PowerShell Execution" rule is designed to detect the execution of the `AgentExecutor.exe` binary, a potential Living Off The Land Binary (LOLBIN) that can facilitate the execution of PowerShell scripts with modified execution policies. The rule specifically targets instances where `AgentExecutor.exe` is invoked with parameters indicating it will launch PowerShell, such as `-powershell`, as well as any binary named `powershell.exe` located in a specified path indicated by the command-line arguments. The detection mechanism relies on process creation logs that capture relevant details like the image name and command-line arguments, allowing SOC analysts to identify potentially malicious behavior linked to PowerShell script execution. 
  ### Investigation Steps
  - Review the process creation logs in the EDR for any instances of `AgentExecutor.exe` executing with the `-powershell` command-line argument to identify suspicious activity.
  - Check the command-line parameters associated with the execution to determine if they include paths leading to PowerShell and if the execution policy was altered (i.e., set to Bypass).
  - Investigate the parent process of `AgentExecutor.exe` to ascertain whether it was launched by legitimate applications like `Microsoft.Management.Services.IntuneWindowsAgent.exe` or if it can be tied to anomalous or unauthorized software.
  - Utilize AV and endpoint security tools to scan for known signatures and behaviors associated with the `AgentExecutor.exe` and any invoked PowerShell processes, ensuring that no known malicious activity is occurring.
