title: HackTool - LaZagne Execution
id: c2b86e67-b880-4eec-b045-50bc98ef4844
status: experimental
description: |
  Detects the execution of the LaZagne. A utility used to retrieve multiple types of passwords stored on a local computer.
  LaZagne has been leveraged multiple times by threat actors in order to dump credentials.
references:
- https://github.com/AlessandroZ/LaZagne/tree/master
- https://thedfirreport.com/2022/05/09/seo-poisoning-a-gootloader-story/
- https://cloud.google.com/blog/topics/threat-intelligence/alphv-ransomware-backup/
- https://securelist.com/defttorero-tactics-techniques-and-procedures/107610/
- https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/800c0e06571993a54e39571cf27fd474dcc5c0bc/2017/2017.11.14.Muddying_the_Water/muddying-the-water-targeted-attacks.pdf
author: Nasreddine Bencherchali (Nextron Systems)
date: 2024-06-24
modified: 2024-08-16
tags:
- attack.credential-access
logsource:
  product: windows
  category: process_creation
detection:
  selection_img:
    Image|endswith: '\lazagne.exe'
  selection_clionly:
        # Note: This selection can be prone to FP. An initial baseline is required
    Image|contains:
    - ':\PerfLogs\'
    - ':\ProgramData\'
    - ':\Temp\'
    - ':\Tmp\'
    - ':\Windows\Temp\'
    - '\AppData\'
    - '\Downloads\'
    - '\Users\Public\'
    CommandLine|endswith:
    - '.exe all'
    - '.exe browsers'
    - '.exe chats'
    - '.exe databases'
    - '.exe games'
    - '.exe git'
    - '.exe mails'
    - '.exe maven'
    - '.exe memory'
    - '.exe multimedia'
            # - '.exe php' # Might be prone to FP
            # - '.exe svn' # Might be prone to FP
    - '.exe sysadmin'
    - '.exe unused'
    - '.exe wifi'
    - '.exe windows'
  selection_cli_modules:
    CommandLine|contains:
    - 'all '
    - 'browsers '
    - 'chats '
    - 'databases '
    - 'games '
    - 'git '
    - 'mails '
    - 'maven '
    - 'memory '
    - 'multimedia '
    - 'php '
    - 'svn '
    - 'sysadmin '
    - 'unused '
    - 'wifi '
    - 'windows '
  selection_cli_options:
    CommandLine|contains:
    - '-oA'
    - '-oJ'
    - '-oN'
    - '-output'
    - '-password'
    - -1Password
    - '-apachedirectorystudio'
    - '-autologon'
    - '-ChromiumBased'
    - '-composer'
    - '-coreftp'
    - '-credfiles'
    - '-credman'
    - '-cyberduck'
    - '-dbvis'
    - '-EyeCon'
    - '-filezilla'
    - '-filezillaserver'
    - '-ftpnavigator'
    - '-galconfusion'
    - '-gitforwindows'
    - '-hashdump'
    - '-iisapppool'
    - '-IISCentralCertP'
    - '-kalypsomedia'
    - '-keepass'
    - '-keepassconfig'
    - '-lsa_secrets'
    - '-mavenrepositories'
    - '-memory_dump'
    - '-Mozilla'
    - '-mRemoteNG'
    - '-mscache'
    - '-opensshforwindows'
    - '-openvpn'
    - '-outlook'
    - '-pidgin'
    - '-postgresql'
    - '-psi-im'
    - '-puttycm'
    - '-pypykatz'
    - '-Rclone'
    - '-rdpmanager'
    - '-robomongo'
    - '-roguestale'
    - '-skype'
    - '-SQLDeveloper'
    - '-squirrel'
    - '-tortoise'
    - '-turba'
    - '-UCBrowser'
    - '-unattended'
    - '-vault'
    - '-vaultfiles'
    - '-vnc'
    - '-windows'
    - '-winscp'
    - '-wsl'
  condition: selection_img or selection_clionly or (selection_cli_modules and selection_cli_options)
falsepositives:
- Some false positive is expected from tools with similar command line flags.
# Note: Increase the level to "high" after an initial baseline
level: medium
notes: |
  n
  ### Technical Context
  The Sigma rule titled "HackTool 
  - LaZagne Execution" is designed to detect the execution of LaZagne, a credential-stealing tool that extracts various stored passwords from local computers. LaZagne is often used by threat actors to facilitate credential harvesting, making its detection crucial for enterprise security. The rule utilizes process creation logs to identify instances where LaZagne is executed, looking specifically for process images that end with `lazagne.exe`. It also analyzes command-line parameters for suspicious strings commonly associated with LaZagne's functionality, such as specific options that target various browser, chat, and database credentials. By leveraging these data sources, the rule aims to uncover malicious activity tied to the misuse of legitimate tools used for credential access.
  ### Investigation Steps
  - Review EDR alerts for any instances of `lazagne.exe` execution, focusing specifically on the context in which the process was initiated.
  - Analyze command-line arguments related to the detected LaZagne execution to identify any potentially malicious options or target applications.
  - Check historical logs from the past few days to determine if there is a pattern of LaZagne usage across multiple endpoints, indicating a possible escalated threat.
  - Investigate associated network traffic through the NGFW and Proxy logs to identify any connections made by the host post-execution, which could indicate data exfiltration.
