title: PUA - Nimgrab Execution
id: 74a12f18-505c-4114-8d0b-8448dd5485c6
status: test
description: Detects the usage of nimgrab, a tool bundled with the Nim programming
  framework and used for downloading files.
references:
- https://github.com/redcanaryco/atomic-red-team/blob/28d190330fe44de6ff4767fc400cc10fa7cd6540/atomics/T1105/T1105.md
author: frack113
date: 2022-08-28
modified: 2024-11-23
tags:
- attack.command-and-control
- attack.t1105
logsource:
  category: process_creation
  product: windows
detection:
  selection_name:
    Image|endswith: '\nimgrab.exe'
  selection_hashes:
    Hashes|contains:
    - MD5=2DD44C3C29D667F5C0EF5F9D7C7FFB8B
    - SHA256=F266609E91985F0FE3E31C5E8FAEEEC4FFA5E0322D8B6F15FE69F4C5165B9559
    - IMPHASH=C07FDDD21D123EA9B3A08EEF44AAAC45
  condition: 1 of selection_*
falsepositives:
- Legitimate use of Nim on a developer systems
level: high
notes: |
  ### Technical Context
  This detection rule is designed to identify the execution of `nimgrab.exe`, a tool associated with the Nim programming framework that is typically used to download files. The rule focuses on specific indicators, namely the file name and its associated hashes (MD5, SHA256, and IMPHASH). By monitoring process creation logs on Windows systems, the rule detects any instances of `nimgrab.exe` execution, which could indicate potential malicious activity or unauthorized file downloads. Given that `nimgrab.exe` can be misused in command-and-control scenarios, prompt identification is critical for maintaining network security.
  The detection relies on process creation events, which capture details such as the executable name and its hashes when the process is launched. This enables the SOC team to respond swiftly to potentially dangerous activity while filtering out legitimate use cases, such as developers working with Nim on their systems.
  ### Investigation Steps
  - Use EDR tools to search for instances of `nimgrab.exe` execution across endpoints. Review the process tree to determine the context of its execution.
  - Check for any related suspicious network activity in NDR logs. Look for outbound connections initiated by `nimgrab.exe` that could indicate data exfiltration or command-and-control communications.
  - Analyze logs from the SIEM to identify correlated events around the time of `nimgrab.exe` execution, such as unusual logins or other suspicious process activities.
  - Review proxy logs for any downloads or requests made by `nimgrab.exe`, assessing whether they correspond to potentially malicious URLs or unexpected file types.
