title: Potential Tampering With RDP Related Registry Keys Via Reg.EXE
id: 0d5675be-bc88-4172-86d3-1e96a4476536
status: test
description: Detects the execution of "reg.exe" for enabling/disabling the RDP service
  on the host by tampering with the 'CurrentControlSet\Control\Terminal Server' values
references:
- https://thedfirreport.com/2022/02/21/qbot-and-zerologon-lead-to-full-domain-compromise/
author: pH-T (Nextron Systems), @Kostastsale, @TheDFIRReport
date: 2022-02-12
modified: 2023-02-05
tags:
- attack.defense-evasion
- attack.lateral-movement
- attack.t1021.001
- attack.t1112
logsource:
  product: windows
  category: process_creation
detection:
  selection_main_img:
  - Image|endswith: '\reg.exe'
  - OriginalFileName: 'reg.exe'
  selection_main_cli:
    CommandLine|contains|all:
    - ' add '
    - '\CurrentControlSet\Control\Terminal Server'
    - 'REG_DWORD'
    - ' /f'
  selection_values_1:
    CommandLine|contains|all:
    - 'Licensing Core'
    - 'EnableConcurrentSessions'
  selection_values_2:
    CommandLine|contains:
    - 'WinStations\RDP-Tcp'
    - 'MaxInstanceCount'
    - 'fEnableWinStation'
    - 'TSUserEnabled'
    - 'TSEnabled'
    - 'TSAppCompat'
    - 'IdleWinStationPoolCount'
    - 'TSAdvertise'
    - 'AllowTSConnections'
    - 'fSingleSessionPerUser'
    - 'fDenyTSConnections'
  condition: all of selection_main_* and 1 of selection_values_*
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This Sigma rule is designed to detect potential malicious activity involving Remote Desktop Protocol (RDP) by monitoring the execution of "reg.exe", a command-line utility for modifying the Windows registry. Specifically, the rule looks for command-line parameters that indicate modifications to the 'CurrentControlSet\Control\Terminal Server' registry values, which govern RDP-related settings. If an attacker gains unauthorized access, they may use reg.exe to enable or disable RDP, facilitating lateral movement or maintaining persistence within the network. By monitoring process creation logs to capture executions of reg.exe with specific command-line arguments, this rule aims to flag suspicious alterations to RDP configurations, providing critical insights for further investigation.
  ### Investigation Steps
  - Review EDR logs to identify additional context around the execution of reg.exe, including parent processes that may indicate whether it was initiated by legitimate administrative actions or potentially malicious entities.
  - Cross-verify the timestamp of the detected command with user login events in Proxy and VPN logs to check for any unauthorized access to the affected system at that time.
  - Investigate related registry changes by exporting the registry settings of the affected server and comparing them with trusted baseline configurations to identify unauthorized modifications.
  - Assess the overall security posture by checking for other active connections or processes related to RDP that may indicate lateral movement or persistence tactics among compromised systems.
