title: Password Provided In Command Line Of Net.EXE
id: d4498716-1d52-438f-8084-4a603157d131
status: test
description: Detects a when net.exe is called with a password in the command line
references:
- Internal Research
author: Tim Shelton (HAWK.IO)
date: 2021-12-09
modified: 2023-02-21
tags:
- attack.defense-evasion
- attack.initial-access
- attack.persistence
- attack.privilege-escalation
- attack.lateral-movement
- attack.t1021.002
- attack.t1078
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith:
    - '\net.exe'
    - '\net1.exe'
  - OriginalFileName:
    - 'net.exe'
    - 'net1.exe'
  selection_cli:
    CommandLine|contains|all:
    - ' use '
    - ':*\\'
    - '/USER:* *'
  filter_main_empty:
    CommandLine|endswith: ' '
  condition: all of selection_* and not 1 of filter_main_*
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  This detection rule targets instances where the Windows command-line utility `net.exe` is executed with a password parameter. The rule captures process creation logs specifically for `net.exe` and `net1.exe`, looking for command lines that indicate the use of network resources, authentication details, and user credentials. Key indicators include the presence of the terms "use" within the command line, the use of UNC paths indicated by `:\`, and a specific pattern related to the user authentication syntax (`/USER:*`). By filtering out incomplete command lines that end with a space, this rule helps to identify potentially malicious attempts to gain unauthorized access, escalate privileges, or perform lateral movements within the network.
  ### Investigation Steps
  - Query the EDR for any process creation events involving `net.exe` or `net1.exe` within the time frame of the alert to gather context on the execution.
  - Review the command line parameters associated with the alert to analyze the specified user and resources being accessed, assisting in understanding the potential impact.
  - Check the VPN and Proxy logs to determine if there has been any unusual remote access or traffic patterns around the time of the event.
  - Investigate the account used in the command line against IAM logs in cloud platforms (like AWS, GCP, or Azure) to verify if the credentials are valid and to assess if any unauthorized access attempts have occurred.
