title: HackTool - RemoteKrbRelay Execution
id: a7664b14-75fb-4a50-a223-cb9bc0afbacf
status: experimental
description: |
  Detects the use of RemoteKrbRelay, a Kerberos relaying tool via CommandLine flags and PE metadata.
references:
- https://github.com/CICADA8-Research/RemoteKrbRelay
author: Nasreddine Bencherchali (Nextron Systems)
date: 2024-06-27
tags:
- attack.credential-access
- attack.t1558.003
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: '\RemoteKrbRelay.exe'
  - OriginalFileName: 'RemoteKrbRelay.exe'
  selection_cli_required:
    CommandLine|contains|all:
    - ' -clsid '
    - ' -target '
    - ' -victim '
    # selection_cli_attacks:
    #     # Note: In the current implementation these flags do not require any other flags. Which means they can't be used on their own. They're already covered by "selection_cli_required"
    #     CommandLine|contains:
    #         - '-adcs ' # relay to HTTP Web Enrollment and get certificate
    #         - '-laps ' # relay to LDAP and extract LAPS passwords
    #         - '-ldapwhoami ' # relay to LDAP and get info about relayed user
    #         - '-shadowcred ' # relay to LDAP and setup Shadow Credentials
  selection_cli_attack_smb:
    CommandLine|contains|all:
    - '-smb '         # relay to SMB
    - '--smbkeyword '
    CommandLine|contains:
    - 'interactive'
    - 'secrets'
    - 'service-add'
  selection_cli_attack_rbcd_main:
    CommandLine|contains: '-rbcd '     # relay to LDAP and setup RBCD
  selection_cli_attack_rbcd_options:
    CommandLine|contains:
    - '-cn '         # Computer name that will be written to msDs-AllowedToActOnBehalfOfOtherIdentity
    - '--computername '         # Computer name that will be written to msDs-AllowedToActOnBehalfOfOtherIdentity
  selection_cli_attack_changepass:
    CommandLine|contains: '-chp '     # relay to LDAP and change user password
    CommandLine|contains|all:
    - '-chpPass '         # new password
    - '-chpUser '         # the name of the user whose password you want to change
  selection_cli_attack_addgrpname:
    CommandLine|contains|all:
    - '-addgroupmember '         # relay to LDAP and add user to group
    - '-group '
    - '-groupuser '
  condition: selection_img or selection_cli_required or all of selection_cli_attack_rbcd_*
    or selection_cli_attack_changepass or selection_cli_attack_addgrpname or selection_cli_attack_smb
falsepositives:
- Unlikely
level: high
notes: |
  n
  ### Technical Context
  The detection rule "HackTool 
  - RemoteKrbRelay Execution" identifies potential malicious use of the RemoteKrbRelay tool, which is commonly used for Kerberos relaying attacks in Windows environments. The rule specifically looks for the execution of the RemoteKrbRelay executable (`RemoteKrbRelay.exe`) as well as certain command line parameters that indicate its use in credential theft or unauthorized actions against the target user or service. Important parameters include `-clsid`, `-target`, and `-victim`, which can signal attempts to manipulate Kerberos tickets or impersonate users. By monitoring process creation logs in Windows systems, this rule capitalizes on telemetry from Sysmon logs to catch these critical activities, directly aligning with the MITRE ATT&CK technique T1558.003 (Credentials from Kerberos).
  ### Investigation Steps
  - **Verify Process Execution:** Check for the `RemoteKrbRelay.exe` process in your EDR solution. Cross-reference its creation timestamps with the detected alerts to establish a timeline of the incident.
  - **Analyze Command Line Arguments:** Review the command line arguments associated with the process. Look for flags that match those specified in the detection rule to further understand the attack vector.
  - **Review Related User Activities:** Use the Windows Security logs to track user logins, account changes, and access patterns that may correlate with the detected use of RemoteKrbRelay.
  - **Conduct Network Traffic Analysis:** Assess network logs for any anomalous SMB or LDAP traffic generated from the host running the RemoteKrbRelay, focusing on connections that may indicate credential theft or unauthorized access attempts.
  ### Prioritization
  This alert is classified as high severity due to the potential for significant damage that could stem from a successful Kerberos relaying attack, which can lead to unauthorized access to sensitive systems and data.
  ### Blind Spots and Assumptions
  The effectiveness of this detection rule may be reduced in environments where RemoteKrbRelay is permitted or used legitimately among administrative tasks, as well as scenarios where the executable name is altered to evade detection. Additionally, if command line flags are obfuscated or if the tool is run in a way that doesn't utilize the expected arguments, the rule may fail to trigger. Analysts should also consider that attacks may be executed from non-standard locations or via alternative methods not captured by this rule.
  > **Disclaimer:** This investigation guide was created using generative AI technology and has not been reviewed for its accuracy and relevance. While every effort has been made to ensure its quality, we recommend validating the content and adapting it to suit specific environment and operational needs. Please communicate any changes to the detection engineering team.
