title: Microsoft IIS Service Account Password Dumped
id: 2d3cdeec-c0db-45b4-aa86-082f7eb75701
status: test
description: Detects the Internet Information Services (IIS) command-line tool, AppCmd,
  being used to list passwords
references:
- https://www.elastic.co/guide/en/security/current/microsoft-iis-service-account-password-dumped.html
- https://twitter.com/0gtweet/status/1588815661085917186?cxt=HHwWhIDUyaDbzYwsAAAA
- https://www.netspi.com/blog/technical/network-penetration-testing/decrypting-iis-passwords-to-break-out-of-the-dmz-part-2/
author: Tim Rauch, Janantha Marasinghe, Elastic (original idea)
date: 2022-11-08
modified: 2023-01-22
tags:
- attack.credential-access
- attack.t1003
logsource:
  category: process_creation
  product: windows
detection:
  selection_base_name:
  - Image|endswith: '\appcmd.exe'
  - OriginalFileName: 'appcmd.exe'
  selection_base_list:
    CommandLine|contains: 'list '
  selection_standalone:
    CommandLine|contains:
    - ' /config'         # https://pbs.twimg.com/media/FgydDAJWIAEio34?format=png&name=900x900
    - ' /xml'
            # We cover the "-" version just in case :)
    - ' -config'
    - ' -xml'
  selection_cmd_flags:
    CommandLine|contains:
    - ' /@t'         # Covers both "/@text:*" and "/@t:*"
    - ' /text'
    - ' /show'
            # We cover the "-" version just in case :)
    - ' -@t'
    - ' -text'
    - ' -show'
  selection_cmd_grep:
    CommandLine|contains:
    - ':\*'
    - 'password'
  condition: all of selection_base_* and (selection_standalone or all of selection_cmd_*)
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This Sigma rule is designed to detect potentially malicious activity involving Microsoft Internet Information Services (IIS) by identifying the use of the AppCmd command-line tool to list sensitive information, including service account passwords. Specifically, it targets the execution of AppCmd with command-line parameters that suggest password retrieval attempts, such as "list," "/config," and several flags that indicate options for displaying password information. The rule relies on process creation logs that capture key details, including the image name, command-line arguments, and specific patterns typically associated with the dumping of credentials. By analyzing these logs, the rule helps to identify actions that may lead to unauthorized access or credential compromise within the IIS environment.
  ### Investigation Steps
  - Utilize the EDR tool to correlate the detected AppCmd execution with additional contextual data, such as user activity logs, to determine if this command was executed by an authorized user or process.
  - Examine the command line arguments and parameters used in the detected process for any anomalies, particularly focusing on keywords related to credential access like "password," ":*", or misused flags.
  - Review the IIS Access and Security logs to identify any unusual access patterns or failed login attempts that may correlate with the time of the detected command usage.
  - Cross-reference any detected IP addresses or user accounts with known malicious actors or anomalous behavior in the network traffic logs using the NDR tool.
