title: Suspicious X509Enrollment - Process Creation
id: 114de787-4eb2-48cc-abdb-c0b449f93ea4
related:
- id: 504d63cb-0dba-4d02-8531-e72981aace2c
  type: similar
status: test
description: Detect use of X509Enrollment
references:
- https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse?slide=42
- https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse?slide=41
- https://learn.microsoft.com/en-us/dotnet/api/microsoft.hpc.scheduler.store.cx509enrollmentwebclassfactoryclass?view=hpc-sdk-5.1.6115
author: frack113
date: 2022-12-23
tags:
- attack.defense-evasion
- attack.t1553.004
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    CommandLine|contains:
    - 'X509Enrollment.CBinaryConverter'
    - '884e2002-217d-11da-b2a4-000e7bbb2b09'
  condition: selection
falsepositives:
- Legitimate administrative script
level: medium
notes: |
  ### Technical Context
  This Sigma detection rule focuses on identifying potentially malicious use of the `X509Enrollment.CBinaryConverter` component during process creation on Windows systems. The rule targets specific command-line parameters associated with this component, which are often utilized in scenarios of credential harvesting or other forms of evasion tactics by malware. The detected command line includes the GUID `884e2002-217d-11da-b2a4-000e7bbb2b09`, indicative of a specific method within the X509 enrollment process that may be abused by actors aiming to bypass security measures. Monitoring for these patterns within process creation logs helps security operations center (SOC) teams flag suspicious activities related to certificate management and potential credential misuse.
  ### Investigation Steps
  - Review process creation logs within your EDR solution for instances of `X509Enrollment.CBinaryConverter` being executed, noting the associated user accounts and timestamps.
  - Investigate the command-line parameters used in the detected processes to ascertain whether they align with known administrative scripts or legitimate use cases.
  - Correlate findings with network traffic logs from the NDR or proxy solutions to determine if there are any unauthorized external communications from the affected host.
  - Analyze any related events in the SIEM that occurred in the timeframe surrounding the alert to identify potentially related malicious activities or lateral movement attempts.
