title: HackTool - UACMe Akagi Execution
id: d38d2fa4-98e6-4a24-aff1-410b0c9ad177
status: test
description: Detects the execution of UACMe, a tool used for UAC bypasses, via default
  PE metadata
references:
- https://github.com/hfiref0x/UACME
author: Christian Burkard (Nextron Systems), Florian Roth (Nextron Systems)
date: 2021-08-30
modified: 2024-11-23
tags:
- attack.defense-evasion
- attack.privilege-escalation
- attack.t1548.002
logsource:
  category: process_creation
  product: windows
detection:
  selection_pe:
  - Product: 'UACMe'
  - Company:
    - 'REvol Corp'
    - 'APT 92'
    - 'UG North'
    - 'Hazardous Environments'
    - 'CD Project Rekt'
  - Description:
    - 'UACMe main module'
    - 'Pentesting utility'
  - OriginalFileName:
    - 'Akagi.exe'
    - 'Akagi64.exe'
  selection_img:
    Image|endswith:
    - '\Akagi64.exe'
    - '\Akagi.exe'
  selection_hashes_sysmon:
    Hashes|contains:
    - 'IMPHASH=767637C23BB42CD5D7397CF58B0BE688'
    - 'IMPHASH=14C4E4C72BA075E9069EE67F39188AD8'
    - 'IMPHASH=3C782813D4AFCE07BBFC5A9772ACDBDC'
    - 'IMPHASH=7D010C6BB6A3726F327F7E239166D127'
    - 'IMPHASH=89159BA4DD04E4CE5559F132A9964EB3'
    - 'IMPHASH=6F33F4A5FC42B8CEC7314947BD13F30F'
    - 'IMPHASH=5834ED4291BDEB928270428EBBAF7604'
    - 'IMPHASH=5A8A8A43F25485E7EE1B201EDCBC7A38'
    - 'IMPHASH=DC7D30B90B2D8ABF664FBED2B1B59894'
    - 'IMPHASH=41923EA1F824FE63EA5BEB84DB7A3E74'
    - 'IMPHASH=3DE09703C8E79ED2CA3F01074719906B'
  condition: 1 of selection_*
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This Sigma rule aims to detect the execution of UACMe, a known penetration testing tool primarily used for User Account Control (UAC) bypass techniques on Windows systems. By monitoring the process creation logs, the rule looks for specific indicators, such as PE metadata associated with UACMe, including product names, company information, and descriptions that suggest malicious intent. Additionally, it checks for specific file names (Akagi.exe, Akagi64.exe) and unique hash signatures (IMPHASH values) associated with these executable files. These indicators help validate that a process execution event corresponds to an attempted use of the UACMe tool, which may signal an escalation of privileges by an attacker or an unauthorized user.
  ### Investigation Steps
  - Check EDR logs for the execution events of processes related to UACMe, specifically looking for the filenames Akagi.exe or Akagi64.exe.
  - Review command-line parameters associated with the executed processes to identify unusual or suspicious arguments that could suggest malicious intent.
  - Analyze network traffic via NDR and proxy logs for unusual outbound requests or connections initiated by the host subsequently executing UACMe.
  - Examine user account behavior, especially any actions taken by the account that executed UACMe, using logs from Active Directory or cloud platforms to identify potential unauthorized access or privilege escalation attempts.
