title: Allow Service Access Using Security Descriptor Tampering Via Sc.EXE
id: 6c8fbee5-dee8-49bc-851d-c3142d02aa47
related:
- id: a537cfc3-4297-4789-92b5-345bfd845ad0     # Generic SD tampering
  type: similar
status: test
description: Detects suspicious DACL modifications to allow access to a service from
  a suspicious trustee. This can be used to override access restrictions set by previous
  ACLs.
references:
- https://twitter.com/0gtweet/status/1628720819537936386
- https://itconnect.uw.edu/tools-services-support/it-systems-infrastructure/msinf/other-help/understanding-sddl-syntax/
- https://learn.microsoft.com/en-us/windows/win32/secauthz/sid-strings
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023-02-28
tags:
- attack.persistence
- attack.t1543.003
logsource:
  category: process_creation
  product: windows
detection:
  selection_sc:
  - Image|endswith: '\sc.exe'
  - OriginalFileName: 'sc.exe'
  selection_sdset:
    CommandLine|contains|all:
    - 'sdset'
    - 'A;'         # Allow Access
  selection_trustee:
    CommandLine|contains:
    - ';IU'         # Interactively logged-on user
    - ';SU'         # Service logon user
    - ';BA'         # Built-in administrators
    - ';SY'         # Local system
    - ';WD'         # Everyone
  condition: all of selection_*
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This detection rule identifies potential security threats stemming from unauthorized modifications to service access controls on Windows systems through the use of the `sc.exe` command-line utility. Specifically, it looks for instances where the security descriptor is altered to allow access to a service from a suspicious trustee, which could potentially override pre-existing access restrictions. The rule primarily relies on process creation logs to capture activity surrounding `sc.exe`, focusing on command-line parameters that indicate the use of the `sdset` command for setting security descriptors. The detection also considers which user accounts are involved (like interactively logged-on users or built-in administrators) to determine if the action originates from legitimate or malicious sources.
  ### Investigation Steps
  - Review EDR logs for recent `sc.exe` execution, specifically filtering for instances where the command line contains `sdset` alongside any suspicious trustee designations.
  - Correlate the identified events with user account activity using Windows Event Logs (Security events) to determine if the executing trustee has legitimate permissions.
  - Analyze the associated service configurations and permissions via service management tools or commands (e.g., `sc query <ServiceName>`) to ascertain any unauthorized changes made to the DACL.
  - Utilize the threat intelligence from incidents involving similar security descriptor tampering to evaluate potential adversaries or motivations behind the modifications.
