title: Suspicious ScreenSave Change by Reg.exe
id: 0fc35fc3-efe6-4898-8a37-0b233339524f
status: test
description: |
  Adversaries may establish persistence by executing malicious content triggered by user inactivity.
  Screensavers are programs that execute after a configurable time of user inactivity and consist of Portable Executable (PE) files with a .scr file extension
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1546.002/T1546.002.md
- https://www.welivesecurity.com/wp-content/uploads/2017/08/eset-gazer.pdf
author: frack113
date: 2021-08-19
modified: 2022-06-02
tags:
- attack.privilege-escalation
- attack.t1546.002
logsource:
  category: process_creation
  product: windows
detection:
  selection_reg:
    Image|endswith: '\reg.exe'
    CommandLine|contains:
    - 'HKEY_CURRENT_USER\Control Panel\Desktop'
    - 'HKCU\Control Panel\Desktop'
  selection_option_1:   # /force Active ScreenSaveActive
    CommandLine|contains|all:
    - '/v ScreenSaveActive'
    - '/t REG_SZ'
    - '/d 1'
    - '/f'
  selection_option_2:   # /force  set ScreenSaveTimeout
    CommandLine|contains|all:
    - '/v ScreenSaveTimeout'
    - '/t REG_SZ'
    - '/d '
    - '/f'
  selection_option_3:   # /force set ScreenSaverIsSecure
    CommandLine|contains|all:
    - '/v ScreenSaverIsSecure'
    - '/t REG_SZ'
    - '/d 0'
    - '/f'
  selection_option_4:   # /force set a .scr
    CommandLine|contains|all:
    - '/v SCRNSAVE.EXE'
    - '/t REG_SZ'
    - '/d '
    - '.scr'
    - '/f'
  condition: selection_reg and 1 of selection_option_*
falsepositives:
- GPO
level: medium
notes: |
  ### Technical Context
  This detection rule identifies potentially malicious usage of the `reg.exe` command-line tool to modify Windows registry settings related to screensavers. Adversaries may leverage these settings for persistence by exploiting the inactivity timeout on user sessions, thereby executing malicious screensaver files (with a `.scr` extension). The rule specifically looks for command-line arguments to `reg.exe` that alter registry values under `HKEY_CURRENT_USER\Control Panel\Desktop`. It checks for a range of modifications, such as enabling screensavers, setting timeout values, or specifying a malicious screensaver instead of a legitimate one. By analyzing the process creation logs from Windows, this rule enables detection of suspicious behavior that could signify an attempt to establish a foothold within the environment.
  ### Investigation Steps
  - Use the EDR tool to review the process creation logs for instances of `reg.exe` that correspond to the timeframe of the alert, focusing on any suspicious command-line parameters.
  - Examine associated user activity logs to determine if there was any unusual user inactivity prior to the execution of the `reg.exe` command.
  - Check for newly created or modified `.scr` files on the affected systems to assess the legitimacy of the screensaver configurations.
  - Investigate network traffic logs via the NDR solution to identify potential outbound connections made by any identified malicious screensaver executable files.
