title: Suspicious Msbuild Execution By Uncommon Parent Process
id: 33be4333-2c6b-44f4-ae28-102cdbde0a31
status: test
description: Detects suspicious execution of 'Msbuild.exe' by a uncommon parent process
references:
- https://app.any.run/tasks/abdf586e-df0c-4d39-89a7-06bf24913401/
- https://www.echotrail.io/insights/search/msbuild.exe
author: frack113
date: 2022-11-17
tags:
- attack.defense-evasion
logsource:
  category: process_creation
  product: windows
detection:
  selection:
  - Image|endswith: '\MSBuild.exe'
  - OriginalFileName: 'MSBuild.exe'
  filter_parent:
    ParentImage|endswith:
    - '\devenv.exe'
    - '\cmd.exe'
    - '\msbuild.exe'
    - '\python.exe'
    - '\explorer.exe'
    - '\nuget.exe'
  condition: selection and not filter_parent
falsepositives:
- Unknown
level: medium
notes: |
  n
  ### Technical Context
  This detection rule identifies potentially malicious instances of `Msbuild.exe` being executed by uncommon parent processes. `Msbuild.exe` is a legitimate Microsoft tool used for building applications, but attackers may misuse it to carry out various malicious activities, including executing payloads or obfuscating their actions. The rule inspects data from Windows process creation logs to determine when `Msbuild.exe` is launched, specifically focusing on the parent process. If the parent process does not belong to a list of common or expected parent processes (e.g., `devenv.exe`, `cmd.exe`, etc.), it triggers an alert. This rule aligns with the MITRE ATT&CK technique related to defense evasion, specifically indicating adversaries' attempts to disguise their malicious activities by executing from legitimate-looking processes.
  ### Investigation Steps
  - **Review Process Creation Logs:** Investigate the process creation logs in the EDR to understand the context of the `Msbuild.exe` execution detail, including the exact time and the user account associated with the execution.
  - **Analyze Parent Process:** Identify the parent process from which `Msbuild.exe` was launched. Determine if it is an expected or unusual process within the given environment.
  - **Check Command-Line Parameters:** Review the command-line arguments associated with the `Msbuild.exe` execution to identify any potentially malicious intentions or anomalies.
  - **Correlate with Other Security Logs:** Examine relevant logs from AV, Proxy, and network connections to gather additional context about any external or internal communications associated with this execution.
  ### Prioritization
  Alerts for unusually executed `Msbuild.exe` are classified as medium severity due to the risks associated with potential misuse of legitimate tools for malicious purposes. Quick action is recommended, as the execution chain may indicate an ongoing attack or a compromised system.
  ### Blind Spots and Assumptions
  This rule assumes that the parent process will be one of the common ones defined in the filter and does not account for potential abusers that mimic typical parent processes to bypass detection. Additionally, if `Msbuild.exe` is invoked through atypical means or custom scripts not captured in standard logging, it may not be detected. Furthermore, environmental variations in software usage may lead to legitimate alerts if uncommon processes are typically used in certain workflows.
  > **Disclaimer:** This investigation guide was created using generative AI technology and has not been reviewed for its accuracy and relevance. While every effort has been made to ensure its quality and consistency, we recommend validating the content and adapting it to suit specific environment and operational needs. Please communicate any changes to the detection engineering team.
