title: Suspicious File Download From IP Via Wget.EXE - Paths
id: 40aa399c-7b02-4715-8e5f-73572b493f33
status: test
description: Detects potentially suspicious file downloads directly from IP addresses
  and stored in suspicious locations using Wget.exe
references:
- https://www.gnu.org/software/wget/manual/wget.html
author: Nasreddine Bencherchali (Nextron Systems)
date: 2024-02-23
tags:
- attack.execution
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: '\wget.exe'
  - OriginalFileName: 'wget.exe'
  selection_ip:
    CommandLine|re: '://[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}'
  selection_http:
    CommandLine|contains: 'http'
  selection_flag:
  - CommandLine|re: '\s-O\s'
  - CommandLine|contains: '--output-document'
  selection_paths:
  - CommandLine|contains:
    - ':\PerfLogs\'
    - ':\Temp\'
    - ':\Users\Public\'
    - ':\Windows\Help\'
    - ':\Windows\Temp\'
    - '\Temporary Internet'
  - CommandLine|contains|all:
    - ':\Users\'
    - '\Favorites\'
  - CommandLine|contains|all:
    - ':\Users\'
    - '\Favourites\'
  - CommandLine|contains|all:
    - ':\Users\'
    - '\Contacts\'
  - CommandLine|contains|all:
    - ':\Users\'
    - '\Pictures\'
  condition: all of selection_*
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This detection rule identifies potentially suspicious file downloads on Windows systems originating from IP addresses using the Wget utility. Specifically, it captures process creation events where `wget.exe` is invoked to download files from external IP addresses and saves these files in locations deemed suspicious, such as `Temp`, `Public`, or `Help` directories. The rule utilizes various command line parameters and patterns, such as the use of `http` in the command line, options like `-O` or `--output-document`, and specific paths where downloads are commonly misused to identify potentially unauthorized activity. These indicators of compromise align with the MITRE ATT&CK tactic of Execution under the technique of Command-Line Interface (T1059), highlighting cases where attackers may be leveraging legitimate tools for malicious purposes.
  ### Investigation Steps
  - **Review Process Creation Logs:** Examine the process creation logs in the EDR tool to confirm the execution of `wget.exe` and validate the command-line parameters used, especially the presence of an IP address and suspicious flags.
    
  - **Confirm Download Locations:** Cross-reference the file paths where the files are being downloaded against the organization's safe file storage practices to determine any unauthorized or atypical file downloads.
  - **Analyze Network Traffic:** Utilize the NDR or firewall logs to track outbound and inbound connections associated with the detected IP address during the time frame of the `wget` execution to understand the nature of the traffic.
  - **Investigate User Context:** Check the user accounts under which `wget.exe` was executed, assessing whether they have appropriate permissions for download actions and if there are any prior incidents associated with these accounts.
  ### Prioritization
  The severity level of this alert is classified as high because unauthorized file downloads from external IPs can indicate potential data breaches, malware infections, or other forms of compromise, requiring immediate investigation to prevent further exploitation.
  ### Blind Spots and Assumptions
  This rule may not fire if `wget.exe` is executed from a non-standard path or renamed, circumventing the detection logic. Additionally, the rule assumes that all legitimate downloads are routed through expected means and does not account for other download utilities that might be employed equally maliciously. Attackers may also utilize advanced techniques to obfuscate command-line arguments or IP addresses, leading to missed detections.
  > **Disclaimer:** This investigation guide was created using generative AI technology and has not been reviewed for its accuracy and relevance. While every effort has been made to ensure its quality, we recommend validating the content and adapting it to suit specific environment and operational needs. Please communicate any changes to the detection engineering team.
