title: Suspicious Git Clone
id: aef9d1f1-7396-4e92-a927-4567c7a495c1
status: test
description: Detects execution of "git" in order to clone a remote repository that
  contain suspicious keywords which might be suspicious
references:
- https://gist.githubusercontent.com/MichaelKoczwara/12faba9c061c12b5814b711166de8c2f/raw/e2068486692897b620c25fde1ea258c8218fe3d3/history.txt
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023-01-03
modified: 2023-01-10
tags:
- attack.reconnaissance
- attack.t1593.003
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith:
    - '\git.exe'
    - '\git-remote-https.exe'
  - OriginalFileName: 'git.exe'
  selection_cli:
    CommandLine|contains:
    - ' clone '
    - 'git-remote-https '
  selection_keyword:
    CommandLine|contains:
            # Add more suspicious keywords
    - 'exploit'
    - 'Vulns'
    - 'vulnerability'
    - 'RemoteCodeExecution'
    - 'Invoke-'
    - 'CVE-'
    - 'poc-'
    - 'ProofOfConcept'
            # Add more vuln names
    - 'proxyshell'
    - 'log4shell'
    - 'eternalblue'
    - 'eternal-blue'
    - 'MS17-'
  condition: all of selection_*
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  The "Suspicious Git Clone" rule is designed to detect potentially malicious use of the Git version control system on Windows environments. It identifies process creation events where `git.exe` or `git-remote-https.exe` is executed. The focus is on command-line arguments, particularly those containing the word "clone" and references to known vulnerabilities or exploits. The rule looks for specific keywords that are often associated with malicious activity, such as 'exploit', 'vulnerability', 'CVE-', and notable exploits like 'log4shell' and 'eternalblue'. By monitoring these indicators, the rule aims to catch scenarios where adversaries may be attempting to clone repositories that contain harmful or untrustworthy code, ultimately aiding in the early detection of reconnaissance activities and potential breaches.
  ### Investigation Steps
  - Review the process creation logs in your EDR tool to identify the occurrences of `git.exe` or `git-remote-https.exe` being executed, along with their associated command-line arguments.
  - Analyze the context of the cloned repositories by checking the git configuration or the destination paths to determine if the repositories are known to be malicious or contain suspicious content.
  - Query your AV or endpoint protection solutions to identify any alerts or blocks related to the cloned repositories, particularly for those repositories associated with the suspicious keywords.
  - Investigate any network traffic related to the suspicious git operations in your NDR tools or Proxy logs to uncover further details on the source and destination of the traffic initiated by the detected git command.
