title: Powershell Defender Disable Scan Feature
id: 1ec65a5f-9473-4f12-97da-622044d6df21
status: test
description: Detects requests to disable Microsoft Defender features using PowerShell
  commands
references:
- https://learn.microsoft.com/en-us/powershell/module/defender/set-mppreference?view=windowsserver2022-ps
- https://www.virustotal.com/gui/file/d609799091731d83d75ec5d1f030571af20c45efeeb94840b67ea09a3283ab65/behavior/C2AE
- https://www.virustotal.com/gui/search/content%253A%2522Set-MpPreference%2520-Disable%2522/files
author: Florian Roth (Nextron Systems)
date: 2022-03-03
modified: 2024-01-02
tags:
- attack.defense-evasion
- attack.t1562.001
logsource:
  category: process_creation
  product: windows
detection:
  selection_cli_cmdlet:
    CommandLine|contains:
    - 'Add-MpPreference '
    - 'Set-MpPreference '
  selection_cli_option:
    CommandLine|contains:
    - 'DisableArchiveScanning '
    - 'DisableRealtimeMonitoring '
    - 'DisableIOAVProtection '
    - 'DisableBehaviorMonitoring '
    - 'DisableBlockAtFirstSeen '
    - 'DisableCatchupFullScan '
    - 'DisableCatchupQuickScan '
  selection_cli_value:
    CommandLine|contains:
    - '$true'
    - ' 1 '
  selection_encoded_modifier:
    CommandLine|base64offset|contains:
            # Note: Since this is calculating offsets casing is important
    - 'disablearchivescanning '
    - 'DisableArchiveScanning '
    - 'disablebehaviormonitoring '
    - 'DisableBehaviorMonitoring '
    - 'disableblockatfirstseen '
    - 'DisableBlockAtFirstSeen '
    - 'disablecatchupfullscan '
    - 'DisableCatchupFullScan '
    - 'disablecatchupquickscan '
    - 'DisableCatchupQuickScan '
    - 'disableioavprotection '
    - 'DisableIOAVProtection '
    - 'disablerealtimemonitoring '
    - 'DisableRealtimeMonitoring '
  selection_encoded_direct:
    CommandLine|contains:
    - 'RABpAHMAYQBiAGwAZQBSAGUAYQBsAHQAaQBtAGUATQBvAG4AaQB0AG8AcgBpAG4AZwAgA'
    - 'QAaQBzAGEAYgBsAGUAUgBlAGEAbAB0AGkAbQBlAE0AbwBuAGkAdABvAHIAaQBuAGcAIA'
    - 'EAGkAcwBhAGIAbABlAFIAZQBhAGwAdABpAG0AZQBNAG8AbgBpAHQAbwByAGkAbgBnACAA'
    - 'RABpAHMAYQBiAGwAZQBJAE8AQQBWAFAAcgBvAHQAZQBjAHQAaQBvAG4AIA'
    - 'QAaQBzAGEAYgBsAGUASQBPAEEAVgBQAHIAbwB0AGUAYwB0AGkAbwBuACAA'
    - 'EAGkAcwBhAGIAbABlAEkATwBBAFYAUAByAG8AdABlAGMAdABpAG8AbgAgA'
    - 'RABpAHMAYQBiAGwAZQBCAGUAaABhAHYAaQBvAHIATQBvAG4AaQB0AG8AcgBpAG4AZwAgA'
    - 'QAaQBzAGEAYgBsAGUAQgBlAGgAYQB2AGkAbwByAE0AbwBuAGkAdABvAHIAaQBuAGcAIA'
    - 'EAGkAcwBhAGIAbABlAEIAZQBoAGEAdgBpAG8AcgBNAG8AbgBpAHQAbwByAGkAbgBnACAA'
    - 'RABpAHMAYQBiAGwAZQBCAGwAbwBjAGsAQQB0AEYAaQByAHMAdABTAGUAZQBuACAA'
    - 'QAaQBzAGEAYgBsAGUAQgBsAG8AYwBrAEEAdABGAGkAcgBzAHQAUwBlAGUAbgAgA'
    - 'EAGkAcwBhAGIAbABlAEIAbABvAGMAawBBAHQARgBpAHIAcwB0AFMAZQBlAG4AIA'
    - 'ZABpAHMAYQBiAGwAZQByAGUAYQBsAHQAaQBtAGUAbQBvAG4AaQB0AG8AcgBpAG4AZwAgA'
    - 'QAaQBzAGEAYgBsAGUAcgBlAGEAbAB0AGkAbQBlAG0AbwBuAGkAdABvAHIAaQBuAGcAIA'
    - 'kAGkAcwBhAGIAbABlAHIAZQBhAGwAdABpAG0AZQBtAG8AbgBpAHQAbwByAGkAbgBnACAA'
    - 'ZABpAHMAYQBiAGwAZQBpAG8AYQB2AHAAcgBvAHQAZQBjAHQAaQBvAG4AIA'
    - 'QAaQBzAGEAYgBsAGUAaQBvAGEAdgBwAHIAbwB0AGUAYwB0AGkAbwBuACAA'
    - 'kAGkAcwBhAGIAbABlAGkAbwBhAHYAcAByAG8AdABlAGMAdABpAG8AbgAgA'
    - 'ZABpAHMAYQBiAGwAZQBiAGUAaABhAHYAaQBvAHIAbQBvAG4AaQB0AG8AcgBpAG4AZwAgA'
    - 'QAaQBzAGEAYgBsAGUAYgBlAGgAYQB2AGkAbwByAG0AbwBuAGkAdABvAHIAaQBuAGcAIA'
    - 'kAGkAcwBhAGIAbABlAGIAZQBoAGEAdgBpAG8AcgBtAG8AbgBpAHQAbwByAGkAbgBnACAA'
    - 'ZABpAHMAYQBiAGwAZQBiAGwAbwBjAGsAYQB0AGYAaQByAHMAdABzAGUAZQBuACAA'
    - 'QAaQBzAGEAYgBsAGUAYgBsAG8AYwBrAGEAdABmAGkAcgBzAHQAcwBlAGUAbgAgA'
    - 'kAGkAcwBhAGIAbABlAGIAbABvAGMAawBhAHQAZgBpAHIAcwB0AHMAZQBlAG4AIA'
    - 'RABpAHMAYQBiAGwAZQBDAGEAdABjAGgAdQBwAEYAdQBsAGwAUwBjAGEAbgA'
    - 'RABpAHMAYQBiAGwAZQBDAGEAdABjAGgAdQBwAFEAdQBpAGMAawBTAGMAYQBuAA'
    - 'RABpAHMAYQBiAGwAZQBBAHIAYwBoAGkAdgBlAFMAYwBhAG4AbgBpAG4AZwA'
  condition: all of selection_cli_* or 1 of selection_encoded_*
falsepositives:
- Possible administrative activity
- Other Cmdlets that may use the same parameters
level: high
notes: |
  n
  ### Technical Context
  The "Powershell Defender Disable Scan Feature" Sigma rule is designed to detect potentially harmful actions where an attacker attempts to disable Microsoft Defender's security features using PowerShell commands. The rule specifically looks for command-line arguments associated with the `Set-MpPreference` and `Add-MpPreference` cmdlets, particularly those that disable important security functionalities like real-time monitoring and scanning services. By monitoring the process creation logs for these PowerShell command invocations, the rule can identify when such disabling actions occur. The relevant MITRE ATT&CK tactics for this rule include **Defense Evasion** (T1562.001), which focuses on methods attackers use to evade detection and security software.
  ### Investigation Steps
  - **Examine the EDR Alerts**: Review the EDR logs to identify the source process and the context in which the PowerShell command was executed, including the user and the time of execution.
  - **Analyze Command Line Arguments**: Scrutinize the command line arguments passed to PowerShell to confirm if they align with known commands used to disable Microsoft Defender features.
  - **Review Security and Application Logs**: Check Windows Security and Application logs for any preceding events that may indicate suspicious activities leading up to the execution of the disabling commands.
  - **Cross-reference with User Activity**: Map the detected activity against normal user activity and roles to determine if the command was initiated by an authorized user performing legitimate administrative tasks.
  ### Prioritization
  This alert has a high severity level because disabling security features like real-time monitoring can significantly enhance an adversary's ability to conduct malicious activities undetected within the network environment.
  ### Blind Spots and Assumptions
  Potential blind spots include legitimate administrative activities that may use the same PowerShell cmdlets and parameters, possibly leading to false positives. The rule may also fail to fire if command executions are obfuscated or command arguments are altered. Additionally, if certain security features are already disabled or if PowerShell is executed with certain flags or encodings, the detection may be circumvented.
  > **Disclaimer:** This investigation guide was created using generative AI technology and has not been reviewed for its accuracy and relevance. While every effort has been made to ensure its quality, we recommend validating the content and adapting it to suit specific environment and operational needs. Please communicate any changes to the detection engineering team.
