title: Renamed ZOHO Dctask64 Execution
id: 340a090b-c4e9-412e-bb36-b4b16fe96f9b
status: test
description: |
  Detects a renamed "dctask64.exe" execution, a signed binary by ZOHO Corporation part of ManageEngine Endpoint Central.
  This binary can be abused for DLL injection, arbitrary command and process execution.
references:
- https://twitter.com/gN3mes1s/status/1222088214581825540
- https://twitter.com/gN3mes1s/status/1222095963789111296
- https://twitter.com/gN3mes1s/status/1222095371175911424
author: Florian Roth (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)
date: 2020-01-28
modified: 2025-01-22
tags:
- attack.defense-evasion
- attack.t1036
- attack.t1055.001
- attack.t1202
- attack.t1218
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Hashes|contains:
    - 'IMPHASH=6834B1B94E49701D77CCB3C0895E1AFD'
    - 'IMPHASH=1BB6F93B129F398C7C4A76BB97450BBA'
    - 'IMPHASH=FAA2AC19875FADE461C8D89DCF2710A3'
    - 'IMPHASH=F1039CED4B91572AB7847D26032E6BBF'
  filter_main_legit_name:
    Image|endswith: '\dctask64.exe'
  condition: selection and not 1 of filter_main_*
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This detection rule focuses on identifying potentially malicious executions of "dctask64.exe," a signed executable by ZOHO Corporation associated with its ManageEngine Endpoint Central. The rule specifically looks for instances where the executable has been renamed, which can indicate an attempt to evade detection in environments that monitor trusted applications. The detection utilizes hashes that are significant to legitimate versions of the executable. By analyzing process creation logs and focusing on specific hash characteristics coupled with the file name, the rule is designed to trigger alerts when suspicious executions are detected, warranting further investigation.
  ### Investigation Steps
  - Review process creation logs in your EDR solution to identify any instances of "dctask64.exe" execution, particularly focusing on the command-line parameters used during execution.
  - Investigate the hash values against the known good hashes listed in the rule to determine if the executable has been tampered with or is indeed a legitimate file.
  - Utilize your network detection tools (NDR) to monitor for any unusual outbound traffic originating from systems where this executable was run, which could indicate post-exploitation activity.
  - Check historical logs in your AV and NGFW solutions for any prior detections or blocking of the dctask64.exe executable to understand if this is an isolated incident or part of a larger campaign.
