title: Remote Access Tool - UltraViewer Execution
id: 88656cec-6c3b-487c-82c0-f73ebb805503
status: test
description: |
  An adversary may use legitimate desktop support and remote access software, such as Team Viewer, Go2Assist, LogMein, AmmyyAdmin, etc, to establish an interactive command and control channel to target systems within networks.
  These services are commonly used as legitimate technical support software, and may be allowed by application control within a target environment.
  Remote access tools like VNC, Ammyy, and Teamviewer are used frequently when compared with other legitimate software commonly used by adversaries. (Citation: Symantec Living off the Land)
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1219/T1219.md
author: frack113
date: 2022-09-25
modified: 2024-03-14
tags:
- attack.command-and-control
- attack.t1219
logsource:
  category: process_creation
  product: windows
detection:
  selection:
  - Product: 'UltraViewer'
  - Company: 'DucFabulous Co,ltd'
  - OriginalFileName: 'UltraViewer_Desktop.exe'
  condition: selection
falsepositives:
- Legitimate use
level: medium
notes: |
  ### Technical Context
  This detection rule targets the execution of UltraViewer, a remote access tool commonly used for technical support. The rule monitors process creation logs and looks specifically for instances where the product name is 'UltraViewer' and the original file name is 'UltraViewer_Desktop.exe' produced by 'DucFabulous Co, Ltd'. This software can be misused by threat actors to establish unauthorized remote connections, potentially leading to a command and control (C2) situation within an enterprise environment. Given that products like UltraViewer can often be misclassified as legitimate, this rule aids in identifying potential misuse that could indicate malicious activities while balancing the risk of false positives from legitimate use cases.
  ### Investigation Steps
  - Review the EDR telemetry to identify the context of the UltraViewer execution, including the user accounts, host involved, and any previous process interactions.
  - Check the command-line parameters used during the execution of UltraViewer to ascertain any unusual flags or options that might indicate malicious intent.
  - Examine network logs from the NGFW or NDR for any suspicious outbound connections made by UltraViewer, focusing on unusual IP addresses or ports that deviate from typical patterns.
  - Validate the user activity through proxy logs or VPN connections to determine if the execution aligns with normal user behavior or if it appears anomalous in the given context.
