title: Remote Access Tool - NetSupport Execution
id: 758ff488-18d5-4cbe-8ec4-02b6285a434f
status: test
description: |
  An adversary may use legitimate desktop support and remote access software, such as Team Viewer, Go2Assist, LogMein, AmmyyAdmin, etc, to establish an interactive command and control channel to target systems within networks.
  These services are commonly used as legitimate technical support software, and may be allowed by application control within a target environment.
  Remote access tools like VNC, Ammyy, and Teamviewer are used frequently when compared with other legitimate software commonly used by adversaries. (Citation: Symantec Living off the Land)
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1219/T1219.md
author: frack113
date: 2022-09-25
modified: 2023-03-06
tags:
- attack.command-and-control
- attack.t1219
logsource:
  category: process_creation
  product: windows
detection:
  selection:
  - Description: NetSupport Client Configurator
  - Product: NetSupport Remote Control
  - Company: NetSupport Ltd
  - OriginalFileName: PCICFGUI.EXE
  condition: selection
falsepositives:
- Legitimate use
level: medium
notes: |
  ### Technical Context
  This detection rule is designed to identify the execution of the NetSupport Remote Control application, a legitimate remote access tool that could be exploited by adversaries to establish unauthorized command and control (C2) channels. The rule focuses on the detection of process creation events specifically targeting the NetSupport Client Configurator by examining key attributes such as the file description, product name, company name, and original file name involved in its execution. This data is typically gathered from process creation logs within a Windows environment, allowing analysts to distinguish between legitimate usage and potential misuse of remote access tools.
  By monitoring these specific characteristics, the rule helps to surface potential issues stemming from the use of remote desktop support tools, which adversaries may leverage to maintain persistence and facilitate further exploitation. Detecting such executions is crucial in a SOC environment, as it aids in identifying possible threats that could compromise the integrity of the network.
  ### Investigation Steps
  - Review the EDR logs for the process creation events associated with NetSupport Client Configurator to confirm the activity and assess its context within the environment.
  - Check network traffic logs from the NDR to identify any unusual communication patterns associated with the detected remote access tool, looking for connections to unauthorized external IPs.
  - Investigate the proxy logs to determine if there were any recent web requests that may indicate suspicious downloads or interactions with known malicious sites.
  - Utilize the SIEM to correlate this alert with other related security events to build a comprehensive view of the potential incident and assess whether it aligns with known attack patterns.
