title: Suspicious Execution of Shutdown to Log Out
id: ec290c06-9b6b-4338-8b6b-095c0f284f10
status: test
description: Detects the rare use of the command line tool shutdown to logoff a user
references:
- https://github.com/redcanaryco/atomic-red-team/blob/9e5b12c4912c07562aec7500447b11fa3e17e254/atomics/T1529/T1529.md
- https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/shutdown
author: frack113
date: 2022-10-01
tags:
- attack.impact
- attack.t1529
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith: '\shutdown.exe'
    CommandLine|contains: '/l'
  condition: selection
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  This detection rule identifies suspicious activity involving the `shutdown.exe` command-line tool, specifically when it is used to log off a user from a Windows system. The command line `/l` in conjunction with the execution of `shutdown.exe` is uncommon and can indicate an attempt to terminate a user session, possibly as part of unauthorized access or malicious activity. The rule leverages process creation logs to monitor when `shutdown.exe` is executed with this specific command-line parameter. By analyzing this data, security analysts can flag potential misuse and respond accordingly to safeguard against threats.
  ### Investigation Steps
  - Review the process creation logs in your EDR tool to identify the timestamp and user account associated with the execution of `shutdown.exe /l`. Look for any anomalies regarding the user context.
  - Check for any related log entries in SIEM that may provide context, such as prior activities or processes initiated by the user leading up to the command execution.
  - Examine user activity logs in the NGFW and Proxy to identify any unusual actions taken by the user preceding the shutdown command, which may signify malicious intent.
  - If applicable, cross-reference cloud platform logs (AWS, GCP, Azure) for any related suspicious activity or session management actions that coincide with the local shutdown command execution.
