title: Uncommon FileSystem Load Attempt By Format.com
id: 9fb6b26e-7f9e-4517-a48b-8cac4a1b6c60
status: test
description: |
  Detects the execution of format.com with an uncommon filesystem selection that could indicate a defense evasion activity in which "format.com" is used to load malicious DLL files or other programs.
references:
- https://twitter.com/0gtweet/status/1477925112561209344
- https://twitter.com/wdormann/status/1478011052130459653?s=20
author: Florian Roth (Nextron Systems)
date: 2022-01-04
modified: 2024-05-13
tags:
- attack.defense-evasion
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith: '\format.com'
    CommandLine|contains: '/fs:'
  filter_main_known_fs:
    CommandLine|contains:
    - '/fs:exFAT'
    - '/fs:FAT'
    - '/fs:NTFS'
    - '/fs:ReFS'
    - '/fs:UDF'
  condition: selection and not 1 of filter_main_*
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This detection rule identifies the execution of the `format.com` command with an unusual filesystem type specified in the command-line parameters, which could suggest malicious intent or attempts at evading security measures. Specifically, the rule monitors for processes where the command line contains the `/fs:` argument followed by a filesystem type that does not fall under the commonly accepted types (exFAT, FAT, NTFS, ReFS, UDF). The primary data sources leveraged for this detection include process creation logs that capture the command-line arguments associated with process initiation. Understanding these uncommon executions is critical, as attackers might use `format.com` to manipulate filesystem formats for nefarious activities, such as loading malicious DLLs.
  ### Investigation Steps
  - Review EDR logs to identify the context around the execution of `format.com`, including the user account and system involved in the process initiation.
  - Cross-reference the detected command-line parameters with recent changes in permissions or system configurations to identify any unusual patterns or anomalies.
  - Investigate network traffic using NDR tools to discern if any external connections were established around the time `format.com` was executed, which might indicate data exfiltration or external command-and-control activity.
  - Analyze system logs or cloud instantiation logs in AWS, GCP, or Azure to track any deployments or changes that correlate with the detected activity, focusing on unusual patterns or unauthorized alterations.
