title: Weak or Abused Passwords In CLI
id: 91edcfb1-2529-4ac2-9ecc-7617f895c7e4
status: test
description: |
  Detects weak passwords or often abused passwords (seen used by threat actors) via the CLI.
  An example would be a threat actor creating a new user via the net command and providing the password inline
references:
- https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/espionage-asia-governments
- https://thedfirreport.com/2022/09/26/bumblebee-round-two/
- https://www.microsoft.com/en-us/security/blog/2022/10/25/dev-0832-vice-society-opportunistic-ransomware-campaigns-impacting-us-education-sector/
- https://www.huntress.com/blog/slashandgrab-screen-connect-post-exploitation-in-the-wild-cve-2024-1709-cve-2024-1708
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-09-14
modified: 2024-02-23
tags:
- attack.defense-evasion
- attack.execution
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|contains:
            # Add more passwords
    - '123456789'
    - '123123qwE'
    - 'Asd123.aaaa'
    - 'Decryptme'
    - 'P@ssw0rd!'
    - 'Pass8080'
    - 'password123'         # Also covers PASSWORD123123! as seen in https://www.microsoft.com/en-us/security/blog/2022/10/25/dev-0832-vice-society-opportunistic-ransomware-campaigns-impacting-us-education-sector/
    - 'test@202'         # Covers multiple years
  condition: selection
falsepositives:
- Legitimate usage of the passwords by users via commandline (should be discouraged)
- Other currently unknown false positives
level: medium
notes: |
  ### Technical Context
  This detection rule identifies potential misuse of weak or commonly abused passwords entered through the command line interface (CLI) on Windows systems. Leveraging process creation logs from EDR tools, the rule analyzes command line inputs for specific strings known to be weak passwords, such as "123456789," "P@ssw0rd!," and "password123." By targeting command-line operations where these passwords are provided inline, the rule seeks to catch instances where threat actors might attempt to create new user accounts or perform unauthorized actions using these easily exploitable credentials. Investigating alerts generated by this rule can help ascertain whether these operations are malicious in nature or legitimate, thus assisting in mitigating security risks related to poor password hygiene.
  ### Investigation Steps
  - Use EDR tools to review the process creation logs and confirm the command-line parameters associated with the alerts.
  - Cross-reference the detected commands with user activity logs to determine if these weak passwords were used by authorized personnel or in legitimate contexts.
  - Examine network traffic using NDR solutions to identify if there are any suspicious outbound connections associated with the process creator.
  - Perform a deeper analysis using cloud logs (if applicable) to check for unauthorized user account creations or modifications in account settings correlated with the alerts.
