title: Discovery of a System Time
id: b243b280-65fe-48df-ba07-6ddea7646427
status: test
description: Identifies use of various commands to query a systems time. This technique
  may be used before executing a scheduled task or to discover the time zone of a
  target system.
references:
- https://eqllib.readthedocs.io/en/latest/analytics/fcdb99c2-ac3c-4bde-b664-4b336329bed2.html
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1124/T1124.md
author: E.M. Anhaus (originally from Atomic Blue Detections, Endgame), oscd.community
date: 2019-10-24
modified: 2022-06-28
tags:
- attack.discovery
- attack.t1124
logsource:
  category: process_creation
  product: windows
detection:
  selection_time:
    Image|endswith:
    - '\net.exe'
    - '\net1.exe'
    CommandLine|contains: 'time'
  selection_w32tm:
    Image|endswith: '\w32tm.exe'
    CommandLine|contains: 'tz'
  condition: 1 of selection_*
falsepositives:
- Legitimate use of the system utilities to discover system time for legitimate reason
level: low
notes: |
  ### Technical Context
  This Sigma rule is designed to detect the querying of a system's time through specific command-line utilities in a Windows environment. It identifies the execution of commands such as `net.exe`, `net1.exe`, and `w32tm.exe` when they are used to retrieve time-related information or time zone settings. Querying the system time can be a precursor to executing scheduled tasks or gathering intelligence about the system’s configuration, which can aid in further malicious activities. The technical data sources utilized in this rule include process creation logs, which capture details about the command-line arguments used and the processes executed.
  ### Investigation Steps
  - Review process creation logs in your EDR tool to identify instances of `net.exe`, `net1.exe`, or `w32tm.exe` being executed, particularly looking for command-line arguments containing "time" or "tz."
  - Check for any unusual patterns or sequences of commands leading up to the time queries, which may indicate a reconnaissance phase by an unauthorized user or malicious actor.
  - Correlate the timestamps of these events with other security events or alerts to assess if there is any related suspicious activity that necessitates deeper investigation.
  - Explore network activity through your NDR or Proxy logs to identify any outbound connections initiated around the same time as the time-querying commands, which could indicate data exfiltration or communication with malicious external entities.
