title: Group Membership Reconnaissance Via Whoami.EXE
id: bd8b828d-0dca-48e1-8a63-8a58ecf2644f
status: test
description: Detects the execution of whoami.exe with the /group command line flag
  to show group membership for the current user, account type, security identifiers
  (SID), and attributes.
references:
- https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/whoami
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023-02-28
tags:
- attack.discovery
- attack.t1033
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: '\whoami.exe'
  - OriginalFileName: 'whoami.exe'
  selection_cli:
    CommandLine|contains:
    - ' /groups'
    - ' -groups'
  condition: all of selection_*
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  The Sigma rule titled "Group Membership Reconnaissance Via Whoami.EXE" is designed to detect instances where the Windows command-line utility `whoami.exe` is executed with the `/groups` or `-groups` flag. This command displays the group membership information for the user running the command, which includes account types, security identifiers (SIDs), and relevant attributes. By monitoring process creation logs, the rule specifically looks for the execution of `whoami.exe` with these command line parameters as indicators of potential reconnaissance activity by an unauthorized user or compromised account. The relevant data sources for this detection include logs generated from process creation events on Windows systems.
  ### Investigation Steps
  - Review EDR logs for any recent executions of `whoami.exe` that include the `/groups` or `-groups` flags. 
  - Analyze the user account associated with the execution to determine if it aligns with normal activity patterns for that user.
  - Check for any additional process creation events around the same timestamp that may indicate lateral movement or further reconnaissance-related activities.
  - Analyze network traffic logs from the NGFW or Proxy to identify any suspicious outbound connections following the command execution.
