title: New DLL Registered Via Odbcconf.EXE
id: 9f0a8bf3-a65b-440a-8c1e-5cb1547c8e70
related:
- id: ba4cfc11-d0fa-4d94-bf20-7c332c412e76
  type: similar
status: test
description: Detects execution of "odbcconf" with "REGSVR" in order to register a
  new DLL (equivalent to running regsvr32). Attackers abuse this to install and run
  malicious DLLs.
references:
- https://learn.microsoft.com/en-us/sql/odbc/odbcconf-exe?view=sql-server-ver16
- https://lolbas-project.github.io/lolbas/Binaries/Odbcconf/
- https://redcanary.com/blog/raspberry-robin/
- https://web.archive.org/web/20191023232753/https://twitter.com/Hexacorn/status/1187143326673330176
- https://www.hexacorn.com/blog/2020/08/23/odbcconf-lolbin-trifecta/
- https://www.trendmicro.com/en_us/research/17/h/backdoor-carrying-emails-set-sights-on-russian-speaking-businesses.html
author: Kirill Kiryanov, Beyu Denis, Daniil Yugoslavskiy, oscd.community, Nasreddine
  Bencherchali (Nextron Systems)
date: 2023-05-22
tags:
- attack.defense-evasion
- attack.t1218.008
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: '\odbcconf.exe'
  - OriginalFileName: 'odbcconf.exe'
  selection_cli:
        # Note: The "/A" flag is not required to call a specific action
    CommandLine|contains|all:
    - 'REGSVR '
    - '.dll'
  condition: all of selection_*
falsepositives:
- Legitimate DLLs being registered via "odbcconf" will generate false positives. Investigate
  the path of the DLL and its content to determine if the action is authorized.
level: medium
notes: |
  ### Technical Context
  This detection rule identifies instances where the `odbcconf.exe` executable is used with the `REGSVR` command to register new Dynamic Link Libraries (DLLs). The rule inspects process creation logs on Windows systems, particularly focusing on the invocation of `odbcconf.exe` with command line arguments that include both 'REGSVR' and a DLL file extension. Attackers often exploit this legitimate utility to covertly install and execute malicious DLLs, mimicking the functionality of the common `regsvr32` command. By monitoring for these specific conditions, the rule helps to identify potentially harmful activity that could result in unauthorized code execution and compromised system integrity.
  ### Investigation Steps
  - Check the relevant EDR logs to find the execution path of `odbcconf.exe` and confirm the DLL file being registered for any indicators of compromise.
  - Review the command line parameters for the `odbcconf.exe` execution in process creation logs to ensure that no suspicious arguments were utilized.
  - Investigate the file properties of the registered DLL by using the AV tool to analyze its reputation and determine if it has any malicious indicators.
  - Correlate the event with network activity using NDR logs to see if there were any unusual outbound connections made after the DLL was registered.
