title: Potentially Suspicious Execution Of Regasm/Regsvcs From Uncommon Location
id: cc368ed0-2411-45dc-a222-510ace303cb2
related:
- id: e9f8f8cc-07cc-4e81-b724-f387db9175e4
  type: derived
status: test
description: Detects potentially suspicious execution of the Regasm/Regsvcs utilities
  from a potentially suspicious location
references:
- https://www.fortiguard.com/threat-signal-report/4718?s=09
- https://lolbas-project.github.io/lolbas/Binaries/Regasm/
- https://lolbas-project.github.io/lolbas/Binaries/Regsvcs/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-08-25
modified: 2023-02-13
tags:
- attack.defense-evasion
- attack.t1218.009
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith:
    - '\Regsvcs.exe'
    - '\Regasm.exe'
  - OriginalFileName:
    - 'RegSvcs.exe'
    - 'RegAsm.exe'
  selection_dir:
    CommandLine|contains:
            # Note: Add more potentially suspicious directories
    - '\AppData\Local\Temp\'
    - '\Microsoft\Windows\Start Menu\Programs\Startup\'
    - '\PerfLogs\'
    - '\Users\Public\'
    - '\Windows\Temp\'
            # - '\Desktop\'
            # - '\Downloads\'
  condition: all of selection_*
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  This Sigma rule aims to detect potentially suspicious executions of the Regasm and Regsvcs utilities from uncommon directories. Regasm (Assembly Registration Tool) and Regsvcs (Service Registration Tool) are legitimate Microsoft utilities used for handling .NET assemblies and Windows services, respectively. The detection focuses on their execution from directories that are atypical for these tools, such as `Temp` directories or Startup folders, which may indicate malicious activity, such as evading standard security checks or executing after a system reboot. The primary data sources involved in this detection include process creation logs that detail the execution of these binaries along with their command-line parameters that may reveal suspicious directory paths.
  ### Investigation Steps
  - Examine the alert details in the SIEM to identify the specific user, timestamp, and command-line arguments associated with the execution of Regasm.exe or Regsvcs.exe.
  - Query EDR logs to track the process's parent-child relationships, alone with any associated processes that may indicate lateral movement or execution of additional malicious payloads.
  - Review Windows Event Logs for any associated events around the time of execution that could provide context on the user's activity or system changes.
  - Check network logs in the NDR for any unusual outbound connections made by the host around the time of the alert, as this could indicate data exfiltration or communication with a command-and-control server.
