title: Suspicious File Download From File Sharing Domain Via Wget.EXE
id: a0d7e4d2-bede-4141-8896-bc6e237e977c
status: experimental
description: Detects potentially suspicious file downloads from file sharing domains
  using wget.exe
references:
- https://labs.withsecure.com/publications/fin7-target-veeam-servers
- https://github.com/WithSecureLabs/iocs/blob/344203de742bb7e68bd56618f66d34be95a9f9fc/FIN7VEEAM/iocs.csv
- https://www.microsoft.com/en-us/security/blog/2024/01/17/new-ttps-observed-in-mint-sandstorm-campaign-targeting-high-profile-individuals-at-universities-and-research-orgs/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023-05-05
modified: 2024-10-21
tags:
- attack.execution
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: '\wget.exe'
  - OriginalFileName: 'wget.exe'
  selection_websites:
    CommandLine|contains:
    - '.githubusercontent.com'               # Includes both gists and github repositories / Michael Haag (idea)
    - 'anonfiles.com'
    - 'cdn.discordapp.com'
    - 'ddns.net'
    - 'dl.dropboxusercontent.com'
    - 'ghostbin.co'
    - 'glitch.me'
    - 'gofile.io'
    - 'hastebin.com'
    - 'mediafire.com'
    - 'mega.nz'
    - 'onrender.com'
    - 'pages.dev'
    - 'paste.ee'
    - 'pastebin.com'
    - 'pastebin.pl'
    - 'pastetext.net'
    - 'pixeldrain.com'
    - 'privatlab.com'
    - 'privatlab.net'
    - 'send.exploit.in'
    - 'sendspace.com'
    - 'storage.googleapis.com'
    - 'storjshare.io'
    - 'supabase.co'
    - 'temp.sh'
    - 'transfer.sh'
    - 'trycloudflare.com'
    - 'ufile.io'
    - 'w3spaces.com'
    - 'workers.dev'
  selection_http:
    CommandLine|contains: 'http'
  selection_flag:
  - CommandLine|re: '\s-O\s'
  - CommandLine|contains: '--output-document'
  selection_ext:
    CommandLine|endswith:
    - '.ps1'
    - ".ps1'"
    - '.ps1"'
    - '.dat'
    - ".dat'"
    - '.dat"'
    - '.msi'
    - ".msi'"
    - '.msi"'
    - '.bat'
    - ".bat'"
    - '.bat"'
    - '.exe'
    - ".exe'"
    - '.exe"'
    - '.vbs'
    - ".vbs'"
    - '.vbs"'
    - '.vbe'
    - ".vbe'"
    - '.vbe"'
    - '.hta'
    - ".hta'"
    - '.hta"'
    - '.dll'
    - ".dll'"
    - '.dll"'
    - '.psm1'
    - ".psm1'"
    - '.psm1"'
  condition: all of selection_*
falsepositives:
- Unknown
level: high
notes: |
  n
  ### Technical Context
  This Sigma rule is designed to detect potentially suspicious file downloads initiated through the `wget.exe` utility from known file-sharing domains. The detection mechanism utilizes process creation logs to analyze the command line arguments passed to `wget.exe`. It specifically looks for instances of the executable downloading files with extensions commonly used in scripts and executables, such as `.ps1`, `.exe`, and `.bat`, from domains associated with file sharing (e.g., `pastebin.com`, `mediafire.com`). The rule relates to the MITRE ATT&CK technique of Execution (T1203 
  - Exploitation for Client Execution). 
  The critical data sources involved in this detection include command-line parameters from process creation logs, which can reveal what is being downloaded, the source URL, and any associated flags used in the command invocation of `wget.exe`. By cross-referencing with the domains of interest, this rule enhances detection capabilities for malicious file downloads that could lead to further exploitation or incidents within the network.
  ### Investigation Steps
  - **Analyze the alert context**: Review the alert details in your SIEM, focusing on the command-line parameters and the associated process creation logs for `wget.exe` to confirm the potential malicious nature of the file downloaded.
  - **Cross-reference the download source**: Inspect the domain from which the file was downloaded. Use threat intelligence services or internal resources to verify if the domain is historically linked to malicious activity.
  - **Investigate file characteristics**: Check the attributes of the downloaded file if available, using EDR for file metadata analysis and determining whether the file matches known suspicious hashes or signatures.
  - **Monitor subsequent activity**: Look for any subsequent processes spawned from `wget.exe` or downloaded files, as this could indicate further exploitation attempts or lateral movement within the network.
  ### Prioritization
  The alert is classified as high severity due to the potential for significant risk associated with executing malicious files that may be downloaded from untrusted sources, indicating a possible breach or compromise of sensitive environments.
  ### Blind spots and Assumptions
  This rule may not fire if `wget.exe` is invoked without recognizable command-line arguments or if the malicious file is downloaded using different means (e.g., other download managers, powershell). Additionally, if the attacker utilizes custom or obscured domains that are not included in the detection criteria, the rule may fail to trigger. It is assumed that the appropriate logging is properly configured to capture all relevant process creation events; any misconfigurations could impact detection efficacy.
  > **Disclaimer:** This investigation guide was created using generative AI technology and has not been reviewed for its accuracy and relevance. While every effort has been made to ensure its quality and relevance, we recommend validating the content and adapting it to suit specific environment and operational needs. Please communicate any changes to the detection engineering team.
