title: Wlrmdr.EXE Uncommon Argument Or Child Process
id: 9cfc00b6-bfb7-49ce-9781-ef78503154bb
status: test
description: |
  Detects the execution of "Wlrmdr.exe" with the "-u" command line flag which allows anything passed to it to be an argument of the ShellExecute API, which would allow an attacker to execute arbitrary binaries.
  This detection also focuses on any uncommon child processes spawned from "Wlrmdr.exe" as a supplement for those that posses "ParentImage" telemetry.
references:
- https://twitter.com/0gtweet/status/1493963591745220608?s=20&t=xUg9DsZhJy1q9bPTUWgeIQ
- https://lolbas-project.github.io/lolbas/Binaries/Wlrmdr/
author: frack113, manasmbellani
date: 2022-02-16
modified: 2024-03-06
tags:
- attack.defense-evasion
- attack.t1218
logsource:
  category: process_creation
  product: windows
detection:
  selection_parent:   # This selection is looking for processes spawned from wlrmdr using the "-u" flag
    ParentImage|endswith: '\wlrmdr.exe'
  selection_child_img:
  - Image|endswith: '\wlrmdr.exe'
  - OriginalFileName: 'WLRMNDR.EXE'
  selection_child_cli:
    CommandLine|contains|all|windash:
    - '-s '
    - '-f '
    - '-t '
    - '-m '
    - '-a '
    - '-u '
  filter_main_winlogon:
    ParentImage: 'C:\Windows\System32\winlogon.exe'
  filter_main_empty:
    ParentImage:
    - ''
    - '-'
  filter_main_null:
    ParentImage:
  condition: selection_parent or (all of selection_child_* and not 1 of filter_main_*)
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  This detection rule identifies potentially malicious activity involving the execution of the binary `Wlrmdr.exe` with the `-u` command line argument, which can enable attackers to use the ShellExecute API for launching arbitrary executables. The rule closely monitors process creation events and looks for instances where `Wlrmdr.exe` spawns either directly or through uncommon child processes with specific command-line parameters indicative of potential misuse. The relevant data sources for this rule include process creation logs, which provide details on command-line arguments and parent-child process relationships, primarily focusing on Windows environments.
  In essence, the rule will trigger when a process is launched from `Wlrmdr.exe` with the `-u` flag, or when `Wlrmdr.exe` spawns any uncommon child processes, effectively flagging potentially harmful behaviors that may evade standard detection mechanisms.
  ### Investigation Steps
  - Use the EDR tool to examine the process tree starting from `Wlrmdr.exe`. Ensure you note any suspicious child processes and their associated command-line arguments.
  - Review command-line arguments captured in process creation logs to determine if any unusual parameters were used alongside the `-u` flag.
  - Check for network activity related to the child processes using NDR or firewall logs to identify any outbound connections, especially those that appear unusual or unauthorized.
  - Investigate user activity context around the time of the alert using log data from VPN or Azure, confirming whether legitimate users were running any unusual commands.
