title: Suspicious Processes Spawned by Java.EXE
id: 0d34ed8b-1c12-4ff2-828c-16fc860b766d
related:
- id: dff1e1cc-d3fd-47c8-bfc2-aeb878a754c0
  type: similar
status: test
description: Detects suspicious processes spawned from a Java host process which could
  indicate a sign of exploitation (e.g. log4j)
references:
- https://web.archive.org/web/20231230220738/https://www.lunasec.io/docs/blog/log4j-zero-day/
author: Andreas Hunkeler (@Karneades), Florian Roth
date: 2021-12-17
modified: 2024-01-18
tags:
- attack.initial-access
- attack.persistence
- attack.privilege-escalation
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    ParentImage|endswith: '\java.exe'
    Image|endswith:
    - '\AppVLP.exe'
    - '\bitsadmin.exe'
    - '\certutil.exe'
    - '\cscript.exe'
    - '\curl.exe'
    - '\forfiles.exe'
    - '\hh.exe'
    - '\mftrace.exe'
    - '\mshta.exe'
    - '\net.exe'
    - '\net1.exe'
    - '\query.exe'
    - '\reg.exe'
    - '\regsvr32.exe'
    - '\rundll32.exe'
    - '\schtasks.exe'
    - '\scrcons.exe'
    - '\scriptrunner.exe'
    - '\sh.exe'
    - '\systeminfo.exe'
    - '\whoami.exe'
    - '\wmic.exe'                # https://app.any.run/tasks/c903e9c8-0350-440c-8688-3881b556b8e0/
    - '\wscript.exe'
  condition: selection
falsepositives:
- Legitimate calls to system binaries
- Company specific internal usage
level: high
notes: |
  ### Technical Context
  This detection rule is designed to identify potentially malicious processes spawned from the legitimate Java executable (`java.exe`). It specifically looks for instances where a known list of suspicious executables—including administrative tools and common scripting engines—are initiated by the Java host process. A successful detection can indicate potential exploitation methods, such as those involved in the Log4j vulnerability or other Java-related attack vectors. The primary data source for this rule is Windows process creation logs, which capture details about newly created processes, their parent processes, and the command-line parameters used to execute them.
  ### Investigation Steps
  - Investigate the process tree using your EDR solution to confirm the parent-child relationship between `java.exe` and the identified suspect processes.
  - Review the command-line arguments of the spawned processes in the EDR logs to determine if they indicate suspicious behavior or misuse of legitimate applications.
  - Check firewall logs and proxy records to see if any unusual network communications were initiated by the suspicious processes, which may indicate a data exfiltration attempt.
  - Correlate findings with threat intelligence sources to establish any known associations between the detected processes and active threat actors or campaigns.
