title: Renamed Vmnat.exe Execution
id: 7b4f794b-590a-4ad4-ba18-7964a2832205
status: test
description: Detects renamed vmnat.exe or portable version that can be used for DLL
  side-loading
references:
- https://twitter.com/malmoeb/status/1525901219247845376
author: elhoim
date: 2022-09-09
modified: 2023-02-03
tags:
- attack.defense-evasion
- attack.t1574.002
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    OriginalFileName: 'vmnat.exe'
  filter_rename:
    Image|endswith: 'vmnat.exe'
  condition: selection and not 1 of filter_*
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  The "Renamed Vmnat.exe Execution" Sigma rule actively monitors for activities involving the legitimate networking process `vmnat.exe`, which can be exploited by threat actors through renaming for malicious purposes such as DLL side-loading. This rule identifies instances where `vmnat.exe` retains its original filename while being executed from paths that do not align with expected locations, signaling potential evasion tactics. The primary technical data sources for this detection are Windows process creation logs, specifically focusing on attributes like the OriginalFileName parameter and the executed image path. By correlating these details, the SOC can pinpoint suspicious uses of what should be a benign executable and raise alerts for further investigation.
  ### Investigation Steps
  - Review process creation logs in the EDR to identify occurrences of `vmnat.exe` that have been executed from unexpected directories.
  - Analyze command-line parameters in the EDR for any abnormal arguments passed during the execution of `vmnat.exe`, which might indicate malicious intent.
  - Check anti-virus logs for any alerts or blocks related to `vmnat.exe`, as these could provide insights into known malicious versions or behaviors.
  - Inspect network traffic in the NDR to determine if there were suspicious outbound connections initiated by the process, which could suggest the exfiltration of data or communication with a command-and-control server.
