title: Chromium Browser Headless Execution To Mockbin Like Site
id: 1c526788-0abe-4713-862f-b520da5e5316
status: test
description: Detects the execution of a Chromium based browser process with the "headless"
  flag and a URL pointing to the mockbin.org service (which can be used to exfiltrate
  data).
references:
- https://www.zscaler.com/blogs/security-research/steal-it-campaign
author: X__Junior (Nextron Systems)
date: 2023-09-11
tags:
- attack.execution
logsource:
  product: windows
  category: process_creation
detection:
  selection_img:
    Image|endswith:
    - '\brave.exe'
    - '\chrome.exe'
    - '\msedge.exe'
    - '\opera.exe'
    - '\vivaldi.exe'
  selection_headless:
    CommandLine|contains: '--headless'
  selection_url:
    CommandLine|contains:
    - '://run.mocky'
    - '://mockbin'
  condition: all of selection_*
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This detection rule identifies potentially malicious activity involving Chromium-based browsers executed in a headless mode, specifically targeting the use of the mockbin.org service. The headless execution of browsers allows scripts and attackers to operate without a visible interface, making it harder to detect suspicious actions. This rule focuses on processes related to popular browsers such as Chrome, Brave, Edge, Opera, and Vivaldi that are initiated with the command-line flag `--headless` and include URLs directing to mockbin.org. The key technical data sources involved in this detection are process creation logs, which capture details about executed processes, including the process image name and command-line parameters.
  ### Investigation Steps
  - Verify the process attributes in the EDR tool, checking for the specific Chromium-based browser executed with the `--headless` flag.
  - Investigate the command-line arguments used; look for instances of `://mockbin` or `://run.mocky`, as these can indicate potential data exfiltration attempts.
  - Correlate the occurrence of this activity with user behavior logs, particularly focusing on whether the browser executable was launched by an authorized user.
  - Analyze outbound network traffic logs from the firewall or proxy to identify any connections made to mockbin.org or related domains, which may give insight into the data being transferred.
