title: Use of OpenConsole
id: 814c95cc-8192-4378-a70a-f1aafd877af1
status: test
description: Detects usage of OpenConsole binary as a LOLBIN to launch other binaries
  to bypass application Whitelisting
references:
- https://twitter.com/nas_bench/status/1537563834478645252
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-06-16
tags:
- attack.execution
- attack.t1059
logsource:
  category: process_creation
  product: windows
detection:
  selection:
  - OriginalFileName: 'OpenConsole.exe'
  - Image|endswith: '\OpenConsole.exe'
  filter:
    Image|startswith: 'C:\Program Files\WindowsApps\Microsoft.WindowsTerminal'     # We exclude the default path for WindowsTerminal
  condition: selection and not filter
falsepositives:
- Legitimate use by an administrator
level: medium
notes: |
  ### Technical Context
  The detection rule focuses on identifying the usage of the OpenConsole binary, which is a legitimate tool often exploited as a living-off-the-land binary (LOLBIN) to circumvent application whitelisting mechanisms. This means that malicious actors may leverage OpenConsole to launch other binaries without triggering security alerts. The rule specifically checks for process creation events where the `OriginalFileName` or `Image` path corresponds to `OpenConsole.exe`, while excluding instances that originate from the default Microsoft Terminal installation path. By monitoring these events, incident responders can distinguish between legitimate administrative actions and potential malicious activity that attempts to exploit this tool.
  ### Investigation Steps
  - Review recent process creation logs in your EDR to identify instances of `OpenConsole.exe` being executed, noting the parent and child processes involved for context.
  - Verify the command-line parameters used with OpenConsole to assess whether they look suspicious or align with normal administrative tasks.
  - Check the user account associated with the OpenConsole execution for any indicators of compromised credentials or unauthorized access patterns.
  - Investigate any network activity related to the processes launched by OpenConsole using your NDR or Proxy logs to look for suspicious outbound connections.
