title: Script Interpreter Execution From Suspicious Folder
id: 1228c958-e64e-4e71-92ad-7d429f4138ba
status: test
description: Detects a suspicious script execution in temporary folders or folders
  accessible by environment variables
references:
- https://www.virustotal.com/gui/file/91ba814a86ddedc7a9d546e26f912c541205b47a853d227756ab1334ade92c3f
- https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/shuckworm-russia-ukraine-military
- https://learn.microsoft.com/en-us/windows/win32/shell/csidl
author: Florian Roth (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)
date: 2022-02-08
modified: 2023-06-16
tags:
- attack.execution
- attack.t1059
logsource:
  category: process_creation
  product: windows
detection:
  selection_proc_image:
    Image|endswith:
    - '\cscript.exe'
    - '\mshta.exe'
    - '\wscript.exe'
  selection_proc_flags:
    CommandLine|contains:
    - ' -ep bypass '
    - ' -ExecutionPolicy bypass '
    - ' -w hidden '
    - '/e:javascript '
    - '/e:Jscript '
    - '/e:vbscript '
  selection_proc_original:
    OriginalFileName:
    - 'cscript.exe'
    - 'mshta.exe'
    - 'wscript.exe'
  selection_folders_1:
    CommandLine|contains:
    - ':\Perflogs\'
    - ':\Users\Public\'
    - '\AppData\Local\Temp'
    - '\AppData\Roaming\Temp'
    - '\Temporary Internet'
    - '\Windows\Temp'
  selection_folders_2:
  - CommandLine|contains|all:
    - ':\Users\'
    - '\Favorites\'
  - CommandLine|contains|all:
    - ':\Users\'
    - '\Favourites\'
  - CommandLine|contains|all:
    - ':\Users\'
    - '\Contacts\'
  condition: 1 of selection_proc_* and 1 of selection_folders_*
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  The "Script Interpreter Execution From Suspicious Folder" detection rule identifies potentially malicious script executions that occur from temporary folders or other accessible directories, which are often exploited by attackers to execute scripts while evading detection. This rule monitors for processes initiated by Windows script interpreters, specifically `cscript.exe`, `mshta.exe`, and `wscript.exe`, combined with command-line parameters indicative of evasion tactics, such as "bypass" or "hidden" execution modes. By analyzing process creation logs, including command-line arguments and the original file names during execution, the rule is designed to flag any instances where scripts are executed from locations that include system directories like `C:\Windows\Temp` and user-specific folders accessed through environment variables. The intent is to surface potential threats leveraging script interpreters in non-standard paths.
  ### Investigation Steps
  - Review EDR logs for any instances of `cscript.exe`, `mshta.exe`, or `wscript.exe` execution that originated from suspicious paths, particularly temporary folders.
  - Analyze command-line parameters associated with the script executions, looking for the use of bypass flags or indicators that may suggest malicious intent.
  - Check for historical data in the SIEM regarding previous executions from the same paths, determining whether this behavior is consistent with user activity or indicative of compromise.
  - Correlate findings with information in the Proxy and AV logs to assess additional context surrounding the execution, including any web traffic or file downloads that may be linked to the scripts.
