title: File Encryption/Decryption Via Gpg4win From Suspicious Locations
id: e1e0b7d7-e10b-4ee4-ac49-a4bda05d320d
status: test
description: Detects usage of Gpg4win to encrypt/decrypt files located in potentially
  suspicious locations.
references:
- https://blogs.vmware.com/security/2022/11/batloader-the-evasive-downloader-malware.html
- https://news.sophos.com/en-us/2022/01/19/zloader-installs-remote-access-backdoors-and-delivers-cobalt-strike/
author: Nasreddine Bencherchali (Nextron Systems), X__Junior (Nextron Systems)
date: 2022-11-30
modified: 2023-08-09
tags:
- attack.execution
logsource:
  category: process_creation
  product: windows
detection:
  selection_metadata:
  - Image|endswith:
    - '\gpg.exe'
    - '\gpg2.exe'
  - Product: 'GNU Privacy Guard (GnuPG)'
  - Description: 'GnuPG’s OpenPGP tool'
  selection_cli:
    CommandLine|contains: '-passphrase'
  selection_paths:
    CommandLine|contains:
    - ':\PerfLogs\'
    - ':\Temp\'
    - ':\Users\Public\'
    - ':\Windows\Temp\'
    - '\AppData\Local\Temp\'
    - '\AppData\Roaming\'
  condition: all of selection_*
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This detection rule identifies the usage of Gpg4win, a suite that includes GnuPG for file encryption and decryption, particularly focusing on processes initiated from suspicious locations such as temporary directories and public folders. The rule monitors process creation logs for instances of `gpg.exe` or `gpg2.exe`, specifically looking for command-line arguments that include `-passphrase`, indicating a possible encryption or decryption operation. This is significant as malicious actors may use encryption tools to obfuscate data before exfiltration or to secure malware payloads. The technical data sources involved primarily include process creation events from Windows and the specific attributes associated with the command line and file paths used by the processes.
  ### Investigation Steps
  - Investigate the process creation logs in your EDR to identify the originating user accounts and timeframes related to the `gpg.exe` or `gpg2.exe` executions.
  - Cross-reference command-line parameters found in the logs, particularly looking for instances that utilize `-passphrase`, to understand the intentions behind the encryption or decryption actions.
  - Review file access logs in your file system auditing tools to check if sensitive data files were accessed during the time the suspicious processes ran.
  - Analyze logs from your proxy or VPN to determine if there were any associated external communications that could indicate data exfiltration or command-control interactions.
