title: HackTool - Impacket Tools Execution
id: 4627c6ae-6899-46e2-aa0c-6ebcb1becd19
status: test
description: Detects the execution of different compiled Windows binaries of the impacket
  toolset (based on names or part of their names - could lead to false positives)
references:
- https://github.com/ropnop/impacket_static_binaries/releases/tag/0.9.21-dev-binaries
author: Florian Roth (Nextron Systems)
date: 2021-07-24
modified: 2023-02-07
tags:
- attack.execution
- attack.t1557.001
logsource:
  category: process_creation
  product: windows
detection:
  selection:
  - Image|contains:
    - '\goldenPac'
    - '\karmaSMB'
    - '\kintercept'
    - '\ntlmrelayx'
    - '\rpcdump'
    - '\samrdump'
    - '\secretsdump'
    - '\smbexec'
    - '\smbrelayx'
    - '\wmiexec'
    - '\wmipersist'
  - Image|endswith:
    - '\atexec_windows.exe'
    - '\dcomexec_windows.exe'
    - '\dpapi_windows.exe'
    - '\findDelegation_windows.exe'
    - '\GetADUsers_windows.exe'
    - '\GetNPUsers_windows.exe'
    - '\getPac_windows.exe'
    - '\getST_windows.exe'
    - '\getTGT_windows.exe'
    - '\GetUserSPNs_windows.exe'
    - '\ifmap_windows.exe'
    - '\mimikatz_windows.exe'
    - '\netview_windows.exe'
    - '\nmapAnswerMachine_windows.exe'
    - '\opdump_windows.exe'
    - '\psexec_windows.exe'
    - '\rdp_check_windows.exe'
    - '\sambaPipe_windows.exe'
    - '\smbclient_windows.exe'
    - '\smbserver_windows.exe'
    - '\sniff_windows.exe'
    - '\sniffer_windows.exe'
    - '\split_windows.exe'
    - '\ticketer_windows.exe'
              # - '\addcomputer_windows.exe'
              # - '\esentutl_windows.exe'
              # - '\getArch_windows.exe'
              # - '\lookupsid_windows.exe'
              # - '\mqtt_check_windows.exe'
              # - '\mssqlclient_windows.exe'
              # - '\mssqlinstance_windows.exe'
              # - '\ntfs-read_windows.exe'
              # - '\ping_windows.exe'
              # - '\ping6_windows.exe'
              # - '\raiseChild_windows.exe'
              # - '\reg_windows.exe'
              # - '\registry-read_windows.exe'
              # - '\services_windows.exe'
              # - '\wmiquery_windows.exe'
  condition: selection
falsepositives:
- Legitimate use of the impacket tools
level: high
notes: |
  ### Technical Context
  This detection rule identifies the execution of various binaries associated with the Impacket toolset, a collection often employed for executing network attacks and assessment tasks. The rule checks for specific file names and paths related to Impacket binaries found in system process creation logs, leveraging Windows' ability to track executed processes. By monitoring the names of these binaries, such as `goldenPac`, `secretsdump`, and `psexec`, the rule can help identify potentially malicious or unauthorized activity in a Windows environment. It's essential to note that legitimate usage of these tools can lead to false positives, necessitating careful analysis before drawing conclusions.
  ### Investigation Steps
  - Utilize the EDR tool to trace the execution history of the detected binaries, gathering context on user accounts, timestamps, and associated process execution paths.
  - Review Windows event logs, particularly those related to process creation, for additional details surrounding the execution context, including command-line arguments used with the binaries.
  - Check for network activity associated with the detected processes by examining logs from the NGFW or NDR. Look for unusual outbound connections aligning with the functionalities of Impacket tools.
  - Analyze any relevant proxy logs to reveal if there were any inbound or outbound web requests correlated with the timing of the alerts, helping discern if the activities were part of a coordinated attack or legitimate usage.
