title: Install New Package Via Winget Local Manifest
id: 313d6012-51a0-4d93-8dfc-de8553239e25
status: test
description: |
  Detects usage of winget to install applications via manifest file. Adversaries can abuse winget to download payloads remotely and execute them.
  The manifest option enables you to install an application by passing in a YAML file directly to the client.
  Winget can be used to download and install exe, msi or msix files later.
references:
- https://learn.microsoft.com/en-us/windows/package-manager/winget/install#local-install
- https://lolbas-project.github.io/lolbas/Binaries/Winget/
- https://github.com/nasbench/Misc-Research/tree/b9596e8109dcdb16ec353f316678927e507a5b8d/LOLBINs/Winget
author: Sreeman, Florian Roth (Nextron Systems), frack113
date: 2020-04-21
modified: 2023-04-17
tags:
- attack.defense-evasion
- attack.execution
- attack.t1059
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: '\winget.exe'
  - OriginalFileName: 'winget.exe'
  selection_install_flag:
    CommandLine|contains:
    - 'install'
    - ' add '         # https://github.com/microsoft/winget-cli/blob/02d2f93807c9851d73eaacb4d8811a76b64b7b01/src/AppInstallerCLICore/Commands/InstallCommand.h
  selection_manifest_flag:
    CommandLine|contains:
    - '-m '
    - '--manifest'
  condition: all of selection_*
falsepositives:
- Some false positives are expected in some environment that may use this functionality
  to install and test their custom applications
level: medium
notes: |
  ### Technical Context
  This detection rule captures the execution of the Windows Package Manager (`winget`) when it is used to install applications via a local manifest file, which can potentially be misused by adversaries to deploy malicious payloads. The rule focuses on process creation logs, specifically monitoring the execution of `winget.exe`. It identifies command-line parameters that indicate an installation action (`install`, `add`) combined with flags that imply a local manifest file (`-m`, `--manifest`). By flagging such behavior, the rule assists in detecting unauthorized or suspicious installations that may bypass standard security measures by leveraging the `winget` tool to download and execute malicious files in the environment.
  ### Investigation Steps
  - Review EDR and process creation logs for instances of `winget.exe` executing with the specified command-line parameters identifying potential misuse.
  - Check for recent installations or activities linked to the applications being installed via the manifest files to determine if they are legitimate or unusual.
  - Correlate alerts from the SIEM with user account activity logs to ascertain whether the user initiated the installation or if it was potentially automated or unauthorized.
  - Utilize the AV and NDR solutions to scan for any known malicious signatures or anomalous behavior related to the newly installed applications to ensure they are not compromised.
