title: Suspicious File Download From IP Via Wget.EXE
id: 17f0c0a8-8bd5-4ee0-8c5f-a342c0199f35
status: test
description: Detects potentially suspicious file downloads directly from IP addresses
  using Wget.exe
references:
- https://www.gnu.org/software/wget/manual/wget.html
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023-07-27
tags:
- attack.execution
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: '\wget.exe'
  - OriginalFileName: 'wget.exe'
  selection_ip:
    CommandLine|re: '://[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}'
  selection_http:
    CommandLine|contains: 'http'
  selection_flag:
  - CommandLine|re: '\s-O\s'
  - CommandLine|contains: '--output-document'
  selection_ext:
    CommandLine|endswith:
            # Note you can transform this into a "contains" to increase coverage but you would need to take care of some FP.
    - '.ps1'
    - ".ps1'"
    - '.ps1"'
    - '.dat'
    - ".dat'"
    - '.dat"'
    - '.msi'
    - ".msi'"
    - '.msi"'
    - '.bat'
    - ".bat'"
    - '.bat"'
    - '.exe'
    - ".exe'"
    - '.exe"'
    - '.vbs'
    - ".vbs'"
    - '.vbs"'
    - '.vbe'
    - ".vbe'"
    - '.vbe"'
    - '.hta'
    - ".hta'"
    - '.hta"'
    - '.dll'
    - ".dll'"
    - '.dll"'
    - '.psm1'
    - ".psm1'"
    - '.psm1"'
  condition: all of selection_*
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This detection rule identifies potentially suspicious file downloads executed through `wget.exe`, a commonly used command-line utility for downloading files from the web. The rule specifically looks for command-line activities where `wget.exe` is invoked to retrieve files directly from IP addresses, as indicated by the format of the Command Line parameters. The detection logic encompasses various conditions: it checks for common flags associated with file output, such as `-O` or `--output-document`, and identifies specific file extensions that are often associated with malicious scripts or executables (e.g., `.ps1`, `.exe`, `.bat`). The primary data source involved in this detection is process creation logs, capturing the arguments and patterns associated with the execution of `wget.exe`.
  ### Investigation Steps
  - Utilize your EDR tool to query recent `wget.exe` process execution logs, focusing on command lines containing specified IP addresses and file extensions. 
  - Analyze any related network logs to trace the downloaded file's origin, using your NDR or firewall logs to verify the IP address and inspect any potential malicious activity.
  - Examine the file download history and context, leveraging AV solutions to scan the downloaded files for malware signatures, especially if they fall into potentially dangerous categories.
  - Review proxy logs for any outbound HTTP requests associated with the identified IP address to assess the level of user engagement and potential data exfiltration.
