title: Potential Tampering With Security Products Via WMIC
id: 847d5ff3-8a31-4737-a970-aeae8fe21765
related:
- id: b53317a0-8acf-4fd1-8de8-a5401e776b96     # Generic Uninstall
  type: derived
status: test
description: Detects uninstallation or termination of security products using the
  WMIC utility
references:
- https://twitter.com/cglyer/status/1355171195654709249
- https://thedfirreport.com/2021/10/18/icedid-to-xinglocker-ransomware-in-24-hours/
- https://www.mandiant.com/resources/unc2165-shifts-to-evade-sanctions
- https://research.nccgroup.com/2022/08/19/back-in-black-unlocking-a-lockbit-3-0-ransomware-attack/
- https://www.trendmicro.com/en_us/research/23/a/vice-society-ransomware-group-targets-manufacturing-companies.html
author: Florian Roth (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)
date: 2021-01-30
modified: 2023-02-14
tags:
- attack.defense-evasion
- attack.t1562.001
logsource:
  category: process_creation
  product: windows
detection:
  selection_cli_1:
    CommandLine|contains|all:
    - 'wmic'
    - 'product where '
    - 'call'
    - 'uninstall'
    - '/nointeractive'
  selection_cli_2:
    CommandLine|contains|all:
    - 'wmic'
    - 'caption like '
    CommandLine|contains:
    - 'call delete'
    - 'call terminate'
  selection_cli_3:
    CommandLine|contains|all:
    - 'process '
    - 'where '
    - 'delete'
  selection_product:
    CommandLine|contains:
    - '%carbon%'
    - '%cylance%'
    - '%endpoint%'
    - '%eset%'
    - '%malware%'
    - '%Sophos%'
    - '%symantec%'
    - 'Antivirus'
    - 'AVG '
    - 'Carbon Black'
    - 'CarbonBlack'
    - 'Cb Defense Sensor 64-bit'
    - 'Crowdstrike Sensor'
    - 'Cylance '
    - 'Dell Threat Defense'
    - 'DLP Endpoint'
    - 'Endpoint Detection'
    - 'Endpoint Protection'
    - 'Endpoint Security'
    - 'Endpoint Sensor'
    - 'ESET File Security'
    - 'LogRhythm System Monitor Service'
    - 'Malwarebytes'
    - 'McAfee Agent'
    - 'Microsoft Security Client'
    - 'Sophos Anti-Virus'
    - 'Sophos AutoUpdate'
    - 'Sophos Credential Store'
    - 'Sophos Management Console'
    - 'Sophos Management Database'
    - 'Sophos Management Server'
    - 'Sophos Remote Management System'
    - 'Sophos Update Manager'
    - 'Threat Protection'
    - 'VirusScan'
    - 'Webroot SecureAnywhere'
    - 'Windows Defender'
  condition: 1 of selection_cli_* and selection_product
falsepositives:
- Legitimate administration
level: high
notes: |
  ### Technical Context
  This detection rule is designed to identify potential attempts to tamper with security products on Windows systems by leveraging the Windows Management Instrumentation Command-line (WMIC) utility. Specifically, the rule focuses on command-line inputs that indicate uninstallation or termination of security software, which can signify malicious activities such as evasion tactics employed by attackers. The rule inspects process creation logs for WMIC commands that include keywords associated with uninstallation, deletion, and termination of various well-known security products. 
  The analysis is concentrated on the "CommandLine" attributes captured in process creation logs, checking for the presence of specific strings that signify harmful intent, such as "uninstall," "delete," or "terminate," alongside recognized product names from various antivirus and endpoint protection solutions. This approach allows for the swift identification of potentially unauthorized changes to security products, prompting further investigation to ensure the integrity of the environment.
  ### Investigation Steps
  - Examine the EDR logs for processes executed with WMIC, focusing on command-line arguments that indicate uninstallation or termination of security software.
  - Review the alerting system or SIEM for correlated events, particularly those indicating prior or subsequent unusual activities linked to the affected host.
  - Query the anti-virus (AV) logs for any recent alerts associated with the same system or user to assess whether any legitimate administrative activities were mistakenly flagged.
  - Check firewall or proxy logs for abnormal outbound connections or activities occurring around the time of the WMIC commands to evaluate any potential data exfiltration or communication with known malicious actors.
