title: Potential Arbitrary Command Execution Using Msdt.EXE
id: 258fc8ce-8352-443a-9120-8a11e4857fa5
status: test
description: Detects processes leveraging the "ms-msdt" handler or the "msdt.exe"
  binary to execute arbitrary commands as seen in the follina (CVE-2022-30190) vulnerability
references:
- https://twitter.com/nao_sec/status/1530196847679401984
- https://app.any.run/tasks/713f05d2-fe78-4b9d-a744-f7c133e3fafb/
- https://twitter.com/_JohnHammond/status/1531672601067675648
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-05-29
modified: 2024-03-13
tags:
- attack.defense-evasion
- attack.t1202
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: '\msdt.exe'
  - OriginalFileName: 'msdt.exe'
  selection_cmd_inline:
    CommandLine|contains: 'IT_BrowseForFile='
  selection_cmd_answerfile_flag:
    CommandLine|contains: ' PCWDiagnostic'
  selection_cmd_answerfile_param:
    CommandLine|contains|windash: ' -af '
  condition: selection_img and (selection_cmd_inline or all of selection_cmd_answerfile_*)
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This detection rule targets possible arbitrary command execution through the use of the "msdt.exe" binary, a Microsoft support tool that has been exploited in the past, specifically through the CVE-2022-30190 vulnerability (commonly referred to as "Follina"). The rule identifies processes that invoke "msdt.exe" along with specific command-line parameters indicative of exploit attempts. Data sources for this rule primarily include process creation logs that capture details about executed commands and their arguments. By monitoring characteristics such as file name, original file name, and specific command-line flags related to the exploit, this rule helps identify potentially malicious actions by spotting unusual usage of legitimate tools on Windows systems.
  ### Investigation Steps
  - Review recent process creation logs in your EDR solution to identify instances of "msdt.exe" being executed, focusing on the command-line parameters that indicate potential exploitation.
  - Correlate the identified events with any network traffic logs from your NDR or firewall to check for unusual outbound connections that may result from the arbitrary command execution.
  - Monitor the user's behavior and access patterns through your cloud logs (if applicable) to determine if there are any suspicious activities or unauthorized access attempts associated with the affected user account.
  - Conduct a thorough antivirus scan on the affected endpoints using your AV tool, while also checking for any other signs of compromise or concurrent malicious activities in system logs.
