title: Suspicious GUP Usage
id: 0a4f6091-223b-41f6-8743-f322ec84930b
status: test
description: Detects execution of the Notepad++ updater in a suspicious directory,
  which is often used in DLL side-loading attacks
references:
- https://www.fireeye.com/blog/threat-research/2018/09/apt10-targeting-japanese-corporations-using-updated-ttps.html
author: Florian Roth (Nextron Systems)
date: 2019-02-06
modified: 2022-08-13
tags:
- attack.defense-evasion
- attack.t1574.002
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith: '\GUP.exe'
  filter_programfiles:
    Image|endswith:
    - '\Program Files\Notepad++\updater\GUP.exe'
    - '\Program Files (x86)\Notepad++\updater\GUP.exe'
  filter_user:
    Image|contains: '\Users\'
    Image|endswith:
    - '\AppData\Local\Notepad++\updater\GUP.exe'
    - '\AppData\Roaming\Notepad++\updater\GUP.exe'
  condition: selection and not 1 of filter_*
falsepositives:
- Execution of tools named GUP.exe and located in folders different than Notepad++\updater
level: high
notes: |
  ### Technical Context
  This detection rule identifies potentially malicious activity associated with the execution of GUP.exe, the updater for Notepad++. The rule looks for instances where GUP.exe is being executed from unexpected directories, specifically within user profile paths like AppData or a user’s installation folders, rather than standard locations such as Program Files. This behavior is of particular concern because attackers often leverage legitimate tools and applications for DLL side-loading attacks, leading to the execution of malicious code. By monitoring process creation logs and filtering based on file paths, security teams can effectively identify and investigate these suspicious executions.
  ### Investigation Steps
  - Check EDR logs for the execution details of GUP.exe, focusing on the full path from where it was launched to determine if it deviates from standard Notepad++ installation paths.
  - Analyze the command-line parameters associated with the GUP.exe process to identify any unusual arguments that may indicate malicious intent.
  - Utilize AV logs to see if any alerts were triggered around the same time as the suspicious GUP.exe execution, providing context to any potential malware activity.
  - Review network logs for any suspicious outbound connections made by GUP.exe, which may reveal attempts to communicate with known malicious domains or IP addresses.
