title: Greedy File Deletion Using Del
id: 204b17ae-4007-471b-917b-b917b315c5db
status: test
description: Detects execution of the "del" builtin command to remove files using
  greedy/wildcard expression. This is often used by malware to delete content of folders
  that perhaps contains the initial malware infection or to delete evidence.
references:
- https://www.joesandbox.com/analysis/509330/0/html#1044F3BDBE3BB6F734E357235F4D5898582D
- https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/erase
author: frack113 , X__Junior (Nextron Systems)
date: 2021-12-02
modified: 2023-09-11
tags:
- attack.defense-evasion
- attack.t1070.004
logsource:
  category: process_creation
  product: windows
detection:
    # Example:
    #   del C:\ProgramData\*.dll & exit
  selection_img:
  - Image|endswith: '\cmd.exe'
  - OriginalFileName: 'Cmd.Exe'
  selection_del:
    CommandLine|contains:
    - 'del '
    - 'erase '
  selection_extensions:
    CommandLine|contains:
    - '\\\*.au3'
    - '\\\*.dll'
    - '\\\*.exe'
    - '\\\*.js'
  condition: all of selection_*
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  This detection rule monitors the execution of the `del` or `erase` commands through the Command Prompt on Windows systems, specifically targeting instances where these commands use greedy or wildcard expressions to delete specific file types. Command-line parameters that include patterns like `\\*.dll`, `\\*.exe`, or `\\*.js` are particularly concerning, as they can indicate malicious activity intended to remove evidence or hinder incident response efforts by targeting files associated with malware. The rule leverages process creation logs to gather instances of `cmd.exe` execution with these specific command-line arguments, helping identify potential clean-up actions taken by threat actors during or after a security incident.
  ### Investigation Steps
  - Review the process creation logs in your EDR or SIEM tool to identify instances of `cmd.exe` execution carrying the `del` or `erase` commands with wildcard patterns.
  - Analyze the command-line parameters associated with the identified processes to determine if the extensions targeted are linked to critical system files or applications.
  - Cross-reference the timestamps of these commands with other events in your security log to establish any anomalous user behavior or patterns indicative of malware activity.
  - Utilize AV and NDR tools to scan the affected systems for potential malware remnants and confirm if any known threats correlate with the identified activities.
