title: Windows Kernel Debugger Execution
id: 27ee9438-90dc-4bef-904b-d3ef927f5e7e
status: test
description: Detects execution of the Windows Kernel Debugger "kd.exe".
references:
- Internal Research
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023-05-15
modified: 2024-04-24
tags:
- attack.defense-evasion
- attack.privilege-escalation
logsource:
  category: process_creation
  product: windows
detection:
  selection:
  - Image|endswith: '\kd.exe'
  - OriginalFileName: 'kd.exe'
  condition: selection
falsepositives:
- Rare occasions of legitimate cases where kernel debugging is necessary in production.
  Investigation is required
level: medium
notes: |
  ### Technical Context
  This Sigma rule is designed to detect the execution of the Windows Kernel Debugger (kd.exe), a tool often used for debugging kernel-mode programs. The rule identifies specific characteristics of the executed process, including the image name, which must end with "kd.exe" and its original file name, which is also "kd.exe". By analyzing process creation logs, the detection engine can flag instances where this debugger is initiated. Detection of such activity could indicate potential misuse, such as a threat actor attempting to perform kernel-level debugging to evade security controls or escalate privileges. The primary data sources utilized for this detection include Windows process creation logs.
  ### Investigation Steps
  - Utilize EDR tools to search for instances of the process "kd.exe" being executed, noting the user and system context in which it was run.
  - Review command-line parameters associated with the "kd.exe" execution to determine if any malicious activity could be inferred.
  - Check the system and security event logs around the time of the event for any additional anomalies that might indicate unauthorized access or privilege escalation attempts.
  - Assess user access and permissions to understand if the execution was conducted by an authorized user or if there are potential indicators of compromise.
