title: PUA- IOX Tunneling Tool Execution
id: d7654f02-e04b-4934-9838-65c46f187ebc
status: test
description: Detects the use of IOX - a tool for port forwarding and intranet proxy
  purposes
references:
- https://github.com/EddieIvan01/iox
author: Florian Roth (Nextron Systems)
date: 2022-10-08
modified: 2024-11-23
tags:
- attack.command-and-control
- attack.t1090
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith: '\iox.exe'
  selection_commandline:
    CommandLine|contains:
    - '.exe fwd -l '
    - '.exe fwd -r '
    - '.exe proxy -l '
    - '.exe proxy -r '
  selection_hashes:
        # v0.4
    Hashes|contains:
    - "MD5=9DB2D314DD3F704A02051EF5EA210993"
    - "SHA1=039130337E28A6623ECF9A0A3DA7D92C5964D8DD"
    - "SHA256=C6CF82919B809967D9D90EA73772A8AA1C1EB3BC59252D977500F64F1A0D6731"
  condition: 1 of selection*
falsepositives:
- Legitimate use
level: high
notes: |
  ### Technical Context
  This Sigma rule is designed to detect the execution of IOX, a tunneling tool often used for port forwarding and creating proxies within a network. The rule targets specific indicators in process creation logs, particularly looking for instances of `iox.exe` being executed with command-line parameters that indicate port forwarding or proxy setups. It also utilizes file hashes to identify known malicious or suspicious variants of the IOX tool. By focusing on specific command-line patterns and matching the executable against known hashes, the detection rule aims to identify potential unauthorized uses of IOX that can signify an attempt at command-and-control or data exfiltration.
  The primary data sources for this detection include Windows process creation logs, which provide insights into what executable files are being run on systems, and command-line parameters, which help clarify the intent behind the execution. The rule also considers file integrity by matching hashes against a predefined list to catch known compromised versions of IOX, enhancing the security posture of the enterprise.
  ### Investigation Steps
  - Review the alerts generated by the detection rule in the SIEM to identify the time and source of the IOX execution attempt.
  - Correlate the process creation logs with EDR data to assess the context of the event, including any parent processes and user accounts involved.
  - Examine network traffic logs from the NGFW or NDR to identify any unusual connections or proxy activity initiated by the detected IOX execution.
  - Investigate related logs from the endpoint's AV or security tools to check for previous detection of IOX or other potential indicators of compromise on the affected system.
