title: Execution via stordiag.exe
id: 961e0abb-1b1e-4c84-a453-aafe56ad0d34
status: test
description: Detects the use of stordiag.exe to execute schtasks.exe systeminfo.exe
  and fltmc.exe
references:
- https://strontic.github.io/xcyclopedia/library/stordiag.exe-1F08FC87C373673944F6A7E8B18CD845.html
- https://twitter.com/eral4m/status/1451112385041911809
author: Austin Songer (@austinsonger)
date: 2021-10-21
modified: 2022-12-25
tags:
- attack.defense-evasion
- attack.t1218
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    ParentImage|endswith: '\stordiag.exe'
    Image|endswith:
    - '\schtasks.exe'
    - '\systeminfo.exe'
    - '\fltmc.exe'
  filter:
    ParentImage|startswith:     # as first is "Copy c:\windows\system32\stordiag.exe to a folder"
    - 'c:\windows\system32\'
    - 'c:\windows\syswow64\'
  condition: selection and not filter
falsepositives:
- Legitimate usage of stordiag.exe.
level: high
notes: |
  ### Technical Context
  This Sigma rule is designed to detect malicious execution patterns involving the `stordiag.exe` process. Specifically, it identifies instances where `stordiag.exe` serves as the parent process for the execution of other potentially harmful executables such as `schtasks.exe`, `systeminfo.exe`, and `fltmc.exe`. The rule examines Windows process creation logs, focusing on the paths of parent and child processes to determine if the executions are initiated from unauthorized locations. By filtering for these specific executables originating under the `c:\windows\system32\` and `c:\windows\syswow64\` paths, the rule aims to expose potential defense-evasion tactics that may be employed by adversaries to execute commands or gather system information stealthily.
  ### Investigation Steps
  - Review the process creation logs in the EDR for instances of `schtasks.exe`, `systeminfo.exe`, and `fltmc.exe` being launched with `stordiag.exe` as the parent process.
  - Check for any recent changes in the `stordiag.exe` file properties to ascertain if it was modified, which could indicate potential tampering or malicious behavior.
  - Utilize the SIEM to correlate alerts and examine the timeline of events related to `stordiag.exe` executions to identify any preceding or subsequent suspicious activities.
  - Analyze network traffic logs from NDR solutions to detect any outbound connections initiated around the time `stordiag.exe` executed, which could indicate data exfiltration or further malicious activity.
