title: Deletion of Volume Shadow Copies via WMI with PowerShell
id: 21ff4ca9-f13a-41ad-b828-0077b2af2e40
related:
- id: e17121b4-ef2a-4418-8a59-12fb1631fa9e
  type: derived
- id: c1337eb8-921a-4b59-855b-4ba188ddcc42
  type: similar
status: test
description: Detects deletion of Windows Volume Shadow Copies with PowerShell code
  and Get-WMIObject. This technique is used by numerous ransomware families such as
  Sodinokibi/REvil
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1490/T1490.md#atomic-test-5---windows---delete-volume-shadow-copies-via-wmi-with-powershell
- https://www.elastic.co/guide/en/security/current/volume-shadow-copy-deletion-via-powershell.html
author: Tim Rauch, Elastic (idea)
date: 2022-09-20
modified: 2022-12-30
tags:
- attack.impact
- attack.t1490
logsource:
  category: process_creation
  product: windows
detection:
  selection_get:
    CommandLine|contains:
    - 'Get-WmiObject'
    - 'gwmi'
    - 'Get-CimInstance'
    - 'gcim'
  selection_shadowcopy:
    CommandLine|contains: 'Win32_ShadowCopy'
  selection_delete:
    CommandLine|contains:
    - '.Delete()'
    - 'Remove-WmiObject'
    - 'rwmi'
    - 'Remove-CimInstance'
    - 'rcim'
  condition: all of selection*
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This detection rule identifies potential malicious activity involving the deletion of Windows Volume Shadow Copies using PowerShell commands and WMI (Windows Management Instrumentation). The rule specifically looks for patterns in process creation logs where command-line arguments include references to `Get-WmiObject`, `Get-CimInstance`, and related functions such as `Remove-WmiObject` or `.Delete()`. Volume Shadow Copies are often targeted by ransomware families, including Sodinokibi/REvil, to eliminate restore points and hinder recovery efforts after an attack. By capturing these specific command-line patterns, the rule aims to notify security analysts of potentially harmful actions that could compromise the integrity of the data and systems in the enterprise environment.
  ### Investigation Steps
  - Review EDR logs to track the execution of the identified PowerShell commands, specifically focusing on the timestamps and the associated parent processes.
  - Investigate command-line parameters within process creation logs to confirm the use of `Get-WmiObject` and related WMI functions, ensuring the context is analyzed for malicious intent.
  - Check for related events in the SIEM that may indicate lateral movement or other suspicious activity leading up to the shadow copy deletion.
  - Correlate findings with any alerts from AV or NDR tools that may have flagged abnormal behavior on the affected endpoints or networks.
