title: UAC Bypass Tools Using ComputerDefaults
id: 3c05e90d-7eba-4324-9972-5d7f711a60a8
status: test
description: Detects tools such as UACMe used to bypass UAC with computerdefaults.exe
  (UACMe 59)
references:
- https://github.com/hfiref0x/UACME
author: Christian Burkard (Nextron Systems)
date: 2021-08-31
modified: 2024-12-01
tags:
- attack.defense-evasion
- attack.privilege-escalation
- attack.t1548.002
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    IntegrityLevel:
    - 'High'
    - 'System'
    - 'S-1-16-16384'         # System
    - 'S-1-16-12288'         # High
    Image: 'C:\Windows\System32\ComputerDefaults.exe'
  filter:
    ParentImage|contains:
    - ':\Windows\System32'
    - ':\Program Files'
  condition: selection and not filter
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This detection rule identifies potential UAC (User Account Control) bypass attempts using the tool `computerdefaults.exe`, notably associated with a tool called UACMe. The rule targets instances where this executable runs with elevated privileges, specifically when it has a high integrity level or is run as the system. By examining process creation logs, the rule looks explicitly for `computerdefaults.exe` being executed from common Windows directories, while filtering out typical parent processes to reduce false positives. If the program is launched from directories typically linked to user permissions, it may indicate malicious intent to evade Windows security features and gain higher privileges.
  ### Investigation Steps
  - Review EDR logs to identify the execution path and integrity level of `computerdefaults.exe`, verifying if it aligns with suspicious behavior.
  - Check the process tree for any parent processes that are not typical or expected, as this might indicate an anomaly that warrants deeper investigation.
  - Utilize SIEM to correlate timestamps of the alert with other security events, which could highlight a broader context or additional indicators of compromise.
  - Analyze system and application logs from endpoints to gather contextual information about the user actions leading to the execution of `computerdefaults.exe`.
