title: Potential Defense Evasion Via Binary Rename
id: 36480ae1-a1cb-4eaa-a0d6-29801d7e9142
related:
- id: 0ba1da6d-b6ce-4366-828c-18826c9de23e
  type: similar
status: test
description: Detects the execution of a renamed binary often used by attackers or
  malware leveraging new Sysmon OriginalFileName datapoint.
references:
- https://mgreen27.github.io/posts/2019/05/12/BinaryRename.html
- https://mgreen27.github.io/posts/2019/05/29/BinaryRename2.html
- https://github.com/redcanaryco/atomic-red-team/blob/0f229c0e42bfe7ca736a14023836d65baa941ed2/atomics/T1036.003/T1036.003.md#atomic-test-1---masquerading-as-windows-lsass-process
author: Matthew Green @mgreen27, Ecco, James Pemberton @4A616D6573, oscd.community,
  Andreas Hunkeler (@Karneades)
date: 2019-06-15
modified: 2023-01-18
tags:
- attack.defense-evasion
- attack.t1036.003
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    OriginalFileName:
    - 'Cmd.Exe'
    - 'CONHOST.EXE'
    - '7z.exe'
    - 'WinRAR.exe'
    - 'wevtutil.exe'
    - 'net.exe'
    - 'net1.exe'
    - 'netsh.exe'
    - 'InstallUtil.exe'
  filter:
    Image|endswith:
    - '\cmd.exe'
    - '\conhost.exe'
    - '\7z.exe'
    - '\WinRAR.exe'
    - '\wevtutil.exe'
    - '\net.exe'
    - '\net1.exe'
    - '\netsh.exe'
    - '\InstallUtil.exe'
  condition: selection and not filter
falsepositives:
- Custom applications use renamed binaries adding slight change to binary name. Typically
  this is easy to spot and add to whitelist
level: medium
notes: |
  n
  ### Technical Context
  The "Potential Defense Evasion Via Binary Rename" Sigma rule is designed to identify instances where commonly used Windows binaries are executed with a different name than what is expected. This detection mechanism revolves around the `OriginalFileName` Sysmon datapoint, capturing the original name of the process being executed. By analyzing Windows Process Creation logs, the rule checks if processes that are typically associated with legitimate system operations (such as `cmd.exe`, `conhost.exe`, `7z.exe`, etc.) are run under these altered names. Such behavior is often exploited by attackers for defense evasion purposes (MITRE ATT&CK Tactic: Defense Evasion; Technique: T1036.003 
  - Masquerading). Investigating this alert may help uncover malicious activities or unauthorized changes made by actors looking to obscure their actions.
  ### Investigation Steps
  - **Check Process Creation Logs:** Examine the Windows event logs focused on process creation to confirm the alert and view details about the renamed binary’s execution.
  - **Validate Binary Integrity:** Use an endpoint detection and response (EDR) tool to analyze the file's attributes and ensure its legitimacy, comparing hash values against known good binaries.
  - **Monitor Network Activity:** Assess network connection logs from EDR and firewall to understand if there was any suspicious activity related to the process during its execution.
  - **Conduct Malware Scanning:** Execute antivirus checks on the affected system to identify any potential malware hiding under the renamed binary’s guise.
  ### Prioritization
  The severity of this alert is categorized as medium due to the potential for legitimate processes to be abused by malware. Any execution of a system binary with a renamed signature necessitates immediate investigation to ascertain the intent and legitimacy of the action.
  ### Blind Spots and Assumptions
  This rule may not fire in environments with legitimate applications that use renamed binaries, which can trigger false positives. Additionally, skilled adversaries might employ techniques to disguise their presence further, such as modifying their execution patterns to align closer to normal system behavior. Analysts should remain aware that not every alternate execution of a standard binary implies malicious intent and corroboration with additional telemetry is crucial.
  > **Disclaimer:** This investigation guide was created using generative AI technology and has not been reviewed for its accuracy and relevance. While every effort has been made to ensure its quality, we recommend validating the content and adapting it to suit specific environment and operational needs. Please communicate any changes to the detection engineering team.
