title: File Download From Browser Process Via Inline URL
id: 94771a71-ba41-4b6e-a757-b531372eaab6
status: test
description: Detects execution of a browser process with a URL argument pointing to
  a file with a potentially interesting extension. This can be abused to download
  arbitrary files or to hide from the user for example by launching the browser in
  a minimized state.
references:
- https://twitter.com/mrd0x/status/1478116126005641220
- https://lolbas-project.github.io/lolbas/Binaries/Msedge/
author: Florian Roth (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)
date: 2022-01-11
modified: 2023-11-09
tags:
- attack.command-and-control
- attack.t1105
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
    Image|endswith:
    - '\brave.exe'
    - '\chrome.exe'
    - '\msedge.exe'
    - '\opera.exe'
    - '\vivaldi.exe'
  selection_http:
    CommandLine|contains: 'http'
  selection_extensions:
    CommandLine|endswith:
    - '.7z'
    - '.dat'
    - '.dll'
    - '.exe'
    - '.hta'
    - '.ps1'
    - '.psm1'
    - '.txt'
    - '.vbe'
    - '.vbs'
    - '.zip'
  condition: all of selection_*
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  This detection rule monitors process creation activities for specific web browsers that include command-line parameters indicating the download of files with potentially malicious or sensitive extensions. It specifically looks for command-lines that contain a URL (`http`) and end with extensions like `.exe`, `.zip`, or `.vbs`, which are often associated with malware or unauthorized data exfiltration. The browsers targeted by this rule include popular ones such as Chrome, Brave, Edge, Opera, and Vivaldi. By analyzing these parameters, the rule can identify potentially nefarious activity where a browser is leveraged to download harmful files, either in the foreground or hidden (for example, by running minimized).
  The relevant data sources for this rule are primarily process creation logs, which capture details of newly launched processes and their command-line arguments. By correlating the presence of specific browser images with suspicious command-line configurations, responders can effectively detect potential malicious actions initiated through web browsers.
  ### Investigation Steps
  - Check the EDR logs for the identified browser processes to confirm the command-line arguments used during execution, looking specifically for suspicious file download patterns.
  - Analyze network traffic using NDR tools or firewall logs to determine if the URLs accessed during the browser's execution correlate with known malicious domains.
  - Utilize the AV logs to verify if the downloaded files were flagged or quarantined, which could indicate whether the downloaded item posed any immediate threats.
  - Review user activity logs, including VPN and proxy logs, to ascertain whether the file downloads align with normal user behavior or indicate potential misuse of the browser for unauthorized purposes.
