title: Sysprep on AppData Folder
id: d5b9ae7a-e6fc-405e-80ff-2ff9dcc64e7e
status: test
description: Detects suspicious sysprep process start with AppData folder as target
  (as used by Trojan Syndicasec in Thrip report by Symantec)
references:
- https://www.symantec.com/blogs/threat-intelligence/thrip-hits-satellite-telecoms-defense-targets
- https://app.any.run/tasks/61a296bb-81ad-4fee-955f-3b399f4aaf4b
author: Florian Roth (Nextron Systems)
date: 2018-06-22
modified: 2021-11-27
tags:
- attack.execution
- attack.t1059
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith: '\sysprep.exe'
    CommandLine|contains: '\AppData\'
  condition: selection
falsepositives:
- False positives depend on scripts and administrative tools used in the monitored
  environment
level: medium
notes: |
  ### Technical Context
  The "Sysprep on AppData Folder" detection rule identifies potentially malicious activity involving the Windows Sysprep tool, specifically when invoked with the AppData folder as its target. Sysprep is typically used for preparing Windows images for deployment, but attackers may exploit this tool to manipulate user data or hide malicious activities. This rule specifically looks for process creation events that indicate the execution of `sysprep.exe` with command-line parameters referencing the AppData directory, which is commonly utilized by users to store application settings and data. By monitoring these events, the rule aims to flag potentially harmful actions consistent with the tactics used by the Trojan Syndicasec, as noted in Symantec’s Thrip report.
  The detection relies primarily on process creation logs within a Windows environment. By leveraging the command-line data associated with the execution of sysprep, security teams can differentiate between legitimate administrative tasks and suspicious behavior that may require further investigation.
  ### Investigation Steps
  - Review recent process creation logs in the EDR platform to identify instances of `sysprep.exe` running with command-line parameters that reference the AppData directory.
  - Analyze user account activity within the logs to determine whether the execution of sysprep was initiated by an expected administrative account or a potentially compromised user.
  - Check for related files or modifications in the AppData folder during the time of the sysprep execution to uncover any unauthorized changes or suspicious files.
  - Correlate findings with threat intelligence sources, including the provided references, to assess if the observed activity aligns with known tactics associated with the Trojan Syndicasec malware.
