title: Potential RDP Session Hijacking Activity
id: 224f140f-3553-4cd1-af78-13d81bf9f7cc
status: test
description: Detects potential RDP Session Hijacking activity on Windows systems
references:
- https://twitter.com/Moti_B/status/909449115477659651
author: '@juju4'
date: 2022-12-27
modified: 2024-12-01
tags:
- attack.execution
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: '\tscon.exe'
  - OriginalFileName: 'tscon.exe'
  selection_integrity:
    IntegrityLevel:
    - 'System'
    - 'S-1-16-16384'
  condition: all of selection_*
falsepositives:
- Administrative activity
level: medium
notes: |
  ### Technical Context
  This detection rule is designed to identify potential RDP (Remote Desktop Protocol) session hijacking activities on Windows systems by monitoring process creation events. Specifically, the rule looks for the execution of `tscon.exe`, which is a command-line utility used to connect to existing terminal sessions. The detection focuses on instances where this executable is running with a high integrity level (System or S-1-16-16384), which is indicative of elevated privileges typically associated with malicious activity. By analyzing process creation logs, this rule aims to identify unexpected or unauthorized use of session connection tools that could signify an attacker attempting to hijack an active RDP session.
  ### Investigation Steps
  - Utilize EDR tools to monitor for unusual process behavior around `tscon.exe` execution, particularly when triggered by non-administrative user accounts.
  - Review the command-line arguments associated with the instance of `tscon.exe` to determine if legitimate sessions are being connected improperly.
  - Cross-reference the timestamps and user accounts in the RDP connection logs to identify any suspicious login activities or anomalies in user behavior.
  - Investigate related network traffic through the NGFW and Proxy logs to check for any unauthorized communications or unusual external connections that could correlate with the RDP session hijacking indicators.
