title: Potential Discovery Activity Via Dnscmd.EXE
id: b6457d63-d2a2-4e29-859d-4e7affc153d1
status: test
description: Detects an attempt to leverage dnscmd.exe to enumerate the DNS zones
  of a domain. DNS zones used to host the DNS records for a particular domain.
references:
- https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/dnscmd
- https://learn.microsoft.com/en-us/azure/dns/dns-zones-records
- https://lolbas-project.github.io/lolbas/Binaries/Dnscmd/
author: '@gott_cyber'
date: 2022-07-31
modified: 2023-02-04
tags:
- attack.discovery
- attack.execution
- attack.t1543.003
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
    Image|endswith: '\dnscmd.exe'
  selection_cli:
    CommandLine|contains:
    - '/enumrecords'
    - '/enumzones'
    - '/ZonePrint'
    - '/info'
  condition: all of selection_*
falsepositives:
- Legitimate administration use
level: medium
notes: |
  ### Technical Context
  This detection rule identifies potential misuse of the `dnscmd.exe` command-line tool, commonly associated with Active Directory DNS management, to enumerate DNS zones within a domain. The rule triggers an alert when specific command-line arguments are detected, such as `/enumrecords`, `/enumzones`, `/ZonePrint`, or `/info`, signifying an intent to access details regarding DNS records or zones. The primary data sources leveraged for this detection include process creation logs that capture executable invocations and their command-line parameters. Given its capabilities, `dnscmd.exe` may be legitimately used by network administrators for routine tasks, but it can also be exploited by attackers seeking to gather reconnaissance on a target environment.
  ### Investigation Steps
  - Review process creation logs in your EDR solution for instances of `dnscmd.exe` execution, specifically focusing on the command-line arguments recorded.
  - Correlate the timestamps of the alert with user activity logs to identify if a legitimate administrator account executed the command or if it was initiated by an unknown or unauthorized user.
  - Utilize DNS logs to examine any DNS queries or changes made prior to and following the execution of `dnscmd.exe` to assess if there was any malicious activity.
  - Check the system for any associated anomalies, including any unauthorized changes to DNS records or unusual network activity related to the domain in question.
