title: HackTool - GMER Rootkit Detector and Remover Execution
id: 9082ff1f-88ab-4678-a3cc-5bcff99fc74d
status: test
description: Detects the execution GMER tool based on image and hash fields.
references:
- http://www.gmer.net/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-10-05
modified: 2024-11-23
tags:
- attack.defense-evasion
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
    Image|endswith: '\gmer.exe'
  selection_sysmon_hash:
    Hashes|contains:
    - 'MD5=E9DC058440D321AA17D0600B3CA0AB04'
    - 'SHA1=539C228B6B332F5AA523E5CE358C16647D8BBE57'
    - 'SHA256=E8A3E804A96C716A3E9B69195DB6FFB0D33E2433AF871E4D4E1EAB3097237173'
  condition: 1 of selection_*
falsepositives:
- Unlikely
level: high
notes: |
  ### Technical Context
  The Sigma rule titled "HackTool 
  - GMER Rootkit Detector and Remover Execution" is designed to detect instances where the GMER tool, known for detecting and removing rootkits, is executed within a Windows environment. This detection leverages process creation logs, specifically focusing on the executable file name (`gmer.exe`) along with specific cryptographic hash values (MD5, SHA1, SHA256) associated with that executable. The rule will trigger alerts when the system detects the execution of this tool, which may indicate unauthorized usage, potentially linked to evasion of detection mechanisms by malicious actors.
  To implement this rule effectively, the primary data source utilized is process creation logs collected via Sysmon or Windows Event Logs. The rule does not typically result in false positives, but analysts should still be vigilant, as its detection may highlight legitimate activities, particularly in environments where GMER is being used for security purposes.
  ### Investigation Steps
  - Verify the alert by reviewing the original process creation logs in EDR to confirm the execution of `gmer.exe` and its associated hashes.
  - Check for any suspicious command-line arguments used during the execution of GMER which may indicate malicious intent.
  - Analyze historical activity of the host where GMER was executed to identify any unusual behavior or patterns leading up to the execution.
  - Review network traffic logs from the NDR solution to assess if any data exfiltration or command-and-control (C2) patterns were associated with the machine during this timeframe.
