title: HackTool - Bloodhound/Sharphound Execution
id: f376c8a7-a2d0-4ddc-aa0c-16c17236d962
status: test
description: Detects command line parameters used by Bloodhound and Sharphound hack
  tools
references:
- https://github.com/BloodHoundAD/BloodHound
- https://github.com/BloodHoundAD/SharpHound
author: Florian Roth (Nextron Systems)
date: 2019-12-20
modified: 2023-02-04
tags:
- attack.discovery
- attack.t1087.001
- attack.t1087.002
- attack.t1482
- attack.t1069.001
- attack.t1069.002
- attack.execution
- attack.t1059.001
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Product|contains: 'SharpHound'
  - Description|contains: 'SharpHound'
  - Company|contains:
    - 'SpecterOps'
    - 'evil corp'
  - Image|contains:
    - '\Bloodhound.exe'
    - '\SharpHound.exe'
  selection_cli_1:
    CommandLine|contains:
    - ' -CollectionMethod All '
    - ' --CollectionMethods Session '
    - ' --Loop --Loopduration '
    - ' --PortScanTimeout '
    - '.exe -c All -d '
    - 'Invoke-Bloodhound'
    - 'Get-BloodHoundData'
  selection_cli_2:
    CommandLine|contains|all:
    - ' -JsonFolder '
    - ' -ZipFileName '
  selection_cli_3:
    CommandLine|contains|all:
    - ' DCOnly '
    - ' --NoSaveCache '
  condition: 1 of selection_*
falsepositives:
- Other programs that use these command line option and accepts an 'All' parameter
level: high
notes: |
  n
  ### Technical Context
  This Sigma rule is designed to detect the execution of popular Active Directory enumeration tools, Bloodhound and Sharphound. It achieves this by monitoring process creation logs for specific command-line parameters and executable names associated with these tools. The rule focuses on detecting keywords in the command line of processes that include 'SharpHound.exe', 'Bloodhound.exe', and various parameters that signify a broad collection of data or specific enumeration tasks. Technical data sources involved in this detection include process creation logs from Windows, which capture the details about script executions, command line arguments, and the calling process details. The identified techniques relate to MITRE ATT&CK under tactics such as Discovery (T1087) and Execution (T1059) for Active Directory environments, where such tools are commonly used for reconnaissance by adversaries.
  ### Investigation Steps
  - **Check EDR Alerts:** Review endpoint detection and response notifications generated during the time of the alert to identify any associated malicious activities or unusual behaviors on the affected system.
  - **Validate Process Details:** Examine the Windows process creation logs for additional information regarding the execution context, such as the initiating user, parent process, and the time of execution.
  - **Analyze Network Connections:** Investigate any network logs associated with the subject machine during the alert time frame to look for suspicious outgoing connections, particularly to known malicious domains or IP addresses.
  - **Review User Activities:** Check the audit logs for user account activity that coincides with the execution of Bloodhound or Sharphound to identify whether legitimate user accounts or potential compromised accounts executed the tools.
  ### Prioritization
  This alert is categorized as high severity within an enterprise environment due to the capability of Bloodhound and Sharphound to extract sensitive information about Active Directory, which could facilitate further attacks, data exfiltration, or lateral movement.
  ### Blind spots and Assumptions
  One notable assumption of this rule is that the detection relies heavily on the inclusion of specific command-line parameters that may not be present if the tools are executed with alternative options or via obfuscation techniques. Additionally, there may be other benign applications that utilize similar command-line patterns, which could lead to false positives. Furthermore, if the tools are executed from uncommon paths or renamed, the rule may not fire. It is crucial for detection engineers to be aware of these variables and to enhance detection coverage accordingly to accommodate evasive strategies employed by threat actors.
  > **Disclaimer:** This investigation guide was created using generative AI technology and has not been reviewed for its accuracy and relevance. While every effort has been made to ensure its quality, we recommend validating the content and adapting it to suit specific environment and operational needs. Please communicate any changes to the detection engineering team.
