title: File Download with Headless Browser
id: 0e8cfe08-02c9-4815-a2f8-0d157b7ed33e
related:
- id: ef9dcfed-690c-4c5d-a9d1-482cd422225c
  type: derived
status: test
description: Detects execution of chromium based browser in headless mode using the
  "dump-dom" command line to download files
references:
- https://twitter.com/mrd0x/status/1478234484881436672?s=12
- https://www.trendmicro.com/en_us/research/23/e/managed-xdr-investigation-of-ducktail-in-trend-micro-vision-one.html
author: Sreeman, Florian Roth (Nextron Systems)
date: 2022-01-04
modified: 2023-05-12
tags:
- attack.command-and-control
- attack.t1105
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith:
    - '\brave.exe'
    - '\chrome.exe'
    - '\msedge.exe'
    - '\opera.exe'
    - '\vivaldi.exe'
    CommandLine|contains|all:
    - '--headless'
    - 'dump-dom'
    - 'http'
  condition: selection
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This Sigma rule identifies potentially malicious activity involving the execution of popular Chromium-based browsers in headless mode. Specifically, it detects instances where the "dump-dom" command-line argument is used in conjunction with file download requests via HTTP. This behavior is significant because headless browsers can automate web interactions, which attackers might leverage for nefarious purposes, such as data exfiltration or unauthorized information retrieval. The critical data sources for this rule include process creation logs, where the command-line arguments and the image names of executables like Chrome, Brave, and Edge are examined. By focusing on these parameters, the rule can effectively flag suspicious automated browsing activities that could indicate an attack.
  ### Investigation Steps
  - Review the process creation logs in your EDR solution to identify instances where the specified browsers were executed in headless mode with the "dump-dom" argument.
  - Check network traffic logs to determine if any unusual HTTP requests were made during the time of the detected headless browser activity, especially focusing on any file downloads.
  - Investigate related alerts and events within the SIEM to correlate with potential lateral movement or command-and-control communications initiated by the headless browser.
  - Analyze any impacted endpoints for further signs of compromise, such as unusual file creation or modifications that could indicate a successful data exfiltration attempt.
