title: Suspicious Process Execution From Fake Recycle.Bin Folder
id: 5ce0f04e-3efc-42af-839d-5b3a543b76c0
related:
- id: cd8b36ac-8e4a-4c2f-a402-a29b8fbd5bca
  type: derived
status: test
description: Detects process execution from a fake recycle bin folder, often used
  to avoid security solution.
references:
- https://www.mandiant.com/resources/blog/infected-usb-steal-secrets
- https://unit42.paloaltonetworks.com/cloaked-ursa-phishing/
author: X__Junior (Nextron Systems)
date: 2023-07-12
modified: 2023-12-11
tags:
- attack.persistence
- attack.defense-evasion
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|contains:
            # e.g. C:\$RECYCLER.BIN
    - 'RECYCLERS.BIN\'
    - 'RECYCLER.BIN\'
  condition: selection
falsepositives:
- Unlikely
level: high
notes: |
  ### Technical Context
  This detection rule identifies potentially malicious process executions that originate from a deceptive folder mimicking the Windows Recycle Bin, specifically paths containing "RECYCLERS.BIN" or "RECYCLER.BIN". Attackers often utilize these tactics to bypass security measures by disguising malware within these misleading paths, effectively evading detection. By monitoring process creation logs, the rule captures instances where executable files are launched from these suspicious directories, which raises the alert level due to the association with common persistence and defense evasion techniques in cyber threats.
  To implement this rule, data sources such as process creation logs from Windows operating systems are leveraged. The rule focuses on identifying abnormal behavior associated with executables that may indicate that a security incident is underway, prompting SOC analysts to investigate further.
  ### Investigation Steps
  - Analyze recent process creation logs in the EDR to identify any processes originating from the suspicious "RECYCLERS.BIN" paths indicated in the alert.
  - Check for any associated network activity using NDR tools to detect unusual outbound connections that may correlate with the execution of these suspicious processes.
  - Review Windows Event Logs for related activities, such as logon events or file access patterns that coincide with the execution times of the detected processes.
  - Conduct a scan of the affected endpoint with AV tools to identify and assess any potential malware that may have been executed from the fake Recycle Bin location.
