title: Process Execution From A Potentially Suspicious Folder
id: 3dfd06d2-eaf4-4532-9555-68aca59f57c4
status: test
description: Detects a potentially suspicious execution from an uncommon folder.
references:
- https://github.com/mbevilacqua/appcompatprocessor/blob/6c847937c5a836e2ce2fe2b915f213c345a3c389/AppCompatSearch.txt
- https://www.secureworks.com/research/bronze-butler-targets-japanese-businesses
- https://www.crowdstrike.com/resources/reports/2019-crowdstrike-global-threat-report/
- https://github.com/ThreatHuntingProject/ThreatHunting/blob/cb22598bb70651f88e0285abc8d835757d2cb596/hunts/suspicious_process_creation_via_windows_event_logs.md
author: Florian Roth (Nextron Systems), Tim Shelton
date: 2019-01-16
modified: 2024-07-12
tags:
- attack.defense-evasion
- attack.t1036
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|contains:
    - ':\Perflogs\'
    - ':\Users\All Users\'
    - ':\Users\Default\'
    - ':\Users\NetworkService\'
    - ':\Windows\addins\'
    - ':\Windows\debug\'
    - ':\Windows\Fonts\'
    - ':\Windows\Help\'
    - ':\Windows\IME\'
    - ':\Windows\Media\'
    - ':\Windows\repair\'
    - ':\Windows\security\'
    - ':\Windows\System32\Tasks\'
    - ':\Windows\Tasks\'
    - '$Recycle.bin'
    - '\config\systemprofile\'
    - '\Intel\Logs\'
    - '\RSA\MachineKeys\'
  filter_optional_ibm:
    Image|startswith: 'C:\Users\Public\IBM\ClientSolutions\Start_Programs\'
  filter_optional_citrix:
    Image|startswith: 'C:\Windows\SysWOW64\config\systemprofile\Citrix\UpdaterBinaries\'
    Image|endswith: '\CitrixReceiverUpdater.exe'
  condition: selection and not 1 of filter_optional_*
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This Sigma rule is designed to detect potentially suspicious process executions originating from uncommon system folders. The focus is primarily on identifying program executions from paths that are generally not typical for application launches, such as `C:\Windows\debug\`, `C:\Users\Default\`, and other unusual directories listed in the detection criteria. By monitoring process creation logs, the rule queries against the paths of executed images to flag any that do not fall within expected program directories. This detection approach helps identify potential misuse of system resources or malicious activities that may indicate lateral movement or exploitation attempts, as attackers often utilize uncommon directories to obfuscate their actions.
  ### Investigation Steps
  - Utilize EDR tools to analyze the details of the process execution, including its parent processes and the command-line arguments used at launch to establish context and identify anomalous behavior.
  - Check system and security event logs for any related activities that occurred during the same time frame to gain insights into user activities or other suspicious events.
  - Correlate findings with firewall logs to verify whether the process initiated any outbound connections to known malicious IP addresses or domains.
  - Review relevant user activity and access logs to determine if there were unauthorized accesses or account anomalies associated with the user accounts linked to the detected process.
