title: Potentially Suspicious Child Process Of DiskShadow.EXE
id: 9f546b25-5f12-4c8d-8532-5893dcb1e4b8
related:
- id: fa1a7e52-3d02-435b-81b8-00da14dd66c1     # Diskshadow Script Mode - Execution From Potential Suspicious Location
  type: similar
- id: 1dde5376-a648-492e-9e54-4241dd9b0c7f     # Diskshadow Script Mode - Uncommon Script Extension Execution
  type: similar
- id: 56b1dde8-b274-435f-a73a-fb75eb81262a     # Diskshadow Child Process Spawned
  type: similar
- id: 0c2f8629-7129-4a8a-9897-7e0768f13ff2     # Diskshadow Script Mode Execution
  type: similar
status: test
description: Detects potentially suspicious child processes of "Diskshadow.exe". This
  could be an attempt to bypass parent/child relationship detection or application
  whitelisting rules.
references:
- https://bohops.com/2018/03/26/diskshadow-the-return-of-vss-evasion-persistence-and-active-directory-database-extraction/
- https://www.ired.team/offensive-security/credential-access-and-credential-dumping/ntds.dit-enumeration
- https://medium.com/@cyberjyot/lolbin-execution-via-diskshadow-f6ff681a27a4
- https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/diskshadow
- https://www.lifars.com/wp-content/uploads/2022/01/GriefRansomware_Whitepaper-2.pdf
- https://www.zscaler.com/blogs/security-research/technical-analysis-crytox-ransomware
- https://research.checkpoint.com/2022/evilplayout-attack-against-irans-state-broadcaster/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023-09-15
tags:
- attack.defense-evasion
- attack.t1218
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    ParentImage|endswith: '\diskshadow.exe'
    Image|endswith:
            # Note: add or remove additional binaries according to your org needs
    - '\certutil.exe'
    - '\cscript.exe'
    - '\mshta.exe'
    - '\powershell.exe'
    - '\pwsh.exe'
    - '\regsvr32.exe'
    - '\rundll32.exe'
    - '\wscript.exe'
  condition: selection
falsepositives:
- False postitve can occur in cases where admin scripts levreage the "exec" flag to
  execute applications
level: medium
notes: |
  ### Technical Context
  This detection rule identifies potentially suspicious child processes spawned from `diskshadow.exe`, which is a legitimate Windows utility used for managing Volume Shadow Copies. Attackers may exploit this process to evade detection mechanisms, especially if they suspect monitoring of parent/child processes in an environment. The rule leverages process creation logs specifically looking for instances where `diskshadow.exe` is the parent process and checks if the child process is among a defined set of binaries that include command-line interpreters, scripts, and other tools often used by attackers. This rule is associated with the MITRE ATT&CK tactic of Defense Evasion (T1218), as it aims to bypass existing security controls and application whitelisting.
  The rule captures events to allow analysts to identify unusual activity around `diskshadow.exe`, which could signal attempts to compromise sensitive configurations or perform unauthorized actions within the enterprise environment. The identification of these child processes acts as an early warning for potential malicious behavior, allowing for timely investigation and remediation.
  ### Investigation Steps
  - **Check Process Logs:** Review the process creation logs (Windows Event ID 4688) for any processes under the `diskshadow.exe` parent, particularly focusing on the command line parameters used during execution.
  - **Analyze Command-Line Arguments:** Utilize EDR tools to further investigate the command-line arguments of the identified child processes to determine if they convey any suspicious intentions or potential evasion techniques.
  - **Review Related Events:** Cross-reference any related alerts or logs from the SIEM regarding the specific binaries detected, and observe if there are follow-up actions or processes associated with the same timestamp.
  - **Consult Threat Intelligence:** Examine known threat intelligence databases for information related to the identified child processes and see if they have any previous associations with malicious activities or persistence mechanisms.
  ### Prioritization
  The alert generated by this rule carries a medium severity level as the detection of potentially suspicious child processes indicates an elevated risk of evasion techniques, which could lead to serious security breaches if not addressed promptly.
  ### Blind Spots and Assumptions
  This rule may not fire in instances where an attacker uses less common or custom executables instead of the delineated binaries listed in the rule. Moreover, there may be legitimate administrative activities that could trigger false positives, particularly legitimate scripts executed by system administrators. If an organization uses various scripting languages or has customized scripts, they may not be monitored under the current rule, leading to possible blind spots.
  > **Disclaimer:** This investigation guide was created using generative AI technology and has not been reviewed for its accuracy and relevance. While every effort has been made to ensure its quality, we recommend validating the content and adapting it to suit specific environment and operational needs. Please communicate any changes to the detection engineering team.
