title: LOL-Binary Copied From System Directory
id: f5d19838-41b5-476c-98d8-ba8af4929ee2
related:
- id: fff9d2b7-e11c-4a69-93d3-40ef66189767
  type: derived
status: test
description: |
  Detects a suspicious copy operation that tries to copy a known LOLBIN from system (System32, SysWOW64, WinSxS) directories to another on disk in order to bypass detections based on locations.
references:
- https://www.hybrid-analysis.com/sample/8da5b75b6380a41eee3a399c43dfe0d99eeefaa1fd21027a07b1ecaa4cd96fdd?environmentId=120
- https://web.archive.org/web/20180331144337/https://www.fireeye.com/blog/threat-research/2018/03/sanny-malware-delivery-method-updated-in-recently-observed-attacks.html
- https://thedfirreport.com/2023/08/28/html-smuggling-leads-to-domain-wide-ransomware/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023-08-29
tags:
- attack.defense-evasion
- attack.t1036.003
logsource:
  category: process_creation
  product: windows
detection:
  selection_tools_cmd:
    Image|endswith: '\cmd.exe'
    CommandLine|contains: 'copy '
  selection_tools_pwsh:
    Image|endswith:
    - '\powershell.exe'
    - '\pwsh.exe'
    CommandLine|contains:
    - 'copy-item'
    - ' copy '
    - 'cpi '
    - ' cp '
  selection_tools_other:
  - Image|endswith:
    - '\robocopy.exe'
    - '\xcopy.exe'
  - OriginalFileName:
    - 'robocopy.exe'
    - 'XCOPY.EXE'
  selection_target_path:
    CommandLine|contains:
    - '\System32'
    - '\SysWOW64'
    - '\WinSxS'
  selection_target_lolbin:
    CommandLine|contains:
            # Note: add more binaries to increase coverage
    - '\bitsadmin.exe'
    - '\calc.exe'
    - '\certutil.exe'
    - '\cmdl32.exe'
    - '\cscript.exe'
    - '\mshta.exe'
    - '\rundll32.exe'
    - '\wscript.exe'
  condition: 1 of selection_tools_* and all of selection_target_*
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This Sigma rule is designed to detect suspicious file copy operations that involve well-known Living Off the Land Binaries (LOLBINs) being copied from protected system directories—namely, System32, SysWOW64, and WinSxS—to other locations on disk. Such behavior often indicates an attempt to evade detection tools that may monitor these binaries' execution from their standard directories. The rule utilizes process creation logs to identify the execution of common command-line tools (such as `cmd.exe`, `PowerShell`, and `robocopy.exe`) that are used to initiate copy commands with indication flags signaling a potential nefarious purpose. Alarmingly, the command line is scrutinized for specific copy operations targeting system LOLBINs, thereby alerting security personnel that an actual or attempted evasion tactic may be in progress.
  ### Investigation Steps
  - Investigate process creation logs in your EDR solution for any instances of `cmd.exe`, `powershell.exe`, or similar tools utilized to copy files from protected locations.
  - Use the SIEM to examine detailed logs around the time of the alert to determine if there were any prior suspicious activities or patterns indicating potential malicious intent.
  - Review the execution context of the detected commands, including user credentials and the originating machine, to assess if there’s unauthorized access or risky behavior associated with the copying operation.
  - Check cloud logs (if applicable) to see if there were any related activities, such as unauthorized access or changes to cloud-stored binaries linked with the LOLBINs detected.
