title: Potential Unquoted Service Path Reconnaissance Via Wmic.EXE
id: 68bcd73b-37ef-49cb-95fc-edc809730be6
related:
- id: 09658312-bc27-4a3b-91c5-e49ab9046d1b     # PowerShell Variant
  type: similar
- id: 76f55eaa-d27f-4213-9d45-7b0e4b60bbae
  type: similar
status: test
description: Detects known WMI recon method to look for unquoted service paths using
  wmic. Often used by pentester and attacker enumeration scripts
references:
- https://github.com/nccgroup/redsnarf/blob/35949b30106ae543dc6f2bc3f1be10c6d9a8d40e/redsnarf.py
- https://github.com/S3cur3Th1sSh1t/Creds/blob/eac23d67f7f90c7fc8e3130587d86158c22aa398/PowershellScripts/jaws-enum.ps1
- https://www.absolomb.com/2018-01-26-Windows-Privilege-Escalation-Guide/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-06-20
modified: 2023-09-11
tags:
- attack.execution
- attack.t1047
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - OriginalFileName: 'wmic.exe'
  - Image|endswith: '\WMIC.exe'
  selection_cli:
    CommandLine|contains|all:
    - ' service get '
    - 'name,displayname,pathname,startmode'
  condition: all of selection*
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  This detection rule identifies potential reconnaissance activities using the Windows Management Instrumentation Command-line (WMIC) tool, specifically targeting unquoted service paths. Attackers often utilize WMIC to enumerate services on Windows systems, helping them uncover misconfigurations that could lead to privilege escalation. The rule focuses on identifying instances where WMIC is executed with command-line parameters that include queries for service information—specifically those containing the keywords 'service get', 'name', 'displayname', 'pathname', and 'startmode'. The primary data source leveraged in this rule is process creation logs, which capture detailed information about the processes initiated within the operating system, including the executable name and the full command line used.
  ### Investigation Steps
  - Review EDR logs to determine if `wmic.exe` was executed, including the associated command-line arguments, to verify if the specified service enumeration command was used.
  - Check the process tree in the EDR to find the parent process of `wmic.exe`, identifying any potentially malicious activity that may have spawned the reconnaissance command.
  - Analyze Windows Event Logs for Service Control Manager events to correlate any service-related changes that occurred around the same time as the `wmic.exe` execution.
  - Investigate network activity logs from the NGFW or Proxy for any suspicious outbound connections initiated during the time frame of the detected activity, as these may indicate data exfiltration or further attack planning.
