title: Filter Driver Unloaded Via Fltmc.EXE
id: 4931188c-178e-4ee7-a348-39e8a7a56821
related:
- id: 4d7cda18-1b12-4e52-b45c-d28653210df8     # Sysmon specific
  type: derived
status: test
description: Detect filter driver unloading activity via fltmc.exe
references:
- https://www.darkoperator.com/blog/2018/10/5/operating-offensively-against-sysmon
- https://www.cybereason.com/blog/threat-analysis-report-lockbit-2.0-all-paths-lead-to-ransom
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023-02-13
modified: 2024-06-24
tags:
- attack.defense-evasion
- attack.t1070
- attack.t1562
- attack.t1562.002
logsource:
  product: windows
  category: process_creation
detection:
  selection_img:
  - Image|endswith: '\fltMC.exe'
  - OriginalFileName: 'fltMC.exe'
  selection_cli:
    CommandLine|contains: 'unload'
  filter_optional_avira:
    ParentImage|startswith: 'C:\Users\'
    ParentImage|contains: '\AppData\Local\Temp\'
    ParentImage|endswith: '\endpoint-protection-installer-x64.tmp'
    CommandLine|endswith: 'unload rtp_filesystem_filter'
  filter_optional_manageengine:
    ParentImage: 'C:\Program Files (x86)\ManageEngine\uems_agent\bin\dcfaservice64.exe'
    CommandLine|endswith: 'unload DFMFilter'
  condition: all of selection_* and not 1 of filter_optional_*
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  This Sigma rule is designed to detect instances where the Windows filter management tool, `fltmc.exe`, is used to unload filter drivers. The rule specifically looks for process creation events and examines details such as the command line used and the parent process of `fltmc.exe`. A typical malicious use case might involve the unloading of a filter driver for evasion purposes, allowing threat actors to bypass security controls. The detection focuses on processes that invoke `fltmc.exe` with the command line argument `unload`, while also checking the parent process's file path for specific patterns that may indicate the operation was initiated from temporary or less scrutinized locations, such as user directories or common application paths. Logs from process creation and command-line activities are the primary data sources.
  ### Investigation Steps
  - Review EDR logs to identify the process creation events associated with `fltmc.exe`, focusing on the parameters used in the command line.
  - Analyze the parent process of the `fltmc.exe` execution to understand its source and determine if it aligns with known systems or applications.
  - Cross-reference the investigation with any recent alerts from AV or NDR tools that might indicate associated malicious activity alongside the unloading of filter drivers.
  - Check cloud logs (if applicable) for any related activities that may suggest a collaborative attack vector, such as modifications in cloud-hosted environments or unusual network traffic patterns leading to the affected endpoint.
