title: Dism Remove Online Package
id: 43e32da2-fdd0-4156-90de-50dfd62636f9
status: test
description: Deployment Image Servicing and Management tool. DISM is used to enumerate,
  install, uninstall, configure, and update features and packages in Windows images
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.001/T1562.001.md#atomic-test-26---disable-windows-defender-with-dism
- https://www.trendmicro.com/en_us/research/22/h/ransomware-actor-abuses-genshin-impact-anti-cheat-driver-to-kill-antivirus.html
author: frack113
date: 2022-01-16
modified: 2022-08-26
tags:
- attack.defense-evasion
- attack.t1562.001
logsource:
  category: process_creation
  product: windows
detection:
  selection_dismhost:
    Image|endswith: '\DismHost.exe'
    ParentCommandLine|contains|all:
    - '/Online'
    - '/Disable-Feature'
            # - '/FeatureName:'
            # - '/Remove'
            # /NoRestart
            # /quiet
  selection_dism:
    Image|endswith: '\Dism.exe'
    CommandLine|contains|all:
    - '/Online'
    - '/Disable-Feature'
            # - '/FeatureName:'
            # - '/Remove'
            # /NoRestart
            # /quiet
  condition: 1 of selection_*
falsepositives:
- Legitimate script
level: medium
notes: |
  ### Technical Context
  This detection rule is designed to identify the use of the Deployment Image Servicing and Management (DISM) tool, specifically targeting its commands for disabling features in Windows environments. The rule looks for instances in which the DISM executables (`DismHost.exe` or `Dism.exe`) are invoked with command-line arguments indicating the removal of system features, which can be a tactic used to disable security features or compromise the integrity of a Windows system. The primary data sources involved in this detection are process creation logs that capture command-line parameters and parent-child process relationships, allowing for the identification of potentially malicious or unauthorized actions taken by users or processes.
  ### Investigation Steps
  - Investigate the source of the process creation logs for any instances of `DismHost.exe` or `Dism.exe` with the specified command-line arguments, focusing on which user executed the command.
  - Review EDR telemetry to determine if there were any preceding or subsequent suspicious activities related to the processes involved, including any unauthorized changes to system features.
  - Check for related events in the AV or endpoint protection tool to ensure that no alerts were triggered that might indicate malicious behavior linked to this action.
  - Analyze network traffic logs (NGFW or Proxy) to identify any communication attempts that may correlate with the execution of the DISM tool, which could indicate external command and control influence.
