title: Taskmgr as LOCAL_SYSTEM
id: 9fff585c-c33e-4a86-b3cd-39312079a65f
status: test
description: Detects the creation of taskmgr.exe process in context of LOCAL_SYSTEM
references:
- Internal Research
author: Florian Roth (Nextron Systems)
date: 2018-03-18
modified: 2022-05-27
tags:
- attack.defense-evasion
- attack.t1036
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    User|contains:     # covers many language settings
    - 'AUTHORI'
    - 'AUTORI'
    Image|endswith: '\taskmgr.exe'
  condition: selection
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This Sigma rule is designed to detect instances where the process `taskmgr.exe` (the Windows Task Manager) is initiated by the `LOCAL_SYSTEM` account. This is a critical detection because legitimate usage of Task Manager typically occurs under user accounts, and its execution by the LOCAL_SYSTEM account can indicate malicious activity, such as a payload trying to mask its behavior or facilitate lateral movement on the network. The rule leverages process creation logs, specifically monitoring the `User` field to identify accounts and the `Image` field to verify the executed process. Due to the potential for abuse, alerts generated by this rule warrant thorough investigation.
  ### Investigation Steps
  - Review the process creation logs via your EDR to determine the parent process that initiated `taskmgr.exe`. Investigate any associated command-line parameters that may offer additional insights.
  - Check for unusual or unauthorized users on the affected system by analyzing user activity logs, focusing on both the LOCAL_SYSTEM and any external accounts that may have recently gained access.
  - Utilize endpoint detection tools to collect forensic data from the endpoint where the alert was triggered, looking for any signs of compromise or related malicious programs.
  - Examine network traffic logs through NDR solutions for any suspicious outbound connections or command-and-control activities that coincide with the timing of the `taskmgr.exe` execution.
