title: Suspicious WmiPrvSE Child Process
id: 8a582fe2-0882-4b89-a82a-da6b2dc32937
related:
- id: 692f0bec-83ba-4d04-af7e-e884a96059b6
  type: similar
- id: d21374ff-f574-44a7-9998-4a8c8bf33d7d
  type: similar
- id: 18cf6cf0-39b0-4c22-9593-e244bdc9a2d4
  type: obsolete
status: test
description: Detects suspicious and uncommon child processes of WmiPrvSE
references:
- https://thedfirreport.com/2021/03/29/sodinokibi-aka-revil-ransomware/
- https://github.com/vadim-hunter/Detection-Ideas-Rules/blob/02bcbfc2bfb8b4da601bb30de0344ae453aa1afe/Threat%20Intelligence/The%20DFIR%20Report/20210329_Sodinokibi_(aka_REvil)_Ransomware.yaml
- https://blog.osarmor.com/319/onenote-attachment-delivers-asyncrat-malware/
- https://twitter.com/ForensicITGuy/status/1334734244120309760
author: Vadim Khrykov (ThreatIntel), Cyb3rEng, Florian Roth (Nextron Systems)
date: 2021-08-23
modified: 2023-11-10
tags:
- attack.execution
- attack.defense-evasion
- attack.t1047
- attack.t1204.002
- attack.t1218.010
logsource:
  product: windows
  category: process_creation
detection:
  selection_parent:
    ParentImage|endswith: '\wbem\WmiPrvSE.exe'
  selection_children_1:
        # TODO: Add more LOLBINs or suspicious processes that make sens in your environment
    Image|endswith:
    - '\certutil.exe'
    - '\cscript.exe'
    - '\mshta.exe'
    - '\msiexec.exe'
    - '\regsvr32.exe'
    - '\rundll32.exe'
    - '\verclsid.exe'
    - '\wscript.exe'
  selection_children_2:
        # This is in a separate selection due to the nature of FP generated with CMD
    Image|endswith: '\cmd.exe'
    CommandLine|contains:
    - 'cscript'
    - 'mshta'
    - 'powershell'
    - 'pwsh'
    - 'regsvr32'
    - 'rundll32'
    - 'wscript'
  filter_main_werfault:
    Image|endswith: '\WerFault.exe'
  filter_main_wmiprvse:
    Image|endswith: '\WmiPrvSE.exe'     # In some legitimate case WmiPrvSE was seen spawning itself
  filter_main_msiexec:
    Image|endswith: '\msiexec.exe'
    CommandLine|contains: '/i '
  condition: selection_parent and 1 of selection_children_* and not 1 of filter_main_*
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  The "Suspicious WmiPrvSE Child Process" detection rule specifically monitors for unusual child processes spawned by the Windows Management Instrumentation Provider Service (WmiPrvSE.exe), which can be leveraged by attackers to execute malicious activities. This rule is particularly relevant to detecting tactics under the MITRE ATT&CK framework, particularly focusing on techniques that include Execution (T1047 
  - Windows Management Instrumentation) and Defense Evasion (T1218.010 
  - Signed Binary Proxy Execution). The rule works by analyzing process creation logs for paths associated with WmiPrvSE.exe and cross-referencing them with known malicious executables or scripts, including common living-off-the-land binaries (LOLBINs) like `powershell.exe`, `mshta.exe`, and others, which adversaries may use to carry out their objectives stealthily.
  The detection relies heavily on Windows Sysmon telemetry, particularly the `process_creation` logs, which provide insights into parent-child relationships between processes. By examining these relationships and identifying processes spawned from WmiPrvSE.exe, the rule aims to flag potentially malicious activities that could signify a compromise. Given that WmiPrvSE is a legitimate system component, close examination of its child processes is critical to discerning benign behavior from potential threats.
  ### Investigation Steps
  - **Check EDR Alerts**: Review the EDR console for additional alerts associated with the parent process `WmiPrvSE.exe` and related child processes, noting event timestamps and user accounts involved.
    
  - **Analyze Process Tree**: Use Sysinternals tools, such as Process Explorer, to investigate the process tree for `WmiPrvSE.exe`, identifying all parent and child relationships and any suspicious executions.
  - **Query Command-line Arguments**: Utilize Windows Security or Sysmon logs to capture command-line arguments associated with flagged processes, looking for unusual or suspicious patterns that could indicate malicious intent.
  - **Review Network Activity**: Investigate the network logs (NDR) associated with the suspicious child processes to see if they attempted any outbound connections that could indicate command and control (C2) activity.
  ### Prioritization
  This alert should be treated with high severity due to the potential for malicious exploitation of WmiPrvSE.exe to execute further attacks, including malware deployment, lateral movement, and data exfiltration. Since this process is often used as a method for evading detection, any alerts warrant immediate attention.
  ### Blind spots and Assumptions
  This rule may not fire if legitimate processes interact with `WmiPrvSE.exe` in a way that mimics malicious behavior, potentially leading to false positives. The detection assumes that the environment manages known binary paths effectively; however, if attackers use custom or less-known LOLBINs, the rule may fail to catch those instances. Additionally, limitations in process creation logging or disabled Sysmon logging could lead to gaps in detection efficacy, allowing adversarial actions to go unnoticed.
  > **Disclaimer:** This investigation guide was created using generative AI technology and has not been reviewed for its accuracy and relevance. While every effort has been made to ensure its quality, we recommend validating the content and adapting it to suit specific environment and operational needs. Please communicate any changes to the detection engineering team.
