title: PUA - Wsudo Suspicious Execution
id: bdeeabc9-ff2a-4a51-be59-bb253aac7891
status: test
description: Detects usage of wsudo (Windows Sudo Utility). Which is a tool that let
  the user execute programs with different permissions (System, Trusted Installer,
  Administrator...etc)
references:
- https://github.com/M2Team/Privexec/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-12-02
modified: 2023-02-14
tags:
- attack.execution
- attack.privilege-escalation
- attack.t1059
logsource:
  category: process_creation
  product: windows
detection:
  selection_metadata:
  - Image|endswith: '\wsudo.exe'
  - OriginalFileName: 'wsudo.exe'
  - Description: 'Windows sudo utility'
  - ParentImage|endswith: '\wsudo-bridge.exe'
  selection_cli:
    CommandLine|contains:
    - '-u System'
    - '-uSystem'
    - '-u TrustedInstaller'
    - '-uTrustedInstaller'
    - ' --ti '
  condition: 1 of selection_*
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  The "PUA 
  - Wsudo Suspicious Execution" detection rule is designed to identify the usage of **wsudo.exe** (Windows Sudo Utility), which allows users to run programs with elevated permissions such as Administrator or System. This tool can be abused for privilege escalation, making it a serious concern for security teams. The rule targets specific characteristics in the process creation logs, looking for the wsudo executable being invoked directly with parameters that request higher privileges, including those targeting 'System' and 'Trusted Installer'. Key indicators monitored include the image name, original file name, and parent image, as well as particular command-line arguments that suggest the tool is being used for potentially malicious intent.
  To effectively respond to alerts generated by this detection rule, analysts will need to reference various technical data sources, primarily process creation logs from endpoints, but also consider related logs from other security tools to ascertain the context and potential impact of the observed activity.
  ### Investigation Steps
  - Review process creation logs in the EDR to identify instances of `wsudo.exe` execution and gather context on its invocation, including the command-line arguments used.
  - Check the parent process of `wsudo.exe` in the EDR to determine which application initiated it, assessing whether it is a known legitimate process or potentially malicious.
  - Use the AV logs to scan the endpoint for any recent alerts or incidents that correlate with the WSudo execution, looking for known threats or suspicious behaviors.
  - Investigate any associated network activity via the NDR or Proxy logs to establish if there were any outgoing connections or data transfers initiated during the time of wsudo execution.
