title: Self Extracting Package Creation Via Iexpress.EXE From Potentially Suspicious
  Location
id: b2b048b0-7857-4380-b0fb-d3f0ab820b71
status: experimental
description: |
  Detects the use of iexpress.exe to create binaries via Self Extraction Directive (SED) files located in potentially suspicious locations.
  This behavior has been observed in-the-wild by different threat actors.
references:
- https://strontic.github.io/xcyclopedia/library/iexpress.exe-D594B2A33EFAFD0EABF09E3FDC05FCEA.html
- https://en.wikipedia.org/wiki/IExpress
- https://decoded.avast.io/janvojtesek/raspberry-robins-roshtyak-a-little-lesson-in-trickery/
- https://www.virustotal.com/gui/file/602f4ae507fa8de57ada079adff25a6c2a899bd25cd092d0af7e62cdb619c93c/behavior
author: Joseliyo Sanchez, @Joseliyo_Jstnk, Nasreddine Bencherchali (Nextron Systems)
date: 2024-02-05
modified: 2024-06-04
tags:
- attack.defense-evasion
- attack.t1218
logsource:
  category: process_creation
  product: windows
detection:
    # VT Query: behavior_processes:"iexpress.exe" and behavior_processes:"/n /q /m" and behavior_processes:"*.sed*" and p:5+
  selection_img:
  - Image|endswith: '\iexpress.exe'
  - OriginalFileName: 'IEXPRESS.exe'
  selection_cli:
    CommandLine|contains|windash: ' /n '
  selection_paths:
    CommandLine|contains:
            # Note: Add more uncommon paths that fit your organizational needs.
    - ':\ProgramData\'
    - ':\Temp\'
    - ':\Windows\System32\Tasks\'
    - ':\Windows\Tasks\'
    - ':\Windows\Temp\'
    - '\AppData\Local\Temp\'
  condition: all of selection_*
falsepositives:
- Administrators building packages using iexpress.exe
level: high
notes: |
  ### Technical Context
  This detection rule aims to identify the suspicious usage of `iexpress.exe`, a Windows utility used to create self-extracting installation packages. Specifically, it monitors for the execution of `iexpress.exe` with command-line arguments that suggest it is using a Self Extraction Directive (SED) file, particularly from locations such as `C:\ProgramData\`, `C:\Temp\`, and various task-related folders. Threat actors often abuse this legitimate tool to package and deliver malware, making its detection critical in incident response efforts. The rule analyzes process creation logs from Windows to capture instances of `iexpress.exe` being executed with specific command-line parameters, which are indicative of potentially malicious activity.
  ### Investigation Steps
  - Query the EDR for recent process creation events involving `iexpress.exe` to confirm any unauthorized executions.
  - Investigate the command-line arguments associated with these events, specifically looking for instances containing `/n`, which indicates a non-interactive mode typically used for automated installations.
  - Check the file paths associated with the executions against known safe directories to identify any suspicious locations, particularly those mentioned in the detection rule.
  - Review correlated logs from other security tools (e.g., AV and NGFW) to identify any additional malicious indicators associated with the execution of `iexpress.exe`.
