title: Suspicious Workstation Locking via Rundll32
id: 3b5b0213-0460-4e3f-8937-3abf98ff7dcc
status: test
description: Detects a suspicious call to the user32.dll function that locks the user
  workstation
references:
- https://app.any.run/tasks/2aef9c63-f944-4763-b3ef-81eee209d128/
author: frack113
date: 2022-06-04
modified: 2023-02-09
tags:
- attack.defense-evasion
logsource:
  category: process_creation
  product: windows
detection:
  selection_call_img:
  - Image|endswith: '\rundll32.exe'
  - OriginalFileName: 'RUNDLL32.EXE'
  selection_call_parent:
    ParentImage|endswith: '\cmd.exe'
  selection_call_cli:
    CommandLine|contains: 'user32.dll,'
  selection_function:
    CommandLine|contains: 'LockWorkStation'
  condition: all of selection_*
fields:
- Image
- ParentImage
falsepositives:
- Scripts or links on the user desktop used to lock the workstation instead of Windows+L
  or the menu option
level: medium
notes: |
  ### Technical Context
  This Sigma rule is designed to detect potentially malicious activity related to workstation locking through an unusual invocation of the `rundll32.exe` process. Specifically, it monitors for instances where `rundll32.exe` is executed with the `user32.dll` library and the command to lock the workstation (`LockWorkStation`) is specified. The detection is focused on scenarios where the parent process is `cmd.exe`, indicating that a command-line interface was used to execute the function. The combination of these elements is crucial as it often deviates from standard user behavior and may suggest an attempt by an attacker to evade detection while locking a workstation to gain unauthorized access or facilitate further malicious actions.
  This rule leverages process creation logs to identify suspicious command-line arguments and parent-child process relationships. It aims to ensure that incident responders can quickly identify and assess potentially harmful actions that, if unchecked, could lead to further compromise or data loss.
  ### Investigation Steps
  - Review the specifics of the alert in the EDR tool to verify the execution of the `rundll32.exe` process, focusing on its parent process to confirm it originated from a command-line interface.
  - Check the command-line parameters used during the execution of `rundll32.exe` to ensure that the `LockWorkStation` command is present, highlighting the potential for abnormal activity.
  - Investigate user activity logs from the Proxy or VPN to correlate the timing of the `rundll32.exe` execution with any suspicious user or network behavior that may indicate a breach.
  - Inspect Windows Event Logs for any other anomalous activity surrounding the alert, such as failed login attempts or usage patterns that deviate from normal behavior for the affected user.
