title: RunDLL32 Spawning Explorer
id: caa06de8-fdef-4c91-826a-7f9e163eef4b
status: test
description: Detects RunDLL32.exe spawning explorer.exe as child, which is very uncommon,
  often observes Gamarue spawning the explorer.exe process in an unusual way
references:
- https://redcanary.com/blog/intelligence-insights-november-2021/
author: elhoim, CD_ROM_
date: 2022-04-27
modified: 2022-05-25
tags:
- attack.defense-evasion
- attack.t1218.011
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    ParentImage|endswith: '\rundll32.exe'
    Image|endswith: '\explorer.exe'
  filter:
    ParentCommandLine|contains: '\shell32.dll,Control_RunDLL'
  condition: selection and not filter
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This detection rule identifies instances where the `RunDLL32.exe` process spawns `explorer.exe` as a child process. This behavior is atypical and typically indicates malicious activity, such as cases involving the Gamarue malware family, which often uses this method to evade detection. The rule inspects Windows process creation logs, focusing on events where the parent image ends with `rundll32.exe` and the child image is `explorer.exe`. It further filters these instances to exclude legitimate use cases by checking if the parent command line contains specific parameters related to legitimate system operations, thereby honing in on abnormal behaviors indicative of potential threats.
  ### Investigation Steps
  - Review the process creation logs in your EDR solution to identify the context of the `RunDLL32.exe` spawning `explorer.exe`, noting the timestamps and any related process activity.
  - Investigate the command line arguments of the parent `RunDLL32.exe` process to determine if they match the suspicious pattern associated with Gamarue or other known exploits.
  - Analyze network activity logs from the NDR tool to check for any unusual outbound connections initiated by `explorer.exe` that may indicate data exfiltration or further compromise.
  - Correlate findings with antivirus solutions to check if any alerts were raised for the detected `RunDLL32.exe` process or associated activities, and assess whether any remediative actions were taken.
