title: Sdiagnhost Calling Suspicious Child Process
id: f3d39c45-de1a-4486-a687-ab126124f744
status: test
description: Detects sdiagnhost.exe calling a suspicious child process (e.g. used
  in exploits for Follina / CVE-2022-30190)
references:
- https://twitter.com/nao_sec/status/1530196847679401984
- https://doublepulsar.com/follina-a-microsoft-office-code-execution-vulnerability-1a47fce5629e
- https://app.any.run/tasks/713f05d2-fe78-4b9d-a744-f7c133e3fafb/
- https://app.any.run/tasks/f420d295-0457-4e9b-9b9e-6732be227583/
- https://app.any.run/tasks/c4117d9a-f463-461a-b90f-4cd258746798/
author: Nextron Systems, @Kostastsale
date: 2022-06-01
modified: 2024-08-23
tags:
- attack.defense-evasion
- attack.t1036
- attack.t1218
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    ParentImage|endswith: '\sdiagnhost.exe'
    Image|endswith:
            # Add more suspicious LOLBins
    - '\powershell.exe'
    - '\pwsh.exe'
    - '\cmd.exe'
    - '\mshta.exe'
    - '\cscript.exe'
    - '\wscript.exe'
    - '\taskkill.exe'
    - '\regsvr32.exe'
    - '\rundll32.exe'
            # - '\csc.exe'   # https://app.any.run/tasks/f420d295-0457-4e9b-9b9e-6732be227583/
    - '\calc.exe'          # https://app.any.run/tasks/f420d295-0457-4e9b-9b9e-6732be227583/
  filter_main_cmd_bits:
    Image|endswith: '\cmd.exe'
    CommandLine|contains: 'bits'
  filter_main_powershell_noprofile:
    Image|endswith: '\powershell.exe'
    CommandLine|endswith:
    - '-noprofile -'
    - '-noprofile'
  condition: selection and not 1 of filter_main_*
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This Sigma rule detects instances where `sdiagnhost.exe`, a legitimate Windows process used for diagnostics, spawns suspicious child processes that may indicate malicious activity. The rule focuses on specific child processes commonly abused in various exploits, including the Follina vulnerability (CVE-2022-30190). It looks for instances where `sdiagnhost.exe` is the parent image and checks if the child process matches known suspicious images such as `powershell.exe`, `cmd.exe`, and several others which are often exploited in attacks. The detection relies on process creation logs as the primary data source, enabling the detection of potentially harmful command-line manipulations that could lead to further exploitation.
  ### Investigation Steps
  - Review the EDR logs for the detected instance of `sdiagnhost.exe` calling suspicious child processes to confirm the event and gather context about the execution environment.
  - Analyze the command-line arguments associated with the child processes to identify any unusual or unexpected parameters that may indicate an exploitation attempt.
  - Check the network activity logs from the NGFW or NDR to monitor any outbound connections initiated by the child processes, which may suggest data exfiltration or command-and-control (C2) communications.
  - Investigate the file artifacts and execution history associated with the detected processes using the AV tools to assess whether any malicious files were downloaded or executed during the timeframe of the alert.
