title: Potentially Suspicious Child Process Of WinRAR.EXE
id: 146aace8-9bd6-42ba-be7a-0070d8027b76
related:
- id: ec3a3c2f-9bb0-4a9b-8f4b-5ec386544343
  type: similar
status: test
description: Detects potentially suspicious child processes of WinRAR.exe.
references:
- https://www.group-ib.com/blog/cve-2023-38831-winrar-zero-day/
- https://github.com/knight0x07/WinRAR-Code-Execution-Vulnerability-CVE-2023-38831/blob/26ab6c40b6d2c09bb4fc60feaa4a3a90cfd20c23/Part-1-Overview.md
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023-08-31
tags:
- attack.execution
- attack.t1203
logsource:
  category: process_creation
  product: windows
detection:
  selection_parent:
    ParentImage|endswith: '\WinRAR.exe'
  selection_binaries:
        # Note: add additional binaries that the attacker might use
  - Image|endswith:
    - '\cmd.exe'
    - '\cscript.exe'
    - '\mshta.exe'
    - '\powershell.exe'
    - '\pwsh.exe'
    - '\regsvr32.exe'
    - '\rundll32.exe'
    - '\wscript.exe'
  - OriginalFileName:
    - 'Cmd.Exe'
    - 'cscript.exe'
    - 'mshta.exe'
    - 'PowerShell.EXE'
    - 'pwsh.dll'
    - 'regsvr32.exe'
    - 'RUNDLL32.EXE'
    - 'wscript.exe'
  condition: all of selection_*
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  This Sigma rule is designed to detect potentially malicious activities initiated by child processes of WinRAR.exe, a popular file compression utility known to be exploited in various cyberattacks. The rule aims to identify child processes that are typically associated with command execution or scripting tasks, such as `cmd.exe`, `powershell.exe`, and others, when they are spawned from the WinRAR process. By monitoring process creation logs, the detection leverages key attributes such as the parent process's image name and the child process's image name or original file name. Since WinRAR has been associated with specific vulnerabilities (e.g., CVE-2023-38831), monitoring for its behavioral patterns can help uncover potential exploitation attempts or lateral movements within an enterprise network.
  ### Investigation Steps
  - Review process creation logs in the EDR platform to identify instances of `WinRAR.exe` spawning any of the specified suspicious child processes.
  - Investigate the command-line parameters of the detected child processes for any obfuscation or commands that indicate malicious intent, using standardized tools like PowerShell logs or Sysmon data.
  - Check for any concurrent network activities or abnormal outbound connections associated with the child processes in the NDR or Firewall logs.
  - Validate if the WinRAR installation on the affected system has been updated or if it is using a vulnerable version that could be exploited based on the references provided.
