title: Remote CHM File Download/Execution Via HH.EXE
id: f57c58b3-ee69-4ef5-9041-455bf39aaa89
status: test
description: Detects the usage of "hh.exe" to execute/download remotely hosted ".chm"
  files.
references:
- https://www.splunk.com/en_us/blog/security/follina-for-protocol-handlers.html
- https://github.com/redcanaryco/atomic-red-team/blob/1cf4dd51f83dcb0ebe6ade902d6157ad2dbc6ac8/atomics/T1218.001/T1218.001.md
- https://www.zscaler.com/blogs/security-research/unintentional-leak-glimpse-attack-vectors-apt37
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-09-29
modified: 2024-01-31
tags:
- attack.defense-evasion
- attack.t1218.001
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - OriginalFileName: 'HH.exe'
  - Image|endswith: '\hh.exe'
  selection_cli:
    CommandLine|contains:
    - 'http://'
    - 'https://'
    - '\\\\'
  condition: all of selection_*
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This detection rule identifies potentially malicious activities involving the Windows Help Application (hh.exe) being used to execute or download .chm (Compiled HTML Help) files that are hosted remotely. These remote files can be leveraged by adversaries to deliver malicious payloads, often through social engineering attacks or phishing campaigns. The rule operates by monitoring process creation logs for instances of hh.exe. It specifically looks for command-line parameters that contain URLs with HTTP or HTTPS as well as UNC paths that indicate files are being fetched from remote sources. This activity is mapped to the MITRE ATT&CK technique T1218.001, which deals with the exploitation of application protocol handlers.
  ### Investigation Steps
  - **Verify Command Line Arguments:** Check the command line arguments of the hh.exe process in EDR to identify any malicious patterns, especially those containing URLs or UNC paths.
  - **Examine Process Tree:** Investigate the parent and child processes associated with hh.exe to understand the context of its execution and identify if there are any unusual execution chains.
  - **Review Network Logs:** Utilize NDR and firewall logs to verify if there were outbound connections to suspicious domains or IPs during the time of the hh.exe execution.
  - **Correlate User Activity:** Look through user activity logs to determine if there were any interactions or user-initiated events that could correlate with the timing and execution of hh.exe, such as downloading documents or browsing untrusted sites.
  ### Prioritization
  The alert has been assigned a high severity level due to the potential for remote execution of malicious code, which can lead to a substantial compromise of user systems and data integrity within the enterprise environment.
  ### Blind spots and Assumptions
  This rule may not trigger if hh.exe is executed without the typical command-line parameters indicative of remote connection attempts or if the adversary uses alternate methods to invoke hh.exe without relying on URLs or UNC paths. Additionally, if legitimate applications similarly use hh.exe for benign purposes, the detection could lead to false positives. It is assumed that appropriate telemetry for process creation is available and that users have not disabled or misconfigured the Windows Help programs.
  > **Disclaimer:** This investigation guide was created using generative AI technology and has not been reviewed for its accuracy and relevance. While every effort has been made to ensure its quality, we recommend validating the content and adapting it to suit specific environment and operational needs. Please communicate any changes to the detection engineering team.
