title: PUA - Ngrok Execution
id: ee37eb7c-a4e7-4cd5-8fa4-efa27f1c3f31
status: test
description: |
  Detects the use of Ngrok, a utility used for port forwarding and tunneling, often used by threat actors to make local protected services publicly available.
  Involved domains are bin.equinox.io for download and *.ngrok.io for connections.
references:
- https://ngrok.com/docs
- https://www.fireeye.com/blog/threat-research/2021/05/shining-a-light-on-darkside-ransomware-operations.html
- https://stackoverflow.com/questions/42442320/ssh-tunnel-to-ngrok-and-initiate-rdp
- https://www.virustotal.com/gui/file/58d21840d915aaf4040ceb89522396124c82f325282f805d1085527e1e2ccfa1/detection
- https://cybleinc.com/2021/02/15/ngrok-platform-abused-by-hackers-to-deliver-a-new-wave-of-phishing-attacks/
- https://twitter.com/xorJosh/status/1598646907802451969
- https://www.softwaretestinghelp.com/how-to-use-ngrok/
author: Florian Roth (Nextron Systems)
date: 2021-05-14
modified: 2023-02-21
tags:
- attack.command-and-control
- attack.t1572
logsource:
  category: process_creation
  product: windows
detection:
  selection1:
    CommandLine|contains:
    - ' tcp 139'
    - ' tcp 445'
    - ' tcp 3389'
    - ' tcp 5985'
    - ' tcp 5986'
  selection2:
    CommandLine|contains|all:
    - ' start '
    - '--all'
    - '--config'
    - '.yml'
  selection3:
    Image|endswith: 'ngrok.exe'
    CommandLine|contains:
    - ' tcp '
    - ' http '
    - ' authtoken '
  selection4:
    CommandLine|contains:
    - '.exe authtoken '
    - '.exe start --all'
  condition: 1 of selection*
falsepositives:
- Another tool that uses the command line switches of Ngrok
- Ngrok http 3978 
  (https://learn.microsoft.com/en-us/azure/bot-service/bot-service-debug-channel-ngrok?view=azure-bot-service-4.0)
level: high
notes: |
  n
  ### Technical Context
  The "PUA 
  - Ngrok Execution" detection rule identifies the execution of Ngrok, a legitimate tool frequently exploited by threat actors for creating tunnels and exposing local services to the public internet. This detection is based on the analysis of process creation logs, particularly focusing on command-line arguments associated with Ngrok, such as those specifying TCP ports (e.g., 139, 445, 3389) and commands linked to tunneling activities. The rule specifies combinations of distinctive command-line patterns and file execution paths, setting it to trigger alerts when suspicious configurations are detected. Given that Ngrok may open critical ports associated with services like RDP or PowerShell, it poses a significant security risk. This detection aligns with the MITRE ATT&CK technique T1572, which pertains to the use of application layer protocols for command-and-control communications.
  ### Investigation Steps
  - **Check EDR Alerts:** Review the latest alerts within the EDR console to identify any suspicious process creation events involving 'ngrok.exe' and related command-line arguments.
  - **Analyze Network Connections:** Utilize the NDR or firewall logs to track any outbound connections to known Ngrok domains (*ngrok.io*) or related IP addresses following the Ngrok execution.
  - **Review Windows Event Logs:** Examine the relevant Windows Event Logs (Security, System) for any user authentication events or application installations occurring around the same time as the Ngrok execution.
  - **Correlate with Proxy Logs:** Investigate proxy logs for any unusual web traffic patterns that link to Ngrok or other port forwarding services, which might indicate malicious intent.
  ### Prioritization
  The alert is classified as high severity due to the potential risk posed by unauthorized exposure of internal services, which could facilitate further attacks or unauthorized access.
  ### Blind Spots and Assumptions
  This rule may not fire if an adversary uses custom binaries that replicate Ngrok's functionality without the recognizable command-line patterns, thus bypassing detection. Additionally, legitimate uses of Ngrok, such as for development or legitimate support purposes, may lead to false positives. Analysts should be aware that other tools with similar command-line switches might also trigger alerts, requiring additional contextual investigation to differentiate between malicious and benign activities.
  > **Disclaimer:** This investigation guide was created using generative AI technology and has not been reviewed for its accuracy and relevance. While every effort has been made to ensure its quality and comprehensiveness, we recommend validating the content and adapting it to suit specific environment and operational needs. Please communicate any changes to the detection engineering team.
