title: Renamed Whoami Execution
id: f1086bf7-a0c4-4a37-9102-01e573caf4a0
status: test
description: Detects the execution of whoami that has been renamed to a different
  name to avoid detection
references:
- https://brica.de/alerts/alert/public/1247926/agent-tesla-keylogger-delivered-inside-a-power-iso-daa-archive/
- https://app.any.run/tasks/7eaba74e-c1ea-400f-9c17-5e30eee89906/
author: Florian Roth (Nextron Systems)
date: 2021-08-12
modified: 2022-10-09
tags:
- attack.discovery
- attack.t1033
- car.2016-03-001
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    OriginalFileName: 'whoami.exe'
  filter:
    Image|endswith: '\whoami.exe'
  condition: selection and not filter
falsepositives:
- Unknown
level: critical
notes: |
  ### Technical Context
  The "Renamed Whoami Execution" rule is designed to detect instances where the legitimate Windows command-line utility `whoami.exe` has been renamed in an attempt to evade security detection mechanisms. Attackers may alter the file name of `whoami.exe` to obscure their activities, using this tool for reconnaissance purposes to gather useful information about the system and the logged-in user. This rule analyzes Windows process creation logs and looks for processes that have the original file name `whoami.exe` while ensuring that the processes being executed do not match the standard file path, thereby identifying potentially malicious activities. By monitoring these anomalies in process execution, security teams can pinpoint potential misuse of an essential system command.
  ### Investigation Steps
  - Review the associated process creation logs in the EDR platform to identify the instances where renamed executions of `whoami.exe` occurred, including the new file names used. 
  - Correlate the identified events with additional logs from the NGFW and proxy to determine if there were any suspicious outgoing connections or activities during the time of execution.
  - Examine user account activity within the environment to assess whether the execution aligns with normal user behavior or indicates an unauthorized access attempt.
  - Conduct a thorough file analysis and threat hunting on the affected endpoints to identify any additional indicators of compromise or related malicious processes.
