title: Raccine Uninstall
id: a31eeaed-3fd5-478e-a8ba-e62c6b3f9ecc
status: test
description: Detects commands that indicate a Raccine removal from an end system.
  Raccine is a free ransomware protection tool.
references:
- https://github.com/Neo23x0/Raccine
author: Florian Roth (Nextron Systems)
date: 2021-01-21
modified: 2022-10-09
tags:
- attack.defense-evasion
- attack.t1562.001
logsource:
  category: process_creation
  product: windows
detection:
  selection1:
    CommandLine|contains|all:
    - 'taskkill '
    - 'RaccineSettings.exe'
  selection2:
    CommandLine|contains|all:
    - 'reg.exe'
    - 'delete'
    - 'Raccine Tray'
  selection3:
    CommandLine|contains|all:
    - 'schtasks'
    - '/DELETE'
    - 'Raccine Rules Updater'
  condition: 1 of selection*
falsepositives:
- Legitimate deinstallation by administrative staff
level: high
notes: |
  ### Technical Context
  This Sigma rule is designed to detect attempts to uninstall Raccine, a free ransomware protection tool, from an endpoint. It identifies specific command-line activities that are commonly associated with the removal of Raccine, including commands to terminate the process, delete registry entries, or remove scheduled tasks related to Raccine. The rule utilizes logs from process creation events on Windows systems, examining the command lines associated with these events to look for signatures that indicate malicious uninstallation activities. If any of the defined patterns are matched, an alert is triggered, enabling security teams to investigate potential unauthorized removal of crucial security software.
  ### Investigation Steps
  - Review endpoint activity logs in the EDR solution to identify the timeline of the command execution and any associated processes that may indicate malicious behavior.
  - Correlate any alerts with user access logs from the Proxy to determine if the actions were initiated by legitimate administrative users or potentially compromised accounts.
  - Investigate registry changes and task scheduler entries on the affected systems to confirm whether the Raccine uninstallation was part of a larger unauthorized access activity.
  - Verify with IT support or administrative staff to determine if legitimate deinstallation of Raccine was performed and assess the context of the activity to rule out false positives.
