title: Suspicious Schtasks Schedule Type With High Privileges
id: 7a02e22e-b885-4404-b38b-1ddc7e65258a
related:
- id: 24c8392b-aa3c-46b7-a545-43f71657fe98
  type: similar
status: test
description: Detects scheduled task creations or modification to be run with high
  privileges on a suspicious schedule type
references:
- https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/schtasks-change
- https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/schtasks-create
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-08-31
tags:
- attack.execution
- attack.t1053.005
logsource:
  product: windows
  category: process_creation
detection:
  selection_img:
  - Image|endswith: '\schtasks.exe'
  - OriginalFileName: 'schtasks.exe'
  selection_time:
    CommandLine|contains:
    - ' ONLOGON '
    - ' ONSTART '
    - ' ONCE '
    - ' ONIDLE '
  selection_privs:
    CommandLine|contains:
    - 'NT AUT'         # This covers the usual NT AUTHORITY\SYSTEM
    - ' SYSTEM'         # SYSTEM is a valid value for schtasks hence it gets it's own value with space
    - 'HIGHEST'
  condition: all of selection_*
falsepositives:
- Some installers were seen using this method of creation unfortunately. Filter them
  in your environment
level: medium
notes: |
  ### Technical Context
  This Sigma rule is designed to detect suspicious scheduled tasks created or modified with high privileges on Windows systems using the `schtasks.exe` command-line tool. The rule focuses on identifying specific command-line patterns associated with the creation of scheduled tasks that may indicate potentially malicious activity. The key components being monitored include the execution of `schtasks.exe` and command-line arguments indicating a scheduled task's behavior, especially those using high privileges like NT AUTHORITY\SYSTEM or "HIGHEST". 
  The rule targets the MITRE ATT&CK technique T1053.005 (Scheduled Task/Job: Windows Task Scheduler) within the execution tactic. By monitoring process creation logs for `schtasks.exe` and its associated command line arguments (such as `ONLOGON`, `ONSTART`, `ONCE`, and `ONIDLE`), defenders can identify when a scheduled task is set to execute in response to certain system events or conditions, particularly with elevated privileges that may indicate an abuse of this legitimate scheduling functionality.
  ### Investigation Steps
  - **Check Process Creation Logs**: Use EDR to query process creation logs for instances of `schtasks.exe` execution. Validate the parent process and any associated unusual command line arguments.
    
  - **Review Scheduled Tasks**: Access the Windows Task Scheduler to list tasks created around the time of the alert. Inspect those tasks for security context and corresponding trigger conditions to determine legitimacy.
  - **Correlate with User Behavior**: Examine user activities captured in Windows Security logs around the alert timestamp. Look for unusual patterns or accounts that might correlate with the creation of the suspicious task.
  - **Analyze External Logs**: If applicable, review logs from SIEM, Proxy, or VPN for unusual connection attempts or commands issued from the host to external systems that might indicate further malicious activity.
  ### Prioritization
  The alert is assigned a medium severity level due to the potential for high-privilege execution of tasks that could allow an attacker to gain persistence or perform malicious actions within the environment. However, it is essential to investigate the context to rule out benign legitimate scheduled tasks.
  ### Blind Spots and Assumptions
  This rule may not fire for legitimate administrative activities or benign software installations that also use `schtasks.exe` for creating scheduled tasks. Additionally, if the `schtasks.exe` command was executed from a context that does not log process creation events (e.g., through a compromised legitimate process), then the detection may fail. Furthermore, adversaries might choose to obfuscate their use of scheduled tasks by employing different monitoring tools or renaming procedures.
  > **Disclaimer:** This investigation guide was created using generative AI technology and has not been reviewed for its accuracy and relevance. While every effort has been made to ensure its quality, we recommend validating the content and adapting it to suit specific environment and operational needs. Please communicate any changes to the detection engineering team.
