title: Suspicious Use of PsLogList
id: aae1243f-d8af-40d8-ab20-33fc6d0c55bc
status: test
description: Detects usage of the PsLogList utility to dump event log in order to
  extract admin accounts and perform account discovery or delete events logs
references:
- https://research.nccgroup.com/2021/01/12/abusing-cloud-services-to-fly-under-the-radar/
- https://www.cybereason.com/blog/deadringer-exposing-chinese-threat-actors-targeting-major-telcos
- https://github.com/3CORESec/MAL-CL/tree/master/Descriptors/Sysinternals/PsLogList
- https://twitter.com/EricaZelic/status/1614075109827874817
author: Nasreddine Bencherchali (Nextron Systems)
date: 2021-12-18
modified: 2024-03-05
tags:
- attack.discovery
- attack.t1087
- attack.t1087.001
- attack.t1087.002
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - OriginalFileName: 'psloglist.exe'
  - Image|endswith:
    - '\psloglist.exe'
    - '\psloglist64.exe'
  selection_cli_eventlog:
    CommandLine|contains:
    - ' security'
    - ' application'
    - ' system'
  selection_cli_flags:
    CommandLine|contains|windash:
    - ' -d'
    - ' -x'
    - ' -s'
    - ' -c'         # Clear event log after displaying
    - ' -g'         # Export an event log as an evt file.
  condition: all of selection_*
falsepositives:
- Another tool that uses the command line switches of PsLogList
- Legitimate use of PsLogList by an administrator
level: medium
notes: |
  ### Technical Context
  This detection rule identifies suspicious usage of the PsLogList utility, a command-line tool that enables users to retrieve and dump the Windows event logs, which can reveal valuable information about administrative accounts and system activities. By analyzing process creation logs, the rule looks for specific indicators such as the execution of PsLogList or its variants, along with particular command-line arguments that suggest possible malicious intent. Notably, the presence of commands indicating event log retrieval, filtering for security, application, or system logs, combined with flags that suggest log clearing or exporting, can point to nefarious account discovery or log tampering activities. 
  The primary data sources for this detection are Windows process creation logs, which capture detailed information about executed processes, including the executable name and command-line parameters. Given that attackers often misuse administrative tools, prompt identification and investigation of PsLogList usage can help mitigate security risks and prevent potential exploitation.
  ### Investigation Steps
  - Search EDR logs for instances of `psloglist.exe` or `psloglist64.exe` executions along with the specific command-line parameters noted in the alert for additional context on the action taken. 
  - Review the user's account behavior in the identity management system to determine if the action was authorized and consistent with their role or if it appears anomalous.
  - Check for additional log clearing activity within the same timeframe from system logs to assess whether there are correlated events indicating an effort to hide malicious activities.
  - Utilize logs from the NGFW, Proxy, and VPN to identify any unusual outbound connections or access to resources that may have occurred following the usage of PsLogList, which could indicate lateral movement or data exfiltration attempts.
