title: Certificate Exported Via PowerShell
id: 9e716b33-63b2-46da-86a4-bd3c3b9b5dfb
related:
- id: aa7a3fce-bef5-4311-9cc1-5f04bb8c308c
  type: similar
status: test
description: Detects calls to cmdlets that are used to export certificates from the
  local certificate store. Threat actors were seen abusing this to steal private keys
  from compromised machines.
references:
- https://us-cert.cisa.gov/ncas/analysis-reports/ar21-112a
- https://learn.microsoft.com/en-us/powershell/module/pki/export-pfxcertificate?view=windowsserver2022-ps
- https://www.splunk.com/en_us/blog/security/breaking-the-chain-defending-against-certificate-services-abuse.html
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023-05-18
tags:
- attack.credential-access
- attack.execution
- attack.t1552.004
- attack.t1059.001
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    CommandLine|contains:
    - 'Export-PfxCertificate '
    - 'Export-Certificate '
  condition: selection
falsepositives:
- Legitimate certificate exports by administrators. Additional filters might be required.
level: medium
notes: |
  ### Technical Context
  This detection rule identifies potentially malicious use of PowerShell cmdlets designed to export certificates from a Windows system’s local certificate store. Specifically, it monitors for the invocation of `Export-PfxCertificate` and `Export-Certificate` commands that may indicate an attacker attempting to extract private keys from compromised machines. These cmdlets can be exploited to exfiltrate sensitive cryptographic materials, which threat actors may leverage for advancing their unauthorized access or impersonation tactics. The primary data sources for this rule are process creation logs that detail command-line activities within the Windows environment, providing insight into potentially harmful actions performed by users or automated scripts.
  ### Investigation Steps
  - Review the process creation logs in your EDR to identify the user account that executed the PowerShell commands and assess whether it aligns with legitimate administrative activities.
  - Analyze the command-line parameters associated with the detected commands to check for unusual flags or additional commands that may indicate a more complex attack.
  - Cross-reference the timestamp of the alert with other security events such as unusual authentication attempts or lateral movement activities to contextualize the risk.
  - Investigate network logs via the proxy or firewall to look for any potentially suspicious outbound connections that may have coincided with the certificate export actions.
