title: Procdump Execution
id: 2e65275c-8288-4ab4-aeb7-6274f58b6b20
status: test
description: Detects usage of the SysInternals Procdump utility
references:
- https://learn.microsoft.com/en-us/sysinternals/downloads/procdump
author: Florian Roth (Nextron Systems)
date: 2021-08-16
modified: 2023-02-28
tags:
- attack.defense-evasion
- attack.t1036
- attack.t1003.001
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith:
    - '\procdump.exe'
    - '\procdump64.exe'
  condition: selection
falsepositives:
- Legitimate use of procdump by a developer or administrator
level: medium
notes: |
  ### Technical Context
  This Sigma rule is designed to detect the execution of the SysInternals utility "Procdump," which is commonly used for capturing process memory dumps. The detection is triggered when a process creation event occurs, and the executed image path ends with "procdump.exe" or "procdump64.exe." By monitoring for these specific executions, security teams can identify potential misuse of the tool, which may indicate an attempted exfiltration of sensitive information or malicious activities aimed at evading security controls. The relevant data source for this detection includes process creation logs, which capture when new processes are launched and their associated command-line parameters.
  ### Investigation Steps
  - Start by reviewing the process creation logs in your EDR solution to obtain context on the initiated Procdump processes, including the user, timestamps, and parent processes.
  - Investigate the command-line parameters used during the execution of Procdump to determine whether it aligns with normal operational usage or indicates suspicious activity.
  - Correlate the detected event with other security logs, such as Windows Event Logs and AV alerts, to identify any signs of malicious behavior linked to the execution of Procdump.
  - Consult network logs from your NDR or Proxy solutions to check for any outbound connections or data transfers initiated shortly after the Procdump execution, which could indicate data exfiltration attempts.
