title: Sensitive File Dump Via Wbadmin.EXE
id: 8b93a509-1cb8-42e1-97aa-ee24224cdc15
status: experimental
description: |
  Detects the dump of highly sensitive files such as "NTDS.DIT" and "SECURITY" hive.
  Attackers can leverage the "wbadmin" utility in order to dump sensitive files that might contain credential or sensitive information.
references:
- https://github.com/LOLBAS-Project/LOLBAS/blob/2cc01b01132b5c304027a658c698ae09dd6a92bf/yml/OSBinaries/Wbadmin.yml
- https://lolbas-project.github.io/lolbas/Binaries/Wbadmin/
- https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/wbadmin-start-recovery
- https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/wbadmin-start-backup
author: Nasreddine Bencherchali (Nextron Systems), frack113
date: 2024-05-10
tags:
- attack.credential-access
- attack.t1003.003
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: '\wbadmin.exe'
  - OriginalFileName: 'WBADMIN.EXE'
  selection_backup:
    CommandLine|contains:
    - 'start'
    - 'backup'
  selection_path:
    CommandLine|contains:
    - '\config\SAM'
    - '\config\SECURITY'
    - '\config\SYSTEM'
    - '\Windows\NTDS\NTDS.dit'
  condition: all of selection_*
falsepositives:
- Legitimate backup operation by authorized administrators. Matches must be investigated
  and allowed on a case by case basis.
level: high
notes: |
  ### Technical Context
  The "Sensitive File Dump Via Wbadmin.EXE" detection rule identifies potentially malicious activities involving the Windows backup utility `wbadmin.exe`. This rule is specifically geared towards detecting attempts to dump highly sensitive files, such as the NTDS database or the Security hive (SECURITY), which may contain vital information such as user credentials. The rule works by monitoring process creation logs for instances where `wbadmin.exe` is executed with command-line parameters that indicate the initiation of a backup operation targeting critical files. By analyzing the command line for specific phrases and paths linked to sensitive data, the SOC can pinpoint likely abuse of backup functionalities designed for legitimate administrative tasks.
  ### Investigation Steps
  - Review the process creation logs in your EDR solution for instances of `wbadmin.exe` executed with command lines containing "start" and "backup" to confirm the invocation of the backup utility.
  - Correlate the detected process with the user account that triggered it to determine whether the operation was executed by an authorized system administrator or a potentially unauthorized user.
  - Examine file access logs or data exfiltration alerts from your NGFW or Data Loss Prevention (DLP) tools for any signs of sensitive files being accessed or transferred after the `wbadmin.exe` execution.
  - Analyze Windows event logs, particularly the Security and System logs, to capture any unusual logins or administrative actions that may coincide with the timing of the `wbadmin.exe` execution.
