title: Renamed CURL.EXE Execution
id: 7530cd3d-7671-43e3-b209-976966f6ea48
status: test
description: Detects the execution of a renamed "CURL.exe" binary based on the PE
  metadata fields
references:
- https://twitter.com/Kostastsale/status/1700965142828290260
author: X__Junior (Nextron Systems)
date: 2023-09-11
modified: 2023-10-12
tags:
- attack.execution
- attack.t1059
- attack.defense-evasion
- attack.t1202
logsource:
  category: process_creation
  product: windows
detection:
  selection:
  - OriginalFileName: 'curl.exe'
  - Description: 'The curl executable'
  filter_main_img:
    Image|contains: '\curl'
  condition: selection and not 1 of filter_main_*
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  This detection rule focuses on identifying unauthorized usage of the well-known CURL utility when it has been renamed or disguised, which could indicate malicious intent or attempts to evade security measures. The rule inspects process creation logs to find instances where the original file name metadata field indicates 'curl.exe' and the description matches that of the standard CURL executable. Additionally, the rule checks the image path for instances containing '\curl,' confirming that the executable may have been manipulated to avoid detection.
  The gathered information helps security analysts to identify suspicious activity that could be associated with malicious actions, such as data exfiltration or command-and-control communications. By monitoring the PE metadata fields, the detection rule can distinguish between legitimate applications and potential impersonators, offering valuable insights into threat behavior.
  ### Investigation Steps
  - Retrieve the process creation logs from your EDR tool, focusing on events triggered by any renamed instances of CURL.EXE to assess the context in which they were executed.
  - Analyze the command-line parameters associated with detected CURL executions to identify unusual flags or endpoints that could indicate malicious activity.
  - Check the associated network logs from your NDR solution for any suspicious outbound connections initiated by the process to determine if data was transferred to an external entity.
  - Review your organization's proxy and firewall logs to identify any previous or subsequent connections made by the same process, which may reveal patterns of unauthorized access or data extraction attempts.
