title: Service DACL Abuse To Hide Services Via Sc.EXE
id: a537cfc3-4297-4789-92b5-345bfd845ad0
related:
- id: 99cf1e02-00fb-4c0d-8375-563f978dfd37     # Deny Service Access
  type: similar
- id: 98c5aeef-32d5-492f-b174-64a691896d25     # Generic SD tampering
  type: similar
status: test
description: Detects usage of the "sc.exe" utility adding a new service with special
  permission seen used by threat actors which makes the service hidden and unremovable.
references:
- https://blog.talosintelligence.com/2021/10/threat-hunting-in-large-datasets-by.html
- https://www.sans.org/blog/red-team-tactics-hiding-windows-services/
- https://twitter.com/Alh4zr3d/status/1580925761996828672
- https://itconnect.uw.edu/tools-services-support/it-systems-infrastructure/msinf/other-help/understanding-sddl-syntax/
author: Andreas Hunkeler (@Karneades)
date: 2021-12-20
modified: 2022-08-08
tags:
- attack.persistence
- attack.defense-evasion
- attack.privilege-escalation
- attack.t1574.011
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: '\sc.exe'
  - OriginalFileName: 'sc.exe'
  selection_cli:
    CommandLine|contains|all:
    - 'sdset'
            # Summary of permissions
            #   DC: Delete All Child Objects
            #   LC: List Contents
            #   WP: Write All Properties
            #   DT: Delete Subtree
            #   SD: Delete
    - 'DCLCWPDTSD'
  condition: all of selection_*
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This detection rule focuses on the use of the Windows service control utility, `sc.exe`, and its potential abuse by threat actors. Specifically, it identifies instances where `sc.exe` is used to create or modify services with unique security descriptors that make them hidden and removable only by the creator. The rule detects command-line parameters associated with the `sdset` command, which sets security descriptors using a specific syntax that can conceal services from normal administrative views. The primary data sources for this rule include process creation logs that capture the execution of `sc.exe`, along with the associated command-line arguments that indicate misuse and the presence of unusual security permissions.
  ### Investigation Steps
  - Utilize EDR tools to query process creation logs for any recent instances of `sc.exe` being executed, particularly those with the `sdset` command-line option.
  - Review the command-line parameters captured in the process logs to identify any service creation commands that include unusual security descriptors (e.g., `DCLCWPDTSD`).
  - Check the affected services through Windows Service Manager or equivalent tools to verify whether any unknown or suspicious services have been created or hidden.
  - Consult SIEM logs for any related alerts, anomalies, or user accounts that may have triggered with elevated privileges around the time of the `sc.exe` execution.
