title: Suspicious Desktopimgdownldr Command
id: bb58aa4a-b80b-415a-a2c0-2f65a4c81009
status: test
description: Detects a suspicious Microsoft desktopimgdownldr execution with parameters
  used to download files from the Internet
references:
- https://labs.sentinelone.com/living-off-windows-land-a-new-native-file-downldr/
- https://twitter.com/SBousseaden/status/1278977301745741825
author: Florian Roth (Nextron Systems)
date: 2020-07-03
modified: 2021-11-27
tags:
- attack.command-and-control
- attack.t1105
logsource:
  category: process_creation
  product: windows
detection:
  selection1:
    CommandLine|contains: ' /lockscreenurl:'
  selection1_filter:
    CommandLine|contains:
    - '.jpg'
    - '.jpeg'
    - '.png'
  selection_reg:
    CommandLine|contains|all:
    - 'reg delete'
    - '\PersonalizationCSP'
  condition: ( selection1 and not selection1_filter ) or selection_reg
fields:
- CommandLine
- ParentCommandLine
falsepositives:
- False positives depend on scripts and administrative tools used in the monitored
  environment
level: high
notes: |
  ### Technical Context
  The "Suspicious Desktopimgdownldr Command" detection rule identifies potentially malicious use of the Microsoft `desktopimgdownldr` utility, which is typically leveraged to download images from the internet. The rule examines the process creation logs for command line execution parameters that indicate an unusual behavior; specifically, it looks for commands containing '/lockscreenurl:' together with file extensions like '.jpg', '.jpeg', or '.png'. If a command contains a deletion of registry keys related to `PersonalizationCSP`, that also triggers the alert. By focusing on these indicators, the rule helps detect possible command-and-control tactics employed by threat actors who might be downloading files as part of a broader attack strategy. 
  ### Investigation Steps
  - Review the process creation logs in your EDR to identify any instances of `desktopimgdownldr` and analyze the associated command-line parameters for any suspicious activity.
  - Check the ParentCommandLine field to understand the context of the process. This can give insights into whether it was spawned by a legitimate application or script.
  - Conduct a search in your AV/EDR solution for any related events or detections around the timestamp of the alert to identify if the activity correlates with known threats.
  - Utilize network logs from your NDR and Proxy to corroborate the command to external URLs, focusing on the requests made by the identified process for any signs of malicious downloads.
