title: Suspicious File Encoded To Base64 Via Certutil.EXE
id: ea0cdc3e-2239-4f26-a947-4e8f8224e464
related:
- id: e62a9f0c-ca1e-46b2-85d5-a6da77f86d1a
  type: derived
status: test
description: Detects the execution of certutil with the "encode" flag to encode a
  file to base64 where the extensions of the file is suspicious
references:
- https://www.virustotal.com/gui/file/35c22725a92d5cb1016b09421c0a6cdbfd860fd4778b3313669b057d4a131cb7/behavior
- https://www.virustotal.com/gui/file/427616528b7dbc4a6057ac89eb174a3a90f7abcf3f34e5a359b7a910d82f7a72/behavior
- https://www.virustotal.com/gui/file/34de4c8beded481a4084a1fd77855c3e977e8ac643e5c5842d0f15f7f9b9086f/behavior
- https://www.virustotal.com/gui/file/4abe1395a09fda06d897a9c4eb247278c1b6cddda5d126ce5b3f4f499e3b8fa2/behavior
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023-05-15
modified: 2024-03-05
tags:
- attack.defense-evasion
- attack.t1027
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: '\certutil.exe'
  - OriginalFileName: 'CertUtil.exe'
  selection_cli:
    CommandLine|contains|windash: '-encode'
  selection_extension:
    CommandLine|contains:
    - '.acl'
    - '.bat'
    - '.doc'
    - '.gif'
    - '.jpeg'
    - '.jpg'
    - '.mp3'
    - '.pdf'
    - '.png'
    - '.ppt'
    - '.tmp'
    - '.xls'
    - '.xml'
  condition: all of selection_*
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This Sigma rule detects potentially malicious activity involving the Windows `certutil.exe` tool, specifically when it is used to encode files into Base64 format with a suspicious file extension. Certutil is a legitimate command-line utility commonly used for certificate management, but threat actors may exploit it for obfuscating malicious payloads or data exfiltration. The rule identifies process creation events where `certutil.exe` is executed with the `-encode` flag, particularly when the file extensions involved are deemed suspicious (e.g., `.pdf`, `.jpg`, `.tmp`). The primary data sources leveraged in this detection rule are process creation logs, which provide insight into the command-line parameters, binary image, and file extensions.
  ### Investigation Steps
  - Review the process creation logs in your EDR solution to locate the instances of `certutil.exe` executing with the `-encode` flag, filtering for the identified suspicious file extensions.
  - Investigate the parent processes associated with the detected instances to determine whether they are linked to known legitimate applications or possible malicious activities.
  - Check your SIEM for any alerts or anomalies that coincide with the timestamp of the suspicious `certutil.exe` execution, especially focusing on user behavior and network activity.
  - Utilize endpoint detection capabilities to analyze the encoded file's integrity and contents, looking for indicators of compromise or relationships to known malware signatures.
