title: Share And Session Enumeration Using Net.EXE
id: 62510e69-616b-4078-b371-847da438cc03
status: stable
description: Detects attempts to enumerate file shares, printer shares and sessions
  using "net.exe" with the "view" flag.
references:
- https://eqllib.readthedocs.io/en/latest/analytics/b8a94d2f-dc75-4630-9d73-1edc6bd26fff.html
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1018/T1018.md
author: Endgame, JHasenbusch (ported for oscd.community)
date: 2018-10-30
modified: 2023-02-21
tags:
- attack.discovery
- attack.t1018
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith:
    - '\net.exe'
    - '\net1.exe'
  - OriginalFileName:
    - 'net.exe'
    - 'net1.exe'
  selection_cli:
    CommandLine|contains: 'view'
  filter:
    CommandLine|contains: '\\\\'
  condition: all of selection_* and not filter
fields:
- ComputerName
- User
- CommandLine
falsepositives:
- Legitimate use of net.exe utility by legitimate user
level: low
notes: |
  ### Technical Context
  This detection rule identifies attempts to enumerate file shares, printer shares, and sessions on Windows systems using the "net.exe" command-line utility with the "view" flag. The rule specifically monitors for process creation events where "net.exe" or "net1.exe" are executed, checking the CommandLine parameters for the inclusion of 'view' and the presence of '\\\\', which suggests an intention to query network resources. By focusing on these indicators, the rule helps detect potentially unauthorized reconnaissance activities within the network that can precede more aggressive attacks, such as lateral movement or data exfiltration.
  Key data sources involved include process creation logs, which detail when and how executables are run on the system, as well as the attributes of those processes, such as command-line arguments and the original file names. This allows SOC analysts to discern between legitimate usage and malicious attempts to map network resources by monitoring who executed the command and for what purpose.
  ### Investigation Steps
  - Validate the originating user account by cross-referencing the logs with User Activity Monitoring data to ensure that the command was not executed by a compromised account.
  - Use EDR tools to review the timeline of process execution, looking for any signs of suspicious activity before or after the "net.exe" command was run, including other abnormal command-line executions.
  - Check network logs for any unexpected communication patterns or connections to systems accessed using the enumerated shares, which could indicate lateral movement or data access.
  - Assess the legitimacy of the command's usage within the context of the user's role and normal activity patterns seen for that account, considering if this activity aligns with their business functions.
