title: Use of FSharp Interpreters
id: b96b2031-7c17-4473-afe7-a30ce714db29
status: test
description: |
  Detects the execution of FSharp Interpreters "FsiAnyCpu.exe" and "FSi.exe"
  Both can be used for AWL bypass and to execute F# code via scripts or inline.
references:
- https://learn.microsoft.com/en-us/windows/security/application-security/application-control/windows-defender-application-control/design/applications-that-can-bypass-wdac
- https://bohops.com/2020/11/02/exploring-the-wdac-microsoft-recommended-block-rules-part-ii-wfc-fsi/
- https://lolbas-project.github.io/lolbas/OtherMSBinaries/FsiAnyCpu/
- https://lolbas-project.github.io/lolbas/OtherMSBinaries/Fsi/
author: Christopher Peacock @SecurePeacock, SCYTHE @scythe_io
date: 2022-06-02
modified: 2024-04-23
tags:
- attack.execution
- attack.t1059
logsource:
  category: process_creation
  product: windows
detection:
  selection:
  - Image|endswith:
    - '\fsi.exe'
    - '\fsianycpu.exe'
  - OriginalFileName:
    - 'fsi.exe'
    - 'fsianycpu.exe'
  condition: selection
falsepositives:
- Legitimate use by a software developer.
level: medium
notes: |
  ### Technical Context
  This detection rule focuses on identifying the execution of FSharp interpreters, specifically "FsiAnyCpu.exe" and "FSi.exe". These executables are known to be used for executing F# code, including potential scripts that may bypass application whitelisting controls. The rule monitors process creation logs for instances where these specific binaries are executed, analyzing both the image path and the original file name. When these files are run, it may indicate either a legitimate programming activity or an attempt by threat actors to execute harmful scripts, making it crucial for SOC analysts to distinguish benign usage from malicious behaviors leveraging these tools.
  ### Investigation Steps
  - Check EDR logs for additional context on the execution, including the user account and parent processes that initiated the FSharp interpreters.
  - Investigate network activity related to the timestamps of the process creation to identify any unusual outbound connections or data exfiltration attempts tracked by NDR or firewall logs.
  - Review any command-line arguments passed during the execution of "FsiAnyCpu.exe" or "FSi.exe" to ascertain the intent and nature of the executed scripts.
  - Correlate findings with cloud platform logs (e.g., AWS CloudTrail, GCP Activity Logs) if applicable, to identify any related actions in cloud environments that could indicate a broader attack campaign.
