title: PUA - Suspicious ActiveDirectory Enumeration Via AdFind.EXE
id: 455b9d50-15a1-4b99-853f-8d37655a4c1b
related:
- id: 9a132afa-654e-11eb-ae93-0242ac130002
  type: similar
status: test
description: Detects active directory enumeration activity using known AdFind CLI
  flags
references:
- https://www.joeware.net/freetools/tools/adfind/
- https://social.technet.microsoft.com/wiki/contents/articles/7535.adfind-command-examples.aspx
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1087.002/T1087.002.md
author: frack113
date: 2021-12-13
modified: 2023-03-05
tags:
- attack.discovery
- attack.t1087.002
logsource:
  product: windows
  category: process_creation
detection:
  selection_password:   # Listing password policy
    CommandLine|contains:
    - lockoutduration
    - lockoutthreshold
    - lockoutobservationwindow
    - maxpwdage
    - minpwdage
    - minpwdlength
    - pwdhistorylength
    - pwdproperties
  selection_enum_ad:   # Enumerate Active Directory Admins
    CommandLine|contains: '-sc admincountdmp'
  selection_enum_exchange:   # Enumerate Active Directory Exchange AD Objects
    CommandLine|contains: '-sc exchaddresses'
  condition: 1 of selection_*
falsepositives:
- Authorized administrative activity
level: high
notes: |
  ### Technical Context
  This Sigma rule detects suspicious enumeration activities against Active Directory (AD) using the AdFind utility, a command-line tool often misused to extract sensitive information from AD. It specifically looks for certain command-line arguments associated with the AdFind tool, such as those that query password policies and Active Directory administration accounts or that retrieve Exchange-related AD objects. By monitoring the process creation logs on Windows systems, particularly focusing on the CommandLine field, this rule identifies potential reconnaissance activities that may indicate an attacker is attempting to gather information about user policies and administrative accounts within the organization's Active Directory environment.
  ### Investigation Steps
  - Review alerts for instances of the AdFind.exe process being executed and examine the associated command-line arguments in the EDR logs to identify any suspicious patterns or parameters. 
  - Cross-reference the time of the alert with user activity logs from Active Directory to determine if the process was initiated by authorized personnel.
  - Check Proxy and VPN logs for any unusually high access from users who are not expected to query Active Directory, as this could indicate a compromised account.
  - Analyze network traffic through NDR tools to see if there are any external connections established following the AD enumeration, which could suggest data exfiltration or further malicious actions.
