title: Suspicious Download From File-Sharing Website Via Bitsadmin
id: 8518ed3d-f7c9-4601-a26c-f361a4256a0c
status: experimental
description: Detects usage of bitsadmin downloading a file from a suspicious domain
references:
- https://blog.netspi.com/15-ways-to-download-a-file/#bitsadmin
- https://isc.sans.edu/diary/22264
- https://lolbas-project.github.io/lolbas/Binaries/Bitsadmin/
- https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/ransomware-hive-conti-avoslocker
- https://www.cisa.gov/uscert/ncas/alerts/aa22-321a
- https://www.microsoft.com/en-us/security/blog/2024/01/17/new-ttps-observed-in-mint-sandstorm-campaign-targeting-high-profile-individuals-at-universities-and-research-orgs/
author: Florian Roth (Nextron Systems)
date: 2022-06-28
modified: 2024-08-22
tags:
- attack.defense-evasion
- attack.persistence
- attack.t1197
- attack.s0190
- attack.t1036.003
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: '\bitsadmin.exe'
  - OriginalFileName: 'bitsadmin.exe'
  selection_flags:
    CommandLine|contains:
    - ' /transfer '
    - ' /create '
    - ' /addfile '
  selection_domain:
    CommandLine|contains:
    - '.githubusercontent.com'               # Includes both gists and github repositories / Michael Haag (idea)
    - 'anonfiles.com'
    - 'cdn.discordapp.com'
    - 'ddns.net'
    - 'dl.dropboxusercontent.com'
    - 'ghostbin.co'
    - 'glitch.me'
    - 'gofile.io'
    - 'hastebin.com'
    - 'mediafire.com'
    - 'mega.nz'
    - 'onrender.com'
    - 'pages.dev'
    - 'paste.ee'
    - 'pastebin.com'
    - 'pastebin.pl'
    - 'pastetext.net'
    - 'privatlab.com'
    - 'privatlab.net'
    - 'send.exploit.in'
    - 'sendspace.com'
    - 'storage.googleapis.com'
    - 'storjshare.io'
    - 'supabase.co'
    - 'temp.sh'
    - 'transfer.sh'
    - 'trycloudflare.com'
    - 'ufile.io'
    - 'w3spaces.com'
    - 'workers.dev'
  condition: all of selection_*
falsepositives:
- Some legitimate apps use this, but limited.
level: high
notes: |
  ### Technical Context
  This Sigma rule is designed to detect potentially malicious activity involving the Windows command-line tool `bitsadmin.exe`, which can be misused to download files from suspicious domains. Specifically, the rule identifies process creation events where `bitsadmin.exe` is invoked with command-line arguments typically associated with file transfers, such as `/transfer`, `/create`, and `/addfile`. The detection leverages log data from process creation events, scrutinizing both the command-line parameters and the domains involved in the file transfer to flag activity that may indicate a download from a known repository of malware or other malicious files. By focusing on specific suspicious domains, this rule aims to mitigate risks associated with file-sharing sites commonly exploited for distributing harmful content.
  ### Investigation Steps
  - Review the process creation logs in your EDR to identify instances where `bitsadmin.exe` has been executed along with the specified command-line parameters. Look for unusual execution contexts or user accounts.
  - Correlate the alert with logs from your proxy server to determine if there was network activity involving the domains listed in the Sigma rule around the time of `bitsadmin.exe` execution.
  - Utilize your threat intelligence sources to assess the reputation of the domains identified in the command-line arguments. Investigate any known associations with malicious activity.
  - Assess the impacted endpoints using your AV solution to scan for any potential malware or suspicious files downloaded during the identified events. This step is vital to prevent further compromise.
