title: HackTool - CrackMapExec Execution
id: 42a993dd-bb3e-48c8-b372-4d6684c4106c
status: test
description: This rule detect common flag combinations used by CrackMapExec in order
  to detect its use even if the binary has been replaced.
references:
- https://mpgn.gitbook.io/crackmapexec/smb-protocol/authentication/checking-credentials-local
- https://www.mandiant.com/resources/telegram-malware-iranian-espionage
- https://www.infosecmatter.com/crackmapexec-module-library/?cmem=mssql-mimikatz
- https://www.infosecmatter.com/crackmapexec-module-library/?cmem=smb-pe_inject
author: Florian Roth (Nextron Systems)
date: 2022-02-25
modified: 2023-03-08
tags:
- attack.execution
- attack.persistence
- attack.privilege-escalation
- attack.credential-access
- attack.discovery
- attack.t1047
- attack.t1053
- attack.t1059.003
- attack.t1059.001
- attack.t1110
- attack.t1201
logsource:
  category: process_creation
  product: windows
detection:
  selection_binary:
    Image|endswith: '\crackmapexec.exe'
  selection_special:
    CommandLine|contains: ' -M pe_inject '
  selection_execute:
    CommandLine|contains|all:
    - ' --local-auth'
    - ' -u '
    - ' -x '
  selection_hash:
    CommandLine|contains|all:
    - ' --local-auth'
    - ' -u '
    - ' -p '
    - " -H 'NTHASH'"
  selection_module_mssql:
    CommandLine|contains|all:
    - ' mssql '
    - ' -u '
    - ' -p '
    - ' -M '
    - ' -d '
  selection_module_smb1:
    CommandLine|contains|all:
    - ' smb '
    - ' -u '
    - ' -H '
    - ' -M '
    - ' -o '
  selection_module_smb2:
    CommandLine|contains|all:
    - ' smb '
    - ' -u '
    - ' -p '
    - ' --local-auth'
  part_localauth_1:
    CommandLine|contains|all:
    - ' --local-auth'
    - ' -u '
    - ' -p '
  part_localauth_2:
    CommandLine|contains|all:
    - ' 10.'
    - ' 192.168.'
    - '/24 '
  condition: 1 of selection_* or all of part_localauth*
fields:
- ComputerName
- User
- CommandLine
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This Sigma rule aims to detect potential unauthorized use of CrackMapExec, a popular post-exploitation tool that attackers often leverage for lateral movement and credential harvesting within Windows environments. The rule monitors process creation events, specifically looking for the execution of `crackmapexec.exe` and various command-line flags commonly associated with the tool's operation. By inspecting parameters that indicate local authentication methods, remote command execution against network shares, and database interactions, this rule can identify misuse scenarios even if the binary itself has been modified or replaced. The data sources utilized in this detection include process creation logs, focusing on attributes such as command line arguments and the executable's name.
  ### Investigation Steps
  - Review the EDR logs for instances of `crackmapexec.exe` being executed, particularly focusing on the associated command-line parameters to assess the context of execution.
  - Search for related activity in the SIEM, analyzing abnormal user or computer behavior during the timeframe in which the tool was detected.
  - Investigate network logs through the NGFW or NDR systems to determine if there was any unusual traffic pattern or connections made to known malicious IPs.
  - Consult any relevant Proxy and cloud logs to see if there were attempts to access unusual resources or initiate command execution that corresponds with the flagged activity.
