title: Suspicious Rundll32 Activity Invoking Sys File
id: 731231b9-0b5d-4219-94dd-abb6959aa7ea
status: test
description: Detects suspicious process related to rundll32 based on command line
  that includes a *.sys file as seen being used by UNC2452
references:
- https://www.microsoft.com/security/blog/2021/03/04/goldmax-goldfinder-sibot-analyzing-nobelium-malware/
author: Florian Roth (Nextron Systems)
date: 2021-03-05
modified: 2022-10-09
tags:
- attack.defense-evasion
- attack.t1218.011
logsource:
  category: process_creation
  product: windows
detection:
  selection1:
    CommandLine|contains: 'rundll32.exe'
  selection2:
    CommandLine|contains:
    - '.sys,'
    - '.sys '
  condition: all of selection*
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This Sigma rule is designed to detect potentially malicious activity involving the Windows `rundll32.exe` process, particularly when it uses `.sys` files. `rundll32.exe` is a legitimate Windows utility that allows for the execution of DLLs, but it can be exploited by attackers to run malicious payloads disguised as system files. This rule looks for command-line arguments containing both `rundll32.exe` and references to `.sys` file extensions, which are commonly used to load kernel-mode drivers. Such combinations can indicate attempts to invoke malicious drivers, a tactic associated with advanced persistent threats like the UNC2452 group.
  The detection process relies on monitoring process creation logs from Windows systems. If the command-line arguments match the specified patterns, an alert is triggered, indicating potentially suspicious activity that should be further examined by SOC analysts.
  ### Investigation Steps
  - Use the EDR tool to retrieve process creation logs around the time of the alert to identify the context and parent processes associated with the invocation of `rundll32.exe`.
  - Examine the command-line parameters, specifically focusing on any `.sys` file references, to determine the legitimacy of the invoked files and their digital signatures.
  - Check the network activity logs via the NDR or firewalls to see if there are any suspicious outbound connections made by the affected system around the alert timeframe.
  - Review any relevant AV logs for detections related to the `.sys` files in question, as well as any related file or process quarantines that may indicate prior malicious activity.
