title: Suspicious File Execution From Internet Hosted WebDav Share
id: f0507c0f-a3a2-40f5-acc6-7f543c334993
status: test
description: Detects the execution of the "net use" command to mount a WebDAV server
  and then immediately execute some content in it. As seen being used in malicious
  LNK files
references:
- https://twitter.com/ShadowChasing1/status/1552595370961944576
- https://www.virustotal.com/gui/file/a63376ee1dba76361df73338928e528ca5b20171ea74c24581605366dcaa0104/behavior
author: pH-T (Nextron Systems)
date: 2022-09-01
modified: 2023-02-21
tags:
- attack.execution
- attack.t1059.001
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|contains: '\cmd.exe'
  - OriginalFileName: 'Cmd.EXE'
  selection_base:
    CommandLine|contains|all:
    - ' net use http'
    - '& start /b '
    - '\DavWWWRoot\'
  selection_ext:
    CommandLine|contains:
    - '.exe '
    - '.dll '
    - '.bat '
    - '.vbs '
    - '.ps1 '
  condition: all of selection_*
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This detection rule is designed to identify suspicious behavior associated with the execution of the `net use` command for mounting a WebDAV server in a Windows environment. The rule triggers when the `cmd.exe` process is utilized to execute a command that maps a network drive using an HTTP protocol and then attempts to execute a file from the mounted location. The focus is on the command line parameters, specifically detecting patterns that indicate malicious intents, such as executing various file types (e.g., executable, script, or batch files) immediately after the mount operation. The primary data sources for this detection are process creation logs, which capture the command-line arguments of the initiated processes along with relevant metadata.
  ### Investigation Steps
  - Investigate the process creation logs in the EDR for instances of `cmd.exe` that contain the `net use` command. Check the timestamps and associated user accounts to assess the context of the command execution.
  - Examine the command-line arguments to identify any attached URLs or file paths that were accessed after mounting the WebDAV share. This can help determine the legitimacy of the file being executed.
  - Utilize cloud platform logs (if applicable) to trace any related activities or connections to external WebDAV servers. Note any unusual patterns or frequent access from unexpected geographic locations.
  - Review antivirus logs to see if the executed files triggered any alerts or detections. Correlate this information with the process creation events to gauge potential risks.
