title: Use Short Name Path in Command Line
id: 349d891d-fef0-4fe4-bc53-eee623a15969
related:
- id: a96970af-f126-420d-90e1-d37bf25e50e1
  type: similar
status: test
description: Detect use of the Windows 8.3 short name. Which could be used as a method
  to avoid command-line detection
references:
- https://www.acunetix.com/blog/articles/windows-short-8-3-filenames-web-security-problem/
- https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-2000-server/cc959352(v=technet.10)
- https://twitter.com/frack113/status/1555830623633375232
author: frack113, Nasreddine Bencherchali
date: 2022-08-07
modified: 2022-10-26
tags:
- attack.defense-evasion
- attack.t1564.004
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|contains:
    - '~1\'
    - '~2\'
  filter:
  - ParentImage:
    - 'C:\Windows\System32\Dism.exe'
    - 'C:\Windows\System32\cleanmgr.exe'
    - 'C:\Program Files\GPSoftware\Directory Opus\dopus.exe'
  - ParentImage|endswith:
    - '\WebEx\WebexHost.exe'
    - '\thor\thor64.exe'
    - '\veam.backup.shell.exe'
    - '\winget.exe'
    - '\Everything\Everything.exe'
  - ParentImage|contains: '\AppData\Local\Temp\WinGet\'
  - CommandLine|contains:
    - '\appdata\local\webex\webex64\meetings\wbxreport.exe'
    - 'C:\Program Files\Git\post-install.bat'
    - 'C:\Program Files\Git\cmd\scalar.exe'
  condition: selection and not filter
falsepositives:
- Applications could use this notation occasionally which might generate some false
  positives. In that case investigate the parent and child process.
level: medium
notes: |
  ### Technical Context
  This detection rule identifies the use of Windows 8.3 short filenames in command-line executions, which can be a tactic used to bypass security monitoring tools. The rule specifically looks for command-line arguments containing the notation `~1\` or `~2\`, indicating the presence of short file names. The rule evaluates not only the command-line arguments but also correlates these with the parent processes that initiated them, filtering out common applications that may legitimately use short names. Data sources involved include process creation logs that capture details about command-line executions and their parent processes, allowing the SOC to effectively flag potentially malicious activity that leverages this evasion technique.
  ### Investigation Steps
  - Utilize the EDR solution to investigate the specific process and its command-line arguments associated with the alert, focusing on the presence of short names.
  - Cross-reference the detected command with the parent processes identified in the alerts to determine if they are known, trusted applications or potentially malicious.
  - Review web access logs through the proxy to see if any related URLs or domains were accessed during the time of the alert, which may provide context for the activity.
  - Examine additional telemetry from the affected endpoints, such as network connections or file changes, using NDR and file integrity monitoring tools to gain further insights into suspicious behavior.
