title: RestrictedAdminMode Registry Value Tampering - ProcCreation
id: 28ac00d6-22d9-4a3c-927f-bbd770104573
related:
- id: d6ce7ebd-260b-4323-9768-a9631c8d4db2     # Registry
  type: similar
status: test
description: |
  Detects changes to the "DisableRestrictedAdmin" registry value in order to disable or enable RestrictedAdmin mode.
  RestrictedAdmin mode prevents the transmission of reusable credentials to the remote system to which you connect using Remote Desktop.
  This prevents your credentials from being harvested during the initial connection process if the remote server has been compromise
references:
- https://github.com/redcanaryco/atomic-red-team/blob/a8e3cf63e97b973a25903d3df9fd55da6252e564/atomics/T1112/T1112.md
- https://social.technet.microsoft.com/wiki/contents/articles/32905.remote-desktop-services-enable-restricted-admin-mode.aspx
- https://thedfirreport.com/2022/05/09/seo-poisoning-a-gootloader-story/
author: frack113
date: 2023-01-13
modified: 2023-12-15
tags:
- attack.defense-evasion
- attack.t1112
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    CommandLine|contains|all:
    - '\System\CurrentControlSet\Control\Lsa\'
    - 'DisableRestrictedAdmin'
  condition: selection
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This Sigma rule is designed to detect unauthorized changes to the "DisableRestrictedAdmin" registry value within a Windows environment. Specifically, it monitors process creation events for command lines that reference the "DisableRestrictedAdmin" registry path in conjunction with any attempts to modify its value. RestrictedAdmin mode is an important security feature that prevents the transmission of reusable credentials when using Remote Desktop, mitigating the risk of credential harvesting during connections to potentially compromised servers. By tracking these registry modifications, the rule aims to identify possible attempts at disabling this critical security setting, which could indicate malicious behavior or an insider threat.
  The primary data source for this detection is process creation logs. These logs capture command-line executions that interact with the Windows registry, allowing the Security Operations Center (SOC) to identify potentially harmful activities suggesting an attempt to alter security configurations.
  ### Investigation Steps
  - Review the specific process creation logs using your EDR tool to identify the context and user initiating the registry changes. Look for processes that are not typically associated with legitimate administrative tasks.
  - Check the timeline of changes to the "DisableRestrictedAdmin" registry value in the Windows registry to verify if they align with any unauthorized access or suspicious user activity.
  - Correlate findings with user activity logs from your SIEM to ascertain if the user initiating the change had legitimate administrative privileges or access.
  - Investigate any network connections made by the affected systems during the timeframe of the registry modifications using NDR or firewall logs to identify if there were any unusual outbound connections or potential command and control activity.
