title: Windows Processes Suspicious Parent Directory
id: 96036718-71cc-4027-a538-d1587e0006a7
status: test
description: Detect suspicious parent processes of well-known Windows processes
references:
- https://web.archive.org/web/20180718061628/https://securitybytes.io/blue-team-fundamentals-part-two-windows-processes-759fe15965e2
- https://www.carbonblack.com/2014/06/10/screenshot-demo-hunt-evil-faster-than-ever-with-carbon-black/
- https://www.13cubed.com/downloads/windows_process_genealogy_v2.pdf
author: vburov
date: 2019-02-23
modified: 2022-02-14
tags:
- attack.defense-evasion
- attack.t1036.003
- attack.t1036.005
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith:
    - '\svchost.exe'
    - '\taskhost.exe'
    - '\lsm.exe'
    - '\lsass.exe'
    - '\services.exe'
    - '\lsaiso.exe'
    - '\csrss.exe'
    - '\wininit.exe'
    - '\winlogon.exe'
  filter_sys:
  - ParentImage|endswith:
    - '\SavService.exe'
    - '\ngen.exe'
  - ParentImage|contains:
    - '\System32\'
    - '\SysWOW64\'
  filter_msmpeng:
    ParentImage|contains:
    - '\Windows Defender\'
    - '\Microsoft Security Client\'
    ParentImage|endswith: '\MsMpEng.exe'
  filter_null:
  - ParentImage:
  - ParentImage: '-'
  condition: selection and not 1 of filter_*
falsepositives:
- Some security products seem to spawn these
level: low
notes: |
  ### Technical Context
  This Sigma rule identifies potentially malicious behavior by monitoring the parent processes of well-known Windows system processes, such as `svchost.exe` and `lsass.exe`. The primary goal is to detect when these system processes are spawned by suspicious or unexpected parent processes, which could indicate an attempt to evade detection or execute harmful actions. The rule specifically looks for certain known processes as parents, including `SavService.exe` and `ngen.exe`, as well as examining the directory paths of parent images to ascertain if they originate from legitimate Windows directories like `System32` or `SysWOW64`. The detection mechanism relies on process creation logs, which capture vital information about process invocations, ensuring visibility into any anomalies in process hierarchies that may suggest malicious activities.
  ### Investigation Steps
  - Review the process creation logs in the EDR solution to confirm the execution and parent-child relationships of the detected processes implicated in the alert.
  - Use the SIEM to correlate alerts with other security events happening within the same timeframe, providing context to the potentially suspicious activity identified.
  - Investigate the parent processes listed in the alert for any known vulnerabilities or associations with malware by querying threat intelligence databases or security product indicators.
  - Conduct a deeper analysis on the endpoint using AV solutions to perform scans on the affected files and processes to determine if any malware or unwanted software is present.
