title: Potential WinAPI Calls Via CommandLine
id: ba3f5c1b-6272-4119-9dbd-0bc8d21c2702
related:
- id: 03d83090-8cba-44a0-b02f-0b756a050306
  type: derived
status: test
description: Detects the use of WinAPI Functions via the commandline. As seen used
  by threat actors via the tool winapiexec
references:
- https://twitter.com/m417z/status/1566674631788007425
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-09-06
modified: 2023-01-09
tags:
- attack.execution
- attack.t1106
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|contains:
    - 'AddSecurityPackage'
    - 'AdjustTokenPrivileges'
    - 'Advapi32'
    - 'CloseHandle'
    - 'CreateProcessWithToken'
    - 'CreatePseudoConsole'
    - 'CreateRemoteThread'
    - 'CreateThread'
    - 'CreateUserThread'
    - 'DangerousGetHandle'
    - 'DuplicateTokenEx'
    - 'EnumerateSecurityPackages'
    - 'FreeHGlobal'
    - 'FreeLibrary'
    - 'GetDelegateForFunctionPointer'
    - 'GetLogonSessionData'
    - 'GetModuleHandle'
    - 'GetProcAddress'
    - 'GetProcessHandle'
    - 'GetTokenInformation'
    - 'ImpersonateLoggedOnUser'
    - 'kernel32'
    - 'LoadLibrary'
    - 'memcpy'
    - 'MiniDumpWriteDump'
            # - 'msvcrt'
    - 'ntdll'
    - 'OpenDesktop'
    - 'OpenProcess'
    - 'OpenProcessToken'
    - 'OpenThreadToken'
    - 'OpenWindowStation'
    - 'PtrToString'
    - 'QueueUserApc'
    - 'ReadProcessMemory'
    - 'RevertToSelf'
    - 'RtlCreateUserThread'
    - 'secur32'
    - 'SetThreadToken'
            # - 'user32'
    - 'VirtualAlloc'
    - 'VirtualFree'
    - 'VirtualProtect'
    - 'WaitForSingleObject'
    - 'WriteInt32'
    - 'WriteProcessMemory'
    - 'ZeroFreeGlobalAllocUnicode'
  filter_optional_mpcmdrun:
    Image|endswith: '\MpCmdRun.exe'
    CommandLine|contains: 'GetLoadLibraryWAddress32'
  condition: selection and not 1 of filter_optional_*
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This Sigma rule is designed to detect suspicious command-line activity associated with the execution of WinAPI functions, which may indicate malicious behavior among threat actors. Specifically, it looks for the presence of specific WinAPI function calls or related terms in the command line of process creation logs. The rule focuses on processes executing Windows API functions like `CreateProcessWithToken`, `OpenProcess`, and `WriteProcessMemory`, which are often used by malware to manipulate system resources or operate covertly. Data sources involved in this detection include process creation logs, typically captured by endpoints utilizing Windows operating systems.
  Triggered alerts from this rule can suggest attempts to execute processes that interact with core Windows functionalities, potentially indicative of lateral movement, privilege escalation, or other types of attacks leveraging the WinAPI. By monitoring these function calls, SOC analysts can identify unusual behavior that may warrant further investigation into potential security incidents.
  ### Investigation Steps
  - Utilize your EDR solution to review the process creation logs for any alerts tied to the identified WinAPI function calls in the command line.
  - Cross-reference the user accounts involved in this suspicious command-line activity against logs from AD or other user management systems to determine if the actions align with legitimate user behavior.
  - Investigate network communications associated with the affected process using NDR tools to identify potential command-and-control callbacks or data exfiltration attempts.
  - Analyze relevant AV and NGFW logs to check for any known malicious signatures or patterns related to the command line inputs observed in this alert.
