title: Sensitive File Recovery From Backup Via Wbadmin.EXE
id: 84972c80-251c-4c3a-9079-4f00aad93938
related:
- id: 6fe4aa1e-0531-4510-8be2-782154b73b48
  type: derived
status: experimental
description: |
  Detects the dump of highly sensitive files such as "NTDS.DIT" and "SECURITY" hive.
  Attackers can leverage the "wbadmin" utility in order to dump sensitive files that might contain credential or sensitive information.
references:
- https://github.com/LOLBAS-Project/LOLBAS/blob/2cc01b01132b5c304027a658c698ae09dd6a92bf/yml/OSBinaries/Wbadmin.yml
- https://lolbas-project.github.io/lolbas/Binaries/Wbadmin/
- https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/wbadmin-start-recovery
- https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/wbadmin-start-backup
author: Nasreddine Bencherchali (Nextron Systems), frack113
date: 2024-05-10
tags:
- attack.credential-access
- attack.t1003.003
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: '\wbadmin.exe'
  - OriginalFileName: 'WBADMIN.EXE'
  selection_backup:
    CommandLine|contains|all:
    - ' recovery'
    - 'recoveryTarget'
    - 'itemtype:File'
    CommandLine|contains:
    - '\config\SAM'
    - '\config\SECURITY'
    - '\config\SYSTEM'
    - '\Windows\NTDS\NTDS.dit'
  condition: all of selection_*
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This detection rule identifies potentially malicious use of the `wbadmin.exe` utility, a legitimate tool on Windows systems that facilitates backup and recovery operations. Attackers can exploit this utility to extract sensitive files, such as the NTDS.DIT, which contains Active Directory data, or the SECURITY hive, which holds user credential information. The rule specifically watches for process creation events where `wbadmin.exe` is invoked with command-line parameters that indicate recovery of sensitive files, focusing on configurations that typically store sensitive data. The primary data sources leveraged for this detection include process creation logs, which capture the execution of processes along with their command-line arguments.
  ### Investigation Steps
  - Examine process creation logs in your EDR tool for any instances of `wbadmin.exe` running with the specified command-line parameters. This will help identify unauthorized backup or recovery attempts.
  - Query the AV and NGFW logs for any signals related to unusual outbound connections or file access patterns that may stem from the use of sensitive files being extracted.
  - Review Windows event logs, particularly Event ID 4663, which can provide insights into attempts to access sensitive file locations like `\config\SAM` or `\Windows\NTDS\NTDS.dit`.
  - Analyze history in cloud platforms, such as AWS CloudTrail or Azure Activity Logs, for any recent changes or suspicious activities correlated with the timing of the detected `wbadmin.exe` executions.
