title: Potential Reconnaissance Activity Via GatherNetworkInfo.VBS
id: 575dce0c-8139-4e30-9295-1ee75969f7fe
related:
- id: f92a6f1e-a512-4a15-9735-da09e78d7273     # FileCreate
  type: similar
- id: 07aa184a-870d-413d-893a-157f317f6f58     # ProcCreation Susp
  type: similar
status: test
description: Detects execution of the built-in script located in "C:\Windows\System32\gatherNetworkInfo.vbs".
  Which can be used to gather information about the target machine
references:
- https://posts.slayerlabs.com/living-off-the-land/#gathernetworkinfovbs
- https://www.mandiant.com/resources/blog/trojanized-windows-installers-ukrainian-government
author: blueteamer8699
date: 2022-01-03
modified: 2023-02-08
tags:
- attack.discovery
- attack.execution
- attack.t1615
- attack.t1059.005
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith:
    - '\cscript.exe'
    - '\wscript.exe'
  - OriginalFileName:
    - 'cscript.exe'
    - 'wscript.exe'
  selection_cli:
    CommandLine|contains: 'gatherNetworkInfo.vbs'
  condition: all of selection_*
falsepositives:
- Administrative activity
level: medium
notes: |
  ### Technical Context
  This Sigma rule is designed to identify potential reconnaissance activity via the execution of the built-in Windows script `gatherNetworkInfo.vbs`, located in the `C:\Windows\System32` directory. The script is typically invoked through legitimate Windows scripting engines, specifically `cscript.exe` or `wscript.exe`, which are both capable of running VBS scripts. When executed, the script can gather information about the target machine, including network configurations and connected devices, making it a useful tool for attackers during the reconnaissance phase of an attack. The rule monitors process creation logs, looking for specific command-line parameters that indicate the script's invocation alongside associated process information to detect unauthorized or suspicious usage of these scripting tools.
  ### Investigation Steps
  - Utilize the EDR tool to identify recent executions of `cscript.exe` or `wscript.exe`, and check for command-line parameters associated with `gatherNetworkInfo.vbs`.
  - Review process tree and parent-child relationships in the EDR logs to identify any unusual execution patterns or processes initiating the script.
  - Investigate any corresponding network connections using the NDR to determine if the machine was attempting to connect to unfamiliar IP addresses during or after the execution.
  - Check the SIEM or other log sources for correlated events and alerts around the same timeframe, looking for signs of lateral movement or other suspicious activities following the execution.
