title: Process Memory Dump via RdrLeakDiag.EXE
id: edadb1e5-5919-4e4c-8462-a9e643b02c4b
related:
- id: 6355a919-2e97-4285-a673-74645566340d
  type: obsolete
status: test
description: Detects the use of the Microsoft Windows Resource Leak Diagnostic tool
  "rdrleakdiag.exe" to dump process memory
references:
- https://www.pureid.io/dumping-abusing-windows-credentials-part-1/
- https://www.crowdstrike.com/blog/overwatch-exposes-aquatic-panda-in-possession-of-log-4-shell-exploit-tools/
- https://lolbas-project.github.io/lolbas/Binaries/Rdrleakdiag/
- https://twitter.com/0gtweet/status/1299071304805560321?s=21
- https://news.sophos.com/en-us/2024/06/05/operation-crimson-palace-a-technical-deep-dive
author: Cedric MAURUGEON, Florian Roth (Nextron Systems), Swachchhanda Shrawan Poudel,
  Nasreddine Bencherchali (Nextron Systems)
date: 2021-09-24
modified: 2024-08-15
tags:
- attack.credential-access
- attack.t1003.001
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: '\rdrleakdiag.exe'
  - OriginalFileName: RdrLeakDiag.exe
  selection_cli_dump:
    CommandLine|contains|windash:
    - '/memdmp'
    - 'fullmemdmp'
  selection_cli_output_process:
    CommandLine|contains|windash:
    - ' /o '         # Output
    - ' /p '         # Process
  condition: all of selection_*
falsepositives:
- Unlikely
level: high
notes: |
  ### Technical Context
  The detection rule targets the Microsoft Windows Resource Leak Diagnostic tool, `rdrleakdiag.exe`, specifically monitoring its use for dumping process memory. This is significant as unauthorized memory dumps can expose sensitive data, including credentials, and enable attackers to gain deeper access into systems. The rule evaluates process creation logs to identify instances where `rdrleakdiag.exe` is executed with command-line parameters indicative of memory dumping activities, specifically `'/memdmp'` and `'/fullmemdmp'`. It also looks for command-line parameters that specify output files and target processes, further refining detections to moments when elevated privileges may be misused. The rule aligns with the MITRE ATT&CK framework, specifically under the tactic of Credential Access and the technique T1003.001, positioning it as a crucial indicator of potential credential theft.
  ### Investigation Steps
  - **Check EDR Alerts:** Review endpoint detection and response alerts related to `rdrleakdiag.exe` for potential anomalies in execution patterns and associated process behaviors.
  - **Correlate with Windows Event Logs:** Investigate Windows Security event logs for any unusual login activity or privilege escalations correlated with the time the memory dump command was executed.
  - **Analyze Network Traffic:** Use network detection tools to examine outbound connections or suspicious data transfers occurring in conjunction with the `rdrleakdiag.exe` execution. Look for any unusual or unauthorized communication.
  - **Review Process Tree:** Utilize endpoint tools to assess the process tree for `rdrleakdiag.exe`, ensuring to examine parent and child processes to identify if additional malicious activity is associated with the memory dump execution.
  ### Prioritization
  The high severity level of this alert is attributed to the potential for serious data breaches, as the misuse of memory dumping tools can lead to the extraction of sensitive information, including credentials, thereby posing a critical threat to enterprise security.
  ### Blind Spots and Assumptions
  This rule may not fire if `rdrleakdiag.exe` is executed in unusual ways or under different naming conventions or if command-line parameters are obfuscated. Additionally, environments with stringent application whitelisting may prevent the execution of this tool altogether, masking activity. It assumes the presence of process creation logs and may fail in environments with limited logging capabilities. Adversaries can circumvent detection by renaming the executable or utilizing different tools altogether for similar malicious purposes which remain undetected.
  > **Disclaimer:** This investigation guide was created using generative AI technology and has not been reviewed for its accuracy and relevance. While every effort has been made to ensure its quality, we recommend validating the content and adapting it to suit specific environment and operational needs. Please communicate any changes to the detection engineering team.
