title: Suspicious DLL Loaded via CertOC.EXE
id: 84232095-ecca-4015-b0d7-7726507ee793
related:
- id: 242301bc-f92f-4476-8718-78004a6efd9f
  type: similar
status: test
description: Detects when a user installs certificates by using CertOC.exe to load
  the target DLL file.
references:
- https://twitter.com/sblmsrsn/status/1445758411803480072?s=20
- https://github.com/elastic/protections-artifacts/commit/746086721fd385d9f5c6647cada1788db4aea95f#diff-fe98e74189873d6df72a15df2eaa0315c59ba9cdaca93ecd68afc4ea09194ef2
- https://lolbas-project.github.io/lolbas/Binaries/Certoc/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023-02-15
modified: 2024-03-05
tags:
- attack.defense-evasion
- attack.t1218
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: '\certoc.exe'
  - OriginalFileName: 'CertOC.exe'
  selection_cli:
    CommandLine|contains|windash: ' -LoadDLL '
  selection_paths:
    CommandLine|contains:
    - '\Appdata\Local\Temp\'
    - '\Desktop\'
    - '\Downloads\'
    - '\Users\Public\'
    - 'C:\Windows\Tasks\'
    - 'C:\Windows\Temp\'
  condition: all of selection_*
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This detection rule flags instances when potentially malicious Dynamic Link Libraries (DLLs) are loaded using CertOC.exe, a utility commonly used for installing certificates. The rule revolves around process creation logs, particularly looking for instances where the command line includes the parameter "-LoadDLL" along with specific pathways indicative of suspicious behavior, such as the user's temporary files, desktop, and download directories. The presence of CertOC.exe in the command line signifies an intent to modify the certificate store, and when combined with the loading of an unusual DLL, this denotes potential evasion tactics being employed by attackers. This activity is aligned with the MITRE ATT&CK technique T1218 (Signed Binary Proxy Execution), which highlights the misuse of legitimate tools to evade defense mechanisms.
  ### Investigation Steps
  - **Check Process Creation Logs:** Review logs for instances of CertOC.exe being called with the "-LoadDLL" argument to verify the context of usage.
  - **Examine Command Line Parameters:** Investigate the command line details associated with the CertOC.exe instances to determine the specific DLL being loaded and its source path.
  - **Analyze the Loaded DLL:** Identify the loaded DLL's hash and source by cross-referencing it with known threat intelligence databases to assess its legitimacy.
  - **Assess User Behavior:** Look at the user’s activity before and after the usage of CertOC.exe, checking for any harmful trends or anomalies like accessing unusual applications or systems.
  ### Prioritization
  Given the high severity level of this alert, it suggests that this behavior could indicate an ongoing or imminent evasion technique being employed by an adversary, which warrants immediate investigation to prevent further exploitation.
  ### Blind spots and Assumptions
  This rule may not fire if the attacker employs obfuscation techniques that alter the command line parameters or utilizes legitimate tools that do not match the specified criteria. Additionally, if CertOC.exe is executed with different parameters or in safe environments without malicious intent, false positives could occur. It is assumed that the operational environment collects comprehensive process creation logs, and missing or misconfigured logging could lead to undetected attempts.
  > **Disclaimer:** This investigation guide was created using generative AI technology and has not been reviewed for its accuracy and relevance. While every effort has been made to ensure its quality, we recommend validating the content and adapting it to suit specific environment and operational needs. Please communicate any changes to the detection engineering team.
