title: Webshell Hacking Activity Patterns
id: 4ebc877f-4612-45cb-b3a5-8e3834db36c9
status: test
description: |
  Detects certain parent child patterns found in cases in which a web shell is used to perform certain credential dumping or exfiltration activities on a compromised system
references:
- https://youtu.be/7aemGhaE9ds?t=641
author: Florian Roth (Nextron Systems)
date: 2022-03-17
modified: 2023-11-09
tags:
- attack.persistence
- attack.t1505.003
- attack.t1018
- attack.t1033
- attack.t1087
logsource:
  category: process_creation
  product: windows
detection:
   # Webserver
  selection_webserver_image:
    ParentImage|endswith:
    - '\caddy.exe'
    - '\httpd.exe'
    - '\nginx.exe'
    - '\php-cgi.exe'
    - '\w3wp.exe'
    - '\ws_tomcatservice.exe'
  selection_webserver_characteristics_tomcat1:
    ParentImage|endswith:
    - '\java.exe'
    - '\javaw.exe'
    ParentImage|contains:
    - '-tomcat-'
    - '\tomcat'
  selection_webserver_characteristics_tomcat2:
    ParentImage|endswith:
    - '\java.exe'
    - '\javaw.exe'
    CommandLine|contains:
    - 'catalina.jar'
    - 'CATALINA_HOME'
    # Suspicious child processes
  selection_child_1:
        # Process dumping
    CommandLine|contains|all:
    - 'rundll32'
    - 'comsvcs'
  selection_child_2:
        # Winrar exfil
    CommandLine|contains|all:
    - ' -hp'
    - ' a '
    - ' -m'
  selection_child_3:
        # User add
    CommandLine|contains|all:
    - 'net'
    - ' user '
    - ' /add'
  selection_child_4:
    CommandLine|contains|all:
    - 'net'
    - ' localgroup '
    - ' administrators '
    - '/add'
  selection_child_5:
    Image|endswith:
            # Credential stealing
    - '\ntdsutil.exe'
            # AD recon
    - '\ldifde.exe'
    - '\adfind.exe'
            # Process dumping
    - '\procdump.exe'
    - '\Nanodump.exe'
            # Destruction / ransom groups
    - '\vssadmin.exe'
    - '\fsutil.exe'
  selection_child_6:
        # SUspicious patterns
    CommandLine|contains:
    - ' -decode '          # Used with certutil
    - ' -NoP '          # Often used in malicious PowerShell commands
    - ' -W Hidden '          # Often used in malicious PowerShell commands
    - ' /decode '          # Used with certutil
    - ' /ticket:'          # Rubeus
    - ' sekurlsa'          # Mimikatz
    - '.dmp full'          # Process dumping method apart from procdump
    - '.downloadfile('          # PowerShell download command
    - '.downloadstring('          # PowerShell download command
    - 'FromBase64String'         # PowerShell encoded payload
    - 'process call create'         # WMIC process creation
    - 'reg save '          # save registry SAM - syskey extraction
    - 'whoami /priv'
  condition: 1 of selection_webserver_* and 1 of selection_child_*
falsepositives:
- Unlikely
level: high
notes: |
  n
  ### Technical Context
  This detection rule identifies potential webshell activity characterized by specific parent-child process relationships in a Windows environment. It looks for processes associated with common webservers such as Caddy, Apache (httpd), Nginx, and IIS, followed by suspicious child processes indicative of credential dumping or system exfiltration. Critical parameters include process creation logs that capture command-line arguments and the image paths of these processes. The rule leverages the MITRE ATT&CK framework, specifically the tactics of persistence (TA0002) and credential access (TA0006), notably techniques T1505.003 (Web Shell), T1018 (Remote System Discovery), T1033 (Network Share Discovery), and T1087 (Account Discovery). By watching for specific command-line patterns and process names associated with credential manipulation and management, the rule aids in identifying potential malicious activity on compromised systems.
  ### Investigation Steps
  - **Analyze EDR Logs:** Review endpoint detection and response (EDR) logs for process creation details related to the identified parent (webserver) and child processes, focusing on the command-line parameters used.
  - **Query SIEM for Alerts:** Search the Security Information and Event Management (SIEM) system for alerts that correlate with the execution of the suspicious child processes identified in the detection rule.
  - **Inspect Process Connections:** Use network connection endpoints to examine outgoing connections from the compromised webserver processes for any unusual or unauthorized data transfers that may indicate exfiltration.
  - **Review Authentication Logs:** Check Windows Security logs for anomalies or unusual account activities, particularly any modifications or additions to local groups that could relate to the detected user privilege escalation attempts.
  ### Prioritization
  The alert generated by this detection rule is categorized as high severity due to the potential implications of webshell activity, which may allow attackers to maintain persistence, escalate privileges, and execute further malicious activities on the network.
  ### Blind Spots and Assumptions
  This rule may not fire in environments where the webserver processes or associated command-line arguments differ significantly from those specified. Additionally, if an attacker utilizes obfuscation, custom tooling, or legitimate administrative tasks that mimic these patterns, the rule may fail to detect such activity. It's crucial to ensure that the telemetry from which this rule derives is comprehensive and accurate, as any gaps in monitoring could lead to missed detections.
  > **Disclaimer:** This investigation guide was created using generative AI technology and has not been reviewed for its accuracy and relevance. While every effort has been made to ensure its quality, we recommend validating the content and adapting it to suit specific environment and operational needs. Please communicate any changes to the detection engineering team.
