title: Suspicious Certreq Command to Download
id: 4480827a-9799-4232-b2c4-ccc6c4e9e12b
status: test
description: Detects a suspicious certreq execution taken from the LOLBAS examples,
  which can be abused to download (small) files
references:
- https://lolbas-project.github.io/lolbas/Binaries/Certreq/
author: Christian Burkard (Nextron Systems)
date: 2021-11-24
modified: 2022-06-13
tags:
- attack.command-and-control
- attack.t1105
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: '\certreq.exe'
  - OriginalFileName: 'CertReq.exe'
  selection_cli:
    CommandLine|contains|all:
    - ' -Post '
    - ' -config '
    - ' http'
    - ' C:\windows\win.ini '
  condition: all of selection*
fields:
- CommandLine
- ParentCommandLine
falsepositives:
- Unlikely
level: high
notes: |
  ### Technical Context
  This detection rule identifies potentially malicious usage of the `certreq.exe` binary, a tool commonly used for certificate requests in Windows environments. The rule looks for specific command-line parameters associated with the execution of `certreq.exe`, particularly those involving HTTP requests (indicated by 'http') and a specific configuration pointing to `C:\windows\win.ini`. The presence of these parameters suggests efforts to manipulate the tool for unauthorized file downloads, a technique often employed by attackers for command-and-control (C2) activities. The primary data source for this detection is process creation logs, which capture details about executed processes, including their command-line arguments and parent processes.
  ### Investigation Steps
  - Review the process creation logs in the EDR solution to analyze the execution of `certreq.exe` and identify the specific command-line parameters used.
  - Investigate the parent process associated with the `certreq.exe` execution to determine the context in which it was launched and assess whether any associated behavioral anomalies are present.
  - Query the firewall logs to trace any outbound HTTP requests initiated by the system at the time of the suspicious `certreq.exe` execution, focusing on any connections to unknown or untrusted domains.
  - Check for any file downloads or file creation activities related to the execution of `certreq.exe` by analyzing file system logs and monitoring events in the affected system.
