title: Remote XSL Execution Via Msxsl.EXE
id: 75d0a94e-6252-448d-a7be-d953dff527bb
status: test
description: Detects the execution of the "msxsl" binary with an "http" keyword in
  the command line. This might indicate a potential remote execution of XSL files.
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1220/T1220.md
- https://lolbas-project.github.io/lolbas/OtherMSBinaries/Msxsl/
author: Swachchhanda Shrawan Poudel
date: 2023-11-09
tags:
- attack.defense-evasion
- attack.t1220
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith: '\msxsl.exe'
    CommandLine|contains: 'http'
  condition: selection
falsepositives:
- Msxsl is not installed by default and is deprecated, so unlikely on most systems.
level: high
notes: |
  n
  ### Technical Context
  This detection rule focuses on identifying the execution of the `msxsl.exe` binary, specifically when the command line arguments include the keyword "http." The use of `msxsl.exe`, which is a utility for transforming XML documents with XSLT, in conjunction with an HTTP keyword might indicate attempts to execute remote XSL files, which could be a tactic for executing malicious payloads stored online. The rule pulls from process creation logs as its primary data source, examining the specific command-line parameters associated with process launches. In line with the MITRE ATT&CK framework, this rule aligns with the tactic of Defense Evasion (T1220) as attackers may use this technique to obfuscate their actions while leveraging system tools for malicious outcomes.
  ### Investigation Steps
  - **Verify the Process**: Check the details of the `msxsl.exe` process execution in your EDR tool, looking for other associated processes and the user account that initiated the command.
  - **Inspect Command Line Arguments**: Review the complete command-line parameters used with `msxsl.exe` via Windows Event Logs to confirm the presence of potentially malicious URLs or remote resources.
  - **Network Traffic Analysis**: Utilize the network detection tools to analyze outbound traffic for any connections made to suspicious hosts linked to the execution of `msxsl.exe`, particularly focusing on connections made immediately after the alert.
  - **Endpoint Behavior Correlation**: Look for other alerts or indicators of compromise on the same machine or user account in your SIEM to correlate any other suspicious behaviors that might suggest a larger compromise.
  ### Prioritization
  The alert is set to high severity due to the potential for remote code execution through the misuse of `msxsl.exe`, which can indicate an advanced persistent threat or active attacker attempts to compromise the system.
  ### Blind spots and Assumptions
  This rule may not trigger if `msxsl.exe` is not present on systems as it is not a standard installation and is deprecated. Additionally, legitimate uses of `msxsl.exe` could lead to false positives if users are working with XML transformations as part of their standard duties. Adversaries may also leverage modified or alternative tools to bypass detection, making it critical to monitor for abnormal behavior on systems where `msxsl.exe` is executed.
  > **Disclaimer:** This investigation guide was created using generative AI technology and has not been reviewed for its accuracy and relevance. While every effort has been made to ensure its quality, we recommend validating the content and adapting it to suit specific environment and operational needs. Please communicate any changes to the detection engineering team.
