title: Unusual Child Process of dns.exe
id: a4e3d776-f12e-42c2-8510-9e6ed1f43ec3
status: test
description: Detects an unexpected process spawning from dns.exe which may indicate
  activity related to remote code execution or other forms of exploitation as seen
  in CVE-2020-1350 (SigRed)
references:
- https://www.elastic.co/guide/en/security/current/unusual-child-process-of-dns-exe.html
author: Tim Rauch, Elastic (idea)
date: 2022-09-27
modified: 2023-02-05
tags:
- attack.initial-access
- attack.t1133
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    ParentImage|endswith: '\dns.exe'
  filter:
    Image|endswith: '\conhost.exe'
  condition: selection and not filter
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This detection rule identifies unusual child processes spawned from `dns.exe`. Typically, `dns.exe` is a legitimate Windows process responsible for DNS resolution; however, when it spawns an unexpected child process, such as `conhost.exe`, it may indicate malicious activity, including potential exploitation scenarios related to CVE-2020-1350 (SigRed). The rule scans process creation logs, specifically monitoring for instances where `dns.exe` serves as the parent process and triggers the creation of `conhost.exe`, but only if the invocation does not conform to expected behavior. 
  By focusing on process parent-child relationships, the detection logic analyzes the `ParentImage` attribute to establish that the parent process is `dns.exe` while simultaneously ensuring that the child process does not match known benign patterns. This approach aids in recognizing potential indicators of compromise within Windows endpoints, warranting further investigation.
  ### Investigation Steps
  - Review recent activity logs for the affected endpoint using your EDR solution to identify the process tree involving `dns.exe` and the unusual child process.
  - Analyze command-line parameters and process details of the `conhost.exe` instance to determine if it was executed with suspicious arguments or from an unexpected location.
  - Check for correlated events in the SIEM that might indicate lateral movement or other indicators of compromise originating from the affected system.
  - Conduct a network analysis using your NDR and Proxy tools to trace any unusual outbound connections made by the potentially compromised process.
