title: Msiexec Quiet Installation
id: 79a87aa6-e4bd-42fc-a5bb-5e6fbdcd62f5
status: test
description: |
  Adversaries may abuse msiexec.exe to proxy execution of malicious payloads.
  Msiexec.exe is the command-line utility for the Windows Installer and is thus commonly associated with executing installation packages (.msi)
references:
- https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/msiexec
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1218.007/T1218.007.md
- https://twitter.com/_st0pp3r_/status/1583914244344799235
author: frack113
date: 2022-01-16
modified: 2024-12-01
tags:
- attack.defense-evasion
- attack.t1218.007
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: '\msiexec.exe'
  - OriginalFileName: 'msiexec.exe'
  selection_cli:
        # Note that there is no space before and after the arguments because it's possible to write a commandline as such
        # Example: msiexec -q/i [MSI Package]
    CommandLine|contains|windash:
    - '-i'
    - '-package'
    - '-a'
    - '-j'
  selection_quiet:
    CommandLine|contains|windash: '-q'
  filter_user_temp:
        # The %temp% is a very common location for installers
    ParentImage|startswith: 'C:\Users\'
    ParentImage|contains: '\AppData\Local\Temp\'
  filter_system_temp:
    ParentImage|startswith: 'C:\Windows\Temp\'
  filter_ccm:
    ParentImage: 'C:\Windows\CCM\Ccm32BitLauncher.exe'
    IntegrityLevel:
    - 'System'
    - 'S-1-16-16384'
  condition: all of selection_* and not 1 of filter_*
falsepositives:
- WindowsApps installing updates via the quiet flag
level: medium
notes: |
  n
  ### Technical Context
  The Sigma rule "Msiexec Quiet Installation" identifies potentially malicious use of the Windows Installer utility, msiexec.exe, that adversaries could exploit to execute unauthorized installation packages. It specifically looks for process creation events where msiexec.exe is invoked with command-line parameters associated with quiet installation modes (for example, `-q` for quiet). The rule considers the context in which msiexec runs, filtering out legitimate scenarios such as software updates. Data sources utilized include Windows Process Creation Logs that reveal details about executed processes, command-line parameters, and the parent process context. This detection aligns with the MITRE ATT&CK technique T1218.007 (Signed Binary Proxy Execution).
  ### Investigation Steps
  - **Check EDR alerts:** Investigate any alerts from the EDR system related to msiexec.exe, focusing on command-line arguments and parent processes that might indicate suspicious activity.
    
  - **Review System Event Logs:** Analyze the Windows Security event logs for any unusual logon events that coincide with the msiexec activity, particularly for accounts with elevated privileges.
  - **Perform File Integrity Checks:** Examine the integrity of files and directories affected by msiexec.exe usage, especially if installations target commonly exploited locations like `%temp%` or `%programdata%`.
  - **Cross-reference with Proxy Logs:** Look into proxy server logs for any outbound connections made by msiexec.exe during the timeframe of detection, as this may indicate communication with untrusted sources.
  ### Prioritization
  This alert has a medium severity level as it may indicate evasion tactics by adversaries attempting to execute malicious payloads through legitimate processes, which could lead to a compromise if the activity is confirmed as unauthorized.
  ### Blind spots and Assumptions
  This rule may not trigger in environments where legitimate software installations occur frequently with quiet parameters, such as automated updates from trusted sources. Additionally, if an adversary obfuscates their command through different means (e.g., invoking msiexec.exe from a different path), the rule may fail to detect it. It assumes that environment settings will not excessively deviate from typical configurations which could lead to false negatives.
  > **Disclaimer:** This investigation guide was created using generative AI technology and has not been reviewed for its accuracy and relevance. While every effort has been made to ensure its quality, we recommend validating the content and adapting it to suit specific environment and operational needs. Please communicate any changes to the detection engineering team.
