title: Potential Excel.EXE DCOM Lateral Movement Via ActivateMicrosoftApp
id: 551d9c1f-816c-445b-a7a6-7a3864720d60
status: test
description: |
  Detects suspicious child processes of Excel which could be an indicator of lateral movement leveraging the "ActivateMicrosoftApp" Excel DCOM object.
references:
- https://posts.specterops.io/lateral-movement-abuse-the-power-of-dcom-excel-application-3c016d0d9922
- https://github.com/grayhatkiller/SharpExShell
- https://learn.microsoft.com/en-us/office/vba/api/excel.xlmsapplication
author: Aaron Stratton
date: 2023-11-13
tags:
- attack.t1021.003
- attack.lateral-movement
logsource:
  category: process_creation
  product: windows
detection:
  selection_parent:
    ParentImage|endswith: '\excel.exe'
  selection_child:
  - OriginalFileName:
    - 'foxprow.exe'
    - 'schdplus.exe'
    - 'winproj.exe'
  - Image|endswith:
    - '\foxprow.exe'
    - '\schdplus.exe'
    - '\winproj.exe'
  condition: all of selection_*
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This detection rule identifies potential lateral movement within an enterprise environment that could be initiated by Microsoft Excel processes. Specifically, it focuses on the behavior of Excel (excel.exe) when it spawns certain child processes, such as `foxprow.exe`, `schdplus.exe`, and `winproj.exe`, which can indicate misuse of the "ActivateMicrosoftApp" DCOM object for unauthorized activity. By monitoring process creation logs for instances where Excel is the parent process to these specified child processes, security teams can flag suspicious operations that may be part of an attacker's lateral movement strategy. The rule leverages Windows process creation events, making it essential to have EDR tools functioning effectively to log and analyze such events.
  ### Investigation Steps
  - Review the process creation logs in your EDR solution to verify instances of Excel spawning the specified child processes (`foxprow.exe`, `schdplus.exe`, and `winproj.exe`).
  - Investigate the command-line arguments of the parent Excel process to understand the context in which the child processes were launched, looking for any anomalies that deviate from normal operational patterns.
  - Check network logs for any connections made by the identified child processes to determine if they are interacting with other machines or suspicious external addresses.
  - Utilize your antivirus and endpoint security tools to scan the systems for known signatures or behaviors associated with these child processes, ensuring they are not being leveraged for malicious activities.
