title: Start of NT Virtual DOS Machine
id: 16905e21-66ee-42fe-b256-1318ada2d770
status: test
description: Ntvdm.exe allows the execution of 16-bit Windows applications on 32-bit
  Windows operating systems, as well as the execution of both 16-bit and 32-bit DOS
  applications
references:
- https://learn.microsoft.com/en-us/windows/compatibility/ntvdm-and-16-bit-app-support
- https://support.microsoft.com/fr-fr/topic/an-ms-dos-based-program-that-uses-the-ms-dos-protected-mode-interface-crashes-on-a-computer-that-is-running-windows-7-5dc739ea-987b-b458-15e4-d28d5cca63c7
- https://app.any.run/tasks/93fe92fa-8b2b-4d92-8c09-a841aed2e793/
- https://app.any.run/tasks/214094a7-0abc-4a7b-a564-1b757faed79d/
author: frack113
date: 2022-07-16
modified: 2022-07-16
tags:
- attack.defense-evasion
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith:
    - '\ntvdm.exe'
    - '\csrstub.exe'
  condition: selection
falsepositives:
- Legitimate use
level: medium
notes: |
  ### Technical Context
  The Sigma rule "Start of NT Virtual DOS Machine" is designed to detect the execution of 16-bit applications on modern 32-bit Windows operating systems through the NT Virtual DOS Machine (ntvdm.exe). This process can also invoke csrstub.exe, which may indicate unusual behavior or a need for further investigation. The rule specifically monitors process creation logs to identify instances where these executables are launched, as executing 16-bit applications on a 32-bit OS is often associated with legacy software compatibility or potential misuse. Analysts should be aware that while ntvdm.exe can be used legitimately, it may also signal potential threats, especially if it appears in unexpected contexts or is used as part of an attacker's evasion strategy.
  ### Investigation Steps
  - Review the process creation logs to identify the parent process that initiated ntvdm.exe or csrstub.exe. This will help determine if the execution of these processes is linked to expected software behavior or something suspicious.
  - Verify the command-line parameters of the detected processes using EDR tools to understand the context in which ntvdm.exe or csrstub.exe was executed. This can provide insight into the intent behind their usage.
  - Cross-reference connections made by these processes using network logs from NDR or firewall tools to ensure that no malicious activity is associated with their execution.
  - Check for any related events in cloud environments (if applicable) to see if there are instances where such processes were triggered as part of a broader attack strategy or occurred in conjunction with suspicious cloud activity.
