title: Active Directory Database Snapshot Via ADExplorer
id: 9212f354-7775-4e28-9c9f-8f0a4544e664
related:
- id: ef61af62-bc74-4f58-b49b-626448227652
  type: derived
status: test
description: Detects the execution of Sysinternals ADExplorer with the "-snapshot"
  flag in order to save a local copy of the active directory database.
references:
- https://www.documentcloud.org/documents/5743766-Global-Threat-Report-2019.html
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023-03-14
tags:
- attack.credential-access
- attack.t1552.001
- attack.t1003.003
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: '\ADExplorer.exe'
  - OriginalFileName: 'AdExp'
  selection_cli:
    CommandLine|contains: 'snapshot'
  condition: all of selection_*
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  This detection rule is designed to identify the usage of Sysinternals' ADExplorer tool to create a snapshot of the Active Directory (AD) database, which could indicate unauthorized access or credential dumping activities. The rule focuses on two main aspects: the execution of the ADExplorer executable and the presence of the "-snapshot" flag in the command line arguments. The key data sources for this rule are process creation logs that capture the command line and executable image details. By monitoring these logs, the rule can detect when an attacker attempts to steal sensitive information from the Active Directory environment.
  Depending on the setup, alerts generated by this rule require further investigation to differentiate between legitimate administrative activity and potential malicious actions. Investigating alerts triggered by this rule can provide insights into the security posture of the Active Directory infrastructure.
  ### Investigation Steps
  - Review the process creation logs from the EDR to confirm the execution of `ADExplorer.exe` and check if the command line contains the `-snapshot` parameter.
  - Cross-reference the user account that initiated the ADExplorer execution with user access rights and roles within Active Directory to assess whether this action is consistent with their responsibilities.
  - Examine any associated network logs from the NGFW or NDR for unexpected outbound connections that may indicate the exfiltration of sensitive data following the snapshot creation.
  - Consult the AV logs for any detections or anomalies that may indicate the execution of potentially malicious scripts or tools around the same time as the alert was triggered.
