title: Remote File Download Via Desktopimgdownldr Utility
id: 214641c2-c579-4ecb-8427-0cf19df6842e
status: test
description: Detects the desktopimgdownldr utility being used to download a remote
  file. An adversary may use desktopimgdownldr to download arbitrary files as an alternative
  to certutil.
references:
- https://www.elastic.co/guide/en/security/current/remote-file-download-via-desktopimgdownldr-utility.html
author: Tim Rauch, Elastic (idea)
date: 2022-09-27
tags:
- attack.command-and-control
- attack.t1105
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith: '\desktopimgdownldr.exe'
    ParentImage|endswith: '\desktopimgdownldr.exe'
    CommandLine|contains: '/lockscreenurl:http'
  condition: selection
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  This detection rule identifies the usage of the `desktopimgdownldr` utility, particularly looking for instances where it is employed to download files from a remote source. This utility may be leveraged by attackers as an alternative to more commonly known tools like `certutil`, providing a stealthier method to obtain malicious payloads or exfiltrate sensitive data. The rule focuses on monitoring Windows process creation logs for specific indicators: the executable name (`desktopimgdownldr.exe`), its parent process being the same executable, and command-line parameters that include a URL starting with `http`. By capturing these details, the rule aims to flag suspicious activities that could signify adversarial actions within the network.
  ### Investigation Steps
  - Review the EDR for the process invocation details related to `desktopimgdownldr.exe`, paying attention to the time of the alert and any parent processes associated with it.
  - Validate the command-line parameters to determine if any legitimate usage or suspicious URLs were requested during the execution of `desktopimgdownldr`.
  - Check the Proxy logs to examine Internet traffic generated by the host, specifically looking for outbound requests related to any suspicious downloads.
  - Investigate the user's activity history and system logs to identify any previous anomalies or patterns of suspicious behavior that may correlate with the detected rule.
