title: Suspicious RunAs-Like Flag Combination
id: 50d66fb0-03f8-4da0-8add-84e77d12a020
status: test
description: Detects suspicious command line flags that let the user set a target
  user and command as e.g. seen in PsExec-like tools
references:
- https://www.trendmicro.com/en_us/research/22/k/hack-the-real-box-apt41-new-subgroup-earth-longzhi.html
author: Florian Roth (Nextron Systems)
date: 2022-11-11
tags:
- attack.privilege-escalation
logsource:
  category: process_creation
  product: windows
detection:
  selection_user:
    CommandLine|contains:
    - ' -u system '
    - ' --user system '
    - ' -u NT'
    - ' -u "NT'
    - " -u 'NT"
    - ' --system '
    - ' -u administrator '
  selection_command:
    CommandLine|contains:
    - ' -c cmd'
    - ' -c "cmd'
    - ' -c powershell'
    - ' -c "powershell'
    - ' --command cmd'
    - ' --command powershell'
    - ' -c whoami'
    - ' -c wscript'
    - ' -c cscript'
  condition: all of selection*
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  This detection rule identifies suspicious command line invocations that utilize flags commonly associated with privilege escalation tools, such as PsExec. Specifically, it looks for instances where command line arguments indicate an attempt to execute commands as high-privilege users like 'SYSTEM' or 'administrator', coupled with particular commands often leveraged by threat actors, including 'cmd', 'powershell', and scripting engines like 'wscript' and 'cscript'. The data sources utilized in this detection include Windows process creation logs, which provide insight into the command line arguments used by executable processes and help highlight any attempts at unauthorized administrative access or execution of potentially malicious commands.
  ### Investigation Steps
  - Investigate the associated process creation logs in your EDR tool to identify the originating process and its parent process to determine the context of the execution.
  - Review the command line parameters from the logs to analyze for any uncommon patterns or suspicious combinations of user-targeting flags and commands.
  - Cross-reference the user's activity on the system with proxy logs to identify any external communication or further suspicious actions grouped with the detected behavior.
  - Consult the antivirus logs for any detected threats or blocks around the same timestamps as the suspicious command execution to ascertain whether the activity is tied to known malicious actors or methods.
