title: PUA - SoftPerfect Netscan Execution
id: ca387a8e-1c84-4da3-9993-028b45342d30
status: test
description: |
  Detects usage of SoftPerfect's "netscan.exe". An application for scanning networks.
  It is actively used in-the-wild by threat actors to inspect and understand the network architecture of a victim.
references:
- https://www.protect.airbus.com/blog/uncovering-cyber-intruders-netscan/
- https://secjoes-reports.s3.eu-central-1.amazonaws.com/Sockbot%2Bin%2BGoLand.pdf
- https://www.sentinelone.com/labs/black-basta-ransomware-attacks-deploy-custom-edr-evasion-tools-tied-to-fin7-threat-actor/
- https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/yanluowang-ransomware-attacks-continue
- https://research.nccgroup.com/2022/07/13/climbing-mount-everest-black-byte-bytes-back/
- https://www.bleepingcomputer.com/news/security/microsoft-exchange-servers-hacked-to-deploy-hive-ransomware/
- https://www.softperfect.com/products/networkscanner/
author: '@d4ns4n_ (Wuerth-Phoenix)'
date: 2024-04-25
tags:
- attack.discovery
- attack.t1046
logsource:
  category: process_creation
  product: windows
detection:
  selection:
  - Image|endswith: '\netscan.exe'
  - Product: 'Network Scanner'
  - Description: 'Application for scanning networks'
  condition: selection
falsepositives:
- Legitimate administrator activity
level: medium
notes: |
  ### Technical Context
  This detection rule identifies the execution of **SoftPerfect's netscan.exe**, a network scanning application often leveraged by threat actors to assess a target's network layout. The rule looks for processes that specifically end with the filename `netscan.exe` and are categorized as the 'Network Scanner' with a description indicating its function as a network-scanning tool. The primary technical data sources involved in this detection are **process creation logs**, which track the execution of processes on Windows systems, allowing for the identification of potentially malicious behavior in the environment. Given that tools like netscan.exe can be used in legitimate administrative tasks, the alert is set at a medium severity level to account for potential false positives.
  ### Investigation Steps
  - Review the process creation logs via EDR to confirm the invocation of `netscan.exe` and to check for any associated command-line arguments that could provide additional context regarding its usage.
  - Correlate the timestamp of the alert with user activity logs to determine whether the execution coincided with authorized administrative tasks or if it appears anomalous.
  - Analyze network traffic using NDR tools to identify any scanning activity or unusual traffic patterns that may correlate with the execution of the process.
  - Consult cloud platform logs (if applicable) to investigate any related API calls or activities that may indicate further lateral movement or attempts to exploit the environment.
