title: Suspicious Calculator Usage
id: 737e618a-a410-49b5-bec3-9e55ff7fbc15
status: test
description: |
  Detects suspicious use of 'calc.exe' with command line parameters or in a suspicious directory, which is likely caused by some PoC or detection evasion.
references:
- https://twitter.com/ItsReallyNick/status/1094080242686312448
author: Florian Roth (Nextron Systems)
date: 2019-02-09
modified: 2023-11-09
tags:
- attack.defense-evasion
- attack.t1036
logsource:
  category: process_creation
  product: windows
detection:
  selection_1:
    CommandLine|contains: '\calc.exe '
  selection_2:
    Image|endswith: '\calc.exe'
  filter_main_known_locations:
    Image|contains:
    - ':\Windows\System32\'
    - ':\Windows\SysWOW64\'
    - ':\Windows\WinSxS\'
  condition: selection_1 or ( selection_2 and not filter_main_known_locations )
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  The "Suspicious Calculator Usage" detection rule aims to identify potentially malicious use of the Windows Calculator application (`calc.exe`). It specifically looks for instances where `calc.exe` is executed with command-line parameters or from suspicious directories outside of standard system locations (e.g., System32, SysWOW64, and WinSxS). This behavior may indicate evasion tactics often employed by threat actors, such as running payloads or scripts that leverage benign applications to mask malicious intent. The rule leverages process creation logs to capture and analyze the command lines and image paths associated with `calc.exe`, providing visibility into potentially nefarious configurations or executions.
  ### Investigation Steps
  - Review the EDR logs for any instances of `calc.exe` executed with unusual command-line parameters, noting the context and purpose of these parameters.
  - Check the image paths in the process creation logs to confirm if `calc.exe` was launched from locations outside of the known safe directories.
  - Investigate related network activity using NDR or firewall logs to identify any outbound connections that may correlate with the suspicious `calc.exe` execution.
  - Query AV or endpoint logs for any detections or alerts associated with `calc.exe`, which may provide additional context about the execution environment and intentions.
