title: Windows Recall Feature Enabled Via Reg.EXE
id: 817f252c-5143-4dae-b418-48c3e9f63728
related:
- id: 5dfc1465-8f65-4fde-8eb5-6194380c6a62
  type: similar
- id: 75180c5f-4ea1-461a-a4f6-6e4700c065d4
  type: similar
status: experimental
description: |
  Detects the enabling of the Windows Recall feature via registry manipulation.
  Windows Recall can be enabled by deleting the existing "DisableAIDataAnalysis" value, or setting it to 0.
  Adversaries may enable Windows Recall as part of post-exploitation discovery and collection activities.
  This rule assumes that Recall is already explicitly disabled on the host, and subsequently enabled by the adversary.
references:
- https://learn.microsoft.com/en-us/windows/client-management/manage-recall
- https://learn.microsoft.com/en-us/windows/client-management/mdm/policy-csp-windowsai#disableaidataanalysis
author: Sajid Nawaz Khan
date: 2024-06-02
tags:
- attack.collection
- attack.t1113
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: '\reg.exe'
  - OriginalFileName: 'reg.exe'
  selection_value:
        # HKEY_CURRENT_USER\Software\Policies\Microsoft\Windows\WindowsAI\DisableAIDataAnalysis
        # HKEY_LOCAL_MACHINE\SOFTWARE\Policies\Microsoft\Windows\WindowsAI\DisableAIDataAnalysis
    CommandLine|contains|all:
    - 'Microsoft\Windows\WindowsAI'
    - 'DisableAIDataAnalysis'
  selection_action_add:
    CommandLine|contains:
    - 'add'
    - '0'
  selection_action_delete:
    CommandLine|contains: 'delete'
  condition: selection_img and selection_value and 1 of selection_action_*
falsepositives:
- Legitimate use/activation of Windows Recall
level: medium
notes: |
  ### Technical Context
  This detection rule identifies the manipulation of the Windows Registry to enable the Windows Recall feature via the `reg.exe` command. Specifically, it looks for the command line usage of `reg.exe` that alters the registry entries related to the "DisableAIDataAnalysis" value under either the HKEY_CURRENT_USER or HKEY_LOCAL_MACHINE keys. The rule captures instances where this value is either deleted or set to "0", indicating that the Recall feature, which is frequently utilized during post-exploitation activities for data gathering, has been enabled. By focusing on the creation and modification of these registry entries, this rule seeks to detect potentially malicious activities arising from unauthorized configurations made by adversaries.
  ### Investigation Steps
  - Examine EDR logs to identify any recent executions of `reg.exe` that modified the "DisableAIDataAnalysis" registry value. Confirm the process's parent process and context to determine its legitimacy.
  - Review any command-line arguments associated with the execution of `reg.exe` to confirm the specifics of the operation (e.g., addition or deletion of registry values).
  - Check the timeline of changes in the Windows Registry using Registry auditing logs available within the enterprise's security framework to understand if there were any preceding modifications to "DisableAIDataAnalysis."
  - Analyze network logs from proxies and firewalls for any related outbound connections that coincide with the time of the registry change, which might indicate further malicious activity or data exfiltration.
