title: Response File Execution Via Odbcconf.EXE
id: 5f03babb-12db-4eec-8c82-7b4cb5580868
related:
- id: 2d32dd6f-3196-4093-b9eb-1ad8ab088ca5
  type: similar
- id: 65d2be45-8600-4042-b4c0-577a1ff8a60e
  type: obsolete
status: test
description: Detects execution of "odbcconf" with the "-f" flag in order to load a
  response file which might contain a malicious action.
references:
- https://learn.microsoft.com/en-us/sql/odbc/odbcconf-exe?view=sql-server-ver16
- https://lolbas-project.github.io/lolbas/Binaries/Odbcconf/
- https://www.cybereason.com/blog/threat-analysis-report-bumblebee-loader-the-high-road-to-enterprise-domain-control
- https://www.hexacorn.com/blog/2020/08/23/odbcconf-lolbin-trifecta/
author: Kirill Kiryanov, Beyu Denis, Daniil Yugoslavskiy, oscd.community, Nasreddine
  Bencherchali (Nextron Systems)
date: 2023-05-22
modified: 2024-03-05
tags:
- attack.defense-evasion
- attack.t1218.008
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: '\odbcconf.exe'
  - OriginalFileName: 'odbcconf.exe'
  selection_cli:
    CommandLine|contains|windash: ' -f '
  selection_rsp_ext:
    CommandLine|contains: '.rsp'
  condition: all of selection_*
falsepositives:
- The rule is looking for any usage of response file, which might generate false positive
  when this function is used legitimately. Investigate the contents of the ".rsp"
  file to determine if it is malicious and apply additional filters if necessary.
level: medium
notes: |
  ### Technical Context
  This detection rule targets the execution of `odbcconf.exe` with the `-f` flag, which indicates the usage of a response file. This file, often with an `.rsp` extension, can be leveraged by malicious actors to load custom configurations or execute harmful code. The rule examines several indicators, including the image path of the executed process, its original file name, and the command line parameters used during its execution. Data sourced from process creation logs specifically from Windows are utilized to trigger alerts when these conditions are met. By monitoring for this specific command-line behavior, security teams can identify potential misuse of the legitimate utility `odbcconf.exe`, which could indicate attempts to evade detection during malicious activities.
  ### Investigation Steps
  - Review the process creation logs from your EDR tool to identify the context around the execution of `odbcconf.exe`, focusing on the user account and machine involved.
  - Analyze the contents of the response file (`.rsp`) if it is present, to determine whether it includes any suspicious commands or configurations that would suggest malicious intent.
  - Utilize your SIEM to correlate this alert with related events or logs, such as network connections or file modifications, that may indicate ongoing malicious activities.
  - Assess external threat intelligence sources or internal incident databases for any known patterns or ties related to the usage of `odbcconf.exe` in similar malicious contexts.
