title: Suspicious File Download From IP Via Curl.EXE
id: 5cb299fc-5fb1-4d07-b989-0644c68b6043
status: test
description: Detects potentially suspicious file downloads directly from IP addresses
  using curl.exe
references:
- https://labs.withsecure.com/publications/fin7-target-veeam-servers
- https://github.com/WithSecureLabs/iocs/blob/344203de742bb7e68bd56618f66d34be95a9f9fc/FIN7VEEAM/iocs.csv
- https://github.com/pr0xylife/IcedID/blob/8dd1e218460db4f750d955b4c65b2f918a1db906/icedID_09.28.2023.txt
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023-07-27
tags:
- attack.execution
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: '\curl.exe'
  - OriginalFileName: 'curl.exe'
  selection_ip:
    CommandLine|re: '://[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}'
  selection_http:
    CommandLine|contains: 'http'
  selection_flag:
    CommandLine|contains:
    - ' -O'          # covers the alias for --remote-name and --output
    - '--remote-name'
    - '--output'
  selection_ext:
        # Note: If you add more extensions please consider adding them also in 9cc85849-3b02-4cb5-b371-3a1ff54f2218
    CommandLine|endswith:
    - '.bat'
    - '.bat"'
    - '.dat'
    - '.dat"'
    - '.dll'
    - '.dll"'
    - '.exe'
    - '.exe"'
    - '.gif'
    - '.gif"'
    - '.hta'
    - '.hta"'
    - '.jpeg'
    - '.jpeg"'
    - '.log'
    - '.log"'
    - '.msi'
    - '.msi"'
    - '.png'
    - '.png"'
    - '.ps1'
    - '.ps1"'
    - '.psm1'
    - '.psm1"'
    - '.vbe'
    - '.vbe"'
    - '.vbs'
    - '.vbs"'
    - ".bat'"
    - ".dat'"
    - ".dll'"
    - ".exe'"
    - ".gif'"
    - ".hta'"
    - ".jpeg'"
    - ".log'"
    - ".msi'"
    - ".png'"
    - ".ps1'"
    - ".psm1'"
    - ".vbe'"
    - ".vbs'"
  condition: all of selection_*
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This Sigma rule is designed to detect potentially malicious file downloads originating from IP addresses using `curl.exe`, a command-line tool commonly used for transferring data. The rule monitors process creation logs on Windows systems to identify the execution of `curl.exe` with specific command-line parameters indicative of a file download. It looks for patterns such as the presence of an IP address in the command line (indicated by the regular expression), usage of HTTP protocols, download flags (`-O`, `--remote-name`, `--output`), and specific file extensions that may indicate potentially harmful payloads (e.g., `.exe`, `.dll`, `.bat`). By correlating these indicators, analysts can identify suspicious file downloads that may warrant further investigation.
  ### Investigation Steps
  - Review the process creation logs in the EDR to identify instances of `curl.exe` that match the detection criteria specified in the rule, including command-line parameters.
  - Validate the source IP addresses against known threat intelligence databases to ascertain if they are associated with malicious activity.
  - Utilize the NGFW or Proxy logs to analyze outbound connections initiated by the suspicious `curl.exe` executions, examining the URLs and file types that were downloaded.
  - Check endpoint security solutions (like AV) for any detections or alerts related to the downloaded files that may provide insight into the threat level and associated impacts.
