title: File Decryption Using Gpg4win
id: 037dcd71-33a8-4392-bb01-293c94663e5a
status: test
description: Detects usage of Gpg4win to decrypt files
references:
- https://blogs.vmware.com/security/2022/11/batloader-the-evasive-downloader-malware.html
- https://www.gpg4win.de/documentation.html
- https://news.sophos.com/en-us/2022/01/19/zloader-installs-remote-access-backdoors-and-delivers-cobalt-strike/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023-08-09
tags:
- attack.execution
logsource:
  category: process_creation
  product: windows
detection:
  selection_metadata:
  - Image|endswith:
    - '\gpg.exe'
    - '\gpg2.exe'
  - Description: 'GnuPG’s OpenPGP tool'
  selection_cli:
    CommandLine|contains|all:
    - ' -d '
    - 'passphrase'
  condition: all of selection_*
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  This detection rule identifies the use of Gpg4win, a widely used encryption and decryption tool, specifically focusing on file decryption activities. The rule monitors process creation logs within a Windows environment for the execution of gpg.exe or gpg2.exe, which are the command-line utilities associated with GnuPG—the underlying OpenPGP tool. It checks for specific command-line parameters indicative of file decryption actions, specifically looking for the presence of ' -d ' (which stands for decrypt) and 'passphrase', suggesting that a password is being utilized during the decryption process. Such activity can signal an attempt to access sensitive or exfiltrated data, potentially highlighting malicious intent if linked to other suspicious patterns.
  ### Investigation Steps
  - Examine the EDR logs for any recent process creation events involving gpg.exe or gpg2.exe to establish a timeline of the decryption activities.
  - Review command-line arguments in the process logs to verify if the executed commands align with typical usage or indicate potential misuse.
  - Cross-reference the user accounts associated with the decryption activities against known personnel lists to identify any unauthorized attempts.
  - Utilize Proxy and network logs to analyze any outbound connections made before and after the decryption actions, which may indicate data exfiltration.
