title: Process Creation Using Sysnative Folder
id: 3c1b5fb0-c72f-45ba-abd1-4d4c353144ab
status: test
description: Detects process creation events that use the Sysnative folder (common
  for CobaltStrike spawns)
references:
- https://thedfirreport.com/2021/08/29/cobalt-strike-a-defenders-guide/
author: Max Altgelt (Nextron Systems)
date: 2022-08-23
modified: 2023-12-14
tags:
- attack.defense-evasion
- attack.privilege-escalation
- attack.t1055
logsource:
  category: process_creation
  product: windows
detection:
  sysnative:
  - CommandLine|contains: ':\Windows\Sysnative\'
  - Image|contains: ':\Windows\Sysnative\'
  condition: sysnative
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  This detection rule identifies process creation events that utilize the Sysnative folder, a common tactic employed by malicious actors such as those using Cobalt Strike. The Sysnative folder is often accessed by 32-bit applications running on 64-bit Windows systems to bypass restrictions when interacting with 64-bit paths. The rule looks for specific command line arguments or image paths that contain ":\Windows\Sysnative\", indicating the potential for process deception or privilege escalation. The primary data sources involved in this detection are process creation logs, which capture details about running processes, including their command-line parameters and executable image paths.
  ### Investigation Steps
  - Examine the EDR solution for the identified process creation alerts to check the details of the executed command line and image name.
  - Review system event logs on the affected host to correlate the timing of the Sysnative access with other suspicious activities or known attack patterns.
  - Utilize the SIEM to search for any other indicators of compromise (IoCs) associated with Cobalt Strike, focusing on traffic patterns and connectivity from the internal network to external IPs.
  - Analyze Proxy logs to identify any unusual outbound connections made from the affected host during the time of the process creation event.
