title: Csc.EXE Execution Form Potentially Suspicious Parent
id: b730a276-6b63-41b8-bcf8-55930c8fc6ee
status: test
description: Detects a potentially suspicious parent of "csc.exe", which could be
  a sign of payload delivery.
references:
- https://www.uptycs.com/blog/warzonerat-can-now-evade-with-process-hollowing
- https://reaqta.com/2017/11/short-journey-darkvnc/
- https://www.pwc.com/gx/en/issues/cybersecurity/cyber-threat-intelligence/yellow-liderc-ships-its-scripts-delivers-imaploader-malware.html
author: Florian Roth (Nextron Systems), Nasreddine Bencherchali (Nextron Systems),
  X__Junior (Nextron Systems)
date: 2019-02-11
modified: 2024-05-27
tags:
- attack.execution
- attack.t1059.005
- attack.t1059.007
- attack.defense-evasion
- attack.t1218.005
- attack.t1027.004
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: '\csc.exe'
  - OriginalFileName: 'csc.exe'
  selection_parent_generic:
    ParentImage|endswith:
    - '\cscript.exe'
    - '\excel.exe'
    - '\mshta.exe'
    - '\onenote.exe'
    - '\outlook.exe'
    - '\powerpnt.exe'
    - '\winword.exe'
    - '\wscript.exe'
  selection_parent_powershell:
    ParentImage|endswith:
    - '\powershell.exe'
    - '\pwsh.exe'
    ParentCommandLine|contains:
    - '-Encoded '
    - 'FromBase64String'
  selection_parent_susp_location:
  - ParentCommandLine|re: '([Pp]rogram[Dd]ata|%([Ll]ocal)?[Aa]pp[Dd]ata%|\\[Aa]pp[Dd]ata\\([Ll]ocal([Ll]ow)?|[Rr]oaming))\\[^\\]{1,256}$'
  - ParentCommandLine|contains:
    - ':\PerfLogs\'
    - ':\Users\Public\'
    - ':\Windows\Temp\'
    - '\Temporary Internet'
  - ParentCommandLine|contains|all:
    - ':\Users\'
    - '\Favorites\'
  - ParentCommandLine|contains|all:
    - ':\Users\'
    - '\Favourites\'
  - ParentCommandLine|contains|all:
    - ':\Users\'
    - '\Contacts\'
  - ParentCommandLine|contains|all:
    - ':\Users\'
    - '\Pictures\'
  filter_main_programfiles:
        # Note: this is a generic filter. You could baseline execution in your env for a more robust rule
    ParentImage|startswith:
    - 'C:\Program Files (x86)\'         # https://twitter.com/gN3mes1s/status/1206874118282448897
    - 'C:\Program Files\'         # https://twitter.com/gN3mes1s/status/1206874118282448897
  filter_main_sdiagnhost:
    ParentImage: 'C:\Windows\System32\sdiagnhost.exe'     # https://twitter.com/gN3mes1s/status/1206874118282448897
  filter_main_w3p:
    ParentImage: 'C:\Windows\System32\inetsrv\w3wp.exe'     # https://twitter.com/gabriele_pippi/status/1206907900268072962
  filter_optional_chocolatey:
    ParentImage: 'C:\ProgramData\chocolatey\choco.exe'     # Chocolatey https://chocolatey.org/
  filter_optional_defender:
    ParentCommandLine|contains: '\ProgramData\Microsoft\Windows Defender Advanced
      Threat Protection'
  filter_optional_ansible:
        # Note: As ansible is widely used we exclude it with this generic filter.
        # A better option would be to filter based on script content basis or other marker while hunting
    ParentCommandLine|contains:
            # '{"failed":true,"msg":"Ansible requires PowerShell v3.0 or newer"}'
    - 'JwB7ACIAZgBhAGkAbABlAGQAIgA6AHQAcgB1AGUALAAiAG0AcwBnACIAOgAiAEEAbgBzAGkAYgBsAGUAIAByAGUAcQB1AGkAcgBlAHMAIABQAG8AdwBlAHIAUwBoAGUAbABsACAAdgAzAC4AMAAgAG8AcgAgAG4AZQB3AGUAcgAiAH0AJw'
    - 'cAewAiAGYAYQBpAGwAZQBkACIAOgB0AHIAdQBlACwAIgBtAHMAZwAiADoAIgBBAG4AcwBpAGIAbABlACAAcgBlAHEAdQBpAHIAZQBzACAAUABvAHcAZQByAFMAaABlAGwAbAAgAHYAMwAuADAAIABvAHIAIABuAGUAdwBlAHIAIgB9ACcA'
    - 'nAHsAIgBmAGEAaQBsAGUAZAAiADoAdAByAHUAZQAsACIAbQBzAGcAIgA6ACIAQQBuAHMAaQBiAGwAZQAgAHIAZQBxAHUAaQByAGUAcwAgAFAAbwB3AGUAcgBTAGgAZQBsAGwAIAB2ADMALgAwACAAbwByACAAbgBlAHcAZQByACIAfQAnA'
  condition: selection_img and 1 of selection_parent_* and not 1 of filter_main_*
    and not 1 of filter_optional_*
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  The detection rule titled "Csc.EXE Execution Form Potentially Suspicious Parent" focuses on identifying potentially malicious instances of `csc.exe`, a legitimate Microsoft tool, when executed from unexpected parent processes. This may indicate a method of payload delivery often leveraged by threat actors as part of their execution tactics. The rule looks for specific patterns in process creation logs within the Windows operating system, particularly when `csc.exe` is triggered either from suspicious parent processes such as scripts executed by `powershell.exe`, or from uncommon locations within the file system. The detection sources primarily include the process creation logs, where key parameters such as the parent image and command line arguments are scrutinized.
  The rule is categorized under the MITRE ATT&CK tactics of "Execution" (TA0002) and techniques such as "Command and Scripting Interpreter: Windows PowerShell" (T1059.007) and "Windows Command Shell" (T1059.005). These techniques highlight the usage of legitimate system tools for executing malicious code, effectively evading security controls. By monitoring these indicators, analysts can detect potentially anomalous behavior signaling a threat within their environment.
  ### Investigation Steps
  - **Check EDR Alerts**: Review EDR telemetry for any alerts related to `csc.exe`, especially concerning processes initiated by the identified suspicious parent processes. Investigate the timeline and threat context associated with these alerts.
    
  - **Examine Process Tree**: Utilize the process tree feature of the EDR to visualize the relationship between `csc.exe` and its parent processes. Look for unusual parent-child relationships that could indicate a blend of legitimate and malicious actions.
  - **Analyze Command Line Arguments**: Inspect the command line arguments used for invoking `csc.exe`. Check for telltale signs such as encoded commands or references to known malicious locations which could signify an evasion technique.
  - **Review File and Application Logs**: Search Windows Event Logs (Application, Security, and System) for additional information and use Sysinternals tools if necessary to gather further context on the suspicious execution, looking for anomalies in the environment.
  ### Prioritization
  The alert signifies high severity due to the potential for execution of malicious payloads disguised through legitimate utilities, which can lead to severe impacts on enterprise security if not promptly investigated.
  ### Blind Spots and Assumptions
  This rule may not fire in environments where `csc.exe` is routinely used for legitimate purposes without monitoring for atypical invocation patterns. Additionally, sophisticated attackers may use alternate file names or employ obfuscation techniques to evade detection. There is an assumption that all parent processes and command line arguments surfacing in the logs are appropriately monitored; any gaps in logging or misconfigurations can lead to missed detections. 
  > **Disclaimer:** This investigation guide was created using generative AI technology and has not been reviewed for its accuracy and relevance. While every effort has been made to ensure its quality, we recommend validating the content and adapting it to suit specific environment and operational needs. Please communicate any changes to the detection engineering team.
