title: QuickAssist Execution
id: e20b5b14-ce93-4230-88af-981983ef6e74
status: experimental
description: |
  Detects the execution of Microsoft Quick Assist tool "QuickAssist.exe". This utility can be used by attackers to gain remote access.
references:
- https://www.microsoft.com/en-us/security/blog/2024/05/15/threat-actors-misusing-quick-assist-in-social-engineering-attacks-leading-to-ransomware/
- https://www.linkedin.com/posts/kevin-beaumont-security_ive-been-assisting-a-few-orgs-hit-with-successful-activity-7268055739116445701-xxjZ/
- https://x.com/cyb3rops/status/1862406110365245506
- https://learn.microsoft.com/en-us/windows/client-management/client-tools/quick-assist
author: Muhammad Faisal (@faisalusuf)
date: 2024-12-19
tags:
- attack.command-and-control
- attack.t1219
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith: '\QuickAssist.exe'
  condition: selection
falsepositives:
- Legitimate use of Quick Assist in the environment.
level: low
notes: |
  ### Technical Context
  The Sigma rule “QuickAssist Execution” is designed to detect instances where the Microsoft Quick Assist tool, identified by the executable name “QuickAssist.exe,” is launched on Windows systems. Quick Assist is a legitimate application intended for assistance and remote support; however, its capabilities can be exploited by malicious actors to gain unauthorized access to systems. The detection relies on monitoring process creation logs, specifically targeting instances where the executable name ends with 'QuickAssist.exe'. This can help identify potentially suspicious activity where the tool is used inappropriately or without proper organizational oversight.
  Understanding the context and usage patterns of Quick Assist within the organization will be crucial for investigating alerts generated by this rule. Analysts should consider the timing of usage, user accounts associated with the launch, and related activities that may indicate either a valid support scenario or a security incident.
  ### Investigation Steps
  - Review process creation logs in the EDR to identify the account that initiated the QuickAssist.exe execution and examine the process tree for any related suspicious activity.
  - Check for any associated command-line parameters or environment variables via the EDR that could indicate misuse or an attempt to elevate privileges during the session.
  - Cross-reference VPN and Proxy logs to identify any remote connections established around the time Quick Assist was executed, particularly looking for unusual IP addresses or locations.
  - Consult Windows event logs to validate the context of the Quick Assist execution, including the logged user’s previous activity and any anomalous behaviors in the account health.
