title: Change Default File Association Via Assoc
id: 3d3aa6cd-6272-44d6-8afc-7e88dfef7061
related:
- id: ae6f14e6-14de-45b0-9f44-c0986f50dc89
  type: similar
status: test
description: |
  Detects file association changes using the builtin "assoc" command.
  When a file is opened, the default program used to open the file (also called the file association or handler) is checked. File association selections are stored in the Windows Registry and can be edited by users, administrators, or programs that have Registry access or by administrators using the built-in assoc utility. Applications can modify the file association for a given file extension to call an arbitrary program when a file with the given extension is opened.
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1546.001/T1546.001.md
author: Timur Zinniatullin, oscd.community
date: 2019-10-21
modified: 2023-03-06
tags:
- attack.persistence
- attack.t1546.001
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: '\cmd.exe'
  - OriginalFileName: 'Cmd.Exe'
  selection_cli:
    CommandLine|contains: 'assoc'
  condition: all of selection_*
fields:
- Image
- CommandLine
- User
- LogonGuid
- Hashes
- ParentProcessGuid
- ParentCommandLine
falsepositives:
- Admin activity
level: low
notes: |
  ### Technical Context
  This detection rule focuses on identifying changes made to file associations in Windows using the built-in `assoc` command. File associations define which program is opened when a user double-clicks on a particular file type, and they are stored in the Windows Registry. By monitoring process creation logs, especially those involving `cmd.exe`, the rule detects when `assoc` is used to modify these associations. This behavior can be leveraged by attackers to manipulate file handlers for malicious purposes, potentially leading to persistence mechanisms designed to execute arbitrary programs when certain file types are opened. The data sources involved primarily include process creation logs and command-line parameters, which provide insights into user actions and potentially malicious activities.
  ### Investigation Steps
  - Utilize your EDR tool to search for recent executions of `cmd.exe` that include the `assoc` command in their command-line parameters. Confirm the associated user and whether this usage aligns with known administrative activities.
  - Examine the Windows Registry to identify any recent changes to file associations that were made around the time the alert was triggered. Investigate which applications or users initiated those changes.
  - Review logs from your NGFW or proxy to identify any suspicious outbound connections that occurred immediately after changes to file associations. This can help determine if the system is contacting potentially malicious servers.
  - Assess the context of the alert by correlating with user activity logs and past incident reports to rule out legitimate administrative changes versus potential malicious behavior. This will help prioritize further investigation on affected hosts.
