title: PowerShell DownloadFile
id: 8f70ac5f-1f6f-4f8e-b454-db19561216c5
status: test
description: Detects the execution of powershell, a WebClient object creation and
  the invocation of DownloadFile in a single command line
references:
- https://www.fireeye.com/blog/threat-research/2020/03/apt41-initiates-global-intrusion-campaign-using-multiple-exploits.html
author: Florian Roth (Nextron Systems)
date: 2020-08-28
modified: 2021-11-27
tags:
- attack.execution
- attack.t1059.001
- attack.command-and-control
- attack.t1104
- attack.t1105
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|contains|all:
    - 'powershell'
    - '.DownloadFile'
    - 'System.Net.WebClient'
  condition: selection
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  The "PowerShell DownloadFile" detection rule identifies potentially malicious activity by monitoring for the execution of PowerShell commands that create a WebClient object and invoke the `DownloadFile` method. This specific sequence can indicate attempts at downloading files directly from the internet, which is often leveraged by attackers to execute payloads or exfiltrate data. The rule examines process creation logs on Windows systems for command lines that contain key phrases: 'powershell', '.DownloadFile', and 'System.Net.WebClient'. By correlating these specific indicators, security teams can detect unusual behaviors that may signify an attempted or successful infiltration.
  ### Investigation Steps
  - Review the process creation logs in your EDR tool to find instances of PowerShell execution matching the criteria from the alert.
  - Search AV logs for any detections or quarantines associated with the identified command, particularly focusing on any downloaded files.
  - Analyze network traffic through NDR or firewall logs to identify any outbound connections targeting suspicious or untrusted domains that may correspond with the command.
  - Investigate relevant logs from cloud platforms (AWS, GCP, Azure) for any unauthorized or unusual activities around the timeframe of the alert to assess potential lateral movement or data exfiltration.
