title: PUA - PingCastle Execution From Potentially Suspicious Parent
id: b37998de-a70b-4f33-b219-ec36bf433dc0
related:
- id: b1cb4ab6-ac31-43f4-adf1-d9d08957419c
  type: derived
status: test
description: |
  Detects the execution of PingCastle, a tool designed to quickly assess the Active Directory security level via a script located in a potentially suspicious or uncommon location.
references:
- https://github.com/vletoux/pingcastle
- https://thedfirreport.com/2023/10/30/netsupport-intrusion-results-in-domain-compromise/
- https://github.com/fengjixuchui/Start-ADEnum/blob/e237a739db98b6104427d833004836507da36a58/Functions/Start-ADEnum.ps1#L450
- https://github.com/lkys37en/Start-ADEnum/blob/5b42c54215fe5f57fc59abc52c20487d15764005/Functions/Start-ADEnum.ps1#L680
- https://github.com/projectHULK/AD_Recon/blob/dde2daba9b3393a9388cbebda87068972cc0bd3b/SecurityAssessment.ps1#L2699
- https://github.com/802-1x/Compliance/blob/2e53df8b6e89686a0b91116b3f42c8f717dca820/Ping%20Castle/Get-PingCastle-HTMLComplianceReport.ps1#L8
- https://github.com/EvotecIT/TheDashboard/blob/481a9ce8f82f2fd55fe65220ee6486bae6df0c9d/Examples/RunReports/PingCastle.ps1
author: Nasreddine Bencherchali (Nextron Systems), X__Junior (Nextron Systems)
date: 2024-01-11
tags:
- attack.reconnaissance
- attack.t1595
logsource:
  category: process_creation
  product: windows
detection:
  selection_parent_ext:
    ParentCommandLine|contains:
    - '.bat'
    - '.chm'
    - '.cmd'
    - '.hta'
    - '.htm'
    - '.html'
    - '.js'
    - '.lnk'
    - '.ps1'
    - '.vbe'
    - '.vbs'
    - '.wsf'
  selection_parent_path_1:
    ParentCommandLine|contains:
    - ':\Perflogs\'
    - ':\Temp\'
    - ':\Users\Public\'
    - ':\Windows\Temp\'
    - '\AppData\Local\Temp'
    - '\AppData\Roaming\'
    - '\Temporary Internet'
  selection_parent_path_2:
  - ParentCommandLine|contains|all:
    - ':\Users\'
    - '\Favorites\'
  - ParentCommandLine|contains|all:
    - ':\Users\'
    - '\Favourites\'
  - ParentCommandLine|contains|all:
    - ':\Users\'
    - '\Contacts\'
  selection_cli:
  - Image|endswith: '\PingCastle.exe'
  - OriginalFileName: PingCastle.exe
  - Product: 'Ping Castle'
  - CommandLine|contains:
    - '--scanner aclcheck'
    - '--scanner antivirus'
    - '--scanner computerversion'
    - '--scanner foreignusers'
    - '--scanner laps_bitlocker'
    - '--scanner localadmin'
    - '--scanner nullsession'
    - '--scanner nullsession-trust'
    - '--scanner oxidbindings'
    - '--scanner remote'
    - '--scanner share'
    - '--scanner smb'
    - '--scanner smb3querynetwork'
    - '--scanner spooler'
    - '--scanner startup'
    - '--scanner zerologon'
  - CommandLine|contains: '--no-enum-limit'
  - CommandLine|contains|all:
    - '--healthcheck'
    - '--level Full'
  - CommandLine|contains|all:
    - '--healthcheck'
    - '--server '
  condition: 1 of selection_parent_* and selection_parent_ext and selection_cli
falsepositives:
- Unknown
level: high
notes: |
  n
  ### Technical Context
  This detection rule is designed to identify the execution of PingCastle, a security assessment tool for Active Directory, when initiated from a potentially suspicious parent process. The rule checks for processes that are spawned under certain anomalous command line patterns and locations indicative of suspicious activity, such as scripts executed from temporary folders or uncommon file extensions like `.bat`, `.ps1`, and `.html`. It leverages Windows process creation logs as the primary telemetry source, assessing the parent command line and paths to identify behaviors that correspond to reconnaissance activities, specifically under the MITRE ATT&CK tactic of reconnaissance, tactic ID T1595. By monitoring for specific command line arguments used by PingCastle, the rule aims to catch attempts to gather sensitive information from Active Directory in potentially unauthorized contexts.
  ### Investigation Steps
  - **Review Process Creation Logs**: Utilize EDR tools to inspect recent process creation logs surrounding the PingCastle execution, focusing on the parent process details and their associated command lines. 
  - **Analyze Command Line Arguments**: Examine the command line arguments used during the PingCastle execution; pay attention to any unusual or unauthorized parameters that may indicate malicious intent.
  - **Check Source Locations**: Investigate the file path from which PingCastle was run. Cross-reference this against known safe directories to determine if it originated from a suspicious or unusual location.
  - **Correlate with User Activity**: Use Windows Security event logs to correlate the time of the PingCastle execution with user activity logs to identify the user context involved and to spot possible unauthorized access or privilege escalation.
  ### Prioritization
  The alert generated from this rule is classified as high severity due to the potential risk associated with unauthorized reconnaissance activity that can lead to further compromise within the Active Directory environment.
  ### Blind Spots and Assumptions
  This rule may not fire if the parent process does not conform to the specified directory or file type patterns, or if PingCastle is executed from a legitimate location. Additionally, the rule assumes that users do not have malicious intent when executing scripts from common directories, which might lead to false negatives. Lastly, if the system has overly permissive settings or lacks adequate logging, these scenarios could prevent detection.
  > **Disclaimer:** This investigation guide was created using generative AI technology and has not been reviewed for its accuracy and relevance. While every effort has been made to ensure its quality, we recommend validating the content and adapting it to suit specific environment and operational needs. Please communicate any changes to the detection engineering team.
