title: UAC Bypass Abusing Winsat Path Parsing - Process
id: 7a01183d-71a2-46ad-ad5c-acd989ac1793
status: test
description: Detects the pattern of UAC Bypass using a path parsing issue in winsat.exe
  (UACMe 52)
references:
- https://github.com/hfiref0x/UACME
author: Christian Burkard (Nextron Systems)
date: 2021-08-30
modified: 2024-12-01
tags:
- attack.defense-evasion
- attack.privilege-escalation
- attack.t1548.002
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    IntegrityLevel:
    - 'High'
    - 'System'
    - 'S-1-16-16384'         # System
    - 'S-1-16-12288'         # High
    ParentImage|endswith: '\AppData\Local\Temp\system32\winsat.exe'
    ParentCommandLine|contains: 'C:\Windows \system32\winsat.exe'
  condition: selection
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This detection rule identifies potential User Account Control (UAC) bypass attempts by examining the process creation of `winsat.exe`, which can be manipulated to escalate privileges through path parsing issues. The rule looks for processes that have a high integrity level, indicating that they are executing with elevated privileges, while also inspecting the parent image and command-line parameters associated with the execution of `winsat.exe`. The specific pattern of the parent command line containing the path to `C:\Windows\System32\winsat.exe`, along with its execution from a temporary directory, suggests an attempt to exploit this UAC bypass technique. By monitoring these characteristics in process creation logs, analysts can detect suspicious activity tied to privilege escalation attempts involving `winsat.exe`.
  ### Investigation Steps
  - Review recent process creation logs from the EDR to identify occurrences of `winsat.exe` being launched from the specified path with high integrity levels.
  - Utilize the AV solution to scan the impacted hosts for any known malware or scripts that may have leveraged the UAC bypass technique in conjunction with `winsat.exe`.
  - Analyze the command-line arguments in conjunction with the parent image to verify the legitimacy of the processes and uncover any malicious patterns.
  - Check the firewall and proxy logs for any unusual outbound connections that may indicate further malicious activity following the execution of the flagged process.
