title: Remote Access Tool - GoToAssist Execution
id: b6d98a4f-cef0-4abf-bbf6-24132854a83d
status: test
description: |
  An adversary may use legitimate desktop support and remote access software, such as Team Viewer, Go2Assist, LogMein, AmmyyAdmin, etc, to establish an interactive command and control channel to target systems within networks.
  These services are commonly used as legitimate technical support software, and may be allowed by application control within a target environment.
  Remote access tools like VNC, Ammyy, and Teamviewer are used frequently when compared with other legitimate software commonly used by adversaries. (Citation: Symantec Living off the Land)
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1219/T1219.md#atomic-test-4---gotoassist-files-detected-test-on-windows
author: frack113
date: 2022-02-13
modified: 2023-03-05
tags:
- attack.command-and-control
- attack.t1219
logsource:
  category: process_creation
  product: windows
detection:
  selection:
  - Description: 'GoTo Opener'
  - Product: 'GoTo Opener'
  - Company: 'LogMeIn, Inc.'
  condition: selection
falsepositives:
- Legitimate use
level: medium
notes: |
  ### Technical Context
  The detection rule for GoToAssist execution identifies the use of the GoTo Opener application, which is a legitimate remote access tool frequently exploited by adversaries to establish an interactive command and control (C2) channel within targeted networks. The rule specifically examines process creation logs to detect instances where the application displays certain descriptions and company identifiers associated with LogMeIn, Inc. This is crucial because adversaries often leverage trusted software to bypass security measures like application controls. By monitoring for these specific indicators, the rule aims to flag potential abuses of remote access tools that may indicate unauthorized remote sessions or malicious activity, enhancing the capability of Security Operations Center (SOC) analysts to respond effectively to possible intrusions.
  ### Investigation Steps
  - Review EDR logs for process creation events related to the GoTo Opener application within the specified timeframe to confirm matching indicators.
  - Assess network logs (from NDR or NGFW) for any unusual inbound or outbound traffic patterns originating from devices that launched the GoTo Opener.
  - Examine relevant user activity logs to determine whether there is legitimate justification for the use of GoToOpener by the associated user account during the detected time frame.
  - Cross-reference with application control settings to ensure that the execution of GoTo Opener aligns with documented business needs and policies.
