title: Unmount Share Via Net.EXE
id: cb7c4a03-2871-43c0-9bbb-18bbdb079896
status: test
description: Detects when when a mounted share is removed. Adversaries may remove
  share connections that are no longer useful in order to clean up traces of their
  operation
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1070.005/T1070.005.md
author: oscd.community, @redcanary, Zach Stanford @svch0st
date: 2020-10-08
modified: 2023-02-21
tags:
- attack.defense-evasion
- attack.t1070.005
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith:
    - '\net.exe'
    - '\net1.exe'
  - OriginalFileName:
    - 'net.exe'
    - 'net1.exe'
  selection_cli:
    CommandLine|contains|all:
    - 'share'
    - '/delete'
  condition: all of selection*
falsepositives:
- Administrators or Power users may remove their shares via cmd line
level: low
notes: |
  ### Technical Context
  The "Unmount Share Via Net.EXE" detection rule is designed to identify when an adversary removes a mounted network share using the Net.exe or Net1.exe utilities, as this action may be indicative of attempts to manipulate or erase traces of their activities. The rule looks for process creation logs, specifically monitoring invocations of these executables where the command line contains both the keyword 'share' and the '/delete' switch, signifying that a share removal is being requested. Monitoring for the original file names ensures that legitimate administrative actions are not confused with potential malicious behavior, providing clearer context for incident responders.
  This detection can leverage a variety of data sources available in Windows environments, primarily focusing on the process creation logs that register when executable files are launched, along with their associated command-line parameters. By filtering on the specific characteristics of these command-line arguments, the rule aims to enhance the security posture against possible unauthorized manipulations of file shares.
  ### Investigation Steps
  - Utilize your EDR tool to investigate the process creation logs for instances of 'net.exe' or 'net1.exe' being executed with the parameters indicating a share deletion.
  - Correlate the timestamp of the detected activity with user access logs from the SIEM to determine if the action aligns with legitimate administrative tasks or if it appears out of place.
  - Check for any network traffic via your NDR solution to identify if data was transferred from the share prior to its unmounting, which may indicate data exfiltration attempts.
  - Review authentication logs from both the Proxy and VPN to assess whether there were any unusual login attempts or IP addresses involved with the share removal, which could give insight into possible unauthorized access.
