title: HackTool - KrbRelay Execution
id: e96253b8-6b3b-4f90-9e59-3b24b99cf9b4
status: test
description: Detects the use of KrbRelay, a Kerberos relaying tool
references:
- https://github.com/cube0x0/KrbRelay
author: Florian Roth (Nextron Systems)
date: 2022-04-27
modified: 2023-02-04
tags:
- attack.credential-access
- attack.t1558.003
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: '\KrbRelay.exe'
  - OriginalFileName: 'KrbRelay.exe'       # In case the file has been renamed after compilation
  selection_cli_1:
    CommandLine|contains|all:
    - ' -spn '
    - ' -clsid '
    - ' -rbcd '
  selection_cli_2:
    CommandLine|contains|all:
    - 'shadowcred'
    - 'clsid'
    - 'spn'
  selection_cli_3:
    CommandLine|contains|all:
    - 'spn '
    - 'session '
    - 'clsid '
  condition: 1 of selection_*
falsepositives:
- Unlikely
level: high
notes: |
  ### Technical Context
  This detection rule identifies potential use of the Kerberos relaying tool, KrbRelay, which is known to facilitate credential theft by manipulating Kerberos Ticket Granting Tickets (TGTs). The rule is designed to trigger on specific attributes associated with the execution of `KrbRelay.exe` in a Windows environment. It inspects process creation logs to determine if the `KrbRelay.exe` executable is started, either by its original file name or through a renamed instance. Additionally, the rule checks for suspicious command-line arguments indicative of Kerberos relaying activities. These arguments include disabled service principal names (SPNs), class IDs (CLSIDs), and session references, which are often exploited during such attacks.
  ### Investigation Steps
  - Examine the process creation logs in the EDR tool for instances where `KrbRelay.exe` was executed. Focus on monitoring the associated user and session for unusual behavior.
  - Investigate the command-line parameters used during the execution of KrbRelay to determine the context of its use. Look for suspicious flags or arguments that may indicate malicious intent.
  - Cross-reference user accounts associated with the execution against known compromised accounts or unusual login patterns in cloud logs and VPN access records.
  - Correlate findings with network traffic data from NDR and NGFW to identify any potential exfiltration attempts or abnormal outbound connections after the execution of KrbRelay.
