title: Console CodePage Lookup Via CHCP
id: 7090adee-82e2-4269-bd59-80691e7c6338
status: test
description: Detects use of chcp to look up the system locale value as part of host
  discovery
references:
- https://thedfirreport.com/2022/04/04/stolen-images-campaign-ends-in-conti-ransomware/
- https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/chcp
author: _pete_0, TheDFIRReport
date: 2022-02-21
modified: 2024-03-05
tags:
- attack.discovery
- attack.t1614.001
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    ParentImage|endswith: '\cmd.exe'
    ParentCommandLine|contains|windash:
    - ' -c '
    - ' -r '
    - ' -k '
    Image|endswith: '\chcp.com'
    CommandLine|endswith:
    - 'chcp'
    - 'chcp '
    - 'chcp  '
  condition: selection
falsepositives:
- During Anaconda update the 'conda.exe' process will eventually execution the 'chcp'
  command.
- Discord was seen using chcp to look up code pages
level: medium
notes: |
  ### Technical Context
  The Sigma rule titled "Console CodePage Lookup Via CHCP" is designed to detect potentially malicious activity related to host discovery on Windows systems. Specifically, it identifies instances where the `chcp` command is invoked to check or manipulate the system's code page, which can reveal information about the host's locale settings. The detection rule focuses on process creation logs, particularly targeting instances where `chcp.com` is executed as a child process of `cmd.exe` with specific command-line parameters that may indicate non-standard usage associated with reconnaissance or lateral movement activities. By monitoring these indicators, security teams can identify suspicious host discovery attempts possibly linked to attacker behaviors.
  ### Investigation Steps
  - Review the EDR logs for the process creation events associated with `chcp.com` to identify the initiating source and parent process involved.
  - Investigate the command-line parameters of the detected `chcp` executions to understand the context of the execution and if they align with typical application behaviors or are indicative of malicious intent.
  - Correlate the alert with recent user activity in the environment to identify any unauthorized or unusual access patterns that may accompany host discovery attempts.
  - Check for any related network activity in firewall and proxy logs for outgoing connections or unusual data exfiltration that may suggest a broader attack in progress.
