title: HackTool - RedMimicry Winnti Playbook Execution
id: 95022b85-ff2a-49fa-939a-d7b8f56eeb9b
status: test
description: Detects actions caused by the RedMimicry Winnti playbook a automated
  breach emulations utility
references:
- https://redmimicry.com/posts/redmimicry-winnti/
author: Alexander Rausch
date: 2020-06-24
modified: 2023-03-01
tags:
- attack.execution
- attack.defense-evasion
- attack.t1106
- attack.t1059.003
- attack.t1218.011
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    Image|endswith:
    - '\rundll32.exe'
    - '\cmd.exe'
    CommandLine|contains:
    - 'gthread-3.6.dll'
    - '\Windows\Temp\tmp.bat'
    - 'sigcmm-2.4.dll'
  condition: selection
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  The Sigma rule titled "HackTool 
  - RedMimicry Winnti Playbook Execution" is designed to identify potential malicious activity associated with the automated breach emulation utility known as RedMimicry. This rule detects specific process creation events that involve the execution of 'rundll32.exe' or 'cmd.exe' with malicious command-line parameters indicative of the Winnti playbook execution. The presence of particular DLL files such as 'gthread-3.6.dll', 'sigcmm-2.4.dll', and the execution of batch files located in the Temp directory are key indicators of this automated attack framework. By analyzing these elements in process creation logs, security teams can pinpoint potential instances of RedMimicry exploitation in their environment.
  ### Investigation Steps
  - Investigate recent process creation events in the EDR tool to identify executions of 'rundll32.exe' or 'cmd.exe' that match the specified command-line parameters.
  - Review the command-line arguments for any presence of 'gthread-3.6.dll', 'sigcmm-2.4.dll', or paths like '\Windows\Temp\tmp.bat' to confirm potential malicious activity.
  - Cross-reference affected systems against the AV logs to determine if any known signatures or detections related to RedMimicry or similar tools were flagged.
  - Analyze network traffic patterns using the NDR tool to check for any outbound communications originating from flagged processes that may indicate data exfiltration or command and control behavior.
