title: Command Line Execution with Suspicious URL and AppData Strings
id: 1ac8666b-046f-4201-8aba-1951aaec03a3
status: test
description: Detects a suspicious command line execution that includes an URL and
  AppData string in the command line parameters as used by several droppers (js/vbs
  > powershell)
references:
- https://www.hybrid-analysis.com/sample/3a1f01206684410dbe8f1900bbeaaa543adfcd07368ba646b499fa5274b9edf6?environmentId=100
- https://www.hybrid-analysis.com/sample/f16c729aad5c74f19784a24257236a8bbe27f7cdc4a89806031ec7f1bebbd475?environmentId=100
author: Florian Roth (Nextron Systems), Jonhnathan Ribeiro, oscd.community
date: 2019-01-16
modified: 2021-11-27
tags:
- attack.execution
- attack.command-and-control
- attack.t1059.003
- attack.t1059.001
- attack.t1105
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith: '\cmd.exe'
    CommandLine|contains|all:
    - 'http'         # captures both http and https
    - '://'
    - '%AppData%'
  condition: selection
fields:
- CommandLine
- ParentCommandLine
falsepositives:
- High
level: medium
notes: |
  ### Technical Context
  This detection rule identifies potentially malicious command line executions that utilize both an HTTP or HTTPS URL and an AppData directory string within the command line arguments. Malicious actors often leverage tools like cmd.exe to execute payloads that download and execute further stages of malware, particularly through dropper scripts written in JavaScript or VBScript that invoke PowerShell. By monitoring process creation logs specifically for cmd.exe executions containing an HTTP/HTTPS URL and references to the AppData directory, the rule effectively flags suspicious activity associated with known attack techniques tied to command execution and command-and-control operations. The rule helps security analysts pinpoint executions that may lead to further unwanted behavior on the system.
  ### Investigation Steps
  - Use the EDR platform to review details of the process creation event including the CommandLine and ParentCommandLine fields associated with the alert.
  - Investigate the parent process to determine if it exhibits suspicious behavior or originates from an untrusted source, especially when it initiates cmd.exe.
  - Correlate the alert with Proxy logs to see if the suspicious URL has been accessed and to reveal any additional context about the network behavior of the host.
  - Examine local and cloud storage logs to identify any downloads or artifacts within the AppData directory that may have been created or modified around the time of the suspicious execution.
