title: Node Process Executions
id: df1f26d3-bea7-4700-9ea2-ad3e990cf90e
status: test
description: Detects the execution of other scripts using the Node executable packaged
  with Adobe Creative Cloud
references:
- https://twitter.com/mttaggart/status/1511804863293784064
author: Max Altgelt (Nextron Systems)
date: 2022-04-06
tags:
- attack.defense-evasion
- attack.t1127
- attack.t1059.007
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith: '\Adobe Creative Cloud Experience\libs\node.exe'
  filter:
    CommandLine|contains: 'Adobe Creative Cloud Experience\js'     # Folder where Creative Cloud's JS resources are located
  condition: selection and not filter
fields:
- Image
- CommandLine
- ParentCommandLine
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  This Sigma rule is designed to identify potentially malicious activity by monitoring the execution of scripts using the Node.js executable that is bundled with Adobe Creative Cloud. Specifically, it looks for instances where the Node executable, located in the `\Adobe Creative Cloud Experience\libs\` directory, is invoked to execute JavaScript (JS) files stored in the same Adobe folder. The rule distinguishes between legitimate uses of Node.js by filtering out command-line indicators associated with expected operations of Adobe's software. By detecting these instances, it helps to highlight unusual or unauthorized uses of the Node executable, which could indicate attempts to abuse the application or execute harmful scripts.
  ### Investigation Steps
  - Examine the process creation logs in your EDR solution to locate the instances of `node.exe` and analyze the associated command-line parameters for any indicators of compromise.
  - Investigate the parent process from which the Node executable was spawned to understand the context of its execution and determine if it originated from an expected application.
  - Review firewall logs to check for any anomalous outbound connections made by the Node process that may indicate data exfiltration or communication with a command-and-control server.
  - Conduct a search in the cloud logs (if applicable) to identify any recent deployments or modifications to scripts stored on cloud platforms that could correlate with the detected activity.
