title: Diskshadow Script Mode - Uncommon Script Extension Execution
id: 1dde5376-a648-492e-9e54-4241dd9b0c7f
related:
- id: fa1a7e52-3d02-435b-81b8-00da14dd66c1     # Diskshadow Script Mode - Execution From Potential Suspicious Location
  type: similar
- id: 9f546b25-5f12-4c8d-8532-5893dcb1e4b8     # Potentially Suspicious Child Process Of DiskShadow.EXE
  type: similar
- id: 56b1dde8-b274-435f-a73a-fb75eb81262a     # Diskshadow Child Process Spawned
  type: similar
- id: 0c2f8629-7129-4a8a-9897-7e0768f13ff2     # Diskshadow Script Mode Execution
  type: similar
status: test
description: |
  Detects execution of "Diskshadow.exe" in script mode to execute an script with a potentially uncommon extension.
  Initial baselining of the allowed extension list is required.
references:
- https://bohops.com/2018/03/26/diskshadow-the-return-of-vss-evasion-persistence-and-active-directory-database-extraction/
- https://www.ired.team/offensive-security/credential-access-and-credential-dumping/ntds.dit-enumeration
- https://medium.com/@cyberjyot/lolbin-execution-via-diskshadow-f6ff681a27a4
- https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/diskshadow
- https://www.lifars.com/wp-content/uploads/2022/01/GriefRansomware_Whitepaper-2.pdf
- https://www.zscaler.com/blogs/security-research/technical-analysis-crytox-ransomware
- https://research.checkpoint.com/2022/evilplayout-attack-against-irans-state-broadcaster/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023-09-15
modified: 2024-03-05
tags:
- attack.defense-evasion
- attack.t1218
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - OriginalFileName: 'diskshadow.exe'
  - Image|endswith: '\diskshadow.exe'
  selection_flag:
    CommandLine|contains|windash: '-s '
  filter_main_ext:
        # Note: can be changed to an "endswith" to avoid rare FPs. But you need to account for quoted paths
        # Note: Using the ".txt" is based on the MS documentation example. Best add the extension you use internally before using this rule
    CommandLine|contains: '.txt'
  condition: all of selection_* and not 1 of filter_main_*
falsepositives:
- False postitve might occur with legitimate or uncommon extensions used internally.
  Initial baseline is required.
level: medium
notes: |
  ### Technical Context
  This detection rule identifies potentially malicious usage of the Windows utility "Diskshadow.exe" when it is executed in script mode with an uncommon file extension, such as ".txt". The rule monitors process creation logs and specifically looks for Diskshadow.exe commands that include the "-s" parameter, indicating script execution. Additionally, it filters command lines containing uncommon extensions to prevent false positives from legitimate use cases. Analysts are advised to create an initial baseline of commonly accepted file extensions to fine-tune the rule and differentiate between legitimate administrative activities and potential malicious intent, especially in environments where customization is prevalent.
  ### Investigation Steps
  - Review the process creation logs in the EDR solution to identify instances of "Diskshadow.exe" execution, paying close attention to the specific command-line arguments provided.
  - Check the associated user account for any unusual behavior or access methods, and corroborate against user activity logs to identify potential misuse of administrative privileges.
  - Examine the command-line parameters used with "Diskshadow.exe" to confirm the presence of uncommon file extensions and assess the context of their usage.
  - Analyze system and security event logs for any corresponding events that may indicate attempts to evade detection or utilize "Diskshadow.exe" for unauthorized access.
