title: HackTool - CoercedPotato Execution
id: e8d34729-86a4-4140-adfd-0a29c2106307
status: experimental
description: Detects the use of CoercedPotato, a tool for privilege escalation
references:
- https://github.com/hackvens/CoercedPotato
- https://blog.hackvens.fr/articles/CoercedPotato.html
author: Florian Roth (Nextron Systems)
date: 2023-10-11
modified: 2024-11-23
tags:
- attack.defense-evasion
- attack.privilege-escalation
- attack.t1055
logsource:
  category: process_creation
  product: windows
detection:
  selection_loader_img:
    Image|endswith: '\CoercedPotato.exe'
  selection_params:
    CommandLine|contains: ' --exploitId '
  selection_loader_imphash:
    Hashes|contains:
    - 'IMPHASH=A75D7669DB6B2E107A44C4057FF7F7D6'
    - 'IMPHASH=F91624350E2C678C5DCBE5E1F24E22C9'
    - 'IMPHASH=14C81850A079A87E83D50CA41C709A15'
  condition: 1 of selection_*
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  The "HackTool 
  - CoercedPotato Execution" Sigma rule is designed to identify the execution of CoercedPotato, a tool often used for privilege escalation in Windows environments. This rule focuses on specific indicators associated with the execution of CoercedPotato, specifically monitoring process creation logs for instances where the executable `CoercedPotato.exe` is invoked with command-line parameters including `--exploitId`. Additionally, the rule checks the import hash of the executable against known values that are characteristic of malicious versions of this tool. By correlating these data points, the rule aims to detect unauthorized attempts to elevate privileges within the system.
  The data sources involved in this detection include Windows process creation logs, which provide insights into the execution of applications and their command-line arguments. By analyzing these logs, Security Operations Center (SOC) analysts can identify potentially malicious activity and take necessary actions to mitigate threats related to privilege escalation attempts.
  ### Investigation Steps
  - Review the process creation logs in the EDR to identify any instances of `CoercedPotato.exe` running, noting any unusual parent-child process relationships.
  - Analyze the command-line parameters used during the execution to determine if `--exploitId` or other suspicious flags were present, indicating potential misuse.
  - Cross-reference the import hash of `CoercedPotato.exe` against known malicious hashes to confirm if the version used is suspected to be compromised.
  - Investigate logs from AV or NGFW tools for additional context on network activity associated with the execution, which may provide insights into data exfiltration or other malicious actions.
