title: Suspicious Execution of Hostname
id: 7be5fb68-f9ef-476d-8b51-0256ebece19e
status: test
description: Use of hostname to get information
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1082/T1082.md#atomic-test-6---hostname-discovery-windows
- https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/hostname
author: frack113
date: 2022-01-01
tags:
- attack.discovery
- attack.t1082
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith: '\HOSTNAME.EXE'
  condition: selection
falsepositives:
- Unknown
level: low
notes: |
  ### Technical Context
  This detection rule is designed to identify potentially suspicious executions of the `hostname.exe` process on Windows systems. The primary function of this executable is to retrieve the computer's hostname, which can be a legitimate action. However, its usage in unexpected contexts or by untrusted processes may indicate reconnaissance activities by an attacker. The rule monitors process creation logs to capture instances where `hostname.exe` is executed, particularly focusing on the full image path ending with '\HOSTNAME.EXE'. Investigators should pay attention to the context in which this command is run, as it can reveal attempts to gather information about the environment, particularly in the early stages of a cyber attack.
  ### Investigation Steps
  - Review the process creation logs in your EDR tool to confirm the execution of `hostname.exe`, noting the parent process and user account associated with it.
  - Analyze command-line parameters of the `hostname.exe` execution to determine if it was initiated by an unusual process or if any suspicious flags were used.
  - Check network logs from your Firewall or Proxy to identify any outbound connections made shortly after the execution, which may point to data exfiltration or unauthorized network reconnaissance.
  - Examine related activity in endpoint antivirus logs to see if there are any alerts or detections around the time of the `hostname.exe` execution, providing further insight into potential malicious behavior.
