title: Winrar Execution in Non-Standard Folder
id: 4ede543c-e098-43d9-a28f-dd784a13132f
status: test
description: Detects a suspicious winrar execution in a folder which is not the default
  installation folder
references:
- https://twitter.com/cyb3rops/status/1460978167628406785
author: Florian Roth (Nextron Systems), Tigzy
date: 2021-11-17
modified: 2023-08-31
tags:
- attack.collection
- attack.t1560.001
logsource:
  category: process_creation
  product: windows
detection:
  selection:
  - Image|endswith:
    - '\rar.exe'
    - '\winrar.exe'
  - Description: 'Command line RAR'
  filter_main_unrar:
        # Note: we filter unrar as it has the same description as the other utilities, and we're only interested in compression
    Image|endswith: '\UnRAR.exe'
  filter_main_path:
    Image|contains:
    - ':\Program Files (x86)\WinRAR\'
    - ':\Program Files\WinRAR\'
  filter_optional_temp:
        # Note: in some occasion installers were seen dropping "rar" in TEMP
    Image|contains: ':\Windows\Temp\'
  condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
falsepositives:
- Legitimate use of WinRAR in a folder of a software that bundles WinRAR
level: medium
notes: |
  ### Technical Context
  This Sigma rule is designed to detect suspicious executions of the WinRAR application in directories that deviate from its standard installation paths. Specifically, it flags the execution of `rar.exe` or `winrar.exe` when these binaries are run in locations other than the typical `C:\Program Files (x86)\WinRAR\` or `C:\Program Files\WinRAR\` directories. Additionally, the rule filters out instances where the WinRAR utility is executed from temporary directories, which might indicate legitimate installers or benign uses of the tool. By focusing on the command line parameters and specific image paths, the rule aims to capture potential misuse of WinRAR, a commonly used file compression tool, which could be leveraged by adversaries for data exfiltration or malware deployment.
  ### Investigation Steps
  - Review the process creation logs in your EDR tool to identify the execution context of WinRAR, including the user account and the command-line parameters used.
  - Check the location from which WinRAR was executed against the known installation paths to confirm any deviations, and note any other binaries present in the same directory.
  - Investigate recent file activities in the folder flagged by the detection rule, looking for unusual file compression or extraction that could indicate malicious actions.
  - Correlate any alerts with network logs from your NDR or Proxy to see if there were any unauthorized data transfers associated with the instances of WinRAR execution.
