title: Suspicious Outlook Child Process
id: 208748f7-881d-47ac-a29c-07ea84bf691d
related:
- id: 438025f9-5856-4663-83f7-52f878a70a50     # Office Child Processes
  type: derived
- id: e212d415-0e93-435f-9e1a-f29005bb4723     # Outlook Remote Child Process
  type: derived
status: test
description: Detects a suspicious process spawning from an Outlook process.
references:
- https://www.hybrid-analysis.com/sample/465aabe132ccb949e75b8ab9c5bda36d80cf2fd503d52b8bad54e295f28bbc21?environmentId=100
- https://mgreen27.github.io/posts/2018/04/02/DownloadCradle.html
author: Michael Haag, Florian Roth (Nextron Systems), Markus Neis, Elastic, FPT.EagleEye
  Team
date: 2022-02-28
modified: 2023-02-04
tags:
- attack.execution
- attack.t1204.002
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    ParentImage|endswith: '\OUTLOOK.EXE'
    Image|endswith:
    - '\AppVLP.exe'
    - '\bash.exe'
    - '\cmd.exe'
    - '\cscript.exe'
    - '\forfiles.exe'
    - '\hh.exe'
    - '\mftrace.exe'
    - '\msbuild.exe'                # https://github.com/elastic/detection-rules/blob/c76a39796972ecde44cb1da6df47f1b6562c9770/rules/windows/defense_evasion_execution_msbuild_started_by_office_app.toml
    - '\msdt.exe'                   # CVE-2022-30190
    - '\mshta.exe'
    - '\msiexec.exe'
    - '\powershell.exe'
    - '\pwsh.exe'
    - '\regsvr32.exe'
    - '\schtasks.exe'
    - '\scrcons.exe'
    - '\scriptrunner.exe'
    - '\sh.exe'
    - '\svchost.exe'                # https://www.vmray.com/analyses/2d2fa29185ad/report/overview.html
    - '\wmic.exe'                   # https://app.any.run/tasks/c903e9c8-0350-440c-8688-3881b556b8e0/
    - '\wscript.exe'
            # Several FPs with rundll32.exe
            # We started excluding specific use cases and ended up commenting out the rundll32.exe sub processes completely
            # - '\rundll32.exe'
            # filter_outlook_photoviewer:  # https://twitter.com/Luke_Hamp/status/1495919717760237568
            #   ParentImage|endswith: '\OUTLOOK.EXE'
            #   Image|endswith: '\rundll32.exe'
            #   CommandLine|contains: '\PhotoViewer.dll'
            # filter_outlook_printattachments:  # https://twitter.com/KickaKamil/status/1496238278659485696
            #   ParentImage|endswith: '\OUTLOOK.EXE'
            #   Image|endswith: '\rundll32.exe'
            #   CommandLine|contains|all:
            #     - 'shell32.dll,Control_RunDLL'
            #     - '\SYSTEM32\SPOOL\DRIVERS\'
  condition: selection   # and not 1 of filter*
fields:
- CommandLine
- ParentCommandLine
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This detection rule focuses on identifying potentially malicious child processes that are spawned from the Outlook application (OUTLOOK.EXE) on Windows systems. It specifically looks for a predefined list of processes often misused by attackers to execute additional commands or scripts, which can be indicative of malicious behavior such as executing payloads or establishing persistence. The rule analyzes the `process_creation` logs, examining the `ParentImage` for instances of OUTLOOK.EXE and checking the `Image` for a range of suspicious executables, including command-line tools, scripting engines, and various Windows utilities known to be exploited in attacks. By monitoring these relationships, the rule enables the SOC to proactively identify and respond to potential threats that leverage the legitimate Outlook process as a cover.
  ### Investigation Steps
  - Review the process creation logs in your EDR solution to trace the execution flow of the alerting processes and verify their lineage from OUTLOOK.EXE.
  - Examine the command-line arguments associated with detecting processes to better understand what operations were attempted and whether they indicate malicious intent.
  - Check the alerting user's activities within email and access logs, especially looking for unusual behaviors or unauthorized access that could correlate with the spawned processes.
  - Analyze network traffic logs for any outbound connections initiated by the suspicious processes to detect potential data exfiltration or communication with a command and control server.
