title: Suspicious File Download From IP Via Wget.EXE - Paths
id: 40aa399c-7b02-4715-8e5f-73572b493f33
status: test
description: Detects potentially suspicious file downloads directly from IP addresses
  and stored in suspicious locations using Wget.exe
references:
- https://www.gnu.org/software/wget/manual/wget.html
author: Nasreddine Bencherchali (Nextron Systems)
date: 2024-02-23
tags:
- attack.execution
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: '\wget.exe'
  - OriginalFileName: 'wget.exe'
  selection_ip:
    CommandLine|re: '://[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}'
  selection_http:
    CommandLine|contains: 'http'
  selection_flag:
  - CommandLine|re: '\s-O\s'
  - CommandLine|contains: '--output-document'
  selection_paths:
  - CommandLine|contains:
    - ':\PerfLogs\'
    - ':\Temp\'
    - ':\Users\Public\'
    - ':\Windows\Help\'
    - ':\Windows\Temp\'
    - '\Temporary Internet'
  - CommandLine|contains|all:
    - ':\Users\'
    - '\Favorites\'
  - CommandLine|contains|all:
    - ':\Users\'
    - '\Favourites\'
  - CommandLine|contains|all:
    - ':\Users\'
    - '\Contacts\'
  - CommandLine|contains|all:
    - ':\Users\'
    - '\Pictures\'
  condition: all of selection_*
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This detection rule identifies potentially suspicious file downloads executed through Wget.exe on Windows systems. It focuses on the presence of command-line arguments used to specify IP addresses as download sources, as well as the use of options to control output locations. The rule inspects process creation logs for events generated by the execution of Wget.exe, specifically looking for command-line patterns that indicate files are being downloaded from raw IP addresses (as opposed to domain names) and stored in predefined, potentially alarming directories. 
  Data sources leveraged for this rule include command-line parameters from process creation events, which provide insight into the nature of the downloads and their intended storage locations. By identifying such patterns, the rule assists analysts in recognizing behavior that could indicate malicious intent, such as unauthorized data exfiltration or malware delivery.
  ### Investigation Steps
  - Utilize EDR tools to review detailed process execution logs related to Wget.exe, focusing on command-line arguments to confirm download sources and file paths. 
  - Check endpoint logs for any signs of post-download activity, such as process creation or network connections indicating the files may be executed or accessed.
  - Search proxy logs for any outbound connections made to the identified IP addresses to assess the context of these file downloads.
  - Investigate user activity logs and access patterns to determine if the downloaded files were accessed by accounts or devices that typically shouldn't engage with those specific paths.
