title: Private Keys Reconnaissance Via CommandLine Tools
id: 213d6a77-3d55-4ce8-ba74-fcfef741974e
status: test
description: Adversaries may search for private key certificate files on compromised
  systems for insecurely stored credential
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1552.004/T1552.004.md
author: frack113, Nasreddine Bencherchali (Nextron Systems)
date: 2021-07-20
modified: 2023-03-06
tags:
- attack.credential-access
- attack.t1552.004
logsource:
  category: process_creation
  product: windows
detection:
  selection_cmd_img:
  - Image|endswith: '\cmd.exe'
  - OriginalFileName: 'Cmd.Exe'
  selection_cmd_cli:
    CommandLine|contains: 'dir '
  selection_pwsh_img:
  - Image|endswith:
    - '\powershell.exe'
    - '\pwsh.exe'
  - OriginalFileName:
    - 'PowerShell.EXE'
    - 'pwsh.dll'
  selection_pwsh_cli:
    CommandLine|contains: 'Get-ChildItem '
  selection_findstr:
  - Image|endswith: '\findstr.exe'
  - OriginalFileName: 'FINDSTR.EXE'
  selection_ext:
    CommandLine|contains:
    - '.key'
    - '.pgp'
    - '.gpg'
    - '.ppk'
    - '.p12'
    - '.pem'
    - '.pfx'
    - '.cer'
    - '.p7b'
    - '.asc'
  condition: selection_ext and (all of selection_cmd_* or all of selection_pwsh_*
    or selection_findstr)
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  This Sigma rule focuses on detecting potential reconnaissance activities conducted by adversaries who are searching for privately stored key certificate files on Windows systems. The rule analyzes process creation logs to identify specific command-line interactions that suggest an attempt to locate private keys, which could indicate an ongoing credential access attack. It looks for common command-line utilities such as `cmd.exe`, `powershell.exe`, and `findstr.exe`, alongside specific commands like `dir` and `Get-ChildItem`, which are indicative of directory browsing. Furthermore, the rule checks for queries related to various file extensions associated with cryptographic keys, such as `.pem`, `.pfx`, and `.gpg`, to enhance detection capabilities. Overall, by monitoring both the processes initiated and the characteristics of the command lines used, this rule assists analysts in identifying unusual or potentially malicious reconnaissance behavior in the environment.
  ### Investigation Steps
  - Utilize EDR solutions to review the process creation logs around the time of the alert and correlate any suspicious process executions, especially involving command-line utilities.
  - Check for the presence of the specified key file extensions in the file system using Windows File Explorer or PowerShell commands to determine if any files were accessed or altered.
  - Analyze network activity through proxies or firewalls to identify any data exfiltration attempts or anomalous connections made by processes related to the alert.
  - Review user account activities in cloud environments (e.g., AWS, GCP, Azure) to investigate any unauthorized access or actions taken by the user account associated with the suspicious activity.
