title: AgentExecutor PowerShell Execution
id: 7efd2c8d-8b18-45b7-947d-adfe9ed04f61
related:
- id: c0b40568-b1e9-4b03-8d6c-b096da6da9ab
  type: similar
status: test
description: Detects execution of the AgentExecutor.exe binary. Which can be abused
  as a LOLBIN to execute powershell scripts with the ExecutionPolicy "Bypass" or any
  binary named "powershell.exe" located in the path provided by 6th positional argument
author: Nasreddine Bencherchali (Nextron Systems), memory-shards
references:
- https://twitter.com/lefterispan/status/1286259016436514816
- https://lolbas-project.github.io/lolbas/OtherMSBinaries/Agentexecutor/
- https://learn.microsoft.com/en-us/mem/intune/apps/intune-management-extension
- https://twitter.com/jseerden/status/1247985304667066373/photo/1
date: 2022-12-24
modified: 2024-08-07
tags:
- attack.defense-evasion
- attack.t1218
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image: '\AgentExecutor.exe'
  - OriginalFileName: 'AgentExecutor.exe'
  selection_cli:
        # Example:
        #   AgentExecutor.exe -powershell [scriptPath] [outputFilePath] [errorFilePath] [timeoutFilePath] [timeoutSeconds] [powershellPath] [enforceSignatureCheck] [runAs32BitOn64]
        # Note:
        #   - If [timeoutSeconds] is NULL then it defaults to 60000
        #   - If [enforceSignatureCheck] is:
        #       - "NULL" or "1" then a PowerShell instance is spawned with the args: "-NoProfile -executionPolicy allsigned -file "
        #       - Else a PowerShell instance is spawned with the args: "-NoProfile -executionPolicy bypass -file "
        #   - [powershellPath] is always concatendated to "powershell.exe"
    CommandLine|contains:
    - ' -powershell'         # Also covers the "-powershellDetection" flag
    - ' -remediationScript'
  filter_main_intune:
    ParentImage|endswith: '\Microsoft.Management.Services.IntuneWindowsAgent.exe'
  condition: all of selection_* and not 1 of filter_main_*
falsepositives:
- Legitimate use via Intune management. You exclude script paths and names to reduce
  FP rate
level: medium
notes: |
  n
  ### Technical Context
  The "AgentExecutor PowerShell Execution" rule detects the execution of the `AgentExecutor.exe` binary, which can be exploited as a Living Off The Land Binary (LOLBIN). This tool allows attackers to run PowerShell scripts with the execution policy bypassed, potentially evading security controls. The rule focuses on specific command-line parameters used when launching `AgentExecutor.exe`, particularly those that include the `-powershell` argument or the `-remediationScript` flag. The primary data sources for this detection come from process creation logs on Windows systems, specifically monitoring the command-line execution and parent process information to discern malicious intent from legitimate administrative use, such as during Microsoft Intune operations.
  ### Investigation Steps
  - Review the EDR telemetry for instances of `AgentExecutor.exe` execution, focusing on the command-line arguments for any potentially malicious flags such as `-powershell`.
  - Cross-reference the parent process of the detected `AgentExecutor.exe` instances to determine if the execution stemmed from legitimate administrative tools like Intune.
  - Analyze related PowerShell logs to identify whether any scripts executed by `AgentExecutor.exe` exhibit signs of malicious behavior or unusual activity.
  - Check the network activity logs for outbound connections initiated by PowerShell commands, which may suggest data exfiltration or command and control (C2) activity.
