title: Script Interpreter Execution From Suspicious Folder
id: 1228c958-e64e-4e71-92ad-7d429f4138ba
status: test
description: Detects a suspicious script execution in temporary folders or folders
  accessible by environment variables
references:
- https://www.virustotal.com/gui/file/91ba814a86ddedc7a9d546e26f912c541205b47a853d227756ab1334ade92c3f
- https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/shuckworm-russia-ukraine-military
- https://learn.microsoft.com/en-us/windows/win32/shell/csidl
author: Florian Roth (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)
date: 2022-02-08
modified: 2023-06-16
tags:
- attack.execution
- attack.t1059
logsource:
  category: process_creation
  product: windows
detection:
  selection_proc_image:
    Image|endswith:
    - '\cscript.exe'
    - '\mshta.exe'
    - '\wscript.exe'
  selection_proc_flags:
    CommandLine|contains:
    - ' -ep bypass '
    - ' -ExecutionPolicy bypass '
    - ' -w hidden '
    - '/e:javascript '
    - '/e:Jscript '
    - '/e:vbscript '
  selection_proc_original:
    OriginalFileName:
    - 'cscript.exe'
    - 'mshta.exe'
    - 'wscript.exe'
  selection_folders_1:
    CommandLine|contains:
    - ':\Perflogs\'
    - ':\Users\Public\'
    - '\AppData\Local\Temp'
    - '\AppData\Roaming\Temp'
    - '\Temporary Internet'
    - '\Windows\Temp'
  selection_folders_2:
  - CommandLine|contains|all:
    - ':\Users\'
    - '\Favorites\'
  - CommandLine|contains|all:
    - ':\Users\'
    - '\Favourites\'
  - CommandLine|contains|all:
    - ':\Users\'
    - '\Contacts\'
  condition: 1 of selection_proc_* and 1 of selection_folders_*
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This rule detects the execution of script interpreters (cscript.exe, mshta.exe, wscript.exe) from suspicious folders commonly abused by malicious actors to evade detection or escalate privileges. The primary focus is on command-line parameters that indicate potential attempts to bypass security controls (e.g., `-ep bypass`, `-ExecutionPolicy bypass`) while the scripts are being executed from non-standard directories like temp folders, public user folders, or folders accessible via environmental variables. This combination of factors raises concerns about the legitimacy of the script execution since these paths are often exploited by attackers to hide their malicious activities. The rule leverages Windows process creation logs for detection, aligning with the MITRE ATT&CK tactic of Execution and the associated technique T1059, which covers the use of scripting languages to initiate attacks.
  ### Investigation Steps
  - **Check the Process Creation Logs:** Review the process creation logs in your EDR solution for entries matching the identified script interpreters and suspicious command-line arguments from non-standard folders.
  - **Examine Command-Line Arguments:** Investigate the command-line parameters used during the execution to determine if any potentially harmful flags are present, such as those that indicate an attempt to bypass security settings.
  - **Analyze User Activity:** Look into user account activities to verify if the user associated with the script execution has a legitimate reason for accessing those specific folders or if the behavior is anomalous.
  - **Review Network Connections:** Query network logs to identify any external communications initiated by the suspicious scripts, which may indicate exfiltration activities or further malicious intent.
  ### Prioritization
  Given the severity level of 'high,' this alert should be treated seriously as the detection of such suspicious script executions could potentially indicate an ongoing attack or compromise within the environment.
  ### Blind spots and Assumptions
  One key blind spot includes the potential for legitimate uses of script interpreters, which may lead to false positives. Additionally, if script execution occurs from standard folders or if the targeted binaries are renamed or disguised, the rule may fail to detect such activities. It’s also assumed that process creation logs are being properly collected and that the relevant telemetry is enabled to support detection.
  > **Disclaimer:** This investigation guide was created using generative AI technology and has not been reviewed for its accuracy and relevance. While every effort has been made to ensure its quality, we recommend validating the content and adapting it to suit specific environment and operational needs. Please communicate any changes to the detection engineering team.
