title: Obfuscated IP Via CLI
id: 56d19cb4-6414-4769-9644-1ed35ffbb148
status: test
description: Detects usage of an encoded/obfuscated version of an IP address (hex,
  octal, etc.) via command line
references:
- https://h.43z.one/ipconverter/
- https://twitter.com/Yasser_Elsnbary/status/1553804135354564608
author: Nasreddine Bencherchali (Nextron Systems), X__Junior (Nextron Systems)
date: 2022-08-03
modified: 2023-11-06
tags:
- attack.discovery
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
    Image|endswith:
    - '\ping.exe'
    - '\arp.exe'
  selection_ip_1:
    CommandLine|contains:
    - ' 0x'
    - '//0x'
    - '.0x'
    - '.00x'
  selection_ip_2:
    CommandLine|contains|all:
    - 'http://%'
    - '%2e'
  selection_ip_3:
        # http://81.4.31754
  - CommandLine|re: 'https?://[0-9]{1,3}\.[0-9]{1,3}\.0[0-9]{3,4}'
        # http://81.293898
  - CommandLine|re: 'https?://[0-9]{1,3}\.0[0-9]{3,7}'
        # http://1359248394
  - CommandLine|re: 'https?://0[0-9]{3,11}'
        # http://0121.04.0174.012
  - CommandLine|re: 'https?://(0[0-9]{1,11}\.){3}0[0-9]{1,11}'
        # http://012101076012
  - CommandLine|re: 'https?://0[0-9]{1,11}'
        # For octal format
  - CommandLine|re: ' [0-7]{7,13}'
  filter_main_valid_ip:
    CommandLine|re: 'https?://((25[0-5]|(2[0-4]|1\d|[1-9])?\d)(\.|\b)){4}'
  condition: selection_img and 1 of selection_ip_* and not 1 of filter_main_*
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  The "Obfuscated IP Via CLI" detection rule focuses on identifying potentially malicious activities that involve the use of obfuscated or encoded IP addresses within command line arguments on Windows systems. Specifically, the rule looks for instances where common networking utilities, such as `ping.exe` and `arp.exe`, are invoked with command lines that contain obfuscated representations of IP addresses—these could include formats such as hexadecimal or octal notations. The detection employs a combination of string matching and regular expressions against the command line parameters associated with process creation events to flag suspicious behavior, providing a mechanism for spotting attempts to obscure network destinations. By analyzing process creation logs, this rule aids in early identification of potential reconnaissance or other malicious activities.
  ### Investigation Steps
  - Review the command line arguments of the flagged processes (`ping.exe` or `arp.exe`) using EDR tools to understand the context of the command and the obfuscated IP addresses being invoked.
  - Correlate the timestamps of the events with other security logs (like NDR or Firewall logs) to investigate if the obfuscated IPs have facilitated any unauthorized communications or connections within the network.
  - Utilize threat intelligence sources to cross-reference the obfuscated IP addresses against known malicious IPs, gaining insight into any potential threats associated with the connections.
  - Conduct a forensic analysis of the affected host to check for further indicators of compromise, such as unusual process behaviors, connections to multiple obfuscated IPs, or the presence of unauthorized applications or scripts.
