title: Potentially Suspicious Execution Of Regasm/Regsvcs With Uncommon Extension
id: e9f8f8cc-07cc-4e81-b724-f387db9175e4
related:
- id: cc368ed0-2411-45dc-a222-510ace303cb2
  type: derived
status: test
description: Detects potentially suspicious execution of the Regasm/Regsvcs utilities
  with an uncommon extension.
references:
- https://www.fortiguard.com/threat-signal-report/4718?s=09
- https://lolbas-project.github.io/lolbas/Binaries/Regasm/
- https://lolbas-project.github.io/lolbas/Binaries/Regsvcs/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023-02-13
tags:
- attack.defense-evasion
- attack.t1218.009
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith:
    - '\Regsvcs.exe'
    - '\Regasm.exe'
  - OriginalFileName:
    - 'RegSvcs.exe'
    - 'RegAsm.exe'
  selection_extension:
    CommandLine|contains:
            # Note: Add more potentially uncommon extensions
    - '.dat'
    - '.gif'
    - '.jpeg'
    - '.jpg'
    - '.png'
    - '.txt'
  condition: all of selection_*
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  This detection rule identifies the potentially suspicious execution of the Windows utilities Regasm.exe and Regsvcs.exe when used in conjunction with uncommon file extensions. Regasm and Regsvcs are legitimate tools used for handling .NET assemblies and services; however, threat actors may misuse them to execute malicious code disguised as less common file types, such as .dat, .gif, or .txt files. The rule leverages process creation logs to monitor when these executables are invoked with command-line parameters that include these uncommon extensions. By analyzing these data sources, this rule helps to surface suspicious activity that could indicate attempts to bypass security mechanisms or execute malicious scripts.
  ### Investigation Steps
  - Review the process creation logs in your EDR for any instances of Regasm.exe or Regsvcs.exe execution, focusing specifically on instances where command-line parameters include uncommon extensions.
  - Analyze the command line used for the execution to identify any further obfuscation techniques or other arguments that could indicate malicious intent.
  - Check for any associated network activity within your NDR or proxy logs during the time of execution to detect any external communications or data exfiltration attempts.
  - Investigate the endpoint for any additional indicators of compromise, including unexpected file creations or modifications in the directories associated with the invoked executables.
