title: Potentially Suspicious Regsvr32 HTTP/FTP Pattern
id: 867356ee-9352-41c9-a8f2-1be690d78216
related:
- id: 8e2b24c9-4add-46a0-b4bb-0057b4e6187d
  type: obsolete
status: test
description: Detects regsvr32 execution to download/install/register new DLLs that
  are hosted on Web or FTP servers.
references:
- https://twitter.com/mrd0x/status/1461041276514623491
- https://twitter.com/tccontre18/status/1480950986650832903
- https://lolbas-project.github.io/lolbas/Binaries/Regsvr32/
author: Florian Roth (Nextron Systems)
date: 2023-05-24
modified: 2023-05-26
tags:
- attack.defense-evasion
- attack.t1218.010
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: '\regsvr32.exe'
  - OriginalFileName: 'REGSVR32.EXE'
  selection_flag:
    CommandLine|contains:
    - ' /i'
    - ' -i'
  selection_protocol:
    CommandLine|contains:
    - 'ftp'
    - 'http'
  condition: all of selection_*
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  The "Potentially Suspicious Regsvr32 HTTP/FTP Pattern" rule is designed to detect the execution of the Regsvr32 utility in a manner that suggests it is being used to download or register potentially malicious DLLs from web or FTP servers. Regsvr32.exe is a legitimate Windows tool that can be misused by attackers to register DLLs in order to execute malware or perform other unauthorized actions. This rule specifically looks for instances where Regsvr32 is executed with command-line arguments that indicate it is connecting to 'http' or 'ftp' resources, along with the use of flags such as '/i' or '-i' that signal the intention to install or register a DLL. The primary data sources for this detection include process creation logs that capture details about executed commands, associated images, and the original file name of the processes.
  ### Investigation Steps
  - Review EDR logs for any instances of Regsvr32 execution, paying close attention to the command-line parameters used, especially those containing 'http' or 'ftp' along with the '/i' or '-i' flags.
  - Cross-reference any detected instances with known malicious IP addresses or domains using threat intelligence platforms or proxy logs to assess if any connected resources are suspect.
  - Investigate the surrounding process activity related to the Regsvr32 execution to identify any additional anomalous behavior or associated processes that could indicate a compromise.
  - Check the system's event logs, firewall logs, and network traffic captures to find any related communications that might provide further context around the download or use of the DLL.
