title: Use of Remote.exe
id: 4eddc365-79b4-43ff-a9d7-99422dc34b93
status: test
description: Remote.exe is part of WinDbg in the Windows SDK and can be used for AWL
  bypass and running remote files.
references:
- https://blog.thecybersecuritytutor.com/Exeuction-AWL-Bypass-Remote-exe-LOLBin/
- https://lolbas-project.github.io/lolbas/OtherMSBinaries/Remote/
author: 'Christopher Peacock @SecurePeacock, SCYTHE @scythe_io'
date: 2022-06-02
tags:
- attack.defense-evasion
- attack.t1127
logsource:
  category: process_creation
  product: windows
detection:
  selection:
  - Image|endswith: '\remote.exe'
  - OriginalFileName: 'remote.exe'
  condition: selection
falsepositives:
- Approved installs of Windows SDK with Debugging Tools for Windows (WinDbg).
level: medium
notes: |
  ### Technical Context
  The Sigma rule for detecting the use of `remote.exe` focuses on identifying instances where this executable is initiated on Windows systems. `remote.exe` is part of the Windows SDK and is typically associated with the WinDbg debugging tool. However, it has the potential to be misused for defense evasion techniques, such as Application Whitelisting (AWL) bypass, as cybercriminals may exploit it to execute remote files without alerting security solutions. The detection leverages process creation logs, specifically monitoring for any instances where the file path ends with `\remote.exe` and cross-referencing the executable’s original file name. By doing this, the rule aims to identify potentially unauthorized or malicious usage of this legitimate system tool.
  ### Investigation Steps
  - Query the EDR tool to retrieve a timeline of activities related to the detected `remote.exe` process execution, focusing on parent processes and associated command-line parameters.
  - Check AV logs to see if there were any alerts or detections triggered during the timeframe of the `remote.exe` execution, which may indicate malicious activity.
  - Review proxy logs to identify any unusual outbound connections initiated shortly after the execution of `remote.exe`, which may suggest data exfiltration or communication with malicious servers.
  - Inspect cloud platform logs (e.g., AWS CloudTrail or Azure Activity Logs) for any unusual permissions or resource access around the same time as the `remote.exe` activity to understand the broader context of the incident.
