title: TrustedPath UAC Bypass Pattern
id: 4ac47ed3-44c2-4b1f-9d51-bf46e8914126
status: test
description: Detects indicators of a UAC bypass method by mocking directories
references:
- https://medium.com/tenable-techblog/uac-bypass-by-mocking-trusted-directories-24a96675f6e
- https://www.wietzebeukema.nl/blog/hijacking-dlls-in-windows
- https://github.com/netero1010/TrustedPath-UACBypass-BOF
author: Florian Roth (Nextron Systems)
date: 2021-08-27
tags:
- attack.defense-evasion
- attack.t1548.002
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|contains: 'C:\Windows \System32\'
  condition: selection
falsepositives:
- Unknown
level: critical
notes: |
  ### Technical Context
  The “TrustedPath UAC Bypass Pattern” rule is designed to detect attempts at bypassing User Account Control (UAC) in Windows environments through the use of specific directory manipulations. UAC is a security feature intended to limit unauthorized changes to the operating system. This rule specifically looks for processes that are executed from the System32 directory— a common tactic used by attackers to exploit trusted paths and potentially execute malicious activities without appropriate privileges. The detection relies heavily on process creation logs, examining the paths of executed processes to identify suspicious patterns indicative of UAC bypass attempts.
  To effectively identify malicious behavior, the rule filters for processes where the execution path contains “C:\Windows\System32\”. Such detections may indicate a misuse of trusted system directories by attackers trying to leverage elevated privileges while evading detection mechanisms.
  ### Investigation Steps
  - Query EDR system for any process creation events related to "C:\Windows\System32\" and examine the command-line parameters for anomalous entries.
  - Review logs from your SIEM to identify any other related processes or activities occurring around the same time as the detected UAC bypass attempt.
  - Analyze the security logs from the Windows Event Viewer for any unusual access or privilege escalation events linked to the affected user accounts.
  - If applicable, check cloud logs in environments like AWS, GCP, or Azure for any unauthorized access patterns or anomalous behavior correlating with the timestamp of the UAC bypass activity.
