title: Harvesting Of Wifi Credentials Via Netsh.EXE
id: 42b1a5b8-353f-4f10-b256-39de4467faff
status: test
description: Detect the harvesting of wifi credentials using netsh.exe
references:
- https://blog.malwarebytes.com/threat-analysis/2020/04/new-agenttesla-variant-steals-wifi-credentials/
author: Andreas Hunkeler (@Karneades), oscd.community
date: 2020-04-20
modified: 2023-02-13
tags:
- attack.discovery
- attack.credential-access
- attack.t1040
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: '\netsh.exe'
  - OriginalFileName: 'netsh.exe'
  selection_cli:
    CommandLine|contains|all:
    - 'wlan'
    - ' s'
    - ' p'
    - ' k'
    - '=clear'
  condition: all of selection_*
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  This detection rule is designed to identify potential malicious attempts to harvest Wi-Fi credentials using the Windows command-line utility, `netsh.exe`. By monitoring process creation events, the rule specifically looks for executions of `netsh.exe` along with command-line arguments indicative of credential harvesting. The keywords in the command line—'wlan', 's', 'p', and 'k'=clear—signal that the attacker may be trying to extract sensitive Wi-Fi data stored on the system. The rule utilizes data from process creation logs, which provide insight into the execution of command-line tools, allowing analysts to detect unusual or unauthorized access attempts that could signify a compromise.
  ### Investigation Steps
  - Review recent process creation logs in your EDR system to identify instances where `netsh.exe` was executed along with the specified command-line parameters.
  - Cross-reference the timestamp of the netsh execution with other security logs (AV, NDR) to identify any related suspicious activities or alerts that may correlate with credential harvesting.
  - Examine user account activity to determine if there were any unauthorized logins or administrative changes around the time of the detected netsh execution.
  - Check network logs, such as those from the NGFW or Proxy, to identify any unusual outbound connections correlating with the credential extraction activity that could indicate data exfiltration.
