title: HackTool - CrackMapExec Process Patterns
id: f26307d8-14cd-47e3-a26b-4b4769f24af6
status: test
description: Detects suspicious process patterns found in logs when CrackMapExec is
  used
references:
- https://mpgn.gitbook.io/crackmapexec/smb-protocol/obtaining-credentials/dump-lsass
author: Florian Roth (Nextron Systems)
date: 2022-03-12
modified: 2023-02-13
tags:
- attack.credential-access
- attack.t1003.001
logsource:
  product: windows
  category: process_creation
detection:
  selection_lsass_dump1:
    CommandLine|contains|all:
    - 'tasklist /fi '
    - 'Imagename eq lsass.exe'
    CommandLine|contains:
    - 'cmd.exe /c '
    - 'cmd.exe /r '
    - 'cmd.exe /k '
    - 'cmd /c '
    - 'cmd /r '
    - 'cmd /k '
    User|contains:     # covers many language settings
    - 'AUTHORI'
    - 'AUTORI'
  selection_lsass_dump2:
    CommandLine|contains|all:
    - 'do rundll32.exe C:\windows\System32\comsvcs.dll, MiniDump'
    - '\Windows\Temp\'
    - ' full'
    - '%%B'
  selection_procdump:
    CommandLine|contains|all:
    - 'tasklist /v /fo csv'
    - 'findstr /i "lsass"'
  condition: 1 of selection*
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  The Sigma rule "HackTool 
  - CrackMapExec Process Patterns" is designed to detect suspicious activity that may indicate the use of CrackMapExec, a post-exploitation tool that is often employed for lateral movement and credential dumping in Windows networks. The rule analyzes process creation logs for command-line arguments typically associated with malicious activities, particularly those aimed at extracting sensitive information from the Local Security Authority Subsystem Service (LSASS) process. Key indicators include command-line strings that reference commonly used commands like `tasklist` combined with specific user context and known methods to dump LSASS memory, such as `rundll32.exe` executing a Minidump function.
  The primary data sources for this detection rule are process creation logs generated by the Windows operating system, which provide detailed command-line parameters and user activity logs. By looking for specific patterns in these logs, the rule identifies potentially unauthorized activities that might be associated with credential access techniques, enabling the SOC team to respond to incidents quickly and effectively.
  ### Investigation Steps
  - Review EDR logs to identify instances of `lsass.exe` being accessed via commands like `tasklist /fi` within the same timeframe as the alert, as this can indicate attempts to access sensitive information.
  - Check command-line parameters against the identified user account to determine if the user has legitimate access, and consider correlating the activity against typical user behavior.
  - Examine logs from the Network Detection and Response (NDR) system to see if there are any unusual outbound connections or responses occurring concurrently with the strategy employed by CrackMapExec.
  - Look into associated proxy logs for any unauthorized or unusual web activity originating from the concerned user, as this can provide context around potential exfiltration attempts or further lateral movement.
