title: New Service Creation Using Sc.EXE
id: 85ff530b-261d-48c6-a441-facaa2e81e48
related:
- id: c02e96b7-c63a-4c47-bd83-4a9f74afcfb2     # Using PowerShell
  type: similar
status: test
description: Detects the creation of a new service using the "sc.exe" utility.
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1543.003/T1543.003.md
author: Timur Zinniatullin, Daniil Yugoslavskiy, oscd.community
date: 2023-02-20
tags:
- attack.persistence
- attack.privilege-escalation
- attack.t1543.003
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith: '\sc.exe'
    CommandLine|contains|all:
    - 'create'
    - 'binPath'
  condition: selection
falsepositives:
- Legitimate administrator or user creates a service for legitimate reasons.
- Software installation
level: low
notes: |
  ### Technical Context
  The detection rule identifies when a new Windows service is created using the `sc.exe` utility, a common tool used in administrative tasks. The rule specifically looks for process creation logs indicating the execution of `sc.exe` with command-line parameters that contain both 'create' and 'binPath'. By monitoring these parameters, the rule can flag potential unauthorized service installations, which often represent a persistence mechanism exploited by attackers seeking to maintain access to compromised systems. The key data sources leveraged for this detection are the process creation logs generated by Windows systems, which provide critical insights into command executions and can be integrated into Security Information and Event Management (SIEM) solutions for real-time monitoring.
  ### Investigation Steps
  - Review the process creation logs in the EDR solution to identify the user's context under which `sc.exe` was executed and any related processes started during that time.
  - Analyze the command-line parameters associated with the service creation to determine if the `binPath` points to a suspicious or unrecognized executable.
  - Cross-reference the user account involved in the service creation with established baseline behavior to identify any anomalies or indicators of compromise.
  - Check the Windows Event Logs for recent system changes and correlating events that may indicate malicious activity involving unauthorized service modifications.
