title: Suspicious High IntegrityLevel Conhost Legacy Option
id: 3037d961-21e9-4732-b27a-637bcc7bf539
status: test
description: ForceV1 asks for information directly from the kernel space. Conhost
  connects to the console application. High IntegrityLevel means the process is running
  with elevated privileges, such as an Administrator context.
references:
- https://cybercryptosec.medium.com/covid-19-cyber-infection-c615ead7c29
- https://thedfirreport.com/2022/04/04/stolen-images-campaign-ends-in-conti-ransomware/
- https://learn.microsoft.com/en-us/windows/win32/secauthz/mandatory-integrity-control
author: frack113
date: 2022-12-09
modified: 2024-12-01
tags:
- attack.defense-evasion
- attack.t1202
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    IntegrityLevel:
    - 'High'
    - 'S-1-16-12288'
    CommandLine|contains|all:
    - 'conhost.exe'
    - '0xffffffff'
    - '-ForceV1'
  condition: selection
falsepositives:
- Very Likely, including launching cmd.exe via Run As Administrator
level: informational
notes: |
  ### Technical Context
  The Sigma rule titled "Suspicious High IntegrityLevel Conhost Legacy Option" is designed to identify potentially malicious activities on Windows systems where processes are executing with elevated privileges. Specifically, it focuses on instances where the Console Host (conhost.exe) is invoked with the `-ForceV1` parameter and is running under a high integrity level. The presence of these attributes is noteworthy because `conhost.exe` serves as an intermediary for console applications, and its execution with elevated privileges can signify an attempt to bypass normal security controls. The rule analyzes process creation logs for these specific command-line arguments along with the integrity level associated with the process to detect suspicious behavior indicative of potential exploitation attempts.
  ### Investigation Steps
  - Review the EDR logs to identify any recent instances of `conhost.exe` running with high integrity levels, particularly those using the `-ForceV1` command-line option.
  - Analyze process creation logs to check if the suspicious instance of `conhost.exe` was spawned by a legitimate application or from an unexpected source, which might indicate malicious activity.
  - Cross-reference the time and details of the event with other security logs (e.g., firewall or VPN logs) to identify any related suspicious activities or unauthorized access patterns.
  - Assess user account activities associated with the elevated process to determine if legitimate users initiated the command or if there are signs of credential compromise.
