title: Logged-On User Password Change Via Ksetup.EXE
id: c9783e20-4793-4164-ba96-d9ee483992c4
status: test
description: Detects password change for the logged-on user's via "ksetup.exe"
references:
- https://learn.microsoft.com/en-gb/windows-server/administration/windows-commands/ksetup
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023-04-06
tags:
- attack.execution
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: '\ksetup.exe'
  - OriginalFileName: 'ksetup.exe'
  selection_cli:
    CommandLine|contains: ' /ChangePassword '
  condition: all of selection_*
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  This detection rule focuses on monitoring for potential unauthorized password changes executed via the `ksetup.exe` utility on Windows systems. The `ksetup.exe` command-line tool is typically used to manage the Kerberos configuration settings for a user. By watching for the execution of this executable along with specific command-line parameters 
  - particularly the `/ChangePassword` switch 
  - the rule aims to identify when a logged-on user attempts to change their password. The technical data sources involved in this rule primarily include process creation logs that capture details such as the executed image name, original file name, and the command-line parameters utilized. When an alert is triggered, it indicates potential malicious activity that may require further investigation to confirm the legitimacy of the password change.
  ### Investigation Steps
  - Review the process creation logs in your EDR to identify related instances of `ksetup.exe` that triggered the alert, focusing on the command-line parameters used.
  - Correlate the time of the alert with user login activity in VPN or Active Directory logs to determine if the user was legitimately logged in at the time.
  - Check for additional security events in the SIEM that may indicate other anomalous behavior around the time the password change was initiated.
  - Conduct an endpoint investigation using AV or EDR tools to assess for possible signs of compromise on the affected user’s device, including examining running processes and recent file access.
