title: PUA - NirCmd Execution As LOCAL SYSTEM
id: d9047477-0359-48c9-b8c7-792cedcdc9c4
status: test
description: Detects the use of NirCmd tool for command execution as SYSTEM user
references:
- https://www.nirsoft.net/utils/nircmd.html
- https://www.winhelponline.com/blog/run-program-as-system-localsystem-account-windows/
- https://www.nirsoft.net/utils/nircmd2.html#using
author: Florian Roth (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)
date: 2022-01-24
modified: 2023-02-13
tags:
- attack.execution
- attack.t1569.002
- attack.s0029
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|contains: ' runassystem '
  condition: selection
fields:
- CommandLine
- ParentCommandLine
falsepositives:
- Legitimate use by administrators
level: high
notes: |
  ### Technical Context
  This detection rule identifies the execution of NirCmd, a command-line utility often used to perform various system tasks, under the context of the LOCAL SYSTEM user. The rule specifically focuses on detecting commands that include the string "runassystem," which is indicative of attempts to invoke NirCmd to run processes with elevated privileges. The primary data source for this detection is process creation logs that capture command-line parameters during the initiation of processes on Windows systems. By monitoring and correlating this data, the rule can flag potentially unauthorized or malicious use of NirCmd, which may signal an adversary attempting to gain a foothold or privilege escalation on the system.
  ### Investigation Steps
  - Examine the process creation logs from your EDR solution to identify instances where the NirCmd tool was executed with the "runassystem" command line. Check for the parent process that initiated this action to understand its context.
  - Utilize your SIEM to correlate the detected alert with user activity logs to determine if the execution can be attributed to legitimate administrative tasks or if it shows signs of unauthorized access.
  - Review the settings and configurations of systems that logged the event to ensure that NirCmd is not part of sanctioned administrative tools, and evaluate the user accounts that triggered these executions.
  - If potential malicious activity is confirmed, leverage your incident response procedures to contain the systems involved, and begin a forensic analysis to determine the extent of the compromise.
