title: Suspicious Registry Modification From ADS Via Regini.EXE
id: 77946e79-97f1-45a2-84b4-f37b5c0d8682
related:
- id: 5f60740a-f57b-4e76-82a1-15b6ff2cb134
  type: derived
status: test
description: Detects the import of an alternate data stream with regini.exe, regini.exe
  can be used to modify registry keys.
references:
- https://lolbas-project.github.io/lolbas/Binaries/Regini/
- https://gist.github.com/api0cradle/cdd2d0d0ec9abb686f0e89306e277b8f
- https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/regini
author: Eli Salem, Sander Wiebing, oscd.community
date: 2020-10-12
modified: 2023-02-08
tags:
- attack.t1112
- attack.defense-evasion
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: '\regini.exe'
  - OriginalFileName: 'REGINI.EXE'
  selection_re:
    CommandLine|re: ':[^ \\]'
  condition: all of selection_*
fields:
- ParentImage
- CommandLine
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This detection rule aims to identify suspicious activities associated with the `regini.exe` executable, which could indicate potential unauthorized modifications to the Windows Registry through the use of alternate data streams (ADS). The rule focuses on the command-line arguments of `regini.exe`, looking for indications that an ADS is being imported, which is a known technique used to evade detection and alter system configurations stealthily. The primary data sources leveraged for this detection include process creation logs, capturing details such as the command line parameters of the executed processes, along with the parent image of the initiating process. Detecting these modifications is crucial as they may signify a broader malicious activity that seeks to disrupt system integrity or bypass security controls.
  ### Investigation Steps
  - Review process creation logs in the EDR tool to identify instances of `regini.exe` being executed, focusing on the command-line arguments used during execution.
  - Correlate the ParentImage field with known processes to determine if the execution was initiated by a legitimate application or potentially malicious software.
  - Check for any recent changes within the Windows Registry that may correspond to the detected execution of `regini.exe`, specifically looking for modifications to critical keys or values.
  - Utilize the Proxy and AV logs to identify any previous or subsequent actions by the user or process that executed `regini.exe`, looking for unusual patterns or connections that might indicate malicious behavior.
