title: New Port Forwarding Rule Added Via Netsh.EXE
id: 322ed9ec-fcab-4f67-9a34-e7c6aef43614
status: test
description: Detects the execution of netsh commands that configure a new port forwarding
  (PortProxy) rule
references:
- https://www.fireeye.com/blog/threat-research/2019/01/bypassing-network-restrictions-through-rdp-tunneling.html
- https://adepts.of0x.cc/netsh-portproxy-code/
- https://www.dfirnotes.net/portproxy_detection/
author: Florian Roth (Nextron Systems), omkar72, oscd.community, Swachchhanda Shrawan
  Poudel
date: 2019-01-29
modified: 2023-09-01
tags:
- attack.lateral-movement
- attack.defense-evasion
- attack.command-and-control
- attack.t1090
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: '\netsh.exe'
  - OriginalFileName: 'netsh.exe'
  selection_cli_1:
    CommandLine|contains|all:
    - 'interface'
    - 'portproxy'
    - 'add'
    - 'v4tov4'
  selection_cli_2:
    CommandLine|contains|all:
            # Example: netsh I p a v l=8001 listena=127.0.0.1 connectp=80 c=192.168.1.1
    - 'i '         # interface
    - 'p '         # portproxy
    - 'a '         # add
    - 'v '         # v4tov4
  selection_cli_3:
    CommandLine|contains|all:
    - 'connectp'
    - 'listena'
    - 'c='
  condition: selection_img and 1 of selection_cli_*
falsepositives:
- Legitimate administration activity
- WSL2 network bridge PowerShell script used for WSL/Kubernetes/Docker (e.g. https://github.com/microsoft/WSL/issues/4150#issuecomment-504209723)
level: medium
notes: |
  ### Technical Context
  This detection rule monitors the execution of the `netsh.exe` command, specifically focusing on the configuration of new port forwarding rules through its PortProxy feature. By looking for specific command-line parameters associated with adding port forwarding (for instance, using `interface` and `portproxy`), this rule can identify potential misuse of legitimate Windows networking tools. Attackers may leverage such commands to bypass network restrictions or redirect traffic for nefarious purposes, such as lateral movement within a network or establishing a command-and-control channel. The data sources utilized include process creation logs that capture the execution of `netsh.exe` along with its command-line arguments, enabling analysts to pinpoint potentially malicious activity.
  ### Investigation Steps
  - Review the process creation logs in the EDR to identify instances of `netsh.exe` being executed, along with the corresponding command-line arguments.
  - Correlate the logged events with any existing alerts or incidents, focusing on the associated user accounts to determine if there was any unauthorized activity.
  - Conduct a thorough examination of the firewall logs in your NGFW to check for any unusual connections initiated by the newly configured port forwarding rules.
  - Evaluate the network activity logs from the NDR to identify any abnormal traffic patterns or connections that could signify exploitation or unauthorized access.
