title: Active Directory Structure Export Via Csvde.EXE
id: e5d36acd-acb4-4c6f-a13f-9eb203d50099
status: test
description: Detects the execution of "csvde.exe" in order to export organizational
  Active Directory structure.
references:
- https://www.cybereason.com/blog/research/operation-ghostshell-novel-rat-targets-global-aerospace-and-telecoms-firms
- https://web.archive.org/web/20180725233601/https://www.pwc.co.uk/cyber-security/pdf/cloud-hopper-annex-b-final.pdf
- https://businessinsights.bitdefender.com/deep-dive-into-a-backdoordiplomacy-attack-a-study-of-an-attackers-toolkit
- https://redcanary.com/blog/msix-installers/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023-03-14
tags:
- attack.exfiltration
- attack.discovery
- attack.t1087.002
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: '\csvde.exe'
  - OriginalFileName: 'csvde.exe'
  selection_remote:
    CommandLine|contains: ' -f'
  filter_import:
    CommandLine|contains: ' -i'
  condition: all of selection_* and not 1 of filter_*
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  This detection rule identifies the execution of `csvde.exe`, a command-line tool used to import and export data from an Active Directory (AD) structure in Windows environments. The rule specifically looks for process creation logs that trigger when `csvde.exe` is invoked with a command line that includes the `-f` parameter, designating a file for output, along with ensuring that the command does not involve the `-i` flag, which indicates an import action. By monitoring the execution context of this utility, the rule aims to flag potential information gathering or data exfiltration activities by unauthorized actors, which could signify malicious intent to manipulate, export, or extract sensitive organizational data from Active Directory.
  The rule detects this activity using Windows process creation logs as the primary data source, assessing command-line parameters to distinguish between legitimate administrative actions and potentially harmful behavior. The underlying logic is based on known tactics associated with reconnaissance and data exfiltration as defined in the MITRE ATT&CK framework.
  ### Investigation Steps
  1. Review process creation logs in your EDR system to find instances of `csvde.exe` execution, specifically focusing on command lines that include the `-f` parameter.
  2. Cross-reference the timestamps of the `csvde.exe` executions with user activity logs to determine whether authorized personnel initiated these actions.
  3. Analyze any exported files specified in the command line for unusual or sensitive data that could indicate a breach of organizational security.
  4. Check network logs for any outbound connections initiated shortly after the execution of `csvde.exe`, as this could suggest exfiltration of the exported AD data.
