title: Suspicious Schtasks Schedule Type With High Privileges
id: 7a02e22e-b885-4404-b38b-1ddc7e65258a
related:
- id: 24c8392b-aa3c-46b7-a545-43f71657fe98
  type: similar
status: test
description: Detects scheduled task creations or modification to be run with high
  privileges on a suspicious schedule type
references:
- https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/schtasks-change
- https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/schtasks-create
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-08-31
tags:
- attack.execution
- attack.t1053.005
logsource:
  product: windows
  category: process_creation
detection:
  selection_img:
  - Image|endswith: '\schtasks.exe'
  - OriginalFileName: 'schtasks.exe'
  selection_time:
    CommandLine|contains:
    - ' ONLOGON '
    - ' ONSTART '
    - ' ONCE '
    - ' ONIDLE '
  selection_privs:
    CommandLine|contains:
    - 'NT AUT'         # This covers the usual NT AUTHORITY\SYSTEM
    - ' SYSTEM'         # SYSTEM is a valid value for schtasks hence it gets it's own value with space
    - 'HIGHEST'
  condition: all of selection_*
falsepositives:
- Some installers were seen using this method of creation unfortunately. Filter them
  in your environment
level: medium
notes: |
  ### Technical Context
  This detection rule identifies potentially malicious scheduling tasks configured to run with high privileges on a Windows system. It focuses on tasks created or modified through `schtasks.exe`, particularly those using scheduling types that may indicate problematic behavior, such as `ONLOGON`, `ONSTART`, `ONCE`, and `ONIDLE`. The rule checks for command-line parameters that suggest high levels of privilege, such as `NT AUTHORITY\SYSTEM`, `SYSTEM`, and `HIGHEST`. These parameters can indicate an attempt by an attacker to elevate privileges for persistent malicious activity. Data sourced from process creation logs provide the necessary context for the investigation, while the specific command-line arguments are scrutinized for abnormalities.
  ### Investigation Steps
  - Review the process creation logs in your EDR to identify when `schtasks.exe` was executed and analyze the command-line parameters used, especially those containing scheduling types associated with elevated privileges. 
  - Check for any unusual scheduled tasks in the Task Scheduler on the affected endpoint, focusing on tasks created with high privileges that were triggered by events, such as user logon or system startup.
  - Utilize domain logs from Active Directory to investigate whether the creation or modification of the scheduled tasks correspond with any changes in user privileges, particularly for accounts with administrative access.
  - Monitor your SIEM for related alerts or anomalies that may indicate misuse of administrative credentials, especially around the timestamps of suspicious scheduled tasks execution.
