title: REGISTER_APP.VBS Proxy Execution
id: 1c8774a0-44d4-4db0-91f8-e792359c70bd
status: test
description: Detects the use of a Microsoft signed script 'REGISTER_APP.VBS' to register
  a VSS/VDS Provider as a COM+ application.
references:
- https://twitter.com/sblmsrsn/status/1456613494783160325?s=20
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-08-19
tags:
- attack.defense-evasion
- attack.t1218
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|contains|all:
    - '\register_app.vbs'
    - '-register'
  condition: selection
falsepositives:
- Legitimate usage of the script. Always investigate what's being registered to confirm
  if it's benign
level: medium
notes: |
  ### Technical Context
  The Sigma rule "REGISTER_APP.VBS Proxy Execution" is designed to detect the execution of a specific Microsoft signed script, `REGISTER_APP.VBS`, which is utilized for registering Volume Shadow Copy Service (VSS) and Virtual Disk Service (VDS) providers as COM+ applications. The rule triggers when the command line for a process creation event includes the script name along with the `-register` parameter, signaling a potential attempt to register a VSS/VDS provider. This detection leverages process creation logs from Windows, specifically focusing on command-line parameters that indicate unauthorized or suspicious use of this script.
  While `REGISTER_APP.VBS` can be employed legitimately, its invocation in an unexpected context may signify an evasion technique, as attackers might use it to facilitate malicious persistence or execution. Therefore, analyzing the surrounding context and data is critical for accurate incident response.
  ### Investigation Steps
  - Review the process creation logs in the EDR for instances of `REGISTER_APP.VBS` execution accompanied by the `-register` parameter to gather context on user and system interactions.
  - Cross-reference the timestamps of the alerts with AV logs to check for any other indicators of compromise or previous alert activity that may provide additional context.
  - Investigate the script's purpose by analyzing its code if possible, or review associated documentation and legitimate usage within your environment to confirm its intended function.
  - Look into network logs, such as those from the proxy or NGFW, to determine if there were any suspicious outgoing connections initiated around the same time as the script execution.
