title: Dropping Of Password Filter DLL
id: b7966f4a-b333-455b-8370-8ca53c229762
status: test
description: Detects dropping of dll files in system32 that may be used to retrieve
  user credentials from LSASS
references:
- https://pentestlab.blog/2020/02/10/credential-access-password-filter-dll/
- https://github.com/3gstudent/PasswordFilter/tree/master/PasswordFilter
author: Sreeman
date: 2020-10-29
modified: 2022-10-09
tags:
- attack.credential-access
- attack.t1556.002
logsource:
  category: process_creation
  product: windows
detection:
  selection_cmdline:
    CommandLine|contains|all:
    - 'HKLM\SYSTEM\CurrentControlSet\Control\Lsa'
    - 'scecli\0*'
    - 'reg add'
  condition: selection_cmdline
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  The Sigma rule titled "Dropping Of Password Filter DLL" is designed to detect attempts to drop DLL files into the Windows System32 directory, specifically targeting those DLLs that may facilitate unauthorized access to user credentials stored in the Local Security Authority Subsystem Service (LSASS). This detection focuses on command-line activity that includes patterns indicative of modifications to critical registry keys associated with LSASS, specifically the `HKLM\SYSTEM\CurrentControlSet\Control\Lsa` path. It looks for operations that invoke the addition of registry entries using commands like `reg add`, which can be a precursor to credential theft.
  The rule leverages process creation logs as the primary data source, analyzing the command-line parameters of executed processes for suspicious patterns. By identifying these potentially malicious commands, the rule can aid in pinpointing unauthorized efforts to manipulate sensitive components of the Windows security architecture.
  ### Investigation Steps
  - Analyze EDR telemetry for the specific command-line activity that triggered the alert. Focus on process creation events around the time of the alert to identify the originating process and its parent processes.
    
  - Review system logs for any abnormal modifications made to the registry, especially entries created or altered under `HKLM\SYSTEM\CurrentControlSet\Control\Lsa`. This can indicate unauthorized attempts to change the credential storage behavior.
    
  - Check file creation events within the System32 directory for any suspicious DLL files that match known malicious patterns. Utilize file integrity monitoring tools to detect unauthorized changes in critical system directories.
    
  - Cross-reference alerts with user activity logs, such as logins or application accesses, to correlate potential credential access attempts and assess the context of the incident further.
