title: File Decoded From Base64/Hex Via Certutil.EXE
id: cc9cbe82-7bc0-4ef5-bc23-bbfb83947be7
status: test
description: Detects the execution of certutil with either the "decode" or "decodehex"
  flags to decode base64 or hex encoded files. This can be abused by attackers to
  decode an encoded payload before execution
references:
- https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/certutil
- https://unit42.paloaltonetworks.com/new-babyshark-malware-targets-u-s-national-security-think-tanks/
- https://news.sophos.com/en-us/2021/04/13/compromised-exchange-server-hosting-cryptojacker-targeting-other-exchange-servers/
- https://twitter.com/JohnLaTwC/status/835149808817991680
- https://learn.microsoft.com/en-us/archive/blogs/pki/basic-crl-checking-with-certutil
- https://lolbas-project.github.io/lolbas/Binaries/Certutil/
author: Florian Roth (Nextron Systems), Jonhnathan Ribeiro, oscd.community
date: 2023-02-15
modified: 2024-03-05
tags:
- attack.defense-evasion
- attack.t1027
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: '\certutil.exe'
  - OriginalFileName: 'CertUtil.exe'
  selection_cli:
    CommandLine|contains|windash:
    - '-decode '         # Decode Base64
    - '-decodehex '         # Decode Hex
  condition: all of selection_*
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  This Sigma rule aims to detect suspicious usage of the `certutil.exe` tool on Windows systems, specifically targeting its `-decode` and `-decodehex` flags. `certutil.exe` is a legitimate utility used for managing digital certificates, but it can also be exploited by attackers to decode base64 or hex encoded payloads before execution. The rule monitors process creation logs to identify instances where `certutil.exe` is executed in conjunction with either of these decoding commands. By collecting data such as the command-line arguments and the image name associated with the process, the detection mechanism helps identify potentially malicious activities masked as benign certificate management operations.
  ### Investigation Steps
  - Review the process creation logs using the EDR tool to identify any instances of `certutil.exe` executing with the `-decode` or `-decodehex` flags.
  - Examine the command line associated with the process to determine what encoded data was being processed and whether it correlates to any known malicious payloads.
  - Query the security logs for any surrounding activity, such as file creations or modifications, that may indicate the outcome of the decoding process.
  - Utilize network proxy logs to investigate any outbound connections established shortly after the decoding command was executed, which could imply an attempt to exfiltrate data or call to a malicious command and control server.
