title: Write Protect For Storage Disabled
id: 75f7a0e2-7154-4c4d-9eae-5cdb4e0a5c13
status: test
description: |
  Detects applications trying to modify the registry in order to disable any write-protect property for storage devices.
  This could be a precursor to a ransomware attack and has been an observed technique used by cypherpunk group.
references:
- https://www.manageengine.com/products/desktop-central/os-imaging-deployment/media-is-write-protected.html
author: Sreeman
date: 2021-06-11
modified: 2024-01-18
tags:
- attack.defense-evasion
- attack.t1562
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    CommandLine|contains|all:
    - '\System\CurrentControlSet\Control'
    - 'Write Protection'
    - '0'
    - 'storage'
  condition: selection
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  This Sigma rule targets suspicious modifications to the Windows registry that aim to disable write protection on storage devices. It specifically looks for process creation events that include command-line parameters indicating attempts to access the registry key associated with write protection settings. The rule checks for the presence of keywords like "Write Protection," "0," and "storage" within command-line arguments, signaling an intent to manipulate these settings. Such actions can be indicative of preparatory steps taken by threat actors before executing a ransomware attack, which may involve encrypting files on unprotected storage media. The relevant technical data sources for this alert include process creation logs and command-line parameters.
  ### Investigation Steps
  - Review the process creation logs in your EDR system to identify the specific application that triggered this alert and examine its command-line parameters for anomalies. 
  - Cross-reference the application’s hash against known malware databases to determine if it is recognized as malicious or should be further scrutinized.
  - Check the Windows registry on the affected system to verify if any unauthorized changes to the write protection settings have occurred.
  - Monitor related activities on the affected endpoints, such as file system modifications and unusual network traffic, to assess whether there are ongoing malicious operations.
