title: Forfiles Command Execution
id: 9aa5106d-bce3-4b13-86df-3a20f1d5cf0b
related:
- id: a85cf4e3-56ee-4e79-adeb-789f8fb209a8
  type: obsolete
- id: fa47597e-90e9-41cd-ab72-c3b74cfb0d02
  type: obsolete
status: test
description: |
  Detects the execution of "forfiles" with the "/c" flag.
  While this is an expected behavior of the tool, it can be abused in order to proxy execution through it with any binary.
  Can be used to bypass application whitelisting.
references:
- https://lolbas-project.github.io/lolbas/Binaries/Forfiles/
- https://pentestlab.blog/2020/07/06/indirect-command-execution/
author: Tim Rauch, Elastic, E.M. Anhaus (originally from Atomic Blue Detections, Endgame),
  oscd.community
date: 2022-06-14
modified: 2024-03-05
tags:
- attack.execution
- attack.t1059
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: '\forfiles.exe'
  - OriginalFileName: 'forfiles.exe'
  selection_cli:
    CommandLine|contains|windash: ' -c '
  condition: all of selection_*
falsepositives:
- Legitimate use via a batch script or by an administrator.
level: medium
notes: |
  ### Technical Context
  This detection rule focuses on the execution of the Windows command-line utility "forfiles" with the "/c" flag, which allows users to execute commands on selected files. While this capability is built into forfiles and can be used legitimately for administrative tasks, its misuse can signal an attempt to execute potentially harmful commands through indirect methods, thereby bypassing application whitelisting controls. The rule analyzes process creation logs specifically targeting events where forfiles is executed along with the "/c" command, using data extracted from process attributes such as the command line parameters and the image name. This helps identify anomalous behaviors that could indicate malicious activities.
  ### Investigation Steps
  - Review the process creation logs in your EDR to confirm the execution of forfiles.exe along with the "/c" flag to understand the context of the command.
  - Check the command-line parameters for any unusual or suspicious commands that may indicate malicious intent, especially those not typical for standard user activities.
  - Investigate the user account that initiated the forfiles command by cross-referencing logs to determine if the behavior is consistent with their usual activities or if it is anomalous.
  - Examine other telemetry data from endpoints, such as AV logs and network traffic, to identify any further actions taken by the process or subsequent connections that could indicate further exploitation.
