title: New ActiveScriptEventConsumer Created Via Wmic.EXE
id: ebef4391-1a81-4761-a40a-1db446c0e625
status: test
description: Detects WMIC executions in which an event consumer gets created. This
  could be used to establish persistence
references:
- https://twitter.com/johnlatwc/status/1408062131321270282?s=12
- https://www.fireeye.com/content/dam/fireeye-www/global/en/current-threats/pdfs/wp-windows-management-instrumentation.pdf
author: Florian Roth (Nextron Systems)
date: 2021-06-25
modified: 2023-02-14
tags:
- attack.persistence
- attack.t1546.003
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|contains|all:
    - 'ActiveScriptEventConsumer'
    - ' CREATE '
  condition: selection
fields:
- CommandLine
- ParentCommandLine
falsepositives:
- Legitimate software creating script event consumers
level: high
notes: |
  ### Technical Context
  This Sigma rule is designed to detect the creation of a new ActiveScriptEventConsumer via WMIC (Windows Management Instrumentation Command-line). The rule specifically looks for command-line executions that contain the keywords "ActiveScriptEventConsumer" and "CREATE," indicating a potential attempt to establish persistence through script event consumers. ActiveScriptEventConsumers allow scripts to run in response to system events, which malicious actors can exploit to maintain a foothold in the environment. The primary data source involved in this detection is process creation logs, which capture command-line parameters and the parent processes associated with these executions.
  ### Investigation Steps
  - Review the process creation logs using your EDR solution to identify any instances where `wmic.exe` executed with the specified command-line parameters, noting the creation time and associated user context.
  - Check for any suspicious parent processes that may have initiated the WMIC command, as they could provide insight into the method of compromise.
  - Search network logs or proxy logs for unusual outbound connections from the system where the command was executed, as this may indicate exfiltration or communication with a command and control server.
  - Consult cloud logs for related activities if the affected device interacts with cloud services, ensuring a comprehensive understanding of potential lateral movement or additional indicators of compromise.
