title: Persistence Via TypedPaths - CommandLine
id: ec88289a-7e1a-4cc3-8d18-bd1f60e4b9ba
status: test
description: Detects modification addition to the 'TypedPaths' key in the user or
  admin registry via the commandline. Which might indicate persistence attempt
references:
- https://twitter.com/dez_/status/1560101453150257154
- https://forensafe.com/blogs/typedpaths.html
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-08-22
tags:
- attack.persistence
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|contains: '\Software\Microsoft\Windows\CurrentVersion\Explorer\TypedPaths'
  condition: selection
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  The "Persistence Via TypedPaths 
  - CommandLine" detection rule is designed to identify attempts to add or modify entries in the 'TypedPaths' registry key on Windows systems. This key is responsible for storing user-specific paths previously accessed through the Windows File Explorer, and it can be manipulated by malicious actors to maintain persistence on a system. The rule works by monitoring process creation logs with a focus on command-line arguments that indicate changes to the 'TypedPaths' registry entry, specifically looking for command lines that include the path `\Software\Microsoft\Windows\CurrentVersion\Explorer\TypedPaths`. Technical data sources involved include Windows registry logs and process creation logs, which capture the command-line arguments used during the execution of processes.
  ### Investigation Steps
  - Review the EDR process creation logs to identify the specific command lines executed by processes that reference the 'TypedPaths' registry key.
  - Check the timestamp of the detected modification against user activity logs to determine if the change correlates with legitimate user behavior or unusual activity.
  - Investigate the source of the command, including the parent process, to assess whether it originated from a trusted application or could indicate a malicious intrusion.
  - Examine any associated registry modifications for other persistence mechanisms to understand the potential impact and scope of the incident.
