title: Suspicious Windows Defender Registry Key Tampering Via Reg.EXE
id: 452bce90-6fb0-43cc-97a5-affc283139b3
status: test
description: Detects the usage of "reg.exe" to tamper with different Windows Defender
  registry keys in order to disable some important features related to protection
  and detection
references:
- https://thedfirreport.com/2022/03/21/apt35-automates-initial-access-using-proxyshell/
- https://github.com/swagkarna/Defeat-Defender-V1.2.0
- https://www.elevenforum.com/t/video-guide-how-to-completely-disable-microsoft-defender-antivirus.14608/page-2
author: Florian Roth (Nextron Systems), Swachchhanda Shrawan Poudel, Nasreddine Bencherchali
  (Nextron Systems)
date: 2022-03-22
modified: 2023-06-05
tags:
- attack.defense-evasion
- attack.t1562.001
logsource:
  category: process_creation
  product: windows
detection:
  selection_root_img:
  - Image|endswith: '\reg.exe'
  - OriginalFileName: 'reg.exe'
  selection_root_path:
    CommandLine|contains:
    - 'SOFTWARE\Microsoft\Windows Defender\'
    - 'SOFTWARE\Policies\Microsoft\Windows Defender Security Center'
    - 'SOFTWARE\Policies\Microsoft\Windows Defender\'
  selection_dword_0:
    CommandLine|contains|all:
    - ' add '
    - 'd 0'
    CommandLine|contains:
    - 'DisallowExploitProtectionOverride'
    - 'EnableControlledFolderAccess'
    - 'MpEnablePus'
    - 'PUAProtection'
    - 'SpynetReporting'
    - 'SubmitSamplesConsent'
    - 'TamperProtection'
  selection_dword_1:
    CommandLine|contains|all:
    - ' add '
    - 'd 1'
    CommandLine|contains:
    - 'DisableAntiSpyware'
    - 'DisableAntiSpywareRealtimeProtection'
    - 'DisableAntiVirus'
    - 'DisableArchiveScanning'
    - 'DisableBehaviorMonitoring'
    - 'DisableBlockAtFirstSeen'
    - 'DisableConfig'
    - 'DisableEnhancedNotifications'
    - 'DisableIntrusionPreventionSystem'
    - 'DisableIOAVProtection'
    - 'DisableOnAccessProtection'
    - 'DisablePrivacyMode'
    - 'DisableRealtimeMonitoring'
    - 'DisableRoutinelyTakingAction'
    - 'DisableScanOnRealtimeEnable'
    - 'DisableScriptScanning'
    - 'Notification_Suppress'
    - 'SignatureDisableUpdateOnStartupWithoutEngine'
  condition: all of selection_root_* and 1 of selection_dword_*
falsepositives:
- Rare legitimate use by administrators to test software (should always be investigated)
level: high
notes: |
  ### Technical Context
  This detection rule identifies potential unauthorized modifications to Windows Defender's registry keys, which can indicate an attempt at disabling critical security features. The rule specifically looks for the use of `reg.exe`, a command-line utility for managing the Windows registry, to alter keys associated with Windows Defender's protection mechanisms. It captures Registry modifications that involve setting values for certain registry keys to '0' or '1' that are pertinent to the operation of Windows Defender, particularly those related to anti-virus functionalities and security settings. The rule utilizes process creation logs as its primary data source, triggering alerts when specific command-line arguments associated with key tampering are detected, thereby signaling a possible evasion tactic under the MITRE ATT&CK technique T1562.001 (Impair Defenses: Disable or Modify Tools).
  ### Investigation Steps
  - **Investigate EDR Alerts**: Use your EDR tool to track the process tree of the `reg.exe` execution, including any parent processes, to identify suspicious activity and correlate it with user actions.
  - **Review Command-Line Usage**: Analyze the command-line arguments passed to `reg.exe` in the event logs. Look specifically for indicators that suggest key tampering, such as entries that disable or modify defensive features of Windows Defender.
  - **Examine Windows Security Logs**: Check related Windows Security logs to see if there are any corresponding alerts triggered by Windows Defender during the same timeframe as the suspicious registry changes.
  - **Audit System Configuration**: Validate system settings against your organization's baseline security policy to ensure that no unauthorized modifications have occurred in your security configurations.
  ### Prioritization
  The alert is categorized with a high severity level due to the critical role Windows Defender plays in enterprise cybersecurity. Unauthorized tampering with its settings can lead directly to an increased risk of malware infections and broader system compromise.
  ### Blind Spots and Assumptions
  This rule may not trigger in scenarios where `reg.exe` usage is legitimate or part of an authorized administrative activity, as such use cases may not always be tracked in the process histories. It also assumes that the system's logging configuration is set up correctly to capture these necessary process creation logs. Adversaries could potentially obfuscate their activities by using alternative methods or tools to modify registry keys that do not involve `reg.exe`, leading to missed detections.
  > **Disclaimer:** This investigation guide was created using generative AI technology and has not been reviewed for its accuracy and relevance. While every effort has been made to ensure its quality, we recommend validating the content and adapting it to suit specific environment and operational needs. Please communicate any changes to the detection engineering team.
