title: UAC Bypass via ICMLuaUtil
id: 49f2f17b-b4c8-4172-a68b-d5bf95d05130
status: test
description: Detects the pattern of UAC Bypass using ICMLuaUtil Elevated COM interface
references:
- https://www.elastic.co/guide/en/security/current/uac-bypass-via-icmluautil-elevated-com-interface.html
author: Florian Roth (Nextron Systems), Elastic (idea)
date: 2022-09-13
modified: 2022-09-27
tags:
- attack.defense-evasion
- attack.privilege-escalation
- attack.t1548.002
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    ParentImage|endswith: '\dllhost.exe'
    ParentCommandLine|contains:
    - '/Processid:{3E5FC7F9-9A51-4367-9063-A120244FBEC7}'
    - '/Processid:{D2E7041B-2927-42FB-8E9F-7CE93B6DC937}'
  filter:
  - Image|endswith: '\WerFault.exe'
  - OriginalFileName: 'WerFault.exe'
  condition: selection and not filter
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  The Sigma rule for detecting UAC (User Account Control) bypass via ICMLuaUtil focuses on identifying suspicious process creation activities specifically involving `dllhost.exe` as a parent image. It targets instances where the command line contains specific process IDs indicative of exploitation attempts to escalate privileges without proper user consent. The detection logic examines processes to determine if they utilize `WerFault.exe`, a legitimate Windows fault reporting tool, as part of an evasion mechanism. This rule leverages process creation logs, particularly the parent image and command line parameters, to provide a clear signal of potentially malicious activity, allowing security analysts to prioritize their response effectively.
  ### Investigation Steps
  - Verify the process creation logs in the EDR system to identify instances of `dllhost.exe` serving as a parent for suspicious child processes, looking closely at associated command line parameters.
  - Check the command lines associated with `WerFault.exe` to confirm the presence of the targeted process IDs specified in the detection rule for any unauthorized usage patterns.
  - Review related logs in the SIEM for actions taken by the user account involved, correlating any other anomalous behavior or access patterns that may indicate privilege escalation attempts.
  - Utilize AV scanning tools to check the integrity of `WerFault.exe` and other involved binaries, ensuring they have not been tampered with or replaced by malicious counterparts.
