title: Chromium Browser Instance Executed With Custom Extension
id: 88d6e60c-759d-4ac1-a447-c0f1466c2d21
related:
- id: 27ba3207-dd30-4812-abbf-5d20c57d474e
  type: similar
status: test
description: Detects a Chromium based browser process with the 'load-extension' flag
  to start a instance with a custom extension
references:
- https://redcanary.com/blog/chromeloader/
- https://emkc.org/s/RJjuLa
- https://www.mandiant.com/resources/blog/lnk-between-browsers
author: Aedan Russell, frack113, X__Junior (Nextron Systems)
date: 2022-06-19
modified: 2023-11-28
tags:
- attack.persistence
- attack.t1176
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith:
    - '\brave.exe'
    - '\chrome.exe'
    - '\msedge.exe'
    - '\opera.exe'
    - '\vivaldi.exe'
    CommandLine|contains: '--load-extension='
  condition: selection
falsepositives:
- Usage of Chrome Extensions in testing tools such as BurpSuite will trigger this
  alert
level: medium
notes: |
  ### Technical Context
  This detection rule identifies instances where Chromium-based browsers (including Brave, Chrome, Microsoft Edge, Opera, and Vivaldi) are launched with a command-line argument indicating the loading of a custom extension (`--load-extension=`). The rule relies on process creation logs that capture the image name of the executable and associated command-line parameters. By analyzing these logs, the detection rule aims to flag potentially unauthorized or malicious browser extensions that may pose security risks, such as data exfiltration or user tracking. This is particularly relevant in environments where control over browser extensions is critical for maintaining security and compliance.
  ### Investigation Steps
  - Review the process creation logs in your EDR system to verify the instance of the browser that triggered the alert and examine the specific command-line parameters used.
  - Identify the custom extension being loaded by cross-referencing the command line with known extensions or internal policies to determine if it is authorized.
  - Investigate any related network activity in the NDR or proxy logs that could indicate data exfiltration or suspicious communication initiated by the browser extension.
  - Conduct a search for the loaded extension across all systems within your environment using the AV or cloud security tools to check for additional instances or related activities that could pose a threat.
