title: Suspicious Execution of Shutdown
id: 34ebb878-1b15-4895-b352-ca2eeb99b274
status: test
description: Use of the commandline to shutdown or reboot windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1529/T1529.md
- https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/shutdown
author: frack113
date: 2022-01-01
tags:
- attack.impact
- attack.t1529
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith: '\shutdown.exe'
    CommandLine|contains:
    - '/r '
    - '/s '
  condition: selection
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  This detection rule identifies suspicious attempts to shut down or reboot a Windows system by monitoring processes that execute the `shutdown.exe` command. Specifically, it looks for instances where the command is invoked using the command line parameters for reboot (`/r`) or shutdown (`/s`). By analyzing process creation logs, which detail the execution events of applications and commands, this rule flags potentially unauthorized system shutdowns that may indicate malicious activity or an insider threat. 
  Used in conjunction with a SIEM, this detection can help analysts identify and respond to incidents that could disrupt operations or signify compromise, thereby facilitating timely and effective incident response.
  ### Investigation Steps
  - Review the process creation logs in the EDR solution to identify the user account and context under which `shutdown.exe` was executed, noting any abnormal behavior or unknown users. 
  - Check related logs for prior activity from the same user account, focusing on any patterns of suspicious behavior leading up to the shutdown command.
  - Investigate the network logs on the NGFW/proxy to identify any external connections that were established by the user prior to execution, as they could indicate a remote compromise.
  - Analyze any active sessions or tasks from the Security Information and Event Management (SIEM) to corroborate the execution context and determine if other security alerts coincide with the shutdown activity.
