title: Suspicious Response File Execution Via Odbcconf.EXE
id: 2d32dd6f-3196-4093-b9eb-1ad8ab088ca5
related:
- id: 5f03babb-12db-4eec-8c82-7b4cb5580868
  type: derived
- id: 65d2be45-8600-4042-b4c0-577a1ff8a60e
  type: obsolete
status: test
description: Detects execution of "odbcconf" with the "-f" flag in order to load a
  response file with a non-".rsp" extension.
references:
- https://learn.microsoft.com/en-us/sql/odbc/odbcconf-exe?view=sql-server-ver16
- https://lolbas-project.github.io/lolbas/Binaries/Odbcconf/
- https://www.trendmicro.com/en_us/research/17/h/backdoor-carrying-emails-set-sights-on-russian-speaking-businesses.html
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023-05-22
modified: 2024-03-13
tags:
- attack.defense-evasion
- attack.t1218.008
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: '\odbcconf.exe'
  - OriginalFileName: 'odbcconf.exe'
  selection_cli:
    CommandLine|contains|windash: ' -f '
  filter_main_rsp_ext:
    CommandLine|contains: '.rsp'
  filter_main_runonce_odbc:
        # When odbcconf is run with the "/R" flag, it creates a "runonce" key to run at the next reboot
    ParentImage: 'C:\Windows\System32\runonce.exe'
    Image: 'C:\Windows\System32\odbcconf.exe'
    CommandLine|contains: '.exe /E /F "C:\WINDOWS\system32\odbcconf.tmp"'
  condition: all of selection_* and not 1 of filter_main_*
falsepositives:
- Unlikely
level: high
notes: |
  ### Technical Context
  This detection rule focuses on identifying potentially malicious usage of the `odbcconf.exe` executable, a Windows utility for managing ODBC data sources. Specifically, it targets instances where `odbcconf.exe` is executed with the `-f` flag to load response files that do not have a standard `.rsp` extension. Such command-line activities can indicate attempts to load unauthorized or malicious configurations, possibly aimed at evading detection mechanisms. The rule leverages process creation logs as the primary data source, monitoring for executions of `odbcconf.exe` while applying criteria that filter legitimate usage patterns, such as the requirement for a `.rsp` file. This approach helps to enhance the identification of potentially harmful behavior by evaluating both the invoked images and command-line parameters.
  ### Investigation Steps
  - Utilize your EDR tool to search for recent executions of `odbcconf.exe` that match the identified patterns, focusing on the command-line parameters used during these actions for further analysis.
  - Review the process tree in your EDR to determine the parent process of `odbcconf.exe`, identifying any unusual parent-child relationships that could indicate a compromise.
  - Check firewall logs for outbound connections initiated by processes executing `odbcconf.exe`, as this might indicate attempts to communicate with external malicious entities.
  - Examine system logs and any relevant cloud logs for signs of policy violations or atypical modifications that coincide with the execution of `odbcconf.exe`, especially focusing on the timestamps of the incidents.
