title: Potentially Suspicious Desktop Background Change Using Reg.EXE
id: 8cbc9475-8d05-4e27-9c32-df960716c701
related:
- id: 85b88e05-dadc-430b-8a9e-53ff1cd30aae
  type: similar
status: test
description: |
  Detects the execution of "reg.exe" to alter registry keys that would replace the user's desktop background.
  This is a common technique used by malware to change the desktop background to a ransom note or other image.
references:
- https://www.attackiq.com/2023/09/20/emulating-rhysida/
- https://research.checkpoint.com/2023/the-rhysida-ransomware-activity-analysis-and-ties-to-vice-society/
- https://www.trendmicro.com/en_us/research/23/h/an-overview-of-the-new-rhysida-ransomware.html
- https://www.virustotal.com/gui/file/a864282fea5a536510ae86c77ce46f7827687783628e4f2ceb5bf2c41b8cd3c6/behavior
- https://admx.help/?Category=Windows_10_2016&Policy=Microsoft.Policies.WindowsDesktop::Wallpaper
- https://admx.help/?Category=Windows_10_2016&Policy=Microsoft.Policies.ControlPanelDisplay::CPL_Personalization_NoDesktopBackgroundUI
author: Stephen Lincoln @slincoln-aiq (AttackIQ)
date: 2023-12-21
tags:
- attack.defense-evasion
- attack.impact
- attack.t1112
- attack.t1491.001
logsource:
  product: windows
  category: process_creation
detection:
    # TODO: Improve this to also focus on variation using PowerShell and other CLI tools
  selection_reg_img:
  - Image|endswith: '\reg.exe'
  - OriginalFileName: 'reg.exe'
  selection_reg_flag:
    CommandLine|contains: 'add'
  selection_keys:
    CommandLine|contains:
    - 'Control Panel\Desktop'
    - 'CurrentVersion\Policies\ActiveDesktop'
    - 'CurrentVersion\Policies\System'
  selection_cli_reg_1:
    CommandLine|contains|all:
    - '/v NoChangingWallpaper'
    - '/d 1'         # Prevent changing desktop background
  selection_cli_reg_2:
    CommandLine|contains|all:
    - '/v Wallpaper'
    - '/t REG_SZ'
  selection_cli_reg_3:
    CommandLine|contains|all:
    - '/v WallpaperStyle'
    - '/d 2'         # Stretch
  condition: all of selection_reg_* and selection_keys and 1 of selection_cli_reg_*
falsepositives:
- Administrative scripts that change the desktop background to a company logo or other
  image.
level: medium
notes: |
  n
  ### Technical Context
  This detection rule focuses on monitoring the use of the `reg.exe` command-line utility, which is often exploited by malicious actors to manipulate Windows registry settings and alter the user's desktop background. Specifically, the rule identifies instances where registry keys associated with desktop personalization are modified, particularly keys that dictate the user's wallpaper settings. By analyzing `process_creation` logs, the rule looks for executions of `reg.exe` that aim to add or change registry values under paths like `Control Panel\Desktop`, which are commonly targeted by ransomware and other forms of malware for displaying ransom notes or misleading information. This behavior is categorized under the MITRE ATT&CK techniques T1112 (Modify Registry) and T1491.001 (Destructive Action 
  - Data Encrypted for Impact), signaling potential threats tied to user interface manipulation and impact on user experience.
  ### Investigation Steps
  - **Review EDR Alerts**: Use your EDR solution to examine the alerts tied to the identified `reg.exe` executions and correlate them with user activity logs to determine the legitimacy of the action.
  - **Inspect Registry Changes**: Access the relevant registry sections through a tool like Regedit or PowerShell to validate if unauthorized changes to the desktop background settings have occurred.
  - **Analyze Command-Line Activity**: Utilize Sysmon logs to analyze the command-line arguments used during the execution of `reg.exe`, identifying the exact parameters that were modified.
  - **Correlate with User Reports**: Check for any recent user complaints or reports regarding unexpected changes to their desktop background that could coincide with the detected activity.
  ### Prioritization
  The alert is assigned a medium severity level as it may indicate malicious activity attempting to alter user experience and potentially display ransom notes or misleading images. While this behavior can be linked to benign administrative tasks, the context surrounding the usage warrants further investigation to determine its legitimacy.
  ### Blind Spots and Assumptions
  This rule may not trigger if `reg.exe` is utilized in a manner that does not alter the desktop background (e.g., administrative tasks that do not use the specified keys). Additionally, if malicious actors use alternative tools or methods like PowerShell with a different syntax or switch to obfuscation techniques, the detection might fail. Analysts should also consider scenarios where legitimate administrative scripts change wallpapers for branding purposes, which may create false positives if the context is not adequately assessed.
  > **Disclaimer:** This investigation guide was created using generative AI technology and has not been reviewed for its accuracy and relevance. While every effort has been made to ensure its quality, we recommend validating the content and adapting it to suit specific environment and operational needs. Please communicate any changes to the detection engineering team.
