title: Potential Password Spraying Attempt Using Dsacls.EXE
id: bac9fb54-2da7-44e9-988f-11e9a5edbc0c
status: test
description: Detects possible password spraying attempts using Dsacls
references:
- https://www.ired.team/offensive-security-experiments/active-directory-kerberos-abuse/using-dsacls-to-check-ad-object-permissions#password-spraying-anyone
- https://ss64.com/nt/dsacls.html
- https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-r2-and-2012/cc771151(v=ws.11)
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-06-20
modified: 2023-02-04
tags:
- attack.defense-evasion
- attack.t1218
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: '\dsacls.exe'
  - OriginalFileName: "DSACLS.EXE"
  selection_cli:
    CommandLine|contains|all:
    - '/user:'
    - '/passwd:'
  condition: all of selection*
falsepositives:
- Legitimate use of dsacls to bind to an LDAP session
level: medium
notes: |
  ### Technical Context
  This detection rule identifies potential password spraying attempts involving the use of the `dsacls.exe` executable in a Microsoft Windows environment. The rule works by monitoring process creation logs for instances where `dsacls.exe` is invoked with command-line arguments indicative of password spraying, specifically looking for parameters such as `/user:` and `/passwd:`. By focusing on these specific command-line components, the rule aims to flag events that may suggest unauthorized attempts to gain access to user accounts through brute-force guessing of passwords.
  The primary data sources for this rule include process creation logs that detail the execution of Windows applications, specifically monitoring for the execution of `dsacls.exe`. By correlating the presence of this executable with specific command-line arguments, the rule helps in identifying potentially malicious activities aimed at exploiting user accounts within an Active Directory environment, making it crucial for proactive threat detection.
  ### Investigation Steps
  - Review the process creation logs for `dsacls.exe` execution, focusing on the time frame and the user initiating the process to determine if there are signs of unauthorized access.
  - Use EDR tools to obtain further context on the system where `dsacls.exe` was executed, checking for any unusual patterns of activity surrounding the execution time.
  - Investigate the command-line parameters used with `dsacls.exe` to identify specific user accounts targeted, especially looking for entries that may not align with normal operational behavior.
  - Correlate findings with Active Directory logs and authentication attempts to assess whether the targeted accounts experienced additional failed login attempts that may confirm a password spraying incident.
