title: Potential Application Whitelisting Bypass via Dnx.EXE
id: 81ebd28b-9607-4478-bf06-974ed9d53ed7
status: test
description: |
  Detects the execution of Dnx.EXE. The Dnx utility allows for the execution of C# code.
  Attackers might abuse this in order to bypass application whitelisting.
references:
- https://lolbas-project.github.io/lolbas/OtherMSBinaries/Csi/
- https://enigma0x3.net/2016/11/17/bypassing-application-whitelisting-by-using-dnx-exe/
author: Beyu Denis, oscd.community
date: 2019-10-26
modified: 2024-04-24
tags:
- attack.defense-evasion
- attack.t1218
- attack.t1027.004
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith: '\dnx.exe'
  condition: selection
falsepositives:
- Legitimate use of dnx.exe by legitimate user
level: medium
notes: |
  ### Technical Context
  This detection rule focuses on identifying the execution of `Dnx.EXE`, a utility that allows for the execution of C# code. Attackers may misuse `Dnx.EXE` to circumvent application whitelisting mechanisms, potentially facilitating unauthorized code execution within an enterprise environment. The rule examines process creation logs, specifically searching for instances where the image path ends with `\dnx.exe`. This search employs the capabilities of systems that log process creation events, making it essential for detecting potential defenses being evaded during an attack. Given that legitimate applications may also use this utility, context is critical to distinguishing between benign and malicious activity.
  ### Investigation Steps
  - Review the process creation logs in your EDR solution to confirm details about the `dnx.exe` execution, including the user context and process lineage.
  - Analyze the command-line parameters used with `dnx.exe` to understand the nature of the executed code and to detect any suspicious or unusual patterns.
  - Check the logs of any application whitelisting solutions to determine if `dnx.exe` was previously allowed or blocked and identify any related alerts generated by those solutions.
  - Investigate network activity associated with the user and process to uncover any communication with potentially malicious external domains or suspicious data exfiltration attempts.
