title: Potential Renamed Rundll32 Execution
id: 2569ed8c-1147-498a-9b8c-2ad3656b10ed
related:
- id: 0ba1da6d-b6ce-4366-828c-18826c9de23e
  type: derived
status: test
description: Detects when 'DllRegisterServer' is called in the commandline and the
  image is not rundll32. This could mean that the 'rundll32' utility has been renamed
  in order to avoid detection
references:
- https://twitter.com/swisscom_csirt/status/1331634525722521602?s=20
- https://app.any.run/tasks/f74c5157-8508-4ac6-9805-d63fe7b0d399/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-08-22
modified: 2023-02-03
tags:
- attack.execution
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|contains: 'DllRegisterServer'
  filter:
    Image|endswith: '\rundll32.exe'
  condition: selection and not filter
falsepositives:
- Unlikely
level: high
notes: |
  ### Technical Context
  This detection rule identifies potential misuse of the Windows `rundll32` utility, particularly when an executable that is not `rundll32.exe` calls the `DllRegisterServer` function via the command line. This behavior can indicate that an attacker has renamed the `rundll32` executable to evade detection mechanisms, leveraging its functionality to execute malicious payloads. The rule utilizes process creation logs, focusing on command-line parameters that contain 'DllRegisterServer' while filtering out legitimate instances where the image in question is the standard `rundll32.exe` file. By analyzing these parameters, the rule highlights suspicious activities that may warrant further investigation.
  ### Investigation Steps
  - Review process creation logs in the EDR to identify all instances of processes executing with the 'DllRegisterServer' command-line parameter.
  - Check the file paths of the identified processes to confirm whether the executing image is genuinely not `rundll32.exe`, which could indicate potential renaming or obfuscation. 
  - Cross-reference the timestamps of the identified processes with other logs (AV, Proxy, etc.) to find anomalous activity or additional indicators of compromise associated with the suspicious execution.
  - If suspicious activity is confirmed, collect additional contextual information, like network connections and parent processes, to better understand the intent and potential impact of this execution.
