title: HackTool - PowerTool Execution
id: a34f79a3-8e5f-4cc3-b765-de00695452c2
status: test
description: Detects the execution of the tool PowerTool which has the ability to
  kill a process, delete its process file, unload drivers, and delete the driver files
references:
- https://thedfirreport.com/2022/11/28/emotet-strikes-again-lnk-file-leads-to-domain-wide-ransomware/
- https://www.trendmicro.com/en_us/research/22/i/play-ransomware-s-attack-playbook-unmasks-it-as-another-hive-aff.html
- https://twitter.com/gbti_sa/status/1249653895900602375?lang=en
- https://www.softpedia.com/get/Antivirus/Removal-Tools/ithurricane-PowerTool.shtml
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-11-29
modified: 2023-02-04
tags:
- attack.defense-evasion
- attack.t1562.001
logsource:
  product: windows
  category: process_creation
detection:
  selection:
  - Image|endswith:
    - '\PowerTool.exe'
    - '\PowerTool64.exe'
  - OriginalFileName: 'PowerTool.exe'
  condition: selection
falsepositives:
- Unlikely
level: high
notes: |
  ### Technical Context
  This detection rule identifies the execution of the tool PowerTool, which is often associated with malicious activity such as process termination and driver manipulation. PowerTool can delete processes, unload drivers, and remove associated driver files, making it a powerful tool for evading security measures. The rule inspects process creation logs to find entries where the image filename ends with either `PowerTool.exe` or `PowerTool64.exe` and checks for the original file name of `PowerTool.exe`. By monitoring these specific indicators, the rule aims to detect the unauthorized use of this tool, which could signal an attempt to facilitate further malicious actions, such as ransomware execution or system compromise.
  ### Investigation Steps
  - Utilize EDR tools to review the process creation logs for instances of `PowerTool.exe` or `PowerTool64.exe`, paying close attention to the timestamps of execution.
  - Investigate the command-line parameters associated with the execution of PowerTool, as they may provide insight into the specific actions the tool was used for.
  - Check related process activity and communication logs (e.g., from Proxy or NGFW) to identify any unusual outbound connections or suspicious interactions right before and after the execution of PowerTool.
  - Examine system logs and alerts from AV or NDR tools for any anomalies or alerts that may indicate malicious activity related to the use of PowerTool in your environment.
