title: Set Suspicious Files as System Files Using Attrib.EXE
id: efec536f-72e8-4656-8960-5e85d091345b
related:
- id: bb19e94c-59ae-4c15-8c12-c563d23fe52b
  type: derived
status: test
description: |
  Detects the usage of attrib with the "+s" option to set scripts or executables located in suspicious locations as system files to hide them from users and make them unable to be deleted with simple rights. The rule limits the search to specific extensions and directories to avoid FPs
references:
- https://app.any.run/tasks/c28cabc8-a19f-40f3-a78b-cae506a5c0d4
- https://app.any.run/tasks/cfc8870b-ccd7-4210-88cf-a8087476a6d0
- https://unit42.paloaltonetworks.com/unit42-sure-ill-take-new-combojack-malware-alters-clipboards-steal-cryptocurrency/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-06-28
modified: 2023-03-14
tags:
- attack.defense-evasion
- attack.t1564.001
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: '\attrib.exe'
  - OriginalFileName: 'ATTRIB.EXE'
  selection_cli:
    CommandLine|contains: ' +s'
  selection_paths:
    CommandLine|contains:
    - ' %'         # Custom Environment variable
    - '\Users\Public\'
    - '\AppData\Local\'
    - '\ProgramData\'
    - '\Downloads\'
    - '\Windows\Temp\'
  selection_ext:
    CommandLine|contains:
    - '.bat'
    - '.dll'
    - '.exe'
    - '.hta'
    - '.ps1'
    - '.vbe'
    - '.vbs'
  filter_optional_installer:
    CommandLine|contains|all:
    - '\Windows\TEMP\'
    - '.exe'
  condition: all of selection* and not 1 of filter_optional_*
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This detection rule identifies when the `attrib.exe` executable is utilized to set files as system files using the "+s" command-line option, which is often employed by malware to hide its presence on a Windows system. The rule specifically monitors for this command within the context of potentially suspicious file paths (such as `\Users\Public\`, `\AppData\Local\`, and `\Windows\Temp\`) and certain file extensions (including `.exe`, `.bat`, `.dll`, etc.). By focusing on a narrow set of command-line attributes, file types, and execution paths, the rule aims to reduce false positives while flagging techniques commonly associated with various forms of malware and unauthorized access attempts.
  The primary data sources leveraged by the detection include process creation logs generated by the Windows operating system, capturing details about executed processes, their command-line parameters, and the paths from where they are launched. This allows incident responders to quickly identify and analyze potentially malicious activity on enterprise endpoints.
  ### Investigation Steps
  - Review the process creation logs in your EDR solution for the execution of `attrib.exe` with the "+s" parameter, along with the associated command-line arguments and file paths.
  - Investigate the specific file(s) being altered to system files located in the suspicious directories identified by the rule to determine their legitimacy and origin.
  - Check for any associated network activity through your NDR or Proxy logs that might indicate data exfiltration or communication with known malicious hosts during the time frame of the alert.
  - Examine historical and real-time alerts from your AV solution for any detections relating to the altered files and ensure that no known malware signatures or behaviors have been triggered.
