title: PUA - Netcat Suspicious Execution
id: e31033fc-33f0-4020-9a16-faf9b31cbf08
status: test
description: Detects execution of Netcat. Adversaries may use a non-application layer
  protocol for communication between host and C2 server or among infected hosts within
  a network
references:
- https://nmap.org/ncat/
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1095/T1095.md
- https://www.revshells.com/
author: frack113, Florian Roth (Nextron Systems)
date: 2021-07-21
modified: 2023-02-08
tags:
- attack.command-and-control
- attack.t1095
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
        # can not use OriginalFileName as is empty
    Image|endswith:
    - '\nc.exe'
    - '\ncat.exe'
    - '\netcat.exe'
  selection_cmdline:
        # Typical command lines
    CommandLine|contains:
    - ' -lvp '
    - ' -lvnp'
    - ' -l -v -p '
    - ' -lv -p '
    - ' -l --proxy-type http '
            # - ' --exec cmd.exe ' # Not specific enough for netcat
    - ' -vnl --exec '
    - ' -vnl -e '
    - ' --lua-exec '
    - ' --sh-exec '
  condition: 1 of selection_*
falsepositives:
- Legitimate ncat use
level: high
notes: |
  ### Technical Context
  This detection rule aims to identify suspicious executions of Netcat, a versatile networking utility often leveraged by adversaries for command and control (C2) communications within compromised environments. Netcat can facilitate data exfiltration or unauthorized remote access, making its usage a significant red flag in security monitoring. The rule primarily analyzes process creation logs from Windows systems, looking for specific executables related to Netcat (`nc.exe`, `ncat.exe`, `netcat.exe`) and predefined command-line arguments commonly associated with malicious usage patterns. By correlating image names and command-line parameters, the rule effectively detects non-application layer protocol communications that could signal unauthorized activity.
  ### Investigation Steps
  - **Review process creation logs** to identify the context of the Netcat execution, focusing on the parent process and any associated command-line arguments that indicate suspicious behavior.
  - **Cross-reference command-line execution against existing application whitelists** to determine if the use of Netcat is justified or if it deviates from normal operational practices in your environment.
  - **Utilize EDR tools to analyze the device's network traffic** during the timeframe of the alert to detect any unusual outbound connections, particularly those leading to unauthorized external IP addresses.
  - **Check proxy logs for any indication of command and control traffic** that may align with the usage of Netcat, including any unusual patterns or connections to known malicious domains.
