title: System Disk And Volume Reconnaissance Via Wmic.EXE
id: c79da740-5030-45ec-a2e0-479e824a562c
related:
- id: d85ecdd7-b855-4e6e-af59-d9c78b5b861e
  type: similar
status: test
description: |
  An adversary might use WMI to discover information about the system, such as the volume name, size,
  free space, and other disk information. This can be done using the `wmic` command-line utility and has been
  observed being used by threat actors such as Volt Typhoon.
references:
- https://www.cisa.gov/news-events/cybersecurity-advisories/aa23-144a
- https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/wmic
author: Stephen Lincoln `@slincoln-aiq`(AttackIQ)
date: 2024-02-02
tags:
- attack.execution
- attack.discovery
- attack.t1047
- attack.t1082
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: '\WMIC.exe'
  - OriginalFileName: 'wmic.exe'
  selection_cli:
    CommandLine|contains:
    - 'volume'
    - 'path win32_logicaldisk'
  condition: all of selection_*
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  This detection rule focuses on identifying potential reconnaissance activities conducted by adversaries using the Windows Management Instrumentation Command-line (WMIC) tool, specifically the `wmic.exe` utility. Threat actors may leverage WMIC to gather critical information about a system’s disk volumes, such as names, sizes, and available free space, which can assist in planning further attacks. The rule monitors for the execution of `wmic.exe` and examines the command-line parameters supplied to it, explicitly looking for terms related to disk volume data retrieval. By utilizing process creation logs, the detection helps capture instances where an adversary may be probing the system for valuable information before executing additional malicious actions.
  ### Investigation Steps
  - Use your EDR tool to investigate the endpoint where the alert was triggered. Look for recent process executions that include `wmic.exe` with the identified command-line parameters.
  - Cross-reference the alert with any available logs from your SIEM to determine the source IP address or user account associated with the execution of the WMIC command, identifying any potentially unauthorized access.
  - Check firewall and proxy logs for any unusual outbound connections or attempts to access remote resources immediately following the execution of `wmic.exe`, as this may indicate lateral movement or data exfiltration.
  - Analyze any active connections to cloud platforms like AWS, GCP, or Azure, to determine if there were attempts to gather sensitive data or execute commands remotely that align with the identified WMIC activity.
