title: Filter Driver Unloaded Via Fltmc.EXE
id: 4931188c-178e-4ee7-a348-39e8a7a56821
related:
- id: 4d7cda18-1b12-4e52-b45c-d28653210df8     # Sysmon specific
  type: derived
status: test
description: Detect filter driver unloading activity via fltmc.exe
references:
- https://www.darkoperator.com/blog/2018/10/5/operating-offensively-against-sysmon
- https://www.cybereason.com/blog/threat-analysis-report-lockbit-2.0-all-paths-lead-to-ransom
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023-02-13
modified: 2024-06-24
tags:
- attack.defense-evasion
- attack.t1070
- attack.t1562
- attack.t1562.002
logsource:
  product: windows
  category: process_creation
detection:
  selection_img:
  - Image|endswith: '\fltMC.exe'
  - OriginalFileName: 'fltMC.exe'
  selection_cli:
    CommandLine|contains: 'unload'
  filter_optional_avira:
    ParentImage|startswith: 'C:\Users\'
    ParentImage|contains: '\AppData\Local\Temp\'
    ParentImage|endswith: '\endpoint-protection-installer-x64.tmp'
    CommandLine|endswith: 'unload rtp_filesystem_filter'
  filter_optional_manageengine:
    ParentImage: 'C:\Program Files (x86)\ManageEngine\uems_agent\bin\dcfaservice64.exe'
    CommandLine|endswith: 'unload DFMFilter'
  condition: all of selection_* and not 1 of filter_optional_*
falsepositives:
- Unknown
level: medium
notes: |
  n
  ### Technical Context
  The rule "Filter Driver Unloaded Via Fltmc.EXE" is designed to detect potentially malicious activities that involve the unloading of filter drivers using the `fltmc.exe` utility in Windows. Filter drivers can be used to monitor or modify the behavior of other drivers and can be exploited by adversaries to bypass security measures or perform unauthorized actions. This detection rule monitors process creation events for instances where `fltmc.exe` is used with an associated command line that includes the term "unload." Additionally, it filters out common legitimate scenarios, such as those triggered by certain application installers. The primary telemetry data sources involved in this detection include process creation logs from Sysmon, capturing details on the command lines and parent processes involved in these operations. This detection aligns with the MITRE ATT&CK tactics of Defense Evasion (TA0005), focusing specifically on techniques such as Indicator Removal on Host (T1070) and Process Injection (T1562).
  ### Investigation Steps
  - **Review Process Creation Logs**: Examine Sysmon process creation logs for instances of `fltmc.exe` running with "unload" in the command line. Identify the context of the command execution, such as the user and parent processes.
  - **Correlate with Security Alerts**: Check the EDR for any security events or alerts generated around the same time as the detected unload command to assess if this action correlates with other known malicious activities.
  - **Analyze Parent Processes**: Investigate the parent processes of the `fltmc.exe` instance, particularly those related to common applications or services. This can help determine if the activity is legitimate or part of a potential attack.
  - **Cross-Check Recent Changes**: Utilize configuration and change management logs to identify any recent changes made to filter drivers or system configurations that could explain or provide context for the unloading process.
  ### Prioritization
  This alert has a medium severity level due to the potentially harmful nature of filter driver unloading, which can indicate an attempt to evade security measures. Immediate investigation is recommended to determine if this activity is part of a legitimate process or a malicious tactic employed by an attacker.
  ### Blind Spots and Assumptions
  This rule may not fire in environments where `fltmc.exe` is not used or in cases where the unloading of filter drivers does not involve the specified command line parameters. It is important to note that legitimate software may also trigger this alert, making context essential for accurate interpretation. Additionally, adversaries may deploy custom scripts or tools that bypass this detection mechanism, leveraging alternate utilities or command-line formats that do not trigger the current filtering criteria.
  > **Disclaimer:** This investigation guide was created using generative AI technology and has not been reviewed for its accuracy and relevance. While every effort has been made to ensure its quality and comprehensiveness, we recommend validating the content and adapting it to suit specific environment and operational needs. Please communicate any changes to the detection engineering team.
