title: Suspicious DumpMinitool Execution
id: eb1c4225-1c23-4241-8dd4-051389fde4ce
status: test
description: Detects suspicious ways to use the "DumpMinitool.exe" binary
references:
- https://twitter.com/mrd0x/status/1511415432888131586
- https://twitter.com/mrd0x/status/1511489821247684615
- https://lolbas-project.github.io/lolbas/OtherMSBinaries/DumpMinitool/
author: Florian Roth (Nextron Systems)
date: 2022-04-06
modified: 2023-04-12
tags:
- attack.defense-evasion
- attack.t1036
- attack.t1003.001
logsource:
  category: process_creation
  product: windows
detection:
  selection:
  - Image|endswith:
    - '\DumpMinitool.exe'
    - '\DumpMinitool.x86.exe'
    - '\DumpMinitool.arm64.exe'
  - OriginalFileName:
    - 'DumpMinitool.exe'
    - 'DumpMinitool.x86.exe'
    - 'DumpMinitool.arm64.exe'
  filter_folder:
    Image|contains:
    - '\Microsoft Visual Studio\'
    - '\Extensions\'          # https://github.com/microsoft/vstest/blob/b2e2126f1aa7e5753cafe9515563c99ade6a59ce/src/package/nuspec/Microsoft.TestPlatform.Portable.nuspec#L159
  susp_flags:
    CommandLine|contains: '.txt'
  cmd_has_flags:
    CommandLine|contains:
    - ' Full'
    - ' Mini'
    - ' WithHeap'
  filter_cmd_misses_flags:
    CommandLine|contains: '--dumpType'
  condition: selection and ( ( not filter_folder ) or susp_flags or ( cmd_has_flags
    and not filter_cmd_misses_flags ) )
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  The "Suspicious DumpMinitool Execution" Sigma rule is designed to identify potentially malicious use of the "DumpMinitool.exe" binary, which is often leveraged in defense-evasion tactics. This rule detects executions of DumpMinitool based on specific attributes such as the image path, original file name, and associated command line arguments. The rule particularly monitors for instances where the binary is executed from uncommon directories or contains suspicious command-line parameters that might indicate nefarious activities, such as the intention to dump sensitive information or bypass security controls. Key data sources for this detection include process creation logs that capture the executable paths and command-line arguments at the time of execution.
  ### Investigation Steps
  - Review the process creation logs in your EDR tool to confirm the execution of DumpMinitool.exe, taking note of the parent process and execution path for further context.
  - Analyze the command-line parameters associated with the detected execution to identify any suspicious flags and arguments that could indicate malicious intent.
  - Check for additional indicators of compromise using your SIEM, such as correlating logs for unusual network activity or file access events around the time of the alert.
  - Investigate the system's recent updates and configurations in your AV solution to ensure that the environment has not been improperly modified to allow unauthorized use of this binary.
