title: Suspicious File Characteristics Due to Missing Fields
id: 9637e8a5-7131-4f7f-bdc7-2b05d8670c43
status: test
description: Detects Executables in the Downloads folder without FileVersion,Description,Product,Company
  likely created with py2exe
references:
- https://securelist.com/muddywater/88059/
- https://www.virustotal.com/#/file/276a765a10f98cda1a38d3a31e7483585ca3722ecad19d784441293acf1b7beb/detection
author: Markus Neis, Sander Wiebing
date: 2018-11-22
modified: 2022-10-09
tags:
- attack.execution
- attack.t1059.006
logsource:
  product: windows
  category: process_creation
detection:
  selection1:
    Description: '\?'
    FileVersion: '\?'
  selection2:
    Description: '\?'
    Product: '\?'
  selection3:
    Description: '\?'
    Company: '\?'
  folder:
    Image|contains: '\Downloads\'
  condition: (selection1 or selection2 or selection3) and folder
fields:
- CommandLine
- ParentCommandLine
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  This detection rule aims to identify suspicious executable files located in the Windows "Downloads" folder that lack essential metadata fields such as FileVersion, Description, Product, and Company. These characteristics are often indicative of files generated by automated scripts like py2exe, which may not populate these attributes properly. By leveraging process creation logs, the rule checks for processes that exhibit this lack of metadata while residing in the Downloads folder, which is a common initial staging ground for potentially malicious executables downloaded from the internet. Detecting these files can help incident responders mitigate risks associated with unverified and potentially harmful downloads.
  ### Investigation Steps
  - Review process creation logs in the EDR system to identify the executable files flagged by this rule, paying particular attention to the command-line parameters used during execution.
  - Check the parent process and its command-line arguments to determine how the suspicious executable was initiated and whether it is tied to known legitimate applications or scripts.
  - Analyze the file using antivirus solutions or services like VirusTotal to verify its reputation and check for any existing detections or alerts associated with the file hash.
  - Investigate other files within the same directory or within user profiles that may exhibit similar characteristics to establish potential patterns of malicious activity.
