title: Remote Access Tool - ScreenConnect Installation Execution
id: 75bfe6e6-cd8e-429e-91d3-03921e1d7962
status: test
description: Detects ScreenConnect program starts that establish a remote access to
  a system.
references:
- https://www.anomali.com/blog/probable-iranian-cyber-actors-static-kitten-conducting-cyberespionage-campaign-targeting-uae-and-kuwait-government-agencies
author: Florian Roth (Nextron Systems)
date: 2021-02-11
modified: 2024-02-26
tags:
- attack.initial-access
- attack.t1133
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|contains|all:
    - 'e=Access&'
    - 'y=Guest&'
    - '&p='
    - '&c='
    - '&k='
  condition: selection
falsepositives:
- Legitimate use by administrative staff
level: medium
notes: |
  ### Technical Context
  This Sigma rule is designed to detect the installation and execution of the ScreenConnect remote access tool on a Windows system. It identifies specific command-line parameters associated with the ScreenConnect setup process, such as those indicating access configurations for guest users and access permissions. The rule parses process creation logs to flag instances where the command line contains certain keywords typical of ScreenConnect operations, such as 'e=Access&', 'y=Guest&', and parameters denoting the session configuration. Responders should be aware that while this detection seeks to identify potentially malicious usage, legitimate administrative activities may trigger alerts due to the nature of ScreenConnect being used for remote support.
  ### Investigation Steps
  - Review the process creation logs in the EDR to identify the specific user and time associated with the ScreenConnect execution.
  - Examine related network activity using NDR to detect any unusual connections that may indicate unauthorized remote access attempts.
  - Check the AV logs to see if any alerts were triggered during the installation or execution of ScreenConnect, which could indicate suspicious behavior.
  - Investigate the context of the alert by analyzing the user's history and any prior instances of legitimate usage of remote access tools, especially from administrative roles.
