title: Suspicious AddinUtil.EXE CommandLine Execution
id: 631b22a4-70f4-4e2f-9ea8-42f84d9df6d8
status: test
description: |
  Detects execution of the Add-In deployment cache updating utility (AddInutil.exe) with suspicious Addinroot or Pipelineroot paths. An adversary may execute AddinUtil.exe with uncommon Addinroot/Pipelineroot paths that point to the adversaries Addins.Store payload.
references:
- https://www.blue-prints.blog/content/blog/posts/lolbin/addinutil-lolbas.html
author: Nasreddine Bencherchali (Nextron Systems), Michael McKinley (@McKinleyMike),
  Tony Latteri (@TheLatteri)
date: 2023-09-18
tags:
- attack.defense-evasion
- attack.t1218
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: '\addinutil.exe'
  - OriginalFileName: 'AddInUtil.exe'
  selection_susp_1_flags:
    CommandLine|contains:
    - '-AddInRoot:'
    - '-PipelineRoot:'
  selection_susp_1_paths:
    CommandLine|contains:
    - '\AppData\Local\Temp\'
    - '\Desktop\'
    - '\Downloads\'
    - '\Users\Public\'
    - '\Windows\Temp\'
  selection_susp_2:
    CommandLine|contains:
    - '-AddInRoot:.'
    - '-AddInRoot:"."'
    - '-PipelineRoot:.'
    - '-PipelineRoot:"."'
    CurrentDirectory|contains:
    - '\AppData\Local\Temp\'
    - '\Desktop\'
    - '\Downloads\'
    - '\Users\Public\'
    - '\Windows\Temp\'
  condition: selection_img and (all of selection_susp_1_* or selection_susp_2)
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  The detection rule titled "Suspicious AddinUtil.EXE CommandLine Execution" targets the execution of the Add-In utility (AddInUtil.exe), specifically when it is invoked with unusual parameters that could indicate malicious activity. AddInUtil.exe is a legitimate tool for updating Microsoft Office add-ins, but attackers may abuse it by specifying atypical paths, such as those in temporary directories or user profiles, to execute malicious payloads. This rule leverages process creation logs to identify instances where AddInUtil.exe is executed with command-line arguments that include suspicious `-AddInRoot` or `-PipelineRoot` flags, especially with path markers that hint at non-standard or unforeseen locations. 
  The analysis relies on two primary detection criteria: first, checking for the execution image and noting the command-line parameters, and second, confirming that these parameters correspond to directories commonly associated with temporary file storage or other user-related paths. This multi-faceted approach enhances detection capabilities and makes it more challenging for adversaries to evade scrutiny.
  ### Investigation Steps
  - Review the process creation logs in your EDR to identify instances where AddInUtil.exe was executed with suspicious command-line arguments.
  - Investigate the corresponding user activity in the AV logs to determine if there are known malicious files or behaviors associated with the execution of AddInUtil.exe in those instances.
  - Analyze the command-line parameters and current working directory extracted from the logs, ensuring they do not point to legitimate add-in installation directories.
  - Check web proxy logs for any unusual download activity that could correlate with the identified suspicious command execution, especially focusing on attachments or links that could lead to malicious payloads.
