title: New Remote Desktop Connection Initiated Via Mstsc.EXE
id: 954f0af7-62dd-418f-b3df-a84bc2c7a774
status: test
description: |
  Detects the usage of "mstsc.exe" with the "/v" flag to initiate a connection to a remote server.
  Adversaries may use valid accounts to log into a computer using the Remote Desktop Protocol (RDP). The adversary may then perform actions as the logged-on user.
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1021.001/T1021.001.md#t1021001---remote-desktop-protocol
- https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/mstsc
author: frack113
date: 2022-01-07
modified: 2024-06-04
tags:
- attack.lateral-movement
- attack.t1021.001
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: '\mstsc.exe'
  - OriginalFileName: 'mstsc.exe'
  selection_cli:
    CommandLine|contains|windash: ' /v:'
  filter_optional_wsl:
        # Example: mstsc.exe /v:XXXXXXXX-XXXX-XXXX-XXXX-XXXXXXXXXXXX /hvsocketserviceid:XXXXXXXX-XXXX-XXXX-XXXX-XXXXXXXXXXXX /silent /wslg /plugin:WSLDVC /wslgsharedmemorypath:WSL\XXXXXXXX-XXXX-XXXX-XXXX-XXXXXXXXXXXX\wslg C:\ProgramData\Microsoft\WSL\wslg.rdp
    ParentImage: 'C:\Windows\System32\lxss\wslhost.exe'
    CommandLine|contains: 'C:\ProgramData\Microsoft\WSL\wslg.rdp'
  condition: all of selection_* and not 1 of filter_optional_*
falsepositives:
- WSL (Windows Sub System For Linux)
level: medium
notes: |
  ### Technical Context
  This detection rule aims to identify instances where a user initiates a Remote Desktop Protocol (RDP) connection using `mstsc.exe`, specifically focusing on the usage of the "/v" command-line parameter. The rule examines process creation logs on Windows systems to detect when `mstsc.exe` is executed, looking for its original filename and associated command-line arguments. By targeting connections initiated with the "/v" flag, the rule captures potentially unauthorized access attempts to remote systems by adversaries leveraging valid credentials. This can indicate lateral movement within the network. Additionally, the rule accounts for optional execution contexts, including instances where `mstsc.exe` is launched within the Windows Subsystem for Linux (WSL), thereby reducing false positive alerts from benign usage.
  ### Investigation Steps
  - Review the EDR logs to examine the process creation events for `mstsc.exe`, ensuring to check the user account that initiated the connection.
  - Analyze command-line arguments recorded alongside the process execution to assess whether the connection targets a suspicious or known malicious host.
  - Utilize firewall logs to validate network connections established from the source machine to the destination IP during the time of the alert.
  - Check VPN or proxy logs to see if there were any unusual access patterns surrounding the time the RDP session was initiated, particularly from remote locations.
