title: Execution Of Non-Existing File
id: 71158e3f-df67-472b-930e-7d287acaa3e1
status: test
description: Checks whether the image specified in a process creation event is not
  a full, absolute path (caused by process ghosting or other unorthodox methods to
  start a process)
references:
- https://pentestlaboratories.com/2021/12/08/process-ghosting/
author: Max Altgelt (Nextron Systems)
date: 2021-12-09
modified: 2022-12-14
tags:
- attack.defense-evasion
logsource:
  category: process_creation
  product: windows
detection:
  image_absolute_path:
    Image|contains: '\'
  filter_null:
    Image:
  filter_empty:
    Image:
    - '-'
    - ''
  filter_4688:
  - Image:
    - 'System'
    - 'Registry'
    - 'MemCompression'
    - 'vmmem'
  - CommandLine:
    - 'Registry'
    - 'MemCompression'
    - 'vmmem'
  condition: not image_absolute_path and not 1 of filter*
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  The "Execution Of Non-Existing File" Sigma rule is designed to detect suspicious process creation events in Windows environments. Specifically, it identifies situations where a process is initiated without a full, absolute path, which may indicate potential process ghosting or other evasion techniques. The rule examines process creation logs, focusing on the 'Image' and 'CommandLine' attributes associated with the processes. If the image path is not an absolute path, and it does not match known safe processes (such as 'System', 'Registry', 'MemCompression', and 'vmmem'), an alert is generated. This behavior is typically associated with attempts to obfuscate malicious activity or improper command execution.
  ### Investigation Steps
  - Review the associated process creation logs using your EDR tool to identify the specific process and user account that triggered the alert.
  - Analyze command-line arguments in the logs to determine if any unusual or malicious commands were executed alongside the process initiation.
  - Cross-reference the alert with existing threat intelligence and previously identified false positives to assess the legitimacy of the detected activity.
  - Investigate related network activity in your NDR or Proxy logs to check for potential malware communication or lateral movement attempts associated with the suspicious process.
