title: Potential Regsvr32 Commandline Flag Anomaly
id: b236190c-1c61-41e9-84b3-3fe03f6d76b0
status: test
description: Detects a potential command line flag anomaly related to "regsvr32" in
  which the "/i" flag is used without the "/n" which should be uncommon.
references:
- https://twitter.com/sbousseaden/status/1282441816986484737?s=12
author: Florian Roth (Nextron Systems)
date: 2019-07-13
modified: 2024-03-13
tags:
- attack.defense-evasion
- attack.t1218.010
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith: '\regsvr32.exe'
    CommandLine|contains|windash: ' -i:'
  filter_main_flag:
    CommandLine|contains|windash: ' -n '
  condition: selection and not 1 of filter_main_*
falsepositives:
- Administrator typo might cause some false positives
level: medium
notes: |
  ### Technical Context
  This Sigma rule is focused on detecting anomalies in the usage of the Windows command-line utility "regsvr32," specifically when the "/i" flag is invoked without the commonly associated "/n" flag. The "/i" flag typically indicates that a user wants to invoke a DLL with registration instructions but when used alone can signify potential evasion techniques employed by malicious actors. The rule leverages process creation logs to identify instances where the command line invoked includes the "regsvr32.exe" image and the "/i" flag while explicitly excluding cases where the "/n" flag is also present. This behavior is unusual in typical administrative actions, which raises concerns and warrants further investigation into possible misuse or exploitation.
  ### Investigation Steps
  - Review recent process creation logs in your EDR solution to identify occurrences of "regsvr32.exe" executed with the "/i" flag but without the "/n" flag.
  - Pull command-line arguments from affected processes to analyze the context of execution, including identifying the user and system involved.
  - Examine application and security event logs from the Firewalls or Proxies to correlate any related outbound or suspicious traffic patterns matching the alert timeframe.
  - Investigate the integrity of the DLLs being handled by "regsvr32" by checking their file signatures and origin through your AV and endpoint security platforms.
