title: PUA - AdvancedRun Suspicious Execution
id: fa00b701-44c6-4679-994d-5a18afa8a707
related:
- id: d2b749ee-4225-417e-b20e-a8d2193cbb84
  type: similar
status: test
description: Detects the execution of AdvancedRun utility in the context of the TrustedInstaller,
  SYSTEM, Local Service or Network Service accounts
references:
- https://twitter.com/splinter_code/status/1483815103279603714
- https://medium.com/s2wblog/analysis-of-destructive-malware-whispergate-targeting-ukraine-9d5d158f19f3
- https://www.elastic.co/security-labs/operation-bleeding-bear
- https://www.winhelponline.com/blog/run-program-as-system-localsystem-account-windows/
author: Florian Roth (Nextron Systems)
date: 2022-01-20
modified: 2023-02-21
tags:
- attack.defense-evasion
- attack.privilege-escalation
- attack.t1134.002
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    CommandLine|contains:
    - '/EXEFilename'
    - '/CommandLine'
  selection_runas:
  - CommandLine|contains:
    - ' /RunAs 8 '
    - ' /RunAs 4 '
    - ' /RunAs 10 '
    - ' /RunAs 11 '
  - CommandLine|endswith:
    - '/RunAs 8'
    - '/RunAs 4'
    - '/RunAs 10'
    - '/RunAs 11'
  condition: all of selection*
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  The Sigma rule "PUA 
  - AdvancedRun Suspicious Execution" focuses on detecting the execution of the AdvancedRun utility when it is invoked in the context of privileged accounts such as TrustedInstaller, SYSTEM, Local Service, or Network Service. AdvancedRun is a tool that allows users to run programs with different user credentials and has the potential to be abused for malicious purposes, particularly in evading security controls and escalating privileges. The rule leverages process creation logs to monitor specific command-line parameters associated with the AdvancedRun utility, specifically looking for execution patterns that utilize run-as commands indicative of privilege escalation attempts. The detected command-line arguments (like '/RunAs') exhibit characteristics that align with MITRE ATT&CK technique T1134.002 
  - "Access Token Manipulation," under the tactic of "Defense Evasion" and "Privilege Escalation," enabling attackers to execute unauthorized commands in a privileged context.
  ### Investigation Steps
  - **Review Process Creation Logs**: Utilize EDR to investigate the process creation logs around the time of the alert, focusing on the parent-child process relationships and verifying if the AdvancedRun utility was indeed executed.
  - **Analyze Command-Line Arguments**: Examine the command-line arguments used in the process creation event to confirm if they match the suspicious patterns specified in the Sigma rule, especially parameters related to the '/RunAs' flag.
  - **Check Credential Use**: Investigate any associated privileged accounts (SYSTEM, TrustedInstaller, etc.) to determine if there have been unauthorized or unusual activities noted in security and system logs that warrant further scrutiny.
  - **Correlate with Other Security Events**: Cross-reference the alert with logs from your SIEM, such as Network Connection and DNS Query logs, to identify any anomalous external communications or malware behavior that could be linked to the execution of AdvancedRun.
  ### Prioritization
  The alert has been assigned a high severity level due to the potential for exploitative behavior that could allow an adversary to manipulate process execution and escalate privileges within an enterprise environment. Immediate investigation is warranted to assess whether malicious activity has occurred.
  ### Blind Spots and Assumptions
  This detection rule may not trigger in scenarios where the AdvancedRun utility was executed without the specific command-line parameters outlined in the rule. Additionally, if an attacker modifies the command-line arguments to avoid detection, or if the log source configurations do not capture process creation events adequately, the rule will not fire. It's also assumed that all relevant logging is appropriately configured and functioning, which may not always be the case depending on the diversity of systems and environments in use.
  > **Disclaimer:** This investigation guide was created using generative AI technology and has not been reviewed for its accuracy and relevance. While every effort has been made to ensure its quality, we recommend validating the content and adapting it to suit specific environment and operational needs. Please communicate any changes to the detection engineering team.
