title: HackTool - PurpleSharp Execution
id: ff23ffbc-3378-435e-992f-0624dcf93ab4
status: test
description: Detects the execution of the PurpleSharp adversary simulation tool
references:
- https://github.com/mvelazc0/PurpleSharp
author: Florian Roth (Nextron Systems)
date: 2021-06-18
modified: 2023-02-05
tags:
- attack.t1587
- attack.resource-development
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|contains: '\purplesharp'
  - OriginalFileName: 'PurpleSharp.exe'
  selection_cli:
    CommandLine|contains:
    - 'xyz123456.exe'
    - 'PurpleSharp'
  condition: 1 of selection_*
falsepositives:
- Unlikely
level: critical
notes: |
  ### Technical Context
  This detection rule identifies the execution of the PurpleSharp tool, a popular adversary simulation framework designed to emulate attacker behaviors in a controlled environment. Specifically, the rule looks for process creation events involving the executable `PurpleSharp.exe` and checks the command line for specific arguments, such as `xyz123456.exe` or `PurpleSharp`. Data sources include Windows process creation logs, which provide critical information about application executions, their corresponding command-line parameters, and associated file metadata. The intention behind this detection is to flag potential misuse of PurpleSharp, as its functionality can be leveraged for malicious purposes if used by unauthorized individuals or in unsecured environments.
  ### Investigation Steps
  - Review the EDR tool's alerts and events for any indication of `PurpleSharp.exe` execution on endpoints, noting the user account under which it ran and associated processes.
  - Analyze command-line arguments in the context of recent administrative activities or red team exercises to determine if the activity was authorized or anomalous.
  - Check the logs from the NGFW for any outbound connections made by the host running PurpleSharp that could suggest lateral movement or communication with known command and control infrastructures.
  - Examine the proxy logs for any web requests generated by the tool to understand its behavior and if it attempted to download any additional payloads or contact external services.
