title: Potential PsExec Remote Execution
id: ea011323-7045-460b-b2d7-0f7442ea6b38
status: test
description: Detects potential psexec command that initiate execution on a remote
  systems via common commandline flags used by the utility
references:
- https://learn.microsoft.com/en-us/sysinternals/downloads/psexec
- https://www.poweradmin.com/paexec/
- https://www.fireeye.com/blog/threat-research/2020/10/kegtap-and-singlemalt-with-a-ransomware-chaser.html
author: Florian Roth (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)
date: 2023-02-28
tags:
- attack.resource-development
- attack.t1587.001
logsource:
  category: process_creation
  product: windows
detection:
  selection:
        # Accepting EULA in commandline - often used in automated attacks
    CommandLine|contains|all:
    - 'accepteula'
    - ' -u '
    - ' -p '
    - ' \\\\'
  condition: selection
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This detection rule is designed to identify potential misuse of the PsExec utility, which allows for remote execution of processes on Windows systems. The rule specifically looks for command-line arguments typically associated with automated attacks using PsExec, including the acceptance of the EULA (`accepteula`), as well as flags that specify a username (`-u`), password (`-p`), and the target remote system (`\\\\`). These elements can suggest that an attacker is attempting to execute commands on remote machines without proper authorization, potentially leading to malpractices such as lateral movement or the deployment of malware. The primary data sources monitored for this detection are process creation logs that capture command-line activity on Windows systems, facilitating the identification of suspicious command invocations.
  ### Investigation Steps
  - Review the process creation logs in your EDR solution to identify the specific instance where PsExec was invoked with the identified command-line patterns.
  - Examine network logs from your NGFW and NDR tools to trace any outgoing or incoming connections that coincide with the potential PsExec command execution, especially focusing on unusual remote access.
  - Check for any related activity within the endpoint's AV solution to determine if the executed process was flagged as malicious, indicating potential compromise.
  - Analyze logs from your cloud platforms (if applicable) and VPN access logs to assess whether any unauthorized resource access occurred alongside the remote execution event.
