title: Suspicious Group And Account Reconnaissance Activity Using Net.EXE
id: d95de845-b83c-4a9a-8a6a-4fc802ebf6c0
status: test
description: |
  Detects suspicious reconnaissance command line activity on Windows systems using Net.EXE
  Check if the user that executed the commands is suspicious (e.g. service accounts, LOCAL_SYSTEM)
references:
- https://redcanary.com/blog/how-one-hospital-thwarted-a-ryuk-ransomware-outbreak/
- https://thedfirreport.com/2020/10/18/ryuk-in-5-hours/
- https://research.nccgroup.com/2022/08/19/back-in-black-unlocking-a-lockbit-3-0-ransomware-attack/
author: Florian Roth (Nextron Systems), omkar72, @svch0st, Nasreddine Bencherchali
  (Nextron Systems)
date: 2019-01-16
modified: 2023-03-02
tags:
- attack.discovery
- attack.t1087.001
- attack.t1087.002
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith:
    - '\net.exe'
    - '\net1.exe'
  - OriginalFileName:
    - 'net.exe'
    - 'net1.exe'
    # Covers group and localgroup flags
  selection_group_root:
    CommandLine|contains:
    - ' group '
    - ' localgroup '
  selection_group_flags:
    CommandLine|contains:
            # Add more groups for other languages
    - 'domain admins'
    - ' administrator'         # Typo without an 'S' so we catch both
    - ' administrateur'         # Typo without an 'S' so we catch both
    - 'enterprise admins'
    - 'Exchange Trusted Subsystem'
    - 'Remote Desktop Users'
    - 'Utilisateurs du Bureau à distance'         # French for "Remote Desktop Users"
    - 'Usuarios de escritorio remoto'         # Spanish for "Remote Desktop Users"
    - ' /do'         # short for domain
  filter_group_add:
        # This filter is added to avoid the potential case where the point is not recon but addition
    CommandLine|contains: ' /add'
    # Covers 'accounts' flag
  selection_accounts_root:
    CommandLine|contains: ' accounts '
  selection_accounts_flags:
    CommandLine|contains: ' /do'     # short for domain
  condition: selection_img and ((all of selection_group_* and not filter_group_add)
    or all of selection_accounts_*)
falsepositives:
- Inventory tool runs
- Administrative activity
level: medium
notes: |
  ### Technical Context
  The Sigma rule "Suspicious Group And Account Reconnaissance Activity Using Net.EXE" is designed to identify potential reconnaissance activities on Windows systems where the `net.exe` or `net1.exe` command-line utilities are utilized. It specifically looks for command-line arguments used to query or list groups and accounts, which are actions commonly employed by attackers to gather information about user privileges or system configurations. The rule highlights commands that include group listings (like `group` or `localgroup`) or account inquiries while filtering out instances where new groups or accounts are being created, as these legitimize administrative actions. The primary technical data sources are process creation logs, which capture the invocation of commands and their respective arguments.
  This rule is associated with the MITRE ATT&CK tactics of Discovery, particularly techniques T1087.001 and T1087.002, which focus on the enumeration of user accounts and groups. Effectively, the rule operates as an early warning system, monitoring for potentially malicious behaviors that could precede more severe attacks.
  ### Investigation Steps
  - **Query EDR Logs**: Check EDR logs for the processes associated with `net.exe` or `net1.exe` to establish the timeline and context of the executions and correlate with user activities.
  - **Review User Context**: Investigate the user account that executed the command. If it is a service account or the LOCAL_SYSTEM account, this requires immediate attention as it may indicate malicious activity.
  - **Examine Command-Line Parameters**: Analyze the command-line arguments tied to the process execution to understand which groups or accounts were queried and assess their relevance and access permissions.
  - **Cross-reference with Security Logs**: Alert on any irregularities in the Windows Security event logs, particularly related to access or modifications involving the entities that were queried through the `net.exe` commands.
  ### Prioritization
  The alert is classified as medium severity because it indicates reconnaissance activity that could be a precursor to more damaging attacks. While it may also represent legitimate administrative tasks, given the right context (user account type and command parameters), it demands prompt investigation to rule out malicious intent.
  ### Blind Spots and Assumptions
  Potential blind spots include legitimate administrative usage of `net.exe` for inventory or management tasks, which could lead to false positives if not correctly contextualized. Additionally, if command-line logging is not enabled or if process creation logs are tampered with, it could lead to missed detections. Adversaries may also use alternative methods or obfuscate command-line output, such as using PowerShell or custom scripts, which would not be captured by this rule.
  > **Disclaimer:** This investigation guide was created using generative AI technology and has not been reviewed for its accuracy and relevance. While every effort has been made to ensure its quality, we recommend validating the content and adapting it to suit specific environment and operational needs. Please communicate any changes to the detection engineering team.
