title: Invocation of Active Directory Diagnostic Tool (ntdsutil.exe)
id: 2afafd61-6aae-4df4-baed-139fa1f4c345
status: test
description: Detects execution of ntdsutil.exe, which can be used for various attacks
  against the NTDS database (NTDS.DIT)
references:
- https://jpcertcc.github.io/ToolAnalysisResultSheet/details/ntdsutil.htm
author: Thomas Patzke
date: 2019-01-16
modified: 2022-03-11
tags:
- attack.credential-access
- attack.t1003.003
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith: '\ntdsutil.exe'
  condition: selection
falsepositives:
- NTDS maintenance
level: medium
notes: |
  ### Technical Context
  This detection rule is designed to identify the invocation of the Windows diagnostic tool `ntdsutil.exe`, which is commonly associated with managing and troubleshooting Active Directory databases (specifically the NTDS database, or NTDS.DIT). The presence of this tool within an organization’s environment can pose a risk, as it may be exploited by attackers to manipulate or extract sensitive information from the Active Directory, particularly during credential access attacks. The rule specifically monitors process creation logs, looking for instances where the command line ends with `ntdsutil.exe`. Alerting on this invocation allows SOC analysts to quickly assess whether the tool is being used for legitimate administrative purposes or if it indicates a potential security incident.
  ### Investigation Steps
  - Review EDR logs to gather context about the PC and user account that executed `ntdsutil.exe`, including recent activity leading up to its invocation.
  - Check process command-line arguments associated with `ntdsutil.exe` to identify any potentially malicious or unusual parameters that indicate exploitation.
  - Investigate Windows Event Logs, specifically security and system logs, for any suspicious login attempts or changes in Active Directory configurations that coincide with the execution of the tool.
  - Utilize network traffic analysis from NDR tools to identify any outbound connections made by the machine immediately after the execution of `ntdsutil.exe`, potentially indicating data exfiltration.
