title: Renamed ProcDump Execution
id: 4a0b2c7e-7cb2-495d-8b63-5f268e7bfd67
related:
- id: 03795938-1387-481b-9f4c-3f6241e604fe
  type: obsolete
status: test
description: |
  Detects the execution of a renamed ProcDump executable.
  This often done by attackers or malware in order to evade defensive mechanisms.
references:
- https://learn.microsoft.com/en-us/sysinternals/downloads/procdump
author: Florian Roth (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)
date: 2019-11-18
modified: 2024-06-25
tags:
- attack.defense-evasion
- attack.t1036.003
logsource:
  product: windows
  category: process_creation
detection:
  selection_ofn:
    OriginalFileName: 'procdump'
  selection_cli_dump_flag:
    CommandLine|contains|windash:
    - ' -ma '         # Full Dump
    - ' -mp '         # Mini Plus
  selection_cli_eula_flag:
        # Note: Even though the "accepteula" flag isn't required. We add it to avoid collision with similar utilities.
    CommandLine|contains|windash: ' /accepteula'
  filter_main_known_names:
    Image|endswith:
    - '\procdump.exe'
    - '\procdump64.exe'
  condition: (selection_ofn or all of selection_cli_*) and not 1 of filter_main_*
falsepositives:
- Procdump illegally bundled with legitimate software.
- Administrators who rename binaries (should be investigated).
level: high
notes: |
  ### Technical Context
  The "Renamed ProcDump Execution" Sigma rule is designed to identify instances where the popular Sysinternals tool, ProcDump, is executed under a different name. Attackers frequently rename executables like ProcDump to circumvent detection mechanisms in security solutions. This rule specifically looks for process creation events where the original filename corresponds to 'procdump', alongside command-line parameters indicative of dump operations (e.g., `-ma` for full memory dumps, `-mp` for mini plus dumps) or flags such as `/accepteula`. The primary data sources used for detection include process creation logs, which capture the executable name and command-line arguments utilized during execution. By flagging anomalies involving renamed instances of ProcDump, this rule aids incident responders in spotting potential malicious activities effectively.
  ### Investigation Steps
  - Check EDR logs for process creation events related to the renamed ProcDump executable, focusing on any suspicious command-line parameters used during execution.
  - Review the source and integrity of the renamed executables across the affected systems, verifying if they are part of a legitimate software suite or potentially malicious imports.
  - Analyze network traffic logs from the NDR tool to identify any suspicious outbound connections that might have been initiated concurrently with the execution of the renamed ProcDump.
  - Examine account activity logs to ascertain whether the execution occurred under unusual user accounts or during irregular timeframes, which may indicate unauthorized use.
