title: Potential SquiblyTwo Technique Execution
id: 8d63dadf-b91b-4187-87b6-34a1114577ea
status: test
description: Detects potential SquiblyTwo attack technique with possible renamed WMIC
  via Imphash and OriginalFileName fields
references:
- https://web.archive.org/web/20190209154607/https://subt0x11.blogspot.com/2018/04/wmicexe-whitelisting-bypass-hacking.html
- https://twitter.com/mattifestation/status/986280382042595328     # Deleted
- https://atomicredteam.io/defense-evasion/T1220/
- https://lolbas-project.github.io/lolbas/Binaries/Wmic/
author: Markus Neis, Florian Roth
date: 2019-01-16
modified: 2024-11-23
tags:
- attack.defense-evasion
- attack.t1047
- attack.t1220
- attack.execution
- attack.t1059.005
- attack.t1059.007
logsource:
  category: process_creation
  product: windows
detection:
  selection_pe:
  - Image|endswith: '\wmic.exe'
  - OriginalFileName: 'wmic.exe'
  - Hashes|contains:        # Sysmon field hashes contains all types
    - IMPHASH=1B1A3F43BF37B5BFE60751F2EE2F326E
    - IMPHASH=37777A96245A3C74EB217308F3546F4C
    - IMPHASH=9D87C9D67CE724033C0B40CC4CA1B206
  selection_cli:
    CommandLine|contains|all:
    - 'format:'
    - 'http'
  condition: all of selection_*
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  The detection rule titled "Potential SquiblyTwo Technique Execution" is designed to identify potential misuse of Windows Management Instrumentation Command-line (WMIC) utility, specifically when attackers use renamed copies of the tool for malicious purposes. The rule scrutinizes process creation logs, focusing on instances where the WMIC executable is invoked with specific characteristics. It looks for renamed WMIC executions by checking the `OriginalFileName` field and identifying distinct hash values that signify known malicious variants. Additionally, it searches for command-line parameters indicative of attacks, specifically those containing "format:" and "http", suggesting attempts to format drives or communicate with external servers. This multifaceted approach enables timely detection of possible SquiblyTwo techniques, which are often employed in obfuscation during execution.
  ### Investigation Steps
  - Utilize the EDR tool to review the process creation logs and filter for instances of WMIC that match the identified hashes and OriginalFileName criteria.
  - Examine command-line arguments associated with WMIC's execution to identify any suspicious parameters, particularly those containing "format:" or "http".
  - Cross-reference the detected processes with current whitelists to assess if the execution aligns with legitimate usage patterns of the WMIC utility.
  - Investigate network logs through the NDR or Proxy to determine if any connections were established to external URLs indicated in the command-line parameters, which may suggest data exfiltration or malicious command and control activities.
