title: Suspicious Userinit Child Process
id: b655a06a-31c0-477a-95c2-3726b83d649d
status: test
description: Detects a suspicious child process of userinit
references:
- https://twitter.com/SBousseaden/status/1139811587760562176
author: Florian Roth (Nextron Systems), Samir Bousseaden (idea)
date: 2019-06-17
modified: 2022-12-09
tags:
- attack.defense-evasion
- attack.t1055
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    ParentImage|endswith: '\userinit.exe'
  filter1:
    CommandLine|contains: '\netlogon\'
  filter2:
  - Image|endswith: '\explorer.exe'
  - OriginalFileName: 'explorer.exe'
  condition: selection and not 1 of filter*
fields:
- CommandLine
- ParentCommandLine
falsepositives:
- Administrative scripts
level: medium
notes: |
  ### Technical Context
  The "Suspicious Userinit Child Process" rule is designed to detect potentially malicious activity by monitoring for unusual child processes spawned from the `userinit.exe` process on Windows systems. This rule specifically looks for processes that have a command line containing `\netlogon\`, indicating unauthorized actions or configurations that could suggest a security compromise. The detection logic checks whether the parent process is `userinit.exe`, which is typically involved in user logon processes, while ensuring the spawned process is not just a legitimate instance of `explorer.exe`. 
  Data sources involved in this detection include process creation logs, which record when new processes are initiated, alongside command-line arguments that provide context on how these processes were started. By analyzing these data points, the rule helps identify potential defense evasion tactics employed by adversaries.
  ### Investigation Steps
  - Examine the EDR logs for the flagged process and review the parent and child process relationships to understand the context of the invocation. Look specifically for any anomalies or signs of malicious activity.
  - Review the command-line arguments captured for the identified suspicious process, focusing on `\netlogon\` paths which could indicate exploitation attempts.
  - Check historical logs in the SIEM for any previous instances of similar behavior to establish whether this is a repeat occurrence and assess the broader impact.
  - Analyze any associated network traffic using NDR tools to determine if there are any outbound connections that correlate with the timing of the detected suspicious process.
