title: Suspicious Service DACL Modification Via Set-Service Cmdlet
id: a95b9b42-1308-4735-a1af-abb1c5e6f5ac
related:
- id: 99cf1e02-00fb-4c0d-8375-563f978dfd37
  type: derived
status: test
description: Detects suspicious DACL modifications via the "Set-Service" cmdlet using
  the "SecurityDescriptorSddl" flag (Only available with PowerShell 7) that can be
  used to hide services or make them unstopable
references:
- https://www.sans.org/blog/red-team-tactics-hiding-windows-services/
- https://learn.microsoft.com/pt-br/windows/win32/secauthz/sid-strings
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-10-18
tags:
- attack.persistence
- attack.t1543.003
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: '\pwsh.exe'
  - OriginalFileName: 'pwsh.dll'
  selection_sddl_flag:
    CommandLine|contains:
    - '-SecurityDescriptorSddl '
    - '-sd '
  selection_set_service:
    CommandLine|contains|all:
    - 'Set-Service '
    - 'D;;'
    CommandLine|contains:
    - ';;;IU'
    - ';;;SU'
    - ';;;BA'
    - ';;;SY'
    - ';;;WD'
  condition: all of selection_*
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This Sigma rule detects potentially malicious activity involving the modification of service Access Control Lists (DACLs) using the PowerShell `Set-Service` cmdlet with the `-SecurityDescriptorSddl` flag. This flag is only available in PowerShell 7 and allows users to change security descriptors of Windows services, which could lead to unmanageable or hidden services. The rule looks for process creation logs specifically for PowerShell (indicated by `pwsh.exe`) and checks the supplied command line arguments for patterns that suggest attempts to alter DACL entries. By monitoring these patterns, the rule aims to identify unauthorized actions that can be used for persistence in a compromised environment.
  ### Investigation Steps
  - Review process creation logs in the EDR tool to identify instances of `pwsh.exe` running with command lines that include `Set-Service` and `-SecurityDescriptorSddl`, focusing on timestamps that align with the alerts. 
  - Check for related network traffic or connections using NDR solutions around the time the command was executed to discover potential lateral movement or remote command execution attempts.
  - Examine any recent changes to service statuses on affected systems through the system logs or API calls in cloud environments like Azure or AWS, verifying if the services have been made unmanageable or hidden.
  - Investigate user behavior associated with the commands by querying logs from the VPN, Proxy, or Active Directory to determine whether the account used had proper authorization and context for modifying service settings.
