title: RemoteFXvGPUDisablement Abuse Via AtomicTestHarnesses
id: a6fc3c46-23b8-4996-9ea2-573f4c4d88c5
related:
- id: f65e22f9-819e-4f96-9c7b-498364ae7a25     # PS Classic
  type: similar
- id: 38a7625e-b2cb-485d-b83d-aff137d859f4     # PS Module
  type: similar
- id: cacef8fc-9d3d-41f7-956d-455c6e881bc5     # PS ScriptBlock
  type: similar
status: test
description: Detects calls to the AtomicTestHarnesses "Invoke-ATHRemoteFXvGPUDisablementCommand"
  which is designed to abuse the "RemoteFXvGPUDisablement.exe" binary to run custom
  PowerShell code via module load-order hijacking.
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1218/T1218.md
- https://github.com/redcanaryco/AtomicTestHarnesses/blob/7e1e4da116801e3d6fcc6bedb207064577e40572/TestHarnesses/T1218_SignedBinaryProxyExecution/InvokeRemoteFXvGPUDisablementCommand.ps1
author: frack113
date: 2021-07-13
modified: 2023-05-09
tags:
- attack.defense-evasion
- attack.t1218
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    CommandLine|contains:
    - 'Invoke-ATHRemoteFXvGPUDisablementCommand'
    - 'Invoke-ATHRemoteFXvGPUDisableme'
  condition: selection
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  The Sigma rule "RemoteFXvGPUDisablement Abuse Via AtomicTestHarnesses" is designed to detect malicious attempts to abuse the `RemoteFXvGPUDisablement.exe` binary through specific PowerShell commands. It specifically looks for calls to the `Invoke-ATHRemoteFXvGPUDisablementCommand`, which is part of the Atomic Test Harnesses framework. This technique exploits module load-order hijacking to run unauthorized scripts, circumventing standard security measures. By capturing process creation logs, particularly the command-line parameters, the rule identifies instances where adversaries may leverage this method for defense evasion and malicious PowerShell execution.
  ### Investigation Steps
  - Utilize EDR tools to review process creation logs and identify instances of `RemoteFXvGPUDisablement.exe` being executed, paying attention to the command-line parameters.
  - Check for any abnormal PowerShell activity surrounding the detected command; use PowerShell logs to trace any preceding or succeeding commands.
  - Investigate the presence of the Atomic Test Harnesses package in the environment to determine whether it has been installed or manipulated.
  - Examine user account activity in conjunction with VPN or cloud identity services to validate whether the commands originated from legitimate user actions or compromised accounts.
