title: Remote File Download Via Findstr.EXE
id: 587254ee-a24b-4335-b3cd-065c0f1f4baa
related:
- id: bf6c39fc-e203-45b9-9538-05397c1b4f3f
  type: obsolete
status: test
description: |
  Detects execution of "findstr" with specific flags and a remote share path. This specific set of CLI flags would allow "findstr" to download the content of the file located on the remote share as described in the LOLBAS entry.
references:
- https://lolbas-project.github.io/lolbas/Binaries/Findstr/
- https://oddvar.moe/2018/04/11/putting-data-in-alternate-data-streams-and-how-to-execute-it-part-2/
- https://gist.github.com/api0cradle/cdd2d0d0ec9abb686f0e89306e277b8f
author: Furkan CALISKAN, @caliskanfurkan_, @oscd_initiative, Nasreddine Bencherchali
  (Nextron Systems)
date: 2020-10-05
modified: 2024-03-05
tags:
- attack.defense-evasion
- attack.t1218
- attack.t1564.004
- attack.t1552.001
- attack.t1105
logsource:
  category: process_creation
  product: windows
detection:
  selection_findstr:
  - CommandLine|contains: findstr
  - Image|endswith: 'findstr.exe'
  - OriginalFileName: 'FINDSTR.EXE'
  selection_cli_download_1:
    CommandLine|contains|windash: ' -v '
  selection_cli_download_2:
    CommandLine|contains|windash: ' -l '
  selection_cli_download_3:
    CommandLine|contains: '\\\\'
  condition: selection_findstr and all of selection_cli_download_*
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  This Sigma rule is designed to detect suspicious use of the Windows command-line utility `findstr.exe`, particularly when it is employed to download files from remote shares. The rule specifically identifies command line executions that include the usage of `findstr` in conjunction with specific flags (`-v` and `-l`), which may indicate an intent to read or manipulate data from a remote location. The presence of a UNC path (`\\`) as part of the command line is a critical component, as it represents an attempt to access shared files on a network, which can be often exploited by threat actors to exfiltrate data or load malicious files. Data sources involved in this detection include process creation logs, analyzing command-line parameters, and confirming the original file name to be 'FINDSTR.EXE'. 
  ### Investigation Steps
  - Review the process creation logs in the EDR for instances of `findstr.exe` execution, particularly noting the exact command line used to identify potentially malicious parameters.
  - Query the SIEM for any alerts that correlate with network shares accessed during the times of the detected `findstr` executions, providing insights into the remote files involved.
  - Cross-reference the activity with any recent changes noted in AV logs that could suggest malicious files being downloaded or accessed via the remote path.
  - Inspect proxy logs for any unusual outbound traffic that coincides with the detected command execution, as this could indicate data exfiltration attempts.
