title: Suspicious WebDav Client Execution Via Rundll32.EXE
id: 982e9f2d-1a85-4d5b-aea4-31f5e97c6555
status: test
description: |
  Detects "svchost.exe" spawning "rundll32.exe" with command arguments like C:\windows\system32\davclnt.dll,DavSetCookie. This could be an indicator of exfiltration or use of WebDav to launch code (hosted on WebDav Server) or potentially a sign of exploitation of CVE-2023-23397
references:
- https://twitter.com/aceresponder/status/1636116096506818562
- https://www.mdsec.co.uk/2023/03/exploiting-cve-2023-23397-microsoft-outlook-elevation-of-privilege-vulnerability/
- https://www.pwndefend.com/2023/03/15/the-long-game-persistent-hash-theft/
- https://www.microsoft.com/en-us/security/blog/wp-content/uploads/2023/03/Figure-7-sample-webdav-process-create-event.png
- https://www.microsoft.com/en-us/security/blog/2023/03/24/guidance-for-investigating-attacks-using-cve-2023-23397/
author: Nasreddine Bencherchali (Nextron Systems), Florian Roth (Nextron Systems)
date: 2023-03-16
modified: 2023-09-18
tags:
- attack.exfiltration
- attack.t1048.003
- cve.2023-23397
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    ParentImage|endswith: '\svchost.exe'
    ParentCommandLine|contains: '-s WebClient'
    Image|endswith: '\rundll32.exe'
    CommandLine|contains: 'C:\windows\system32\davclnt.dll,DavSetCookie'
    CommandLine|re: '://\d{1,3}\.\d{1,3}\.\d{1,3}\.\d{1,3}'
  filter_local_ips:
    CommandLine|contains:
    - '://10.'         # 10.0.0.0/8
    - '://192.168.'         # 192.168.0.0/16
    - '://172.16.'         # 172.16.0.0/12
    - '://172.17.'
    - '://172.18.'
    - '://172.19.'
    - '://172.20.'
    - '://172.21.'
    - '://172.22.'
    - '://172.23.'
    - '://172.24.'
    - '://172.25.'
    - '://172.26.'
    - '://172.27.'
    - '://172.28.'
    - '://172.29.'
    - '://172.30.'
    - '://172.31.'
    - '://127.'         # 127.0.0.0/8
    - '://169.254.'         # 169.254.0.0/16
  condition: selection and not 1 of filter_*
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This detection rule identifies potentially malicious activity involving `rundll32.exe` executed by `svchost.exe`, a common Windows system process. The rule specifically looks for scenarios where `rundll32.exe` is called with command-line arguments that indicate the loading of `davclnt.dll`, coupled with attempts to set device cookies via `DavSetCookie`. Such behavior is commonly associated with exfiltration tactics or exploitation of vulnerabilities—specifically the CVE-2023-23397, which affects Microsoft Outlook. The rule utilizes process creation logs, focusing on the command-line parameters of the invoked processes to filter out legitimate local traffic and highlight suspicious external connections.
  ### Investigation Steps
  - Review the alerts in the EDR console to identify the specific instance of `svchost.exe` invoking `rundll32.exe` and check for the full command-line arguments used.
  - Investigate the parent-child relationship in the process tree to understand the context of the execution, ensuring no legitimate applications were misidentified.
  - Analyze network connections logged by the NGFW or NDR for any unusual outbound traffic patterns that accompany the alert, focusing on external IP addresses.
  - Check cloud logs for any related activities or failed authentication attempts around the same timestamp, particularly on services that may have interacted with WebDav functionalities.
