title: Potential Reconnaissance For Cached Credentials Via Cmdkey.EXE
id: 07f8bdc2-c9b3-472a-9817-5a670b872f53
status: test
description: Detects usage of cmdkey to look for cached credentials on the system
references:
- https://www.peew.pw/blog/2017/11/26/exploring-cmdkey-an-edge-case-for-privilege-escalation
- https://technet.microsoft.com/en-us/library/cc754243(v=ws.11).aspx
- https://github.com/redcanaryco/atomic-red-team/blob/b27a3cb25025161d49ac861cb216db68c46a3537/atomics/T1003.005/T1003.005.md#atomic-test-1---cached-credential-dump-via-cmdkey
author: jmallette, Florian Roth (Nextron Systems), Nasreddine Bencherchali (Nextron
  Systems)
date: 2019-01-16
modified: 2024-03-05
tags:
- attack.credential-access
- attack.t1003.005
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: '\cmdkey.exe'
  - OriginalFileName: 'cmdkey.exe'
  selection_cli:
    CommandLine|contains|windash: ' -l'
  condition: all of selection*
fields:
- CommandLine
- ParentCommandLine
- User
falsepositives:
- Legitimate administrative tasks
level: high
notes: |
  ### Technical Context
  This Sigma rule is designed to detect potential reconnaissance activities involving cached credentials via the `cmdkey.exe` utility on Windows systems. The rule specifically focuses on instances where `cmdkey.exe` is executed, as this program can be used to view and manage stored credentials. It looks for two key indicators: the execution of `cmdkey.exe` with command-line arguments that include `-l`, which is the flag used to list cached credentials, and the presence of the `cmdkey.exe` process itself. By analyzing process creation logs, which capture details like the command line executed, the parent process, and the user account under which the command was run, SOC analysts can identify instances where this potentially malicious activity occurs.
  The technical data sources involved are primarily Windows process creation logs. These logs not only provide information on the command executed but also context around the user and the parent process that spawned the command, helping analysts determine whether the activity is suspicious or part of legitimate administrative tasks.
  ### Investigation Steps
  - Use EDR tools to search for instances of `cmdkey.exe` execution, specifically looking for command lines that include the `-l` argument to identify users attempting to list cached credentials.
  - Review the associated parent process in the EDR data to understand the context of the command execution, determining if it was initiated by a legitimate administrative tool or another application.
  - Cross-reference the user accounts running the command with known administrative roles to assess whether the command execution is part of regular, authorized activity.
  - Check surrounding logs in SIEM or cloud platforms for unusual access patterns or other suspicious activity that may correlate with the use of `cmdkey.exe` to provide further context for the investigation.
