title: IE ZoneMap Setting Downgraded To MyComputer Zone For HTTP Protocols Via CLI
id: 10344bb3-7f65-46c2-b915-2d00d47be5b0
related:
- id: 3fd4c8d7-8362-4557-a8e6-83b29cc0d724
  type: similar
status: test
description: |
  Detects changes to Internet Explorer's (IE / Windows Internet properties) ZoneMap configuration of the "HTTP" and "HTTPS" protocols to point to the "My Computer" zone. This allows downloaded files from the Internet to be granted the same level of trust as files stored locally.
references:
- https://twitter.com/M_haggis/status/1699056847154725107
- https://twitter.com/JAMESWT_MHT/status/1699042827261391247
- https://learn.microsoft.com/en-us/troubleshoot/developer/browsers/security-privacy/ie-security-zones-registry-entries
- https://www.virustotal.com/gui/file/339ff720c74dc44265b917b6d3e3ba0411d61f3cd3c328e9a2bae81592c8a6e5/content
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023-09-05
tags:
- attack.execution
- attack.defense-evasion
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|contains|all:
    - '\Microsoft\Windows\CurrentVersion\Internet Settings\ZoneMap\ProtocolDefaults'
    - 'http'
    - ' 0'
  condition: selection
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This Sigma rule is designed to detect a specific alteration in Internet Explorer's security configuration regarding the ZoneMap settings for HTTP and HTTPS protocols. By downgrading the ZoneMap configuration to point these protocols to the "My Computer" zone, an attacker could potentially allow files downloaded from the internet to be treated with the same level of trust as local files. This configuration change can represent a significant risk as it may expose systems to various attacks such as malware downloads, file-less attacks, and more. The rule focuses on process creation logs, specifically looking for command-line entries that indicate changes made to the registry path responsible for ZoneMap settings. Monitoring these logs helps identify unauthorized modifications that could compromise user security.
  ### Investigation Steps
  - Review the EDR logs for the device that triggered the alert to identify the user account that executed the command and the specific process involved.
  - Cross-reference the command line parameters detailed in the alert with known legitimate administrative actions to assess if the activity appears suspicious or anomalous.
  - Analyze network traffic logs via NDR or Proxy to check for any suspicious HTTP/S requests originating from the affected system around the time of the rule trigger.
  - Investigate the system’s event logs for any other security events or indicators of compromise that occurred in proximity to the suspicious ZoneMap modification.
