title: HackTool - ADCSPwn Execution
id: cd8c163e-a19b-402e-bdd5-419ff5859f12
status: test
description: Detects command line parameters used by ADCSPwn, a tool to escalate privileges
  in an active directory network by coercing authenticate from machine accounts and
  relaying to the certificate service
references:
- https://github.com/bats3c/ADCSPwn
author: Florian Roth (Nextron Systems)
date: 2021-07-31
modified: 2023-02-04
tags:
- attack.credential-access
- attack.t1557.001
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|contains|all:
    - ' --adcs '
    - ' --port '
  condition: selection
falsepositives:
- Unlikely
level: high
notes: |
  ### Technical Context
  This detection rule is designed to identify the execution of the ADCSPwn tool, which is used for privilege escalation in Active Directory environments. The rule looks for specific command-line parameters (`--adcs` and `--port`) that are characteristic of ADCSPwn's operation, indicating that it may be attempting to coerce authentication from machine accounts and relay this information to a certificate service. The primary data source involved is process creation logs from Windows, which capture command-line execution details. By monitoring these logs, security teams can highlight potentially malicious use of this tool, allowing for timely investigations into any unauthorized privilege escalation attempts.
  ### Investigation Steps
  - Examine the EDR solution to identify the process creation logs related to the detected command-line parameters. Look for any recent instances of `ADCSPwn` execution on the network.
  - Correlate alerts from the SIEM with user authentication logs to assess whether the tool was launched by an authorized user or an unexpected account. This may help determine the intent behind the execution.
  - Review network traffic patterns using the NDR tool to observe any unusual communication attempts to certificate services or external ports that align with `ADCSPwn` activity.
  - Investigate the presence of any newly created accounts or modifications to privileges in Active Directory through the relevant cloud platform logs, as these could indicate attempts to exploit as indicated by the detection.
