title: Remote Access Tool - NetSupport Execution From Unusual Location
id: 37e8d358-6408-4853-82f4-98333fca7014
status: test
description: Detects execution of client32.exe (NetSupport RAT) from an unusual location
  (outside of 'C:\Program Files')
references:
- https://redcanary.com/blog/misbehaving-rats/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-09-19
modified: 2024-11-23
tags:
- attack.defense-evasion
logsource:
  category: process_creation
  product: windows
detection:
  selection:
  - Image|endswith: '\client32.exe'
  - Product|contains: 'NetSupport Remote Control'
  - OriginalFileName|contains: 'client32.exe'
  - Hashes|contains: IMPHASH=a9d50692e95b79723f3e76fcf70d023e
  filter:
    Image|startswith:
    - 'C:\Program Files\'
    - 'C:\Program Files (x86)\'
  condition: selection and not filter
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  This detection rule identifies the execution of the NetSupport Remote Access Tool (RAT), specifically the `client32.exe` executable, from locations that are considered unusual, specifically those outside of standard program installation directories like `C:\Program Files` or `C:\Program Files (x86)`. The rule utilizes process creation logs to look for specific characteristics associated with `client32.exe`, such as the product name, original file name, and a known hash value. By filtering for execution locations, the rule aims to reduce false positives, ultimately raising an alert only when the executable is launched from an unexpected path. This approach helps to identify potentially malicious use of legitimate remote access tools that could be leveraged by threat actors.
  ### Investigation Steps
  - Review the process creation logs in your EDR to confirm the execution of `client32.exe` and gather details about the user and device involved.
  - Cross-reference the execution metadata against your AV logs to check for any detections or alerts related to the NetSupport RAT.
  - Inspect any associated network traffic with your NDR solution to determine if there are unusual outbound connections that correspond with the execution of the tool.
  - Analyze relevant proxy logs to trace any web activity or downloads that could relate to the suspicious use of `client32.exe`, especially from unusual or untrusted sources.
