title: Computer Password Change Via Ksetup.EXE
id: de16d92c-c446-4d53-8938-10aeef41c8b6
status: test
description: Detects password change for the computer's domain account or host principal
  via "ksetup.exe"
references:
- https://twitter.com/Oddvarmoe/status/1641712700605513729
- https://learn.microsoft.com/en-gb/windows-server/administration/windows-commands/ksetup
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023-04-06
tags:
- attack.execution
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: '\ksetup.exe'
  - OriginalFileName: 'ksetup.exe'
  selection_cli:
    CommandLine|contains: ' /setcomputerpassword '
  condition: all of selection_*
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  This detection rule focuses on identifying unauthorized changes to the password of a computer's domain account or host principal through the use of `ksetup.exe`, a legitimate Windows command-line tool. The rule captures process creation events where `ksetup.exe` is executed, specifically looking for the presence of the command line parameter `/setcomputerpassword`. By analyzing process creation logs and the originating command lines, analysts can detect possible misuse of this utility, which may indicate an attempt by an attacker to hijack or compromise domain credentials. The rule is applicable within Windows environments, taking advantage of the level of detail provided by process execution logs.
  ### Investigation Steps
  - Review EDR logs for the execution of `ksetup.exe`, noting the time and user context of the event.
  - Analyze the command line arguments associated with the `ksetup.exe` execution to verify if `/setcomputerpassword` was used and identify any unusual patterns or artifacts.
  - Examine associated user accounts and access logs to determine if any unauthorized changes to domain credentials were made following the detected execution.
  - Monitor network traffic and proxy logs for any suspicious outbound connections initiated shortly after the execution of `ksetup.exe`, which could indicate further malicious activity.
