title: Suspicious Eventlog Clearing or Configuration Change Activity
id: cc36992a-4671-4f21-a91d-6c2b72a2edf5
status: stable
description: |
  Detects the clearing or configuration tampering of EventLog using utilities such as "wevtutil", "powershell" and "wmic".
  This technique were seen used by threat actors and ransomware strains in order to evade defenses.
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1070.001/T1070.001.md
- https://eqllib.readthedocs.io/en/latest/analytics/5b223758-07d6-4100-9e11-238cfdd0fe97.html
- https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/wevtutil
- https://gist.github.com/fovtran/ac0624983c7722e80a8f5a4babb170ee
- https://jdhnet.wordpress.com/2017/12/19/changing-the-location-of-the-windows-event-logs/
author: Ecco, Daniil Yugoslavskiy, oscd.community, D3F7A5105
date: 2019-09-26
modified: 2023-07-13
tags:
- attack.defense-evasion
- attack.t1070.001
- attack.t1562.002
- car.2016-04-002
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
    - 'clear-log '                  # clears specified log
    - ' cl '                        # short version of 'clear-log'
    - 'set-log '                    # modifies config of specified log. could be uset to set it to a tiny size
    - ' sl '                        # short version of 'set-log'
    - 'lfn:'                        # change log file location and name
  selection_other_ps:
    Image|endswith:
    - '\powershell.exe'
    - '\pwsh.exe'
    CommandLine|contains:
    - 'Clear-EventLog '
    - 'Remove-EventLog '
    - 'Limit-EventLog '
    - 'Clear-WinEvent '
  selection_other_wmi:
    Image|endswith:
    - '\powershell.exe'
    - '\pwsh.exe'
    - '\wmic.exe'
    CommandLine|contains: 'ClearEventLog'
  filter_msiexec:
        # Example seen during office update/installation:
        #   ParentImage: C:\Windows\SysWOW64\msiexec.exe
        #   CommandLine: "C:\WINDOWS\system32\wevtutil.exe" sl Microsoft-RMS-MSIPC/Debug /q:true /e:true /l:4 /rt:false
    ParentImage:
    - 'C:\Windows\SysWOW64\msiexec.exe'
    - 'C:\Windows\System32\msiexec.exe'
    CommandLine|contains: ' sl '
  condition: 1 of selection_* and not 1 of filter_*
falsepositives:
- Admin activity
- Scripts and administrative tools used in the monitored environment
- Maintenance activity
level: high
notes: |
  n
  ### Technical Context
  This detection rule identifies potential malicious activity related to the clearing or modification of Windows Event Logs. Threat actors often utilize commands issued through tools like `wevtutil`, `PowerShell`, and `WMIC` to erase or alter log entries, thereby evading detection mechanisms that rely on these logs for incident response and threat detection. The rule monitors for specific command-line arguments associated with log clearing and configuration changes, capturing instances where logs may be redirected or reconfigured to limit their retention or visibility. This behavior falls under the MITRE ATT&CK tactics of **Defense Evasion** (T1070.001 
  - Indicator Removal on Host; T1562.002 
  - Impair Defenses), highlighting the importance of vigilance against such tactics in an enterprise environment.
  ### Investigation Steps
  - **Check Process Creation Logs:** Review process creation logs in Windows Event Logs (especially Sysmon) to identify the context and execution details of the `wevtutil`, `powershell`, or `wmic` commands associated with the alert.
  - **Examine Command-Line Arguments:** Analyze the command-line parameters included in the alerts to understand the specific log manipulation actions attempted and assess any associated parent processes for malicious behavior.
  - **Validate with EDR and AV Tools:** Utilize the EDR solution to further investigate the timestamps and execution paths of the involved processes, especially looking for any indicators of compromise (IoCs) or anomalies linked to the alert.
  - **Analyze Network Activity:** Inspect necessary network traffic records via the NDR or NGFW to determine if there were any outgoing connections corresponding with the time of the potentially malicious event log modifications, which could indicate exfiltration attempts or command-and-control callbacks.
  ### Prioritization
  The severity level for this alert is high due to the critical role of Event Logs in tracking system activity and potential malicious actions; any unauthorized clearing or alteration of these logs can severely hinder incident detection and response efforts in an enterprise environment.
  ### Blind Spots and Assumptions
  This rule assumes that the telemetry sources are properly configured and that logging is enabled at a sufficient level to capture the necessary events. It may not fire if an adversary utilizes legitimate administrative tools for task automation or if an anomaly detection system is inadvertently set to ignore scripted administrative activity. Additionally, if any malicious command executions are wrapped within an authorized application, this rule could fail to detect the illicit actions.
  > **Disclaimer:** This investigation guide was created using generative AI technology and has not been reviewed for its accuracy and relevance. While every effort has been made to ensure its quality, we recommend validating the content and adapting it to suit specific environment and operational needs. Please communicate any changes to the detection engineering team.
