title: Suspicious Mstsc.EXE Execution With Local RDP File
id: 6e22722b-dfb1-4508-a911-49ac840b40f8
status: test
description: Detects potential RDP connection via Mstsc using a local ".rdp" file
  located in suspicious locations.
references:
- https://www.blackhillsinfosec.com/rogue-rdp-revisiting-initial-access-methods/
- https://web.archive.org/web/20230726144748/https://blog.thickmints.dev/mintsights/detecting-rogue-rdp/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023-04-18
tags:
- attack.command-and-control
- attack.t1219
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: '\mstsc.exe'
  - OriginalFileName: 'mstsc.exe'
  selection_extension:
    CommandLine|endswith:
    - '.rdp'
    - '.rdp"'
  selection_paths:
        # Note: This list of paths is better transformed into a whitelist where you only exclude legitimate locations you use in your env
    CommandLine|contains:
    - ':\Users\Public\'
    - ':\Windows\System32\spool\drivers\color'
    - ':\Windows\System32\Tasks_Migrated '
    - ':\Windows\Tasks\'
    - ':\Windows\Temp\'
    - ':\Windows\Tracing\'
    - '\AppData\Local\Temp\'
            # - '\Desktop\' # Could be source of FP depending on the environment
    - '\Downloads\'         # Could be source of FP depending on the environment
  condition: all of selection_*
falsepositives:
- Likelihood is related to how often the paths are used in the environment
level: high
notes: |
  ### Technical Context
  This detection rule is designed to identify potentially malicious use of the Windows Remote Desktop Connection client (Mstsc.exe) with local Remote Desktop Protocol (.rdp) files located in suspicious directories. The rule works by analyzing process creation logs to focus on instances where Mstsc.exe is executed with command-line parameters indicating the use of a local .rdp file, particularly if those files originate from unusual or risky locations, such as the public user directory or system temporary directories. By flagging these instances, the rule aims to detect scenarios that could suggest unauthorized access or lateral movement attempts within the network, which are common tactics employed by attackers to gain or maintain access to compromised systems.
  The technical data sources involved include process creation logs, which capture execution details of Mstsc.exe, and command-line parameters that indicate the presence and path of .rdp files. The effective implementation of this rule relies on accurate detection parameters and a contextual understanding of the environment to minimize false positives, particularly due to benign uses of Mstsc.exe in common user workflows.
  ### Investigation Steps
  - Review the context around the alert using EDR tools to gather details about the process creation event, including the user identity and the execution time.
  - Check the command-line parameters associated with Mstsc.exe in the logs to verify the exact path of the .rdp file and assess whether it comes from a legitimate directory.
  - Investigate any network activity surrounding the time of the alert using NDR or firewall logs to determine if there were any unusual connections to remote systems post-execution.
  - If deemed suspicious, analyze the contents of the .rdp file to uncover any potentially harmful settings or configurations that could indicate an attempt to connect to unauthorized systems.
