title: Schedule Task Creation From Env Variable Or Potentially Suspicious Path Via
  Schtasks.EXE
id: 81325ce1-be01-4250-944f-b4789644556f
related:
- id: 43f487f0-755f-4c2a-bce7-d6d2eec2fcf8     # TODO: Recreate after baseline
  type: derived
status: test
description: Detects Schtask creations that point to a suspicious folder or an environment
  variable often used by malware
references:
- https://www.welivesecurity.com/2022/01/18/donot-go-do-not-respawn/
- https://www.joesandbox.com/analysis/514608/0/html#324415FF7D8324231381BAD48A052F85DF04
- https://blog.talosintelligence.com/gophish-powerrat-dcrat/
author: Florian Roth (Nextron Systems)
date: 2022-02-21
modified: 2024-10-28
tags:
- attack.execution
- attack.t1053.005
logsource:
  product: windows
  category: process_creation
detection:
  selection_1_create:
    Image|endswith: '\schtasks.exe'
    CommandLine|contains: ' /create '
  selection_1_all_folders:
    CommandLine|contains:
    - ':\Perflogs'
    - ':\Users\All Users\'
    - ':\Users\Default\'
    - ':\Users\Public'
    - ':\Windows\Temp'
    - '\AppData\Local\'
    - '\AppData\Roaming\'
    - '%AppData%'
    - '%Public%'
  selection_2_parent:
    ParentCommandLine|endswith: '\svchost.exe -k netsvcs -p -s Schedule'
  selection_2_some_folders:
    CommandLine|contains:
    - ':\Perflogs'
    - ':\Windows\Temp'
    - '\Users\Public'
    - '%Public%'
  filter_optional_other:
  - ParentCommandLine|contains: 'unattended.ini'
  - CommandLine|contains: 'update_task.xml'
  filter_optional_team_viewer:
    CommandLine|contains: '/Create /TN TVInstallRestore /TR'
  filter_optional_avira_install:
        # Comment out this filter if you dont use AVIRA
    CommandLine|contains|all:
    - '/Create /Xml "C:\Users\'
    - '\AppData\Local\Temp\.CR.'
    - 'Avira_Security_Installation.xml'
  filter_optional_avira_other:
        # Comment out this filter if you dont use AVIRA
    CommandLine|contains|all:
    - '/Create /F /TN'
    - '/Xml '
    - '\AppData\Local\Temp\is-'
    - 'Avira_'
    CommandLine|contains:
    - '.tmp\UpdateFallbackTask.xml'
    - '.tmp\WatchdogServiceControlManagerTimeout.xml'
    - '.tmp\SystrayAutostart.xml'
    - '.tmp\MaintenanceTask.xml'
  filter_optional_klite_codec:
    CommandLine|contains|all:
    - '\AppData\Local\Temp\'
    - '/Create /TN "klcp_update" /XML '
    - '\klcp_update_task.xml'
  condition: ( all of selection_1_* or all of selection_2_* ) and not 1 of filter_optional_*
falsepositives:
- Benign scheduled tasks creations or executions that happen often during software
  installations
- Software that uses the AppData folder and scheduled tasks to update the software
  in the AppData folders
level: medium
notes: |
  ### Technical Context
  This Sigma rule is designed to detect the creation of scheduled tasks via the `schtasks.exe` utility, particularly when they reference suspicious paths or environment variables that are commonly exploited by malware. The rule identifies instances where the command line contains specific keywords indicating that a task is being created (e.g., ` /create `) and checks the paths it points to for signs of potential misuse. The primary data sources involved in this detection include process creation logs that provide visibility into command-line parameters and parent processes. Specifically, the rule looks for tasks that may be generated from suspicious directories such as temporary files, public user folders, or specific environment variables that are often targeted by malicious actors.
  The rule incorporates filters to exclude known benign tasks that may arise during legitimate software installations, such as those involving `unattended.ini` or `update_task.xml` files. This approach helps minimize false positives, making the detection relevant for security operations teams tasked with identifying potentially harmful activity in the Windows environment.
  ### Investigation Steps
  - Verify the context of the alert by reviewing the relevant process creation logs in the EDR for the `schtasks.exe` execution, noting the command line details and timestamps.
  - Examine the details of the parent process (`svchost.exe`) to assess if it has been invoked in a typical or atypical manner, indicating possible compromise.
  - Analyze system logs to cross-reference the creation of the scheduled task with any known software installations or updates in your environment that may explain the activity.
  - Conduct a threat intelligence lookup on any specific environment variables or paths found in the suspicious command line to identify known malicious uses and associated behaviors.
