title: Weak or Abused Passwords In CLI
id: 91edcfb1-2529-4ac2-9ecc-7617f895c7e4
status: test
description: |
  Detects weak passwords or often abused passwords (seen used by threat actors) via the CLI.
  An example would be a threat actor creating a new user via the net command and providing the password inline
references:
- https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/espionage-asia-governments
- https://thedfirreport.com/2022/09/26/bumblebee-round-two/
- https://www.microsoft.com/en-us/security/blog/2022/10/25/dev-0832-vice-society-opportunistic-ransomware-campaigns-impacting-us-education-sector/
- https://www.huntress.com/blog/slashandgrab-screen-connect-post-exploitation-in-the-wild-cve-2024-1709-cve-2024-1708
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-09-14
modified: 2024-02-23
tags:
- attack.defense-evasion
- attack.execution
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|contains:
            # Add more passwords
    - '123456789'
    - '123123qwE'
    - 'Asd123.aaaa'
    - 'Decryptme'
    - 'P@ssw0rd!'
    - 'Pass8080'
    - 'password123'         # Also covers PASSWORD123123! as seen in https://www.microsoft.com/en-us/security/blog/2022/10/25/dev-0832-vice-society-opportunistic-ransomware-campaigns-impacting-us-education-sector/
    - 'test@202'         # Covers multiple years
  condition: selection
falsepositives:
- Legitimate usage of the passwords by users via commandline (should be discouraged)
- Other currently unknown false positives
level: medium
notes: |
  ### Technical Context
  The "Weak or Abused Passwords In CLI" detection rule identifies the use of weak or commonly abused passwords within command-line interfaces (CLI) on Windows systems. Threat actors often create new user accounts or conduct unauthorized activities using known weak passwords, which can pose significant security risks. This rule specifically monitors for the presence of particular password strings in the CommandLine field of process creation events. The primary data sources involved in this detection include Windows process creation logs, which capture details about commands executed in the CLI. When a process is initiated with a command containing any of the specified weak password strings, the detection rule triggers an alert. This aligns with the MITRE ATT&CK framework under the tactics of **Defense Evasion** (T1564) and **Execution** (T1203).
  ### Investigation Steps
  - **Check EDR for Historical Activity**: Investigate the endpoint's EDR logs to identify the process responsible for the command-line execution, along with the user account that initiated it.
  - **Review User and Group Management**: Utilize Windows Security logs to review the user management actions performed, especially focusing on new user creation or privilege modification related to the alert.
  - **Perform a Network Analysis**: Examine outbound network connections during the time of the alert using NDR or firewall logs to determine if there were any suspicious activities post-execution of the detected command.
  - **Analyze Account Behavior**: Investigate the account associated with the command execution for any unusual behavior in the logs, such as abnormal logins or access patterns to determine if the account may have been compromised.
  ### Prioritization
  This alert is categorized as medium severity due to the potential risk of unauthorized access or misuse of accounts using weak passwords, which can lead to lateral movement within the network and other malicious activities.
  ### Blind Spots and Assumptions
  This detection rule may not fire if adversaries employ techniques to obfuscate command-line input, such as encoding or manipulating the command execution with legitimate tools. Additionally, false positives may occur when authorized users rely on these weak passwords for command-line operations, which, although discouraged, can still happen in an enterprise environment. Engineers should be aware that thorough user training and password policies may reduce the likelihood of legitimate use of weak passwords but cannot eliminate it completely.
  > **Disclaimer:** This investigation guide was created using generative AI technology and has not been reviewed for its accuracy and relevance. While every effort has been made to ensure its quality, we recommend validating the content and adapting it to suit specific environment and operational needs. Please communicate any changes to the detection engineering team.
