title: Potentially Suspicious Rundll32.EXE Execution of UDL File
id: 0ea52357-cd59-4340-9981-c46c7e900428
status: experimental
description: |
  Detects the execution of rundll32.exe with the oledb32.dll library to open a UDL file.
  Threat actors can abuse this technique as a phishing vector to capture authentication credentials or other sensitive data.
references:
- https://trustedsec.com/blog/oops-i-udld-it-again
author: '@kostastsale'
date: 2024-08-16
tags:
- attack.execution
- attack.t1218.011
- attack.t1071
logsource:
  category: process_creation
  product: windows
detection:
  selection_parent:
    ParentImage|endswith: '\explorer.exe'
  selection_img:
  - Image|endswith: '\rundll32.exe'
  - OriginalFileName: 'RUNDLL32.EXE'
  selection_cli:
    CommandLine|contains|all:
    - 'oledb32.dll'
    - ',OpenDSLFile '
    - '\\Users\\*\\Downloads\\'         # Note: You can adjust the path to the download directory or other directories according to your environment.
    CommandLine|endswith: '.udl'
  condition: all of selection_*
falsepositives:
- UDL files serve as a convenient and flexible tool for managing and testing database
  connections in various development and administrative scenarios.
level: medium
notes: |
  ### Technical Context
  This detection rule identifies potentially malicious execution of the `rundll32.exe` process with the `oledb32.dll` library to open Universal Data Link (UDL) files. Often employed by threat actors as a phishing method, this technique can enable the capture of sensitive credentials and data. The rule specifically looks for instances where `rundll32.exe` is initiated by the `explorer.exe` process and attempts to command the loading of `oledb32.dll` with parameters that indicate a file located in a user’s Downloads directory ending with the `.udl` extension. By monitoring the command line syntax for such executions, this rule aims to flag potentially unauthorized access attempts that leverage benign-looking file types for malicious intent.
  ### Investigation Steps
  - Review EDR logs to trace the execution path of `rundll32.exe` and check for any related processes that were spawned from `explorer.exe`.
  - Use the SIEM to examine alerts for additional context surrounding the execution, such as user accounts involved and the timeline of events leading to the execution.
  - Query proxy logs to identify any outgoing network connections initiated by the process, which may reveal data exfiltration attempts related to the UDL exploitation.
  - Analyze the content of the detected UDL file to determine whether it contains suspicious elements or links that could compromise sensitive information or systems.
