title: Renamed AutoIt Execution
id: f4264e47-f522-4c38-a420-04525d5b880f
status: test
description: |
  Detects the execution of a renamed AutoIt2.exe or AutoIt3.exe.
  AutoIt is a scripting language and automation tool for Windows systems. While primarily used for legitimate automation tasks, it can be misused in cyber attacks.
  Attackers can leverage AutoIt to create and distribute malware, including keyloggers, spyware, and botnets. A renamed AutoIt executable is particularly suspicious.
references:
- https://twitter.com/malmoeb/status/1665463817130725378?s=12&t=C0_T_re0wRP_NfKa27Xw9w
- https://www.autoitscript.com/site/
author: Florian Roth (Nextron Systems)
date: 2023-06-04
modified: 2024-11-23
tags:
- attack.defense-evasion
- attack.t1027
logsource:
  category: process_creation
  product: windows
detection:
  selection_1:
    CommandLine|contains:
    - ' /AutoIt3ExecuteScript'
    - ' /ErrorStdOut'
  selection_2:
    Hashes|contains:
    - 'IMPHASH=FDC554B3A8683918D731685855683DDF'          # AutoIt v2 - doesn't cover all binaries
    - 'IMPHASH=CD30A61B60B3D60CECDB034C8C83C290'          # AutoIt v2 - doesn't cover all binaries
    - 'IMPHASH=F8A00C72F2D667D2EDBB234D0C0AE000'          # AutoIt v3 - doesn't cover all binaries
  selection_3:
    OriginalFileName:
    - 'AutoIt3.exe'
    - 'AutoIt2.exe'
    - 'AutoIt.exe'
  filter_main_legit_name:
    Image|endswith:
    - '\AutoIt.exe'
    - '\AutoIt2.exe'
    - '\AutoIt3_x64.exe'
    - '\AutoIt3.exe'
  condition: 1 of selection_* and not 1 of filter_main_*
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This detection rule identifies suspicious executions of renamed AutoIt executables, such as AutoIt2.exe and AutoIt3.exe, which are automation tools primarily used on Windows systems. While AutoIt has legitimate applications, its renaming or modification often indicates potential misuse by attackers to deploy malware like keyloggers or botnets. The rule analyzes process creation logs, focusing on specific command-line parameters indicative of AutoIt executions, while also checking file hashes to ensure they correspond to known AutoIt versions. A further validation step is included to filter out legitimate instances based on the original file names of the executables. The combination of these indicators serves to identify and flag unauthorized uses of AutoIt, particularly in compromised environments.
  ### Investigation Steps
  - **Review EDR Alerts:**
    Examine the EDR console for alerts related to the execution of AutoIt executables, and look for any anomalous parent processes that may indicate exploitation.
  - **Analyze Command-Line Arguments:**
    Investigate the command-line parameters associated with the detected AutoIt execution to identify potentially malicious scripts or behaviors.
  - **Check File Integrity:**
    Use antivirus or endpoint protection tools to verify the hashes of the identified AutoIt binaries against known good signatures, helping confirm their legitimacy.
  - **Correlate with Network Activity:**
    Cross-reference the timeline of the AutoIt execution with proxy and network logs to look for unusual outbound connections that could indicate data exfiltration or callbacks to a command and control server.
