title: Wscript Shell Run In CommandLine
id: 2c28c248-7f50-417a-9186-a85b223010ee
status: test
description: Detects the presence of the keywords "Wscript", "Shell" and "Run" in
  the command, which could indicate a suspicious activity
references:
- https://web.archive.org/web/20220830122045/http://blog.talosintelligence.com/2022/08/modernloader-delivers-multiple-stealers.html
- https://blog.talosintelligence.com/modernloader-delivers-multiple-stealers-cryptominers-and-rats/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-08-31
modified: 2023-05-15
tags:
- attack.execution
- attack.t1059
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|contains|all:
    - 'Wscript.'
    - '.Shell'
    - '.Run'
  condition: selection
falsepositives:
- Inline scripting can be used by some rare third party applications or administrators.
  Investigate and apply additional filters accordingly
level: medium
notes: |
  ### Technical Context
  This detection rule targets potential misuse of Windows Script Host by monitoring command-line arguments for the keywords "Wscript", "Shell", and "Run". These terms, when used together, are indicative of script execution that could be associated with malicious activities, such as the deployment of malware or unauthorized scripts. By analyzing process creation events, this rule assesses command lines to identify instances where potentially harmful scripts may have been initiated. The data sources involved in this detection include process creation logs from Windows, which provide insight into application launches and their corresponding command-line parameters.
  ### Investigation Steps
  - Review the process creation logs in the EDR tool to identify any instances where 'Wscript', '.Shell', and '.Run' are present in command-line arguments.
  - Check for the parent-child relationship of processes to determine if the suspicious Wscript command originated from a legitimate source application.
  - Utilize AV tools to conduct a scan on the identified process to ascertain if it is flagged as malware or part of suspicious activity.
  - Investigate any outbound traffic logs in the Proxy tool to see if the affected processes attempted connections to known malicious domains or IP addresses.
