title: CodePage Modification Via MODE.COM To Russian Language
id: 12fbff88-16b5-4b42-9754-cd001a789fb3
related:
- id: d48c5ffa-3b02-4c0f-9a9e-3c275650dd0e
  type: derived
status: test
description: |
  Detects a CodePage modification using the "mode.com" utility to Russian language.
  This behavior has been used by threat actors behind Dharma ransomware.
references:
- https://learn.microsoft.com/en-us/windows/win32/intl/code-page-identifiers
- https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/mode
- https://strontic.github.io/xcyclopedia/library/mode.com-59D1ED51ACB8C3D50F1306FD75F20E99.html
- https://www.virustotal.com/gui/file/5e75ef02517afd6e8ba6462b19217dc4a5a574abb33d10eb0f2bab49d8d48c22/behavior
author: Joseliyo Sanchez, @Joseliyo_Jstnk
date: 2024-01-17
tags:
- attack.defense-evasion
- attack.t1036
logsource:
  category: process_creation
  product: windows
detection:
    # VT Query: behavior:"mode con cp select=1251"
    # VT Query: behavior:"mode con cp select=866"
  selection_img:
  - Image|endswith: '\mode.com'
  - OriginalFileName: 'MODE.COM'
  selection_cli:
    CommandLine|contains|all:
    - ' con '
    - ' cp '
    - ' select='
    CommandLine|endswith:
    - '=1251'         # ANSI Cyrillic; Cyrillic (Windows) - Observed ITW by Dharma ransomware
    - '=866'         # OEM Russian; Cyrillic (DOS) - Observed ITW by other malware
  condition: all of selection_*
falsepositives:
- Russian speaking people changing the CodePage
level: medium
notes: |
  n
  ### Technical Context
  This detection rule aims to identify the modification of the code page in Windows environments using the command-line utility "mode.com" to set it to the Russian language (CP 1251 or CP 866). Code page modification is a technique that can be exploited by malicious actors, specifically those associated with ransomware like Dharma, to obfuscate malicious activities and facilitate further exploitations. This rule leverages process creation logs, focusing on command-line parameters that include the specific patterns signifying a change in code page. By monitoring for these command-line invocations and the associated executable—mode.com—this rule falls under the MITRE ATT&CK technique T1036 (Masquerading), specifically aligning with the defense evasion tactic.
  ### Investigation Steps
  - **Verify the Process:** Utilize EDR tools to track the process tree associated with the `mode.com` execution. Analyze the parent processes to check if the execution was initiated by a legitimate user application or a potentially malicious one.
    
  - **Analyze Command Line Parameters:** Review the command-line arguments logged in Windows security logs to confirm the presence of 'con cp select=' followed by either '='1251' or '=866'. Interrogate these parameters for suspicious usage patterns.
    
  - **Correlate with User Activity:** Check for any user activity logs in the proxy or VPN logs surrounding the time of the code page modification to identify any unusual patterns or behaviors leading up to the alert.
    
  - **Investigate File Integrity:** Use file integrity monitoring solutions or AV tools to ensure that the `mode.com` utility has not been tampered with or replaced with a malicious payload.
  ### Prioritization
  This alert is deemed medium priority as the modification of code pages can indicate an attempt to evade detection by altering display formats for malicious commands. It requires prompt investigation to ascertain whether it's a benign action or indicative of a more significant threat.
  ### Blind Spots and Assumptions
  The detection rule may not fire in scenarios where legitimate users intentionally change the code page for valid reasons, such as native Russian speakers. Additionally, attacks that employ an alternate method of code page modification or manipulation outside of the monitored command-line parameters may not trigger this alert. Adversaries could bypass detection by using scripted automation or disguise the command under different operational contexts.
  > **Disclaimer:** This investigation guide was created using generative AI technology and has not been reviewed for its accuracy and relevance. While every effort has been made to ensure its quality, we recommend validating the content and adapting it to suit specific environment and operational needs. Please communicate any changes to the detection engineering team.
