title: Potentially Suspicious Command Targeting Teams Sensitive Files
id: d2eb17db-1d39-41dc-b57f-301f6512fa75
status: test
description: |
  Detects a commandline containing references to the Microsoft Teams database or cookies files from a process other than Teams.
  The database might contain authentication tokens and other sensitive information about the logged in accounts.
references:
- https://www.bleepingcomputer.com/news/security/microsoft-teams-stores-auth-tokens-as-cleartext-in-windows-linux-macs/
- https://www.vectra.ai/blogpost/undermining-microsoft-teams-security-by-mining-tokens
author: '@SerkinValery'
date: 2022-09-16
modified: 2023-12-18
tags:
- attack.credential-access
- attack.t1528
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    CommandLine|contains:
    - '\Microsoft\Teams\Cookies'
    - '\Microsoft\Teams\Local Storage\leveldb'
  filter_main_legit_locations:
    Image|endswith: '\Microsoft\Teams\current\Teams.exe'
  condition: selection and not 1 of filter_main_*
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  This Sigma rule is designed to detect potentially suspicious command-line activity targeting sensitive files associated with Microsoft Teams. Specifically, it looks for processes (other than the legitimate Teams executable) that attempt to access the database and cookies files located within the Microsoft Teams directory. These files can contain sensitive information such as authentication tokens and user account data, making them attractive targets for unauthorized access. The rule analyzes process creation logs, focusing on command-line parameters to identify any anomalies that may indicate malicious intent.
  The logic used in this detection involves checking if the command line of a process contains references to the Teams-specific paths (`Cookies` or `Local Storage/leveldb`) while ensuring that the process is not the legitimate Teams application. If such command lines are detected, the rule triggers an alert for further investigation.
  ### Investigation Steps
  - Review the process creation logs in your EDR solution to identify the specific process that triggered the alert and examine its command-line arguments for the referenced Teams files.
  - Correlate the process execution with user activity logs to determine if the user involved has legitimate access to Microsoft Teams and if their actions are consistent with normal behavior.
  - Search your organization's AV and NDR logs for any additional context regarding the flagged process, particularly if the process is associated with known malicious activity or other signs of compromise.
  - Analyze cloud logs (if applicable) related to user activity within Microsoft Teams to look for any unusual behavior or access patterns that coincide with the time of the triggered alert.
