title: Enumeration for 3rd Party Creds From CLI
id: 87a476dc-0079-4583-a985-dee7a20a03de
related:
- id: e0b0c2ab-3d52-46d9-8cb7-049dc775fbd1
  type: derived
status: test
description: Detects processes that query known 3rd party registry keys that holds
  credentials via commandline
references:
- https://isc.sans.edu/diary/More+Data+Exfiltration/25698
- https://github.com/synacktiv/Radmin3-Password-Cracker/blob/acfc87393e4b7c06353973a14a6c7126a51f36ac/regkey.txt
- https://github.com/HyperSine/how-does-MobaXterm-encrypt-password
- https://book.hacktricks.xyz/windows-hardening/windows-local-privilege-escalation#inside-the-registry
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-06-20
tags:
- attack.credential-access
- attack.t1552.002
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|contains:     # Add more paths as they are discovered
    - '\Software\SimonTatham\PuTTY\Sessions'
    - '\Software\\SimonTatham\PuTTY\SshHostKeys\'
    - '\Software\Mobatek\MobaXterm\'
    - '\Software\WOW6432Node\Radmin\v3.0\Server\Parameters\Radmin'
    - '\Software\Aerofox\FoxmailPreview'
    - '\Software\Aerofox\Foxmail\V3.1'
    - '\Software\IncrediMail\Identities'
    - '\Software\Qualcomm\Eudora\CommandLine'
    - '\Software\RimArts\B2\Settings'
    - '\Software\OpenVPN-GUI\configs'
    - '\Software\Martin Prikryl\WinSCP 2\Sessions'
    - '\Software\FTPWare\COREFTP\Sites'
    - '\Software\DownloadManager\Passwords'
    - '\Software\OpenSSH\Agent\Keys'
    - '\Software\TightVNC\Server'
    - '\Software\ORL\WinVNC3\Password'
    - '\Software\RealVNC\WinVNC4'
  condition: selection
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  This detection rule is designed to identify potentially malicious activity involving credential enumeration from certain third-party applications on Windows systems. It monitors the command line of process creation events for specific registry paths associated with popular software that may store credentials. By analyzing the corresponding command-line parameters, the rule can effectively flag any attempts to access sensitive information, such as usernames or passwords, from these applications. The primary data source utilized for this detection is process creation logs, which capture the command-line arguments passed to processes when they are launched.
  The registry keys of interest include those related to applications like PuTTY, MobaXterm, and others, known for being used in both legitimate and malicious contexts. Recognizing enumeration attempts can aid in uncovering potential credential theft, enabling incident responders to quickly address and mitigate security events.
  ### Investigation Steps
  - Review the process creation logs in the EDR tool to identify the specifics of the flagged commands and the associated process responsible for querying the registry.
  - Cross-reference the identified process with known malicious indicators or behavior using threat intelligence sources and your SIEM platform.
  - Analyze network logs from the NGFW and Proxy to see if there were any outbound connections made by the flagged process, which could suggest data exfiltration.
  - Check for user and system activity logs in relevant cloud environments (e.g., AWS, Azure) to determine if there are any suspicious access patterns or anomaly behaviors related to the flagged process.
