title: Suspicious Curl.EXE Download
id: e218595b-bbe7-4ee5-8a96-f32a24ad3468
related:
- id: bbeaed61-1990-4773-bf57-b81dbad7db2d     # Basic curl execution
  type: derived
- id: 9a517fca-4ba3-4629-9278-a68694697b81     # Curl download
  type: similar
status: test
description: Detects a suspicious curl process start on Windows and outputs the requested
  document to a local file
references:
- https://twitter.com/max_mal_/status/1542461200797163522
- https://web.archive.org/web/20200128160046/https://twitter.com/reegun21/status/1222093798009790464
- https://github.com/pr0xylife/Qakbot/blob/4f0795d79dabee5bc9dd69f17a626b48852e7869/Qakbot_AA_23.06.2022.txt
- https://www.volexity.com/blog/2022/07/28/sharptongue-deploys-clever-mail-stealing-browser-extension-sharpext/
- https://github.com/redcanaryco/atomic-red-team/blob/0f229c0e42bfe7ca736a14023836d65baa941ed2/atomics/T1105/T1105.md#atomic-test-18---curl-download-file
author: Florian Roth (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)
date: 2020-07-03
modified: 2023-02-21
tags:
- attack.command-and-control
- attack.t1105
logsource:
  category: process_creation
  product: windows
detection:
  selection_curl:
  - Image|endswith: '\curl.exe'
  - Product: 'The curl executable'
  selection_susp_locations:
    CommandLine|contains:
    - '%AppData%'
    - '%Public%'
    - '%Temp%'
    - '%tmp%'
    - '\AppData\'
    - '\Desktop\'
    - '\Temp\'
    - '\Users\Public\'
    - 'C:\PerfLogs\'
    - 'C:\ProgramData\'
    - 'C:\Windows\Temp\'
  selection_susp_extensions:
    CommandLine|endswith:
    - '.dll'
    - '.gif'
    - '.jpeg'
    - '.jpg'
    - '.png'
    - '.temp'
    - '.tmp'
    - '.txt'
    - '.vbe'
    - '.vbs'
  filter_optional_git_windows:
        # Example FP
        #   CommandLine: "C:\Program Files\Git\mingw64\bin\curl.exe" --silent --show-error --output C:/Users/test/AppData/Local/Temp/gfw-httpget-jVOEoxbS.txt --write-out %{http_code} https://gitforwindows.org/latest-tag.txt
    ParentImage: 'C:\Program Files\Git\usr\bin\sh.exe'
    Image: 'C:\Program Files\Git\mingw64\bin\curl.exe'
    CommandLine|contains|all:
    - '--silent --show-error --output '
    - 'gfw-httpget-'
    - 'AppData'
  condition: selection_curl and 1 of selection_susp_* and not 1 of filter_optional_*
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This detection rule identifies potentially malicious instances of `curl.exe` being executed on Windows systems, specifically when the command-line parameters indicate the download of suspicious file types to common user directories such as `%AppData%`, `%Temp%`, or `%Public%`. By monitoring process creation logs, the rule looks for `curl.exe`, a widely used command-line tool for transferring data with URLs, which can be exploited by attackers for downloading payloads or exfiltrating data. If the executed command includes certain file extensions such as `.dll`, `.gif`, `.jpg`, or `.txt`, alongside suspicious directory locations, this could indicate malicious activity, as attackers often utilize `curl` to facilitate command and control operations or payload delivery.
  This rule specifically relates to the MITRE ATT&CK tactic of Command and Control (T1071) and specifically addresses technique T1105 (Ingress Tool Transfer). Understanding the use of `curl` in this context enables defenders to recognize and respond to potential threats resulting from unauthorized software downloads executed via legitimate tools.
  ### Investigation Steps
  - **Verify the Process:** Check the process creation logs in your EDR tool to confirm if `curl.exe` was indeed initiated along with the command-line parameters detailing suspicious file locations or extensions.
    
  - **Analyze the Parent Process:** Investigate the parent process of the detected `curl.exe` invocation through your EDR logs to determine if it was executed by a potentially trusted process or if it was initiated by an unrecognized or malicious application.
  - **Check Local File Activity:** Review file creation events in the potentially affected directories (e.g., `%AppData%`, `%Temp%`, etc.) to identify if any suspicious files matching the download pattern have indeed been created or modified.
  - **Perform Network Analysis:** Utilize network threat detection tools to check for any outbound connections made by `curl.exe`, examining the traffic to validate whether it reached suspicious external hosts associated with known malicious activity.
  ### Prioritization
  This alert carries a high severity level due to the inherent risks associated with unauthorized downloads using `curl.exe`, which can lead to malware infections, unauthorized data exfiltration, or lateral movement within the enterprise. Immediate investigation is essential to prevent any potential breaches.
  ### Blind spots and Assumptions
  There are several scenarios where this detection rule may not activate. For instance, if `curl.exe` is executed with recognized legitimate parameters from a trusted third-party application (e.g., Git for Windows), it could be falsely flagged as malicious, demonstrating a limitation in differentiating benign from malicious use cases. Moreover, if an adversary uses alternate methods or obfuscates their activity—such as renaming `curl.exe` or employing a different tool for similar functionality—the rule may not trigger. Analysts should remain aware of these variations and verify alerts in the context of live systems.
  > **Disclaimer:** This investigation guide was created using generative AI technology and has not been reviewed for its accuracy and relevance. While every effort has been made to ensure its quality, we recommend validating the content and adapting it to suit specific environment and operational needs. Please communicate any changes to the detection engineering team.
