title: Remote Access Tool - AnyDesk Execution With Known Revoked Signing Certificate
id: 41f407b5-3096-44ea-a74f-96d04fbc41be
status: test
description: |
  Detects the execution of an AnyDesk binary with a version prior to 8.0.8.
  Prior to version 8.0.8, the Anydesk application used a signing certificate that got compromised by threat actors.
  Use this rule to detect instances of older versions of Anydesk using the compromised certificate
  This is recommended in order to avoid attackers leveraging the certificate and signing their binaries to bypass detections.
references:
- https://www.bleepingcomputer.com/news/security/anydesk-says-hackers-breached-its-production-servers-reset-passwords/
- https://anydesk.com/en/changelog/windows
author: Sai Prashanth Pulisetti, Nasreddine Bencherchali (Nextron Systems)
date: 2024-02-08
tags:
- attack.execution
- attack.initial-access
logsource:
  product: windows
  category: process_creation
detection:
  selection_img:
  - Image|endswith: '\AnyDesk.exe'
  - Description: 'AnyDesk'
  - Product: 'AnyDesk'
  - Company: 'AnyDesk Software GmbH'
  selection_version:
    FileVersion|startswith:
    - '7.0.'
    - '7.1.'
    - '8.0.1'
    - '8.0.2'
    - '8.0.3'
    - '8.0.4'
    - '8.0.5'
    - '8.0.6'
    - '8.0.7'
  filter_main_uninstall:
    CommandLine|contains:
    - ' --remove'
    - ' --uninstall'
  condition: all of selection_* and not 1 of filter_main_*
falsepositives:
- Unlikely
level: medium
notes: |
  n
  ### Technical Context
  This detection rule monitors for the execution of AnyDesk applications that utilize a known compromised signing certificate, specifically versions prior to 8.0.8. When an attacker uses an older version of AnyDesk, they may circumvent traditional security measures, exploiting the legitimacy conferred by the compromised certificate to execute malicious activities undetected. The rule primarily leverages Windows process creation logs, checking for the execution of AnyDesk binaries and their respective file versions. If the binary detected is an older version, or if AnyDesk is running uninstall commands, alerts are generated. This aligns with the MITRE ATT&CK framework under the tactic of Execution and technique of Initial Access, focusing on how attackers might exploit trusted software to gain footholds in the system.
  ### Investigation Steps
  - **Review Process Creation Logs:** Check the process creation logs in your EDR solution for the execution of AnyDesk binaries. Pay particular attention to the file versions associated with any detected instances.
  - **Analyze Command-Line Arguments:** Investigate the command-line parameters used during the execution of AnyDesk for any unusual activity, specifically looking for flags indicating uninstallation or removal.
  - **Conduct a Binary Analysis:** If AnyDesk is detected, perform a binary analysis on the file to verify its version and assessing its potential malicious behavior. This may include checking for known IOCs associated with identified threats utilizing this software.
  - **Correlate with Network Activity:** Examine network logs for any anomalous connections initiated by the detected AnyDesk instance. Look for outbound connections that may indicate command and control (C2) communication.
  ### Prioritization
  This alert should be considered medium priority due to the potential for compromised software being used for remote access. The execution of these specific versions of AnyDesk can indicate an ongoing attack or insider threat, warranting timely investigation.
  ### Blind Spots and Assumptions
  The rule may not fire if an attacker modifies the filename of their malicious AnyDesk variant or utilizes a different remote access tool altogether. It also assumes that process creation logging is enabled and that the relevant logs maintain audit trails long enough to capture such activities. Furthermore, if the software executes in environments where logging is disabled or insufficient, detection may be missed entirely.
  > **Disclaimer:** This investigation guide was created using generative AI technology and has not been reviewed for its accuracy and relevance. While every effort has been made to ensure its quality, we recommend validating the content and adapting it to suit specific environment and operational needs. Please communicate any changes to the detection engineering team.
