title: Suspicious Process Start Locations
id: 15b75071-74cc-47e0-b4c6-b43744a62a2b
status: test
description: Detects suspicious process run from unusual locations
references:
- https://car.mitre.org/wiki/CAR-2013-05-002
author: juju4, Jonhnathan Ribeiro, oscd.community
date: 2019-01-16
modified: 2022-01-07
tags:
- attack.defense-evasion
- attack.t1036
- car.2013-05-002
logsource:
  category: process_creation
  product: windows
detection:
  selection:
  - Image|contains:
    - ':\RECYCLER\'
    - ':\SystemVolumeInformation\'
  - Image|startswith:
    - 'C:\Windows\Tasks\'
    - 'C:\Windows\debug\'
    - 'C:\Windows\fonts\'
    - 'C:\Windows\help\'
    - 'C:\Windows\drivers\'
    - 'C:\Windows\addins\'
    - 'C:\Windows\cursors\'
    - 'C:\Windows\system32\tasks\'
  condition: selection
falsepositives:
- False positives depend on scripts and administrative tools used in the monitored
  environment
level: medium
notes: |
  ### Technical Context
  The "Suspicious Process Start Locations" detection rule aims to identify potentially malicious activities by monitoring process creation events in Windows environments. This rule looks for process executions that originate from uncommon or unusual file paths, such as the Recycler and System Volume Information directories, as well as certain Windows directories where system or administrative scripts might be executed. By analyzing the `process_creation` logs, the rule captures instances where processes commence from locations that could be indicative of defense evasion tactics commonly used by attackers. The identified paths, such as `C:\Windows\Tasks\`, may be exploited to execute unwanted processes under the guise of legitimate operations.
  This rule utilizes data from process creation logs, specifically focusing on the file paths (or images) associated with new processes. When a suspicious path is detected, it generates an alert for investigation. Responders should pay close attention to these alerts as they could signify attempts to bypass security measures and gain unauthorized access to system resources.
  ### Investigation Steps
  - Review the process creation logs in the EDR to identify the specific processes that triggered the alert, focusing on their execution context and user accounts involved.
  - Cross-reference the alerting paths with known legitimate processes to determine if any legitimate administrative tasks or scripts are being misidentified as suspicious.
  - Utilize the AV and NGFW tools to scan the devices associated with the alert for known malware signatures, and check network activity for any outgoing connections to suspicious domains.
  - Analyze the timeline of the alerts using cloud logs (if applicable) and other logs from proxied connections to establish a broader context of the activity and identify any associated malicious indicators.
