title: Insensitive Subfolder Search Via Findstr.EXE
id: 04936b66-3915-43ad-a8e5-809eadfd1141
related:
- id: bf6c39fc-e203-45b9-9538-05397c1b4f3f
  type: obsolete
status: test
description: |
  Detects execution of findstr with the "s" and "i" flags for a "subfolder" and "insensitive" search respectively. Attackers sometimes leverage this built-in utility to search the system for interesting files or filter through results of commands.
references:
- https://lolbas-project.github.io/lolbas/Binaries/Findstr/
- https://oddvar.moe/2018/04/11/putting-data-in-alternate-data-streams-and-how-to-execute-it-part-2/
- https://gist.github.com/api0cradle/cdd2d0d0ec9abb686f0e89306e277b8f
author: Furkan CALISKAN, @caliskanfurkan_, @oscd_initiative, Nasreddine Bencherchali
  (Nextron Systems)
date: 2020-10-05
modified: 2024-03-05
tags:
- attack.defense-evasion
- attack.t1218
- attack.t1564.004
- attack.t1552.001
- attack.t1105
logsource:
  category: process_creation
  product: windows
detection:
  selection_findstr:
  - CommandLine|contains: findstr
  - Image|endswith: 'findstr.exe'
  - OriginalFileName: 'FINDSTR.EXE'
  selection_cli_search_subfolder:
    CommandLine|contains|windash: ' -s '
  selection_cli_search_insensitive:
    CommandLine|contains|windash: ' -i '
  condition: selection_findstr and all of selection_cli_search_*
falsepositives:
- Administrative or software activity
level: low
notes: |
  ### Technical Context
  This Sigma rule is designed to detect the use of the Windows command-line utility `findstr.exe` with specific flags that signify potentially malicious activity. The rule focuses on executions of the command where both the “s” flag (subfolder search) and the “i” flag (case-insensitive search) are used in the command-line parameters. Attackers may exploit `findstr.exe` to search for sensitive files or analyze command output without triggering traditional security alerts. This rule relies on process creation logs, specifically monitoring command-line arguments, image names, and the original file name of the executed process to identify suspicious behavior.
  ### Investigation Steps
  - Utilize EDR to review the full command-line arguments associated with the process creation event to understand the context in which `findstr.exe` was executed.
  - Check the event logs for any associated activities or processes that were initiated around the same time as the execution of the findstr command to identify potential lateral movement or data exfiltration attempts.
  - Analyze network traffic logs from the NGFW or Proxy to determine if there were any unusual outbound connections made following the execution of the findstr command, which could indicate data being sent externally.
  - Review cloud activity logs (if applicable) for any file access or modification events that correlate with the identified use of `findstr.exe`, particularly in sensitive or critical directories.
