title: Suspicious Child Process Created as System
id: 590a5f4c-6c8c-4f10-8307-89afe9453a9d
status: test
description: Detection of child processes spawned with SYSTEM privileges by parents
  with LOCAL SERVICE or NETWORK SERVICE accounts
references:
- https://speakerdeck.com/heirhabarov/hunting-for-privilege-escalation-in-windows-environment
- https://foxglovesecurity.com/2016/09/26/rotten-potato-privilege-escalation-from-service-accounts-to-system/
- https://github.com/antonioCoco/RogueWinRM
- https://twitter.com/Cyb3rWard0g/status/1453123054243024897
author: Teymur Kheirkhabarov, Roberto Rodriguez (@Cyb3rWard0g), Open Threat Research
  (OTR)
date: 2019-10-26
modified: 2024-12-01
tags:
- attack.privilege-escalation
- attack.t1134.002
logsource:
  category: process_creation
  product: windows
  definition: 'Requirements: ParentUser field needs sysmon >= 13.30'
detection:
  selection:
    ParentUser|contains:
    - 'AUTHORI'
    - 'AUTORI'
    ParentUser|endswith:
    - '\NETWORK SERVICE'
    - '\LOCAL SERVICE'
    User|contains:     # covers many language settings
    - 'AUTHORI'
    - 'AUTORI'
    User|endswith:     # System
    - '\SYSTEM'
    - '\Système'
    - '\СИСТЕМА'
    IntegrityLevel:
    - 'System'
    - 'S-1-16-16384'
  filter_rundll32:
    Image|endswith: '\rundll32.exe'
    CommandLine|contains: 'DavSetCookie'
  condition: selection and not 1 of filter_*
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This Sigma rule is designed to detect suspicious child processes that are spawned with SYSTEM privileges by parent processes running under the LOCAL SERVICE or NETWORK SERVICE accounts. The focus of this detection is to identify potential privilege escalation attempts, which can occur when an attacker leverages these accounts to execute unauthorized commands with elevated permissions. The rule operates by analyzing process creation logs, specifically from Sysmon with a version of 13.30 or higher, to identify the hierarchy of processes and their associated user accounts. It looks for parent processes with user accounts that include “LOCAL SERVICE” or “NETWORK SERVICE” and checks if these processes subsequently invoke child processes that have SYSTEM-level privileges.
  ### Investigation Steps
  - Investigate the parent process details in EDR to identify any anomalies or unauthorized activities that may have led to the child process creation under SYSTEM privileges.
  - Review command-line parameters and arguments used by the child process through process creation logs to detect suspicious operations or known payloads associated with privilege escalation.
  - Utilize AV and NDR tools to scan for any known malicious signatures or behaviors linked to the parent and child processes, helping to confirm whether they are part of a broader attack vector.
  - Examine network logs from the NGFW and proxy for unusual outbound connections initiated by the SYSTEM-level child process, which could indicate exfiltration or further compromise attempts.
