title: Arbitrary Shell Command Execution Via Settingcontent-Ms
id: 24de4f3b-804c-4165-b442-5a06a2302c7e
status: test
description: The .SettingContent-ms file type was introduced in Windows 10 and allows
  a user to create "shortcuts" to various Windows 10 setting pages. These files are
  simply XML and contain paths to various Windows 10 settings binaries.
references:
- https://posts.specterops.io/the-tale-of-settingcontent-ms-files-f1ea253e4d39
author: Sreeman
date: 2020-03-13
modified: 2022-04-14
tags:
- attack.t1204
- attack.t1566.001
- attack.execution
- attack.initial-access
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|contains: '.SettingContent-ms'
  filter:
    CommandLine|contains: 'immersivecontrolpanel'
  condition: selection and not filter
fields:
- ParentProcess
- CommandLine
- ParentCommandLine
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  This Sigma rule detects the execution of arbitrary shell commands via `SettingContent-ms` files on Windows 10 systems. The `.SettingContent-ms` file type serves as an XML shortcut to various Windows settings and can be exploited to execute commands unexpectedly by leveraging the immersive control panel. The rule specifically looks for command-line arguments that contain '.SettingContent-ms', while ensuring that the command line does not include 'immersivecontrolpanel', which helps filter out legitimate uses. By monitoring process creation logs, the rule detects potentially malicious activities where unauthorized commands may be executed, thereby enabling a proactive security response.
  ### Investigation Steps
  - Examine process creation logs in your EDR solution to identify the instances where `.SettingContent-ms` files were executed, noting the associated `CommandLine` and `ParentProcess`.
  - Verify the context of the processes by correlating them with user activity logs to establish whether the execution was authorized or indicative of malicious behavior.
  - Utilize your SIEM to analyze related events around the timestamp of the alert to detect any lateral movement or other suspicious activities by the same user or process.
  - Investigate firewall and proxy logs for any unusual outbound connections that may have occurred after the execution of the arbitrary commands, which could indicate data exfiltration attempts.
