title: HackTool - Sliver C2 Implant Activity Pattern
id: 42333b2c-b425-441c-b70e-99404a17170f
status: test
description: Detects process activity patterns as seen being used by Sliver C2 framework
  implants
references:
- https://github.com/BishopFox/sliver/blob/79f2d48fcdfc2bee4713b78d431ea4b27f733f30/implant/sliver/shell/shell_windows.go#L36
- https://www.microsoft.com/security/blog/2022/08/24/looking-for-the-sliver-lining-hunting-for-emerging-command-and-control-frameworks/
author: Nasreddine Bencherchali (Nextron Systems), Florian Roth (Nextron Systems)
date: 2022-08-25
modified: 2023-03-05
tags:
- attack.execution
- attack.t1059
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|contains: '-NoExit -Command [Console]::OutputEncoding=[Text.UTF8Encoding]::UTF8'
  condition: selection
falsepositives:
- Unlikely
level: critical
notes: |
  ### Technical Context
  The Sigma rule titled "HackTool 
  - Sliver C2 Implant Activity Pattern" is designed to identify suspicious process creation activities indicative of the Sliver Command and Control (C2) framework implants operating within a Windows environment. Specifically, it looks for command-line parameters that contain the string `-NoExit -Command [Console]::OutputEncoding=[Text.UTF8Encoding]::UTF8`, which is characteristic of the Sliver implants manipulating console output. By monitoring process creation logs, the rule captures attempts to leverage PowerShell with these specific command-line arguments, which can signify an ongoing security incident or a compromised system.
  The primary source of data for this detection comes from process creation logs within the Windows operating system. This information can be correlated with other telemetry data to better understand the context of the alert, assess the potential impact, and support incident response efforts.
  ### Investigation Steps
  - Utilize EDR tools to analyze the process tree and identify any additional processes spawned by the detected command, focusing on their parent-child relationships and execution context. 
  - Review command-line arguments and parent processes in the process creation logs for any signs of abnormal execution patterns or unauthorized scripts running concurrently.
  - Check network logs (NDR and firewall) to identify any unusual outbound connections that may align with the Sliver C2 detected activity, paying special attention to IP addresses and ports commonly associated with C2 traffic.
  - Conduct a review of user account activity and authentication logs to determine if any unusual logins or privilege escalations occurred around the time of the alert, which may indicate an active compromise or lateral movement within the network.
