title: Copy From Or To Admin Share Or Sysvol Folder
id: 855bc8b5-2ae8-402e-a9ed-b889e6df1900
status: test
description: Detects a copy command or a copy utility execution to or from an Admin
  share or remote
references:
- https://twitter.com/SBousseaden/status/1211636381086339073
- https://drive.google.com/file/d/1lKya3_mLnR3UQuCoiYruO3qgu052_iS_/view
- https://www.elastic.co/guide/en/security/current/remote-file-copy-to-a-hidden-share.html
- https://www.microsoft.com/en-us/security/blog/2022/10/18/defenders-beware-a-case-for-post-ransomware-investigations/
author: Florian Roth (Nextron Systems), oscd.community, Teymur Kheirkhabarov @HeirhabarovT,
  Zach Stanford @svch0st, Nasreddine Bencherchali
date: 2019-12-30
modified: 2023-11-15
tags:
- attack.lateral-movement
- attack.collection
- attack.exfiltration
- attack.t1039
- attack.t1048
- attack.t1021.002
logsource:
  category: process_creation
  product: windows
detection:
  selection_target:
    CommandLine|contains:
    - '\\\\*$'
    - '\Sysvol\'
  selection_other_tools:
  - Image|endswith:
    - '\robocopy.exe'
    - '\xcopy.exe'
  - OriginalFileName:
    - 'robocopy.exe'
    - 'XCOPY.EXE'
  selection_cmd_img:
  - Image|endswith: '\cmd.exe'
  - OriginalFileName: 'Cmd.Exe'
  selection_cmd_cli:
    CommandLine|contains: 'copy'
  selection_pwsh_img:
  - Image|contains:
    - '\powershell.exe'
    - '\pwsh.exe'
  - OriginalFileName:
    - 'PowerShell.EXE'
    - 'pwsh.dll'
  selection_pwsh_cli:
    CommandLine|contains:
    - 'copy-item'
    - 'copy '
    - 'cpi '
    - ' cp '
    - 'move '
    - 'move-item'
    - ' mi '
    - ' mv '
  condition: selection_target and (selection_other_tools or all of selection_cmd_*
    or all of selection_pwsh_*)
falsepositives:
- Administrative scripts
level: medium
notes: |
  n
  ### Technical Context
  The "Copy From Or To Admin Share Or Sysvol Folder" detection rule aims to identify unauthorized file copy operations targeting administrative shares or the Sysvol folder in Windows environments. It leverages command-line parameters and executable image names to detect various methods used by adversaries to exfiltrate data or perform lateral movement within the network. This rule monitors the creation of processes that contain specific command-line keywords like `copy`, `robocopy`, `xcopy`, and PowerShell commands such as `copy-item`. Both the command-line arguments and process images are essential data sources, with a particular focus on actions directed towards sensitive folders typically used for administrative purposes. The rule aligns with the MITRE ATT&CK framework, specifically capturing lateral movement (T1021.002), collection (T1039), and exfiltration (T1048) techniques.
  ### Investigation Steps
  - **Review Alerts in EDR**: Investigate the generated alerts in the EDR solution for specific source and destination details, including the account that executed the command and the files being accessed.
  - **Check Event Logs**: Gather Windows Security logs to track logon events and correlate the user activity with times of file copy commands to determine if they are legitimate administrative tasks or suspicious actions.
  - **Analyze File Transfers**: Use the proxy logs to monitor any outbound traffic that may indicate an exfiltration attempt during the reported file copy activities. This includes reviewing any connections to external IP addresses.
  - **Correlate with Other Activities**: Cross-reference with Sysmon logs for any related process creations or network connections at the same time as the file copy commands, which could provide context for potential lateral movement or data theft.
  ### Prioritization
  This alert is categorized as medium severity due to its potential implications on sensitive data exposure and lateral movement within the environment. Unauthorized file copies from critical resources could indicate a security breach where data is being exfiltrated or preparations for further exploitation.
  ### Blind Spots and Assumptions
  There may be legitimate administrative tasks that perform file copying to and from administrative shares, leading to false positives in this rule. Additionally, if the command is executed via scripts that don't leverage the monitored command-line parameters or if the adversary uses alternative tools not detected by this rule, alerts may not be triggered. Assumptions include the presence of required auditing settings in Windows to capture relevant logs, which may not be enabled in all environments.
  > **Disclaimer:** This investigation guide was created using generative AI technology and has not been reviewed for its accuracy and relevance. While every effort has been made to ensure its quality, we recommend validating the content and adapting it to suit specific environment and operational needs. Please communicate any changes to the detection engineering team.
