title: File Download Via Bitsadmin To A Suspicious Target Folder
id: 2ddef153-167b-4e89-86b6-757a9e65dcac
status: test
description: Detects usage of bitsadmin downloading a file to a suspicious target
  folder
references:
- https://blog.netspi.com/15-ways-to-download-a-file/#bitsadmin
- https://isc.sans.edu/diary/22264
- https://lolbas-project.github.io/lolbas/Binaries/Bitsadmin/
- https://blog.talosintelligence.com/breaking-the-silence-recent-truebot-activity/
author: Florian Roth (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)
date: 2022-06-28
modified: 2023-05-30
tags:
- attack.defense-evasion
- attack.persistence
- attack.t1197
- attack.s0190
- attack.t1036.003
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: '\bitsadmin.exe'
  - OriginalFileName: 'bitsadmin.exe'
  selection_flags:
    CommandLine|contains:
    - ' /transfer '
    - ' /create '
    - ' /addfile '
  selection_folder:
    CommandLine|contains:
    - ':\Perflogs'
    - ':\ProgramData\'
    - ':\Temp\'
    - ':\Users\Public\'
    - ':\Windows\'
    - '\AppData\Local\Temp\'
    - '\AppData\Roaming\'
    - '\Desktop\'
    - '%ProgramData%'
    - '%public%'
  condition: all of selection_*
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This detection rule targets the use of the Windows utility `bitsadmin.exe` employed for downloading files to potentially suspicious directories. The rule monitors process creation logs specifically for instances where `bitsadmin.exe` is being executed with particular command-line arguments indicative of file transfer operations. It focuses on command lines that include parameters such as `/transfer`, `/create`, and `/addfile`, while also checking if the download destination is one of several common repository paths—like `C:\ProgramData\`, `C:\Temp\`, or `%ProgramData%\`. The rule operates on the premise that unauthorized downloads to these directories could signify malicious activity, such as persistence mechanisms or evasion tactics employed by threat actors, therefore warranting immediate investigation.
  ### Investigation Steps
  - Review the process creation logs in your EDR to identify any recent executions of `bitsadmin.exe`, paying close attention to the specific command-line parameters used.
  - Cross-reference the target folder paths against known legitimate usage to determine if the download was unexpected or unauthorized. Check other logs for any previous suspicious activity associated with the user.
  - Investigate network traffic for any outbound connections around the same timestamp to identify potential command and control (C2) communication related to the file download.
  - Collect and analyze any related artifacts from the suspicious folders, such as downloaded files or logs, and assess them for malware signatures or other indicators of compromise (IoCs).
