title: Process Proxy Execution Via Squirrel.EXE
id: 45239e6a-b035-4aaf-b339-8ad379fcb67e
related:
- id: 1e75c1cc-c5d4-42aa-ac3d-91b0b68b3b4c
  type: similar
- id: fa4b21c9-0057-4493-b289-2556416ae4d7
  type: obsolete
status: test
description: |
  Detects the usage of the "Squirrel.exe" binary to execute arbitrary processes. This binary is part of multiple Electron based software installations (Slack, Teams, Discord, etc.)
references:
- https://lolbas-project.github.io/lolbas/OtherMSBinaries/Squirrel/
- http://www.hexacorn.com/blog/2019/03/30/sqirrel-packages-manager-as-a-lolbin-a-k-a-many-electron-apps-are-lolbins-by-default/
- http://www.hexacorn.com/blog/2018/08/16/squirrel-as-a-lolbin/
author: Nasreddine Bencherchali (Nextron Systems), Karneades / Markus Neis, Jonhnathan
  Ribeiro, oscd.community
date: 2022-06-09
modified: 2023-11-09
tags:
- attack.defense-evasion
- attack.execution
- attack.t1218
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
    Image|endswith:
    - '\squirrel.exe'
    - '\update.exe'
  selection_exec:
    CommandLine|contains:
    - '--processStart'
    - '--processStartAndWait'
    - '--createShortcut'
  filter_optional_discord:
    CommandLine|contains|all:
    - ':\Users\'
    - '\AppData\Local\Discord\Update.exe'
    - ' --processStart'
    - 'Discord.exe'
  filter_optional_github_desktop:
    CommandLine|contains|all:
    - ':\Users\'
    - '\AppData\Local\GitHubDesktop\Update.exe'
    - 'GitHubDesktop.exe'
    CommandLine|contains:
    - '--createShortcut'
    - '--processStartAndWait'
  filter_optional_teams:
    CommandLine|contains|all:
    - ':\Users\'
    - '\AppData\Local\Microsoft\Teams\Update.exe'
    - 'Teams.exe'
    CommandLine|contains:
    - '--processStart'
    - '--createShortcut'
  filter_optional_yammer:
    CommandLine|contains|all:
    - ':\Users\'
    - '\AppData\Local\yammerdesktop\Update.exe'
    - 'Yammer.exe'
    CommandLine|contains:
    - '--processStart'
    - '--createShortcut'
  condition: all of selection_* and not 1 of filter_optional_*
falsepositives:
- Expected FP with some Electron based applications such as (1Clipboard, Beaker Browser,
  Caret, Discord, GitHub Desktop, etc.)
level: medium
notes: |
  ### Technical Context
  This Sigma rule is designed to detect the execution of arbitrary processes via the "Squirrel.exe" binary, which is commonly associated with Electron-based applications like Slack, Teams, and Discord. Specifically, the rule looks for process creation events where the command line includes specific arguments such as `--processStart`, `--processStartAndWait`, or `--createShortcut`, which are indicative of Squirrel's functionality for starting or managing these applications. By monitoring the `process_creation` logs within the Windows environment, the rule identifies suspicious usage patterns that may signify an attempt to leverage a legitimate application for malicious purposes—specifically, executing unauthorized processes.
  In addition, the detection logic has filtering conditions to differentiate between rule violations and legitimate operations by checking command line patterns associated with commonly used Electron applications, allowing it to reduce false positives while still capturing potentially malicious activity.
  ### Investigation Steps
  Identify any recent instances of Squirrel.exe executions by querying the EDR for process creation logs, focusing on command lines that include suspicious arguments.
  Review related process activity by examining the operational context in the SIEM, including parent and child process relationships to understand how Squirrel.exe was invoked.
  Correlate alerts with network traffic logs from the NDR to identify any unusual outbound connections following the execution of Squirrel.exe, which might indicate data exfiltration or command and control activity.
  Investigate user activity logs via the Proxy to identify any recent downloads or application installations that may have preceded the execution of Squirrel.exe, providing context to the alert and potential origin of the malicious behavior.
