title: Remote Access Tool - ScreenConnect Server Web Shell Execution
id: b19146a3-25d4-41b4-928b-1e2a92641b1b
status: test
description: Detects potential web shell execution from the ScreenConnect server process.
references:
- https://blackpointcyber.com/resources/blog/breaking-through-the-screen/
- https://www.connectwise.com/company/trust/security-bulletins/connectwise-screenconnect-23.9.8
author: Jason Rathbun (Blackpoint Cyber)
date: 2024-02-26
tags:
- attack.initial-access
- attack.t1190
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    ParentImage|endswith: '\ScreenConnect.Service.exe'
    Image|endswith:
    - '\cmd.exe'
    - '\csc.exe'
  condition: selection
falsepositives:
- Unlikely
level: high
notes: |
  ### Technical Context
  This Sigma rule is designed to detect potential web shell execution via the ScreenConnect server process, specifically when processes such as `cmd.exe` or `csc.exe` are spawned as child processes of `ScreenConnect.Service.exe`. The rule leverages process creation logs to monitor the parent-child relationship between these executables, which is indicative of malicious activity such as remote access exploitation. When an attacker compromises the ScreenConnect service, they may use command-line tools to execute various commands or scripts, effectively controlling the compromised environment. By recognizing this specific behavior, security teams can swiftly identify and address potential breaches in their network.
  ### Investigation Steps
  - Review process creation logs to confirm instances where `cmd.exe` or `csc.exe` is initiated by `ScreenConnect.Service.exe`. Verify if the command-line arguments suggest suspicious activity.
  - Utilize your EDR tool to analyze associated processes on the host machine for anomalous behavior or unusual parent-child process relationships that could indicate exploitation.
  - Check any network communication logs, particularly for outgoing connections from the affected system, to determine if there's an ongoing data exfiltration attempt or connection to known malicious IPs.
  - Investigate user activity logs to correlate actions taken on the system around the time of the alert, focusing on unauthorized access patterns or accounts that should not have triggered such executions.
