title: Use NTFS Short Name in Image
id: 3ef5605c-9eb9-47b0-9a71-b727e6aa5c3b
related:
- id: dd6b39d9-d9be-4a3b-8fe0-fe3c6a5c1795
  type: similar
status: test
description: Detect use of the Windows 8.3 short name. Which could be used as a method
  to avoid Image based detection
references:
- https://www.acunetix.com/blog/articles/windows-short-8-3-filenames-web-security-problem/
- https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-2000-server/cc959352(v=technet.10)
- https://twitter.com/jonasLyk/status/1555914501802921984
author: frack113, Nasreddine Bencherchali (Nextron Systems)
date: 2022-08-06
modified: 2023-07-20
tags:
- attack.defense-evasion
- attack.t1564.004
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|contains:
    - '~1.bat'
    - '~1.dll'
    - '~1.exe'
    - '~1.hta'
    - '~1.js'
    - '~1.msi'
    - '~1.ps1'
    - '~1.tmp'
    - '~1.vbe'
    - '~1.vbs'
    - '~2.bat'
    - '~2.dll'
    - '~2.exe'
    - '~2.hta'
    - '~2.js'
    - '~2.msi'
    - '~2.ps1'
    - '~2.tmp'
    - '~2.vbe'
    - '~2.vbs'
  filter_main_generic_parent:
    ParentImage: 'C:\Windows\explorer.exe'
  filter_optional_webex:
    ParentImage|endswith: '\WebEx\WebexHost.exe'
  filter_optional_thor:
    ParentImage|endswith: '\thor\thor64.exe'
  filter_optional_winzip:
    Image: 'C:\PROGRA~1\WinZip\WZPREL~1.EXE'
  filter_optional_vcred:
    Image|endswith: '\VCREDI~1.EXE'
  condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
falsepositives:
- Software Installers
level: medium
notes: |
  ### Technical Context
  This detection rule focuses on identifying the use of NTFS short names in Windows environments, specifically targeting the execution of files with names that conform to the 8.3 filename convention. The filenames are typically represented with a tilde (~) followed by a numeral (such as `~1`, `~2`, etc.) and include various file types such as batch scripts, executables, and others. Attackers may utilize these short names to evade detection by security tools that may not properly analyze these filenames. The rule leverages process creation logs collected from Windows systems, filtering for entries where the `Image` field contains the specified short names while ensuring that the process was not initiated by standard parent processes like `explorer.exe` or certain WebEx and Thor executables, which may generate false positives.
  ### Investigation Steps
  - Check the process creation logs for instances of the detected short-named files, correlating them with timestamps to ascertain any suspicious activity around the time of execution.
  - Utilize EDR tools to gather additional contextual information about the parent processes and their behavior at the time the alert was triggered to identify potential malicious intent.
  - Search your AV and NGFW logs for any indications of related malicious behavior or known signatures that could further validate the alert or identify network communications associated with the detected file.
  - Review any proxy logs for outbound HTTP requests made by the detected short-named process, as this may reveal attempts to communicate with command-and-control servers or deliver additional payloads.
