title: Capture Credentials with Rpcping.exe
id: 93671f99-04eb-4ab4-a161-70d446a84003
status: test
description: Detects using Rpcping.exe to send a RPC test connection to the target
  server (-s) and force the NTLM hash to be sent in the process.
references:
- https://lolbas-project.github.io/lolbas/Binaries/Rpcping/
- https://twitter.com/vysecurity/status/974806438316072960
- https://twitter.com/vysecurity/status/873181705024266241
- https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-r2-and-2012/hh875578(v=ws.11)
author: Julia Fomina, oscd.community
date: 2020-10-09
modified: 2024-03-13
tags:
- attack.credential-access
- attack.t1003
logsource:
  category: process_creation
  product: windows
detection:
  use_rpcping:
    Image|endswith: '\rpcping.exe'
  remote_server:
    CommandLine|contains|windash: '-s'
  ntlm_auth:
  - CommandLine|contains|all|windash:
    - '-u'
    - 'NTLM'
  - CommandLine|contains|all|windash:
    - '-t'
    - 'ncacn_np'
  condition: use_rpcping and remote_server and ntlm_auth
falsepositives:
- Unlikely
level: medium
notes: |
  ### Technical Context
  This detection rule is designed to identify potential credential theft activities by monitoring the use of the `Rpcping.exe` tool on Windows systems. Specifically, the rule looks for instances where `Rpcping.exe` is executed with command-line parameters that indicate an attempt to send an NTLM hash to a remote server. Key indicators include the presence of the `-s` switch, which specifies the target server, along with parameters such as `-u` for the user and `NTLM`, which suggests NTLM authentication is being employed. The primary data source for this detection is process creation logs, capturing detailed command-line arguments used during execution.
  Detecting this behavior is critical for security teams, as it can signal malicious attempts to capture and transmit credentials, especially in environments susceptible to NTLM-based attacks. By understanding the execution patterns of `Rpcping.exe`, incident responders can identify and mitigate these risks effectively.
  ### Investigation Steps
  - Review the process creation logs in the EDR tool to find instances of `rpcping.exe` being executed with suspicious command-line arguments, especially those containing `-s`.
  - Cross-reference the timestamps and source of these executions with network logs from the firewall or proxy to see if any outbound connections correspond to the target server specified.
  - Check for any user credentials that match the ones involved in the execution, using authentication logs, to determine whether legitimate actions were performed or if unauthorized access attempts were made.
  - Investigate the context of the execution by analyzing the surrounding activities in the SIEM, including user behavior and access patterns to identify any potential compromise.
