title: PUA - Potential PE Metadata Tamper Using Rcedit
id: 0c92f2e6-f08f-4b73-9216-ecb0ca634689
status: test
description: Detects the use of rcedit to potentially alter executable PE metadata
  properties, which could conceal efforts to rename system utilities for defense evasion.
references:
- https://security.stackexchange.com/questions/210843/is-it-possible-to-change-original-filename-of-an-exe
- https://www.virustotal.com/gui/file/02e8e8c5d430d8b768980f517b62d7792d690982b9ba0f7e04163cbc1a6e7915
- https://github.com/electron/rcedit
author: Micah Babinski
date: 2022-12-11
modified: 2023-03-05
tags:
- attack.defense-evasion
- attack.t1036.003
- attack.t1036
- attack.t1027.005
- attack.t1027
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith:
    - '\rcedit-x64.exe'
    - '\rcedit-x86.exe'
  - Description: 'Edit resources of exe'
  - Product: 'rcedit'
  selection_flags:
    CommandLine|contains: '--set-'     # Covers multiple edit commands such as "--set-resource-string" or "--set-version-string"
  selection_attributes:
    CommandLine|contains:
    - 'OriginalFileName'
    - 'CompanyName'
    - 'FileDescription'
    - 'ProductName'
    - 'ProductVersion'
    - 'LegalCopyright'
  condition: all of selection_*
falsepositives:
- Legitimate use of the tool by administrators or users to update metadata of a binary
level: medium
notes: |
  ### Technical Context
  This Sigma rule detects potential attempts to tamper with Portable Executable (PE) metadata on Windows systems using the tool `rcedit`. The rule specifically looks for instances where `rcedit` is invoked with command-line parameters that pertain to editing critical executable properties, such as the original file name, company name, or product version. The rule examines process creation logs to identify when the rcedit executable, either the x64 or x86 version, is run with specific flags indicating a modification of PE metadata. This activity could indicate a defense evasion tactic where a malicious actor might be trying to obscure the true identity of a binary by changing its metadata, potentially allowing them to evade detection by security solutions.
  ### Investigation Steps
  - Review the process creation logs in the EDR solution to identify instances where `rcedit` was executed, paying close attention to the command-line arguments used.
  - Cross-reference the detected activity with the legitimate use cases, such as administrative tasks, by checking historical logs or known task schedules.
  - Analyze related file activity to understand the origin and behavior of the modified executable, looking for any anomaly or further suspicious activity associated with it.
  - Investigate network traffic through the NDR or Proxy logs to identify if the modified executable has attempted to connect to known malicious destinations or conducted unusual communications.
