title: Renamed AdFind Execution
id: df55196f-f105-44d3-a675-e9dfb6cc2f2b
status: test
description: Detects the use of a renamed Adfind.exe. AdFind continues to be seen
  across majority of breaches. It is used to domain trust discovery to plan out subsequent
  steps in the attack chain.
references:
- https://www.joeware.net/freetools/tools/adfind/
- https://thedfirreport.com/2020/05/08/adfind-recon/
- https://thedfirreport.com/2021/01/11/trickbot-still-alive-and-well/
- https://www.microsoft.com/security/blog/2021/01/20/deep-dive-into-the-solorigate-second-stage-activation-from-sunburst-to-teardrop-and-raindrop/
- https://social.technet.microsoft.com/wiki/contents/articles/7535.adfind-command-examples.aspx
- https://github.com/center-for-threat-informed-defense/adversary_emulation_library/blob/bf62ece1c679b07b5fb49c4bae947fe24c81811f/fin6/Emulation_Plan/Phase1.md
author: Florian Roth (Nextron Systems)
date: 2022-08-21
modified: 2024-11-23
tags:
- attack.discovery
- attack.t1018
- attack.t1087.002
- attack.t1482
- attack.t1069.002
logsource:
  category: process_creation
  product: windows
detection:
  selection_1:
    CommandLine|contains:
    - 'domainlist'
    - 'trustdmp'
    - 'dcmodes'
    - 'adinfo'
    - ' dclist '
    - 'computer_pwdnotreqd'
    - 'objectcategory='
    - '-subnets -f'
    - 'name="Domain Admins"'
    - '-sc u:'
    - 'domainncs'
    - 'dompol'
    - ' oudmp '
    - 'subnetdmp'
    - 'gpodmp'
    - 'fspdmp'
    - 'users_noexpire'
    - 'computers_active'
    - 'computers_pwdnotreqd'
  selection_2:
    Hashes|contains:
    - 'IMPHASH=BCA5675746D13A1F246E2DA3C2217492'
    - 'IMPHASH=53E117A96057EAF19C41380D0E87F1C2'
  selection_3:
    OriginalFileName: 'AdFind.exe'
  filter:
    Image|endswith: '\AdFind.exe'
  condition: 1 of selection* and not filter
falsepositives:
- Unknown
level: high
notes: |
  n
  ### Technical Context
  The "Renamed AdFind Execution" detection rule is designed to identify the execution of renamed instances of AdFind.exe, a reconnaissance tool commonly used by attackers to gather information about Active Directory environments. By analyzing the command-line parameters associated with newly created processes, this rule specifically targets common AdFind usage patterns, such as queries related to domain trusts and user account information. The rule utilizes process creation logs, focusing on critical attributes such as command-line arguments and file hashes to determine if the process is a legitimate instance of AdFind or a potentially malicious variant. The associated MITRE ATT&CK techniques include T1018 (Windows Remote Administration Tools) and T1087.002 (Account Discovery: Domain Account), among others, highlighting the relevance of this detection in identifying reconnaissance activities involved in the early stages of an attack.
  ### Investigation Steps
  - **Check Process Creation Logs:** Examine the Windows Event Logs for process creation events related to AdFind.exe, noting the command-line arguments to discern if they align with known reconnaissance behaviors.
  - **Review Hash Values:** Use EDR tools to check the file hashes of the detected process against the known malicious hashes to determine if the execution is from a legitimate source or a modified version.
  - **Analyze Network Activity:** Inspect network logs for any outbound connections initiated by the AdFind process that may indicate further reconnaissance or data exfiltration activities.
  - **Audit User Activities:** Look into the user's account logs to see if there were any unusual logins or activities coinciding with the execution of the detected AdFind process, which could suggest credential theft or misuse.
  ### Prioritization
  This alert is considered high severity given that the execution of a renamed AdFind.exe indicates potential malicious reconnaissance activity, which could precede more severe attacks like lateral movement or privilege escalation.
  ### Blind Spots and Assumptions
  This rule may not fire if an attacker uses a completely different executable or if the original AdFind.exe is executed without renaming. Additionally, if the command-line parameters deviate from the known patterns in the detection criteria or if log collection is misconfigured, important events may be missed. It is also assumed that the presence of AdFind.exe is not legitimate as part of standard administrative functions, which may lead to possible false positives.
  > **Disclaimer:** This investigation guide was created using generative AI technology and has not been reviewed for its accuracy and relevance. While every effort has been made to ensure its quality, we recommend validating the content and adapting it to suit specific environment and operational needs. Please communicate any changes to the detection engineering team.
