title: Disable Important Scheduled Task
id: 9ac94dc8-9042-493c-ba45-3b5e7c86b980
related:
- id: 7595ba94-cf3b-4471-aa03-4f6baa9e5fad     # Security-Audting Eventlog
  type: similar
status: test
description: Detects when adversaries stop services or processes by disabling their
  respective scheduled tasks in order to conduct data destructive activities
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1490/T1490.md#atomic-test-8---windows---disable-the-sr-scheduled-task
- https://twitter.com/MichalKoczwara/status/1553634816016498688
- https://thedfirreport.com/2021/10/18/icedid-to-xinglocker-ransomware-in-24-hours/
author: frack113, Nasreddine Bencherchali (Nextron Systems), X__Junior
date: 2021-12-26
modified: 2024-08-25
tags:
- attack.impact
- attack.t1489
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith: '\schtasks.exe'
    CommandLine|contains|all:
    - '/Change'
    - '/TN'
    - '/disable'
    CommandLine|contains:
            # Add more important tasks
    - '\Windows\BitLocker'
    - '\Windows\ExploitGuard'
    - '\Windows\ExploitGuard\ExploitGuard MDM policy Refresh'
    - '\Windows\SystemRestore\SR'
    - '\Windows\UpdateOrchestrator\'
    - '\Windows\Windows Defender\'
    - '\Windows\WindowsBackup\'
    - '\Windows\WindowsUpdate\'
  condition: selection
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This detection rule is designed to identify potentially malicious activity where an adversary disables important scheduled tasks on a Windows system. Specifically, the rule triggers when the `schtasks.exe` process is executed with specific command-line parameters indicating that a scheduled task is being altered or disabled. The command-line must include `/Change`, `/TN`, and `/disable`, along with references to critical system tasks such as those related to BitLocker, Windows Defender, or System Restore. By monitoring such alterations, the rule helps to reveal potential adversaries conducting data-destructive activities or preparing for unauthorized access by disabling system protections.
  The primary data sources that feed into this rule include Windows process creation logs, which capture the invocation of processes and their associated command-line arguments. Monitoring such data allows the detection of actions that could lead to security breaches or system vulnerabilities.
  ### Investigation Steps
  - Review the process creation logs in your EDR solution to identify the instances of `schtasks.exe` along with their command-line parameters for the detected alerts.
  - Examine the timeline of when the scheduled tasks were disabled, and correlate this with other security events in the SIEM to assess if it aligns with any known malicious or suspicious activities.
  - Check for any associated network traffic using the NDR to identify if there were external communications initiated around the time the task was disabled.
  - Verify the integrity and status of the disabled tasks through system logs or directly on the affected system to understand the potential implications of this change on security controls.
