title: Shadow Copies Deletion Using Operating Systems Utilities
id: c947b146-0abc-4c87-9c64-b17e9d7274a2
status: stable
description: Shadow Copies deletion using operating systems utilities
references:
- https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment
- https://blog.talosintelligence.com/2017/05/wannacry.html
- https://securingtomorrow.mcafee.com/other-blogs/mcafee-labs/new-teslacrypt-ransomware-arrives-via-spam/
- https://www.bleepingcomputer.com/news/security/why-everyone-should-disable-vssadmin-exe-now/
- https://www.hybrid-analysis.com/sample/ed01ebfbc9eb5bbea545af4d01bf5f1071661840480439c6e5babe8e080e41aa?environmentId=100
- https://github.com/Neo23x0/Raccine#the-process
- https://github.com/Neo23x0/Raccine/blob/20a569fa21625086433dcce8bb2765d0ea08dcb6/yara/gen_ransomware_command_lines.yar
- https://redcanary.com/blog/intelligence-insights-october-2021/
- https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/blackbyte-exbyte-ransomware
author: Florian Roth (Nextron Systems), Michael Haag, Teymur Kheirkhabarov, Daniil
  Yugoslavskiy, oscd.community, Andreas Hunkeler (@Karneades)
date: 2019-10-22
modified: 2022-11-03
tags:
- attack.defense-evasion
- attack.impact
- attack.t1070
- attack.t1490
logsource:
  category: process_creation
  product: windows
detection:
  selection1_img:
  - Image|endswith:
    - '\powershell.exe'
    - '\pwsh.exe'
    - '\wmic.exe'
    - '\vssadmin.exe'
    - '\diskshadow.exe'
  - OriginalFileName:
    - 'PowerShell.EXE'
    - 'pwsh.dll'
    - 'wmic.exe'
    - 'VSSADMIN.EXE'
    - 'diskshadow.exe'
  selection1_cli:
    CommandLine|contains|all:
    - 'shadow'          # will match "delete shadows" and "shadowcopy delete" and "shadowstorage"
    - 'delete'
  selection2_img:
  - Image|endswith: '\wbadmin.exe'
  - OriginalFileName: 'WBADMIN.EXE'
  selection2_cli:
    CommandLine|contains|all:
    - 'delete'
    - 'catalog'
    - 'quiet'         # will match -quiet or /quiet
  selection3_img:
  - Image|endswith: '\vssadmin.exe'
  - OriginalFileName: 'VSSADMIN.EXE'
  selection3_cli:
    CommandLine|contains|all:
    - 'resize'
    - 'shadowstorage'
    CommandLine|contains:
    - 'unbounded'
    - '/MaxSize='
  condition: (all of selection1*) or (all of selection2*) or (all of selection3*)
fields:
- CommandLine
- ParentCommandLine
falsepositives:
- Legitimate Administrator deletes Shadow Copies using operating systems utilities
  for legitimate reason
- LANDesk LDClient Ivanti-PSModule (PS EncodedCommand)
level: high
notes: |
  n
  ### Technical Context
  This Sigma rule is designed to detect attempts to delete Windows Shadow Copies using various operating system utilities. Specifically, it monitors process creation events to capture executions of tools such as `powershell.exe`, `wmic.exe`, `vssadmin.exe`, `diskshadow.exe`, and `wbadmin.exe`, when they include command-line arguments indicating a deletion action (e.g., "delete shadows", "shadowstorage", "resize shadowstorage"). The rule effectively highlights activities that could signify a malicious actor’s intent to erase backup copies of data, which is a common tactic used in ransomware attacks. By leveraging Windows process creation logs, analysts can identify and investigate instances of these command-line executions.
  This detection is associated with the MITRE ATT&CK framework under the tactic of "Defense Evasion" (T1070) and "Impact" (T1490), which denotes actions taken by adversaries to erase or modify backup mechanisms to impede recovery efforts.
  ### Investigation Steps
  - **Review Process Creation Logs:** Examine process creation logs for entries matching the specified image names and command lines that indicate shadow copy deletions from Sysmon or Windows Event Logs.
    
  - **Correlate with EDR Alerts:** Utilize EDR tools to query the endpoint for any unusual or unauthorized executions of the identified utilities, particularly focusing on the parent commands to trace the origin of the command.
  - **Analyze User Context:** Investigate the user account associated with the relevant process execution to determine if it was a legitimate administrative action or if it was initiated by a potentially compromised account.
  - **Check for Ransomware Indicators:** Conduct a search for associated suspicious indicators or related alerts in other security layers such as AV logs or network traffic to identify broader attack patterns.
  ### Prioritization
  Given the potential for severe data loss and disruption of business operations, the alert is categorized as high severity. Immediate investigation is warranted, as the deletion of Shadow Copies can significantly hinder data recovery efforts during a ransomware incident.
  ### Blind Spots and Assumptions
  This rule may not fire if legitimate shadow copy deletions are made by authorized personnel, which could lead to false positives. Additionally, if an adversary uses obfuscation techniques or runs the commands through other non-monitored scripts or interfaces, detection may be evaded. It's also assumed that the telemetry from Sysmon is properly implemented and functioning on all relevant hosts. If Sysmon is not consistently deployed across the environment, detection capabilities will be limited.
  > **Disclaimer:** This investigation guide was created using generative AI technology and has not been reviewed for its accuracy and relevance. While every effort has been made to ensure its quality, we recommend validating the content and adapting it to suit specific environment and operational needs. Please communicate any changes to the detection engineering team.
