title: New Root Certificate Installed Via CertMgr.EXE
id: ff992eac-6449-4c60-8c1d-91c9722a1d48
related:
- id: 42821614-9264-4761-acfc-5772c3286f76
  type: derived
- id: 46591fae-7a4c-46ea-aec3-dff5e6d785dc
  type: obsolete
status: test
description: |
  Detects execution of "certmgr" with the "add" flag in order to install a new certificate on the system.
  Adversaries may install a root certificate on a compromised system to avoid warnings when connecting to adversary controlled web servers.
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1553.004/T1553.004.md
- https://securelist.com/to-crypt-or-to-mine-that-is-the-question/86307/
author: oscd.community, @redcanary, Zach Stanford @svch0st
date: 2023-03-05
tags:
- attack.defense-evasion
- attack.t1553.004
logsource:
  category: process_creation
  product: windows
detection:
    # Example: CertMgr.exe /add CertificateFileName.cer /s /r localMachine root /all
  selection_img:
  - Image|endswith: '\CertMgr.exe'
  - OriginalFileName: 'CERTMGT.EXE'
  selection_cli:
    CommandLine|contains|all:
    - '/add'
    - 'root'
  condition: all of selection_*
falsepositives:
- Help Desk or IT may need to manually add a corporate Root CA on occasion. Need to
  test if GPO push doesn't trigger FP
level: medium
notes: |
  ### Technical Context
  The detection rule "New Root Certificate Installed Via CertMgr.EXE" identifies potential malicious activity related to the installation of root certificates on Windows systems. Specifically, it looks for instances where the `CertMgr.exe` utility is executed with parameters indicating the addition of a new root certificate. The presence of a root certificate can allow an attacker to manipulate secure connections by eliminating warning messages and enabling interception of encrypted communications. The rule sources its data from process creation logs and command-line arguments, specifically targeting when `CertMgr.exe` is invoked with the `/add` flag along with the 'root' parameter, flagging potential misuse of this tool typically used for legitimate administrative purposes.
  ### Investigation Steps
  - Review the associated process creation logs in the EDR solution to confirm the execution of `CertMgr.exe` with the specified parameters, noting the user and time of execution.
  - Check for other recent installations of root certificates by querying system certificate stores, which can be done through the Windows Certificate Manager or relevant PowerShell commands.
  - Investigate the context of the activity by examining network traffic logs in the NDR and NGFW to see if any connections were made to suspicious or unauthorized IP addresses around the time of certificate installation.
  - Consult AV logs for any alerts or detections that may correlate with the execution of `CertMgr.exe`, indicating potential malware activity that could have exploited the installation of a root certificate.
