title: CodePage Modification Via MODE.COM To Russian Language
id: 12fbff88-16b5-4b42-9754-cd001a789fb3
related:
- id: d48c5ffa-3b02-4c0f-9a9e-3c275650dd0e
  type: derived
status: test
description: |
  Detects a CodePage modification using the "mode.com" utility to Russian language.
  This behavior has been used by threat actors behind Dharma ransomware.
references:
- https://learn.microsoft.com/en-us/windows/win32/intl/code-page-identifiers
- https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/mode
- https://strontic.github.io/xcyclopedia/library/mode.com-59D1ED51ACB8C3D50F1306FD75F20E99.html
- https://www.virustotal.com/gui/file/5e75ef02517afd6e8ba6462b19217dc4a5a574abb33d10eb0f2bab49d8d48c22/behavior
author: Joseliyo Sanchez, @Joseliyo_Jstnk
date: 2024-01-17
tags:
- attack.defense-evasion
- attack.t1036
logsource:
  category: process_creation
  product: windows
detection:
    # VT Query: behavior:"mode con cp select=1251"
    # VT Query: behavior:"mode con cp select=866"
  selection_img:
  - Image|endswith: '\mode.com'
  - OriginalFileName: 'MODE.COM'
  selection_cli:
    CommandLine|contains|all:
    - ' con '
    - ' cp '
    - ' select='
    CommandLine|endswith:
    - '=1251'         # ANSI Cyrillic; Cyrillic (Windows) - Observed ITW by Dharma ransomware
    - '=866'         # OEM Russian; Cyrillic (DOS) - Observed ITW by other malware
  condition: all of selection_*
falsepositives:
- Russian speaking people changing the CodePage
level: medium
notes: |
  ### Technical Context
  This Sigma rule is designed to detect a modification of the code page on Windows systems via the `mode.com` utility, specifically targeting the settings that switch the code page to Russian language. The rule focuses on process creation logs, looking for instances where `mode.com` is executed with command line arguments indicating a change to code pages 1251 (ANSI Cyrillic) or 866 (OEM Russian). The identification of this behavior is critical as threat actors, such as those behind the Dharma ransomware, have exploited this technique to obfuscate their operations or manipulate system behavior to evade detection. Consequently, monitoring for such command-line activities is vital for early threat identification and response.
  ### Investigation Steps
  - Review the process creation logs in your EDR tool to identify instances of `mode.com` being invoked with the specified command-line arguments related to code page modification.
  - Cross-reference the timeline of the detected `mode.com` execution with other suspicious activities in the environment, such as unexpected file modifications or access patterns.
  - Analyze endpoint logs or alerts from your antivirus/endpoint protection solution to check for subsequent malware behaviors linked to the detected code page change.
  - Query network traffic logs from your NDR or Proxy solutions to monitor for unusual connections to known malicious domains or IP addresses following the time of the code page modification.
