title: Uncommon Child Processes Of SndVol.exe
id: ba42babc-0666-4393-a4f7-ceaf5a69191e
status: test
description: Detects potentially uncommon child processes of SndVol.exe (the Windows
  volume mixer)
references:
- https://twitter.com/Max_Mal_/status/1661322732456353792
author: X__Junior (Nextron Systems)
date: 2023-06-09
tags:
- attack.execution
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    ParentImage|endswith: '\SndVol.exe'
  filter_main_rundll32:
    Image|endswith: '\rundll32.exe'
    CommandLine|contains: ' shell32.dll,Control_RunDLL '
  condition: selection and not 1 of filter_main_*
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  The Sigma rule titled "Uncommon Child Processes Of SndVol.exe" is designed to detect potentially malicious or uncommon child processes spawned by the Windows volume mixer executable, `SndVol.exe`. This rule identifies instances where `SndVol.exe` is acting as a parent process and monitors the creation of child processes that are unusual or not typically associated with it. The specific criteria focus on filtering down to child processes that invoke `rundll32.exe` with a command line argument referring to `shell32.dll,Control_RunDLL`, which may indicate suspicious activity. The primary technical data sources utilized include process creation logs, which provide insights into parent-child relationships between processes, as well as command-line parameters that offer context about how specific executables are being invoked.
  ### Investigation Steps
  - Review the process creation logs using the EDR tool to identify instances of `SndVol.exe` and its child processes. Pay particular attention to any child processes that are not typical for audio management tasks. 
  - Examine the command-line arguments of any detected `rundll32.exe` instances associated with `SndVol.exe`. Look for unexpected or suspicious commands that may indicate an attempt to perform unauthorized actions.
  - Check the execution time and user context of the alerts in the SIEM to understand the environment and potential targets of the activity. Note anomalies such as execution during unusual hours or from unexpected user accounts. 
  - Conduct a forensic examination of the detected processes and their parent-child relationships, utilizing the AV and threat intelligence platforms to assess any known indicators of compromises or related threats.
