title: Rar Usage with Password and Compression Level
id: faa48cae-6b25-4f00-a094-08947fef582f
status: test
description: Detects the use of rar.exe, on the command line, to create an archive
  with password protection or with a specific compression level. This is pretty indicative
  of malicious actions.
references:
- https://labs.sentinelone.com/the-anatomy-of-an-apt-attack-and-cobaltstrike-beacons-encoded-configuration/
- https://ss64.com/bash/rar.html
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1560.001/T1560.001.md
author: '@ROxPinTeddy'
date: 2020-05-12
modified: 2022-03-16
tags:
- attack.collection
- attack.t1560.001
logsource:
  category: process_creation
  product: windows
detection:
  selection_password:
    CommandLine|contains: ' -hp'
  selection_other:
    CommandLine|contains:
    - ' -m'
    - ' a '
  condition: selection_password and selection_other
falsepositives:
- Legitimate use of Winrar command line version
- Other command line tools, that use these flags
level: high
notes: |
  ### Technical Context
  This detection rule focuses on identifying potentially malicious behavior associated with the command line usage of `rar.exe`, a file archiving utility, specifically looking for instances where the tool is used to create encrypted archives or employs specific compression levels. The rule categorizes these suspicious activities based on the presence of command-line parameters that indicate password protection (e.g., `-hp`) and relevant compression settings (e.g., `-m` for mode specification). These patterns can suggest attempts to obfuscate sensitive data, leading to data exfiltration or preparation of payloads.
  To effectively implement this detection, the rule leverages process creation logs generated by Windows systems, monitoring command-line invocations for the specified parameters. Given that legitimate users may also utilize these flags for valid purposes, the rule has a high false positive rate, necessitating thorough investigation upon triggering.
  ### Investigation Steps
  - Review the command-line arguments of the triggered event in the EDR tool, focusing on the use of `rar.exe` and the presence of `-hp` and `-m` flags. Determine if legitimate processes might be responsible for the command execution.
  - Analyze the user account associated with the process creation in the SIEM logs to assess if the user has a history of executing such commands or if there is unusual activity around that account.
  - Check for any related network activity in the NDR data. Investigate if there were any abnormal outbound connections immediately following the archive creation that may indicate exfiltration attempts.
  - Inspect the file system for any newly created .rar files in proximity to the event, including their size and modification timestamps, to assess if any sensitive data was archived and potentially exfiltrated.
