title: Remote Access Tool - ScreenConnect Execution
id: 57bff678-25d1-4d6c-8211-8ca106d12053
status: test
description: |
  An adversary may use legitimate desktop support and remote access software, such as Team Viewer, Go2Assist, LogMein, AmmyyAdmin, etc, to establish an interactive command and control channel to target systems within networks.
  These services are commonly used as legitimate technical support software, and may be allowed by application control within a target environment.
  Remote access tools like VNC, Ammyy, and Teamviewer are used frequently when compared with other legitimate software commonly used by adversaries. (Citation: Symantec Living off the Land)
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1219/T1219.md#atomic-test-5---screenconnect-application-download-and-install-on-windows
author: frack113
date: 2022-02-13
modified: 2023-03-05
tags:
- attack.command-and-control
- attack.t1219
logsource:
  category: process_creation
  product: windows
detection:
  selection:
  - Description: 'ScreenConnect Service'
  - Product: 'ScreenConnect'
  - Company: 'ScreenConnect Software'
  condition: selection
falsepositives:
- Legitimate usage of the tool
level: medium
notes: |
  ### Technical Context
  This Sigma rule detects the execution of the ScreenConnect remote access software, which can be exploited by adversaries to establish an interactive command and control (C2) channel within target environments. The rule focuses on analyzing process creation logs that contain specific attributes associated with ScreenConnect, such as its product name and description. Given that ScreenConnect is commonly used for legitimate desktop support, it may not be flagged by traditional security measures, allowing threat actors to operate undetected. Detecting this activity is crucial for identifying potentially malicious use of a legitimate remote access tool, which can indicate a compromise or an ongoing attack.
  ### Investigation Steps
  - Review the process creation logs in your EDR to identify instances of ScreenConnect execution, checking for the specific product and description values related to the rule.
  - Cross-reference the identified ScreenConnect execution events with user activity logs to determine if the usage aligns with legitimate business processes.
  - Utilize network logs from your NDR to assess any outbound connections initiated by ScreenConnect and look for unusual IP addresses that may indicate C2 communications.
  - Investigate any related logs from the firewall or proxy to enhance context, specifically looking for unusual traffic patterns or data exfiltration attempts tied to the identified ScreenConnect sessions.
