title: Registry Modification Via Regini.EXE
id: 5f60740a-f57b-4e76-82a1-15b6ff2cb134
related:
- id: 77946e79-97f1-45a2-84b4-f37b5c0d8682
  type: derived
status: test
description: Detects the execution of regini.exe which can be used to modify registry
  keys, the changes are imported from one or more text files.
references:
- https://lolbas-project.github.io/lolbas/Binaries/Regini/
- https://gist.github.com/api0cradle/cdd2d0d0ec9abb686f0e89306e277b8f
- https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/regini
author: Eli Salem, Sander Wiebing, oscd.community
date: 2020-10-08
modified: 2023-02-08
tags:
- attack.t1112
- attack.defense-evasion
logsource:
  category: process_creation
  product: windows
detection:
  selection:
  - Image|endswith: '\regini.exe'
  - OriginalFileName: 'REGINI.EXE'
  filter:
    CommandLine|re: ':[^ \\]'     # Covered in 77946e79-97f1-45a2-84b4-f37b5c0d8682
  condition: selection and not filter
fields:
- ParentImage
- CommandLine
falsepositives:
- Legitimate modification of keys
level: low
notes: |
  ### Technical Context
  The Sigma rule titled "Registry Modification Via Regini.EXE" is designed to detect the execution of `regini.exe`, a legitimate Windows command-line tool that modifies registry keys based on the provided instructions from text files. The rule focuses on identifying instances where `regini.exe` is invoked, particularly looking at the process creation logs to ascertain its execution parameters, such as the command-line arguments. By filtering for specific command-line patterns, the rule discerns potentially malicious activity while accounting for legitimate use cases, which helps mitigate false positives. The technical data sources involved primarily include process creation logs that record details such as the executable's path, original file name, and associated command-line parameters.
  ### Investigation Steps
  - Utilize EDR tools to search for any instances of `regini.exe` execution, paying close attention to the command-line arguments provided during execution.
  - Review related process tree information to identify the parent processes that spawned `regini.exe`, which could provide context regarding the legitimacy of the modification.
  - Check Windows registry logs using the SIEM to identify any recent registry changes made by this tool, correlating them with the times captured in the alert.
  - Analyze proxy and VPN logs for any unusual outbound connections or data exfiltration that may have occurred after the execution of `regini.exe`.
