title: Suspicious Child Process Of SQL Server
id: 869b9ca7-9ea2-4a5a-8325-e80e62f75445
related:
- id: 344482e4-a477-436c-aa70-7536d18a48c7
  type: obsolete
status: test
description: Detects suspicious child processes of the SQLServer process. This could
  indicate potential RCE or SQL Injection.
references:
- Internal Research
author: FPT.EagleEye Team, wagga
date: 2020-12-11
modified: 2023-05-04
tags:
- attack.t1505.003
- attack.t1190
- attack.initial-access
- attack.persistence
- attack.privilege-escalation
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    ParentImage|endswith: '\sqlservr.exe'
    Image|endswith:
            # You can add other uncommon or suspicious processes
    - '\bash.exe'
    - '\bitsadmin.exe'
    - '\cmd.exe'
    - '\netstat.exe'
    - '\nltest.exe'
    - '\ping.exe'
    - '\powershell.exe'
    - '\pwsh.exe'
    - '\regsvr32.exe'
    - '\rundll32.exe'
    - '\sh.exe'
    - '\systeminfo.exe'
    - '\tasklist.exe'
    - '\wsl.exe'
  filter_optional_datev:
    ParentImage|startswith: 'C:\Program Files\Microsoft SQL Server\'
    ParentImage|endswith: 'DATEV_DBENGINE\MSSQL\Binn\sqlservr.exe'
    Image: 'C:\Windows\System32\cmd.exe'
    CommandLine|startswith: '"C:\Windows\system32\cmd.exe" '
  condition: selection and not 1 of filter_optional_*
level: high
notes: |
  ### Technical Context
  The "Suspicious Child Process Of SQL Server" Sigma rule is designed to identify potentially malicious activity surrounding the SQL Server process (`sqlservr.exe`). This rule looks for child processes that are spawned by `sqlservr.exe`, particularly focusing on commonly abused executables that could facilitate remote code execution (RCE) or SQL injection attacks. It specifically flags child processes such as `cmd.exe`, `powershell.exe`, and others that are often misused by attackers to execute arbitrary commands or scripts. The log data primarily relies on the process creation events collected from Windows systems, enabling the detection of suspicious parent-child process relationships in the execution timeline.
  ### Investigation Steps
  - Review the process creation logs in your EDR solution to identify the specific execution paths of the child processes triggered by `sqlservr.exe`.
  - Analyze the command-line parameters of the flagged child processes for any unusual or suspicious commands that could indicate exploitation attempts.
  - Check the timeline of process creation for any signs of lateral movement or additional suspicious activities associated with the IP address of the server running SQL Server.
  - Cross-reference any identified alert with network activity logs from your NDR and Firewall to identify any potentially malicious external connections or data exfiltration attempts.
