title: Remote Access Tool - Anydesk Execution From Suspicious Folder
id: 065b00ca-5d5c-4557-ac95-64a6d0b64d86
related:
- id: b52e84a3-029e-4529-b09b-71d19dd27e94
  type: similar
status: test
description: |
  An adversary may use legitimate desktop support and remote access software, such as Team Viewer, Go2Assist, LogMein, AmmyyAdmin, etc, to establish an interactive command and control channel to target systems within networks.
  These services are commonly used as legitimate technical support software, and may be allowed by application control within a target environment.
  Remote access tools like VNC, Ammyy, and Teamviewer are used frequently when compared with other legitimate software commonly used by adversaries. (Citation: Symantec Living off the Land)
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1219/T1219.md#atomic-test-2---anydesk-files-detected-test-on-windows
- https://thedfirreport.com/2025/02/24/confluence-exploit-leads-to-lockbit-ransomware/
author: Florian Roth (Nextron Systems)
date: 2022-05-20
modified: 2025-02-24
tags:
- attack.command-and-control
- attack.t1219
logsource:
  category: process_creation
  product: windows
detection:
  selection:
  - Image|endswith:
    - '\AnyDesk.exe'
    - '\AnyDeskMSI.exe'
  - Description: AnyDesk
  - Product: AnyDesk
  - Company: AnyDesk Software GmbH
  filter:
    Image|contains:
    - '\AppData\'
    - 'Program Files (x86)\AnyDesk'
    - 'Program Files\AnyDesk'
  condition: selection and not filter
falsepositives:
- Legitimate use of AnyDesk from a non-standard folder
level: high
notes: |
  ### Technical Context
  This Sigma detection rule targets the execution of the remote access tool AnyDesk from suspicious or uncommon directories. It specifically looks for process creation logs where the executable filename ends with 'AnyDesk.exe' or 'AnyDeskMSI.exe'. The rule focuses on identifying instances where the process description, product, and company name match known parameters of AnyDesk, while also filtering out executions that occur from standard installation paths such as 'Program Files' or 'AppData'. By monitoring such behavior, the rule helps to flag potentially malicious instances of AnyDesk launching from unexpected locations, indicating a possible step in a command and control (C2) attack where adversaries leverage legitimate tools for unauthorized remote access.
  ### Investigation Steps
  - Review the relevant process creation logs in the EDR tool to identify instances of AnyDesk execution from non-standard directories, focusing on timestamps and associated user accounts.
  - Correlate the detected activity with firewall and proxy logs to investigate any outbound connections initiated by AnyDesk, noting any unusual destinations or data exfiltration attempts.
  - Conduct a malware scan on the involved systems using the AV solution to check for any malicious artifacts that may accompany the unauthorized execution of AnyDesk.
  - Analyze user behavior and access patterns within cloud platforms (e.g., AWS, GCP) to determine if any compromised accounts or unexpected access permissions were exploited during the incident.
