title: UAC Bypass Using Disk Cleanup
id: b697e69c-746f-4a86-9f59-7bfff8eab881
status: test
description: Detects the pattern of UAC Bypass using scheduled tasks and variable
  expansion of cleanmgr.exe (UACMe 34)
references:
- https://github.com/hfiref0x/UACME
author: Christian Burkard (Nextron Systems)
date: 2021-08-30
modified: 2024-12-01
tags:
- attack.defense-evasion
- attack.privilege-escalation
- attack.t1548.002
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|endswith: '"\system32\cleanmgr.exe /autoclean /d C:'
    ParentCommandLine: 'C:\Windows\system32\svchost.exe -k netsvcs -p -s Schedule'
    IntegrityLevel:
    - 'High'
    - 'System'
    - 'S-1-16-16384'         # System
    - 'S-1-16-12288'         # High
  condition: selection
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This Sigma rule identifies instances of User Account Control (UAC) bypass techniques utilizing the Disk Cleanup utility (`cleanmgr.exe`). The detection mechanism looks for specific command-line patterns indicating that `cleanmgr.exe` is executed with parameters suggesting elevated privilege actions, associated with a parent process typically used for scheduled tasks (`svchost.exe`). The combination of high or system integrity levels and the command line ending with `/autoclean /d C:` suggests a potential unauthorized elevation of privileges aimed at bypassing UAC protections. The key data sources employed for this detection are process creation logs, which capture details about processes initiated on the system, along with their command-line parameters and parent-child process relationships.
  ### Investigation Steps
  - Review the EDR logs for any instances of `cleanmgr.exe` being executed with the specified command-line parameters and note the time and user context of the event.
  - Check the parent process involved (`svchost.exe`) to determine if it is operating normally and investigate any anomalies in its execution, including unusual command-line arguments or behavior.
  - Utilize the SIEM to correlate this alert with other logs around the same time to identify any additional suspicious activities or patterns of behavior that may indicate a broader attack.
  - Assess the integrity level of the processes involved by examining system logs to ensure that no unauthorized changes were made to the security context of the processes or the system settings.
