title: Cloudflared Tunnel Connections Cleanup
id: 7050bba1-1aed-454e-8f73-3f46f09ce56a
status: test
description: Detects execution of the "cloudflared" tool with the tunnel "cleanup"
  flag in order to cleanup tunnel connections.
references:
- https://github.com/cloudflare/cloudflared
- https://developers.cloudflare.com/cloudflare-one/connections/connect-apps
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023-05-17
modified: 2023-12-21
tags:
- attack.command-and-control
- attack.t1102
- attack.t1090
- attack.t1572
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|contains|all:
    - ' tunnel '
    - 'cleanup '
    CommandLine|contains:
    - '-config '
    - '-connector-id '
  condition: selection
falsepositives:
- Legitimate usage of Cloudflared.
level: medium
notes: |
  ### Technical Context
  This detection rule identifies instances of the "cloudflared" tool, particularly when it is executed with the "tunnel cleanup" command. The command is typically used to clean up existing tunnel connections within a Cloudflare environment, which can be indicative of both legitimate and potentially malicious behavior. The rule monitors process creation logs specifically targeting Windows systems and looks for command-line arguments that suggest a cleanup operation, in combination with other parameters such as `-config` or `-connector-id`. By focusing on these details, the rule aims to help security analysts pinpoint unusual or unauthorized use of the cloudflared tool, which could signify command-and-control activities or rogue tunneling attempts.
  ### Investigation Steps
  - Check the EDR logs for additional contextual information around the execution of cloudflared, including the user account and the timestamp of the process creation.
  - Review network traffic logs from the NGFW to identify any unusual outgoing connections that may align with the specific cloudflared tunnel activity.
  - Analyze command-line parameters used in conjunction with the cloudflared process to determine whether legitimate configurations are being employed or if they appear suspicious.
  - Investigate any associated alerts in the SIEM that may indicate prior related activities or known malicious patterns to get a broader understanding of the potential threat landscape.
