title: PUA - Rclone Execution
id: e37db05d-d1f9-49c8-b464-cee1a4b11638
related:
- id: a0d63692-a531-4912-ad39-4393325b2a9c
  type: obsolete
- id: cb7286ba-f207-44ab-b9e6-760d82b84253
  type: obsolete
status: test
description: Detects execution of RClone utility for exfiltration as used by various
  ransomwares strains like REvil, Conti, FiveHands, etc
references:
- https://research.nccgroup.com/2021/05/27/detecting-rclone-an-effective-tool-for-exfiltration/
- https://thedfirreport.com/2021/03/29/sodinokibi-aka-revil-ransomware
- https://us-cert.cisa.gov/ncas/analysis-reports/ar21-126a
- https://labs.sentinelone.com/egregor-raas-continues-the-chaos-with-cobalt-strike-and-rclone
- https://www.splunk.com/en_us/blog/security/darkside-ransomware-splunk-threat-update-and-detections.html
author: Bhabesh Raj, Sittikorn S, Aaron Greetham (@beardofbinary) - NCC Group
date: 2021-05-10
modified: 2023-03-05
tags:
- attack.exfiltration
- attack.t1567.002
logsource:
  product: windows
  category: process_creation
detection:
  selection_specific_options:
    CommandLine|contains|all:
    - '--config '
    - '--no-check-certificate '
    - ' copy '
  selection_rclone_img:
  - Image|endswith: '\rclone.exe'
  - Description: 'Rsync for cloud storage'
  selection_rclone_cli:
    CommandLine|contains:
    - 'pass'
    - 'user'
    - 'copy'
    - 'sync'
    - 'config'
    - 'lsd'
    - 'remote'
    - 'ls'
    - 'mega'
    - 'pcloud'
    - 'ftp'
    - 'ignore-existing'
    - 'auto-confirm'
    - 'transfers'
    - 'multi-thread-streams'
    - 'no-check-certificate '
  condition: selection_specific_options or all of selection_rclone_*
fields:
- CommandLine
- ParentCommandLine
- Details
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This Sigma rule is designed to detect the execution of the RClone utility, a tool often used for cloud storage management that has been exploited by various ransomware strains (e.g., REvil, Conti, FiveHands) for data exfiltration. The rule leverages data from Windows process creation logs to spot specific command-line parameters and executable details that suggest malicious intent. It looks for RClone's executable name (`rclone.exe`) along with command-line flags commonly associated with file transfers or synchronization processes, such as `copy`, `sync`, and `config`. By identifying these patterns, the rule helps analysts pinpoint potential exfiltration attempts and take timely action.
  ### Investigation Steps
  - Initiate an investigation in your EDR tool to locate the process event logs associated with `rclone.exe`, paying close attention to the command-line parameters used during execution.
  - Review the parent process of the detected RClone execution to determine if it was spawned by a legitimate application or if it indicates suspicious activity linked to malware.
  - Check recent outbound network traffic logs on your NDR and NGFW to assess whether the RClone activity correlates with unusual data transfers, particularly to cloud storage destinations.
  - Analyze account and access logs on cloud platforms (AWS, GCP, or Azure) for potential unauthorized attempts to access or transfer data using RClone, focusing on users may not typically engage in such activities.
