title: Change PowerShell Policies to an Insecure Level
id: 87e3c4e8-a6a8-4ad9-bb4f-46e7ff99a180
related:
- id: cf2e938e-9a3e-4fe8-a347-411642b28a9f     # ProcCreation Registry
  type: similar
- id: 61d0475c-173f-4844-86f7-f3eebae1c66b     # ScriptBlock
  type: similar
- id: fad91067-08c5-4d1a-8d8c-d96a21b37814     # Registry
  type: similar
status: test
description: Detects changing the PowerShell script execution policy to a potentially
  insecure level using the "-ExecutionPolicy" flag.
references:
- https://learn.microsoft.com/en-us/powershell/module/microsoft.powershell.security/set-executionpolicy?view=powershell-7.4
- https://learn.microsoft.com/en-us/powershell/module/microsoft.powershell.core/about/about_execution_policies?view=powershell-7.4
- https://adsecurity.org/?p=2604
- https://thedfirreport.com/2021/11/01/from-zero-to-domain-admin/
author: frack113
date: 2021-11-01
modified: 2023-12-13
tags:
- attack.execution
- attack.t1059.001
logsource:
  product: windows
  category: process_creation
detection:
  selection_img:
  - OriginalFileName:
    - 'PowerShell.EXE'
    - 'pwsh.dll'
  - Image|endswith:
    - '\powershell.exe'
    - '\pwsh.exe'
  selection_option:
    CommandLine|contains:
    - '-executionpolicy '
    - ' -ep '
    - ' -exec '
  selection_level:
    CommandLine|contains:
    - 'Bypass'
    - 'Unrestricted'
  condition: all of selection_*
falsepositives:
- Administrator scripts
level: medium
notes: |
  ### Technical Context
  This Sigma rule is designed to detect attempts to change the PowerShell script execution policy to a less secure setting, which could facilitate the execution of malicious scripts. Specifically, the rule monitors for the use of the `-ExecutionPolicy` parameter commonly passed to PowerShell and PowerShell Core (`pwsh`) executables. It captures relevant process creation logs, focusing on instances where the command line arguments include flags like `Bypass` or `Unrestricted`, both of which can lower protections against potentially harmful scripts. Sources for this detection primarily include Windows process creation logs, which provide insights into command-line executions that could indicate unauthorized or malignant activity.
  ### Investigation Steps
  - Utilize the EDR tool to search for recent instances of `PowerShell.exe` or `pwsh.exe` being executed with the `-ExecutionPolicy` flag, focusing on those that use `Bypass` or `Unrestricted`.
  - Check for additional suspicious command lines or parent processes that may provide context as to why these policy changes were initiated and identify potential escalation paths.
  - Review related logs from the SIEM for abnormal patterns of PowerShell usage within the same time frame to correlate any suspicious behaviors that align with the execution policy changes.
  - Conduct a thorough investigation into the environment to ensure that legitimate administrator scripts haven't been misconfigured or exploited, minimizing false positives during the analysis.
