title: Potential Process Injection Via Msra.EXE
id: 744a188b-0415-4792-896f-11ddb0588dbc
status: test
description: Detects potential process injection via Microsoft Remote Asssistance
  (Msra.exe) by looking at suspicious child processes spawned from the aforementioned
  process. It has been a target used by many threat actors and used for discovery
  and persistence tactics
references:
- https://www.microsoft.com/security/blog/2021/12/09/a-closer-look-at-qakbots-latest-building-blocks-and-how-to-knock-them-down/
- https://www.fortinet.com/content/dam/fortinet/assets/analyst-reports/ar-qakbot.pdf
author: Alexander McDonald
date: 2022-06-24
modified: 2023-02-03
tags:
- attack.defense-evasion
- attack.t1055
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    ParentImage|endswith: '\msra.exe'
    ParentCommandLine|endswith: 'msra.exe'
    Image|endswith:
    - '\arp.exe'
    - '\cmd.exe'
    - '\net.exe'
    - '\netstat.exe'
    - '\nslookup.exe'
    - '\route.exe'
    - '\schtasks.exe'
    - '\whoami.exe'
  condition: selection
falsepositives:
- Legitimate use of Msra.exe
level: high
notes: |
  ### Technical Context
  This detection rule aims to identify potential process injection activities initiated through Microsoft Remote Assistance (Msra.exe). Threat actors often exploit Msra.exe as a means to bypass endpoint defenses and execute malicious child processes, leveraging its legitimate functionalities for unauthorized actions. The detection mechanism examines process creation logs for any child processes spawned by Msra.exe, specifically looking for common system utilities that are frequently abused for reconnaissance and persistence, such as `cmd.exe`, `net.exe`, and `arp.exe`. By focusing on these indicators, the rule helps differentiate between benign usage of Msra.exe and potentially malicious behaviors.
  The core data sources for this detection include Windows process creation logs, which provide detailed information about parent-child process relationships, command line arguments, and executable paths. Analysts can better understand the context of executed commands by analyzing these logs, increasing the chances of effectively identifying and mitigating threats associated with process injection.
  ### Investigation Steps
  - Investigate the process tree using EDR tools to verify the legitimacy of child processes spawned by Msra.exe; pay attention to any unusual or unauthorized executables.
  - Review command-line arguments associated with the detected processes in the context of the user or machine to determine if the execution context appears anomalous or suspicious.
  - Check historical logs for previous executions of Msra.exe and other related processes to establish a timeline and identify any potential patterns of misuse.
  - Analyze network activity logs via NDR or proxy logs to ascertain any unusual external communication attempts made by the identified suspicious processes.
