title: Suspicious Windows Update Agent Empty Cmdline
id: 52d097e2-063e-4c9c-8fbb-855c8948d135
status: test
description: |
  Detects suspicious Windows Update Agent activity in which a wuauclt.exe process command line doesn't contain any command line flags
references:
- https://redcanary.com/blog/blackbyte-ransomware/
author: Florian Roth (Nextron Systems)
date: 2022-02-26
modified: 2023-11-11
tags:
- attack.defense-evasion
- attack.t1036
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: '\Wuauclt.exe'
  - OriginalFileName: 'Wuauclt.exe'
  selection_cli:
    CommandLine|endswith:
    - 'Wuauclt'
    - 'Wuauclt.exe'
  condition: all of selection*
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This detection rule identifies potentially malicious behavior involving the Windows Update Agent (wuauclt.exe). It specifically looks for instances where the wuauclt.exe process is executed without any command-line arguments, which can indicate an unauthorized or suspicious invocation of this system utility. The absence of command-line flags in a legitimate Windows Update process typically does not occur, making this pattern notable. The relevant data sources for this rule include process creation logs from Windows, which capture details about active processes, including executable filenames and their command-line arguments.
  By monitoring activity related to the Windows Update Agent, this rule aids in early detection of tactics used by threat actors, especially those associated with evasion techniques, as they may exploit trusted system processes for malicious purposes. The findings from this rule can help incident responders determine if further investigation is necessary to assess the legitimacy of the processes involved.
  ### Investigation Steps
  - Review the process creation logs in your EDR to identify the triggering event for wuauclt.exe, paying close attention to the timing and user context associated with the execution.
  - Examine command-line parameters of recent instances of wuauclt.exe activity in the logs to confirm that they lack any specified flags, which is atypical for legitimate usage.
  - Cross-reference the execution with network logs to determine if the process attempted to access any suspicious external addresses or engage in unusual network behavior.
  - Check for any related alerts or signs of suspicious activity within SIEM systems that may correlate with the identified wuauclt.exe process to assess if it's part of a broader compromise.
