title: Visual Studio NodejsTools PressAnyKey Renamed Execution
id: 65c3ca2c-525f-4ced-968e-246a713d164f
related:
- id: a20391f8-76fb-437b-abc0-dba2df1952c6
  type: similar
status: test
description: Detects renamed execution of "Microsoft.NodejsTools.PressAnyKey.exe",
  which can be abused as a LOLBIN to execute arbitrary binaries
references:
- https://twitter.com/mrd0x/status/1463526834918854661
- https://gist.github.com/nasbench/a989ce64cefa8081bd50cf6ad8c491b5
author: Nasreddine Bencherchali (Nextron Systems), Florian Roth (Nextron Systems)
date: 2023-04-11
tags:
- attack.execution
- attack.defense-evasion
- attack.t1218
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    OriginalFileName: 'Microsoft.NodejsTools.PressAnyKey.exe'
  filter_main_legit_name:
    Image|endswith: '\Microsoft.NodejsTools.PressAnyKey.exe'
  condition: selection and not 1 of filter_main_*
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  This Sigma rule is designed to detect the renamed execution of the legitimate Windows executable "Microsoft.NodejsTools.PressAnyKey.exe." This tool can be exploited by malicious actors as a Living Off the Land Binary (LOLBIN) to execute arbitrary commands or scripts without raising suspicion. The rule monitors process creation logs and inspects the parameters associated with these processes to identify instances where the executable is invoked under different names, which could indicate an attempt to evade detection or misuse of a trusted application. The primary data source for this detection is the process creation logs generated by Windows systems.
  ### Investigation Steps
  - Use the EDR tool to investigate the specific process creation events where "Microsoft.NodejsTools.PressAnyKey.exe" was executed with unusual command-line parameters. Check for any signs of malicious intent.
  - Query the SIEM to correlate any alerts related to this executable with other security incidents, such as unusual network activities or connections made by the host running the binary.
  - Review the AV logs for prior detections or alerts associated with the renamed executable, which may provide further insights into its use or potential compromise.
  - Examine proxy logs to identify any outbound connections initiated by the process, particularly towards suspicious domains that may indicate data exfiltration or command and control activity.
