title: Use of Wfc.exe
id: 49be8799-7b4d-4fda-ad23-cafbefdebbc5
status: test
description: The Workflow Command-line Compiler can be used for AWL bypass and is
  listed in Microsoft's recommended block rules.
references:
- https://lolbas-project.github.io/lolbas/OtherMSBinaries/Wfc/
- https://learn.microsoft.com/en-us/windows/security/application-security/application-control/windows-defender-application-control/design/applications-that-can-bypass-wdac
author: 'Christopher Peacock @SecurePeacock, SCYTHE @scythe_io'
date: 2022-06-01
tags:
- attack.defense-evasion
- attack.t1127
logsource:
  category: process_creation
  product: windows
detection:
  selection:
  - Image|endswith: '\wfc.exe'
  - OriginalFileName: 'wfc.exe'
  condition: selection
falsepositives:
- Legitimate use by a software developer
level: medium
notes: |
  ### Technical Context
  The detection rule focuses on identifying the execution of `Wfc.exe`, a Microsoft utility known as the Workflow Command-line Compiler. This tool is often used by developers to compile Windows Workflow Foundation applications; however, it has also been noted for its potential misuse in bypassing security controls, particularly in circumstances where application whitelisting is enforced. The rule examines process creation logs, specifically looking for instances where the image name concludes with `\wfc.exe` and where the original file name is recorded as `wfc.exe`. By monitoring these parameters, the rule aims to flag potentially suspicious usage of this tool that might indicate an attempt to evade application defenses.
  ### Investigation Steps
  - Review process creation logs in the EDR solution to identify processes associated with `wfc.exe`, noting the execution context and user account attempting to run the executable.
  - Check the command-line parameters used during the execution of `wfc.exe` for any suspicious flags or options that may indicate malicious intent.
  - Investigate any corresponding network activity through the NDR or Proxy logs that occurred at the time of the `wfc.exe` execution to identify unusual outbound connections.
  - Verify the legitimacy of the user account that initiated the process against your organization's role and access policies to ensure it aligns with expected behavior.
