title: Suspicious Scheduled Task Creation Involving Temp Folder
id: 39019a4e-317f-4ce3-ae63-309a8c6b53c5
status: test
description: Detects the creation of scheduled tasks that involves a temporary folder
  and runs only once
references:
- https://discuss.elastic.co/t/detection-and-response-for-hafnium-activity/266289/3
author: Florian Roth (Nextron Systems)
date: 2021-03-11
modified: 2022-10-09
tags:
- attack.execution
- attack.persistence
- attack.t1053.005
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith: '\schtasks.exe'
    CommandLine|contains|all:
    - ' /create '
    - ' /sc once '
    - '\Temp\'
  condition: selection
falsepositives:
- Administrative activity
- Software installation
level: high
notes: |
  ### Technical Context
  This detection rule focuses on identifying potentially malicious scheduled tasks created via the Windows Task Scheduler, particularly when these tasks leverage temporary folders for their operations. It specifically targets instances where the 'schtasks.exe' command, which is the native tool for creating scheduled tasks, is used in conjunction with the command-line parameters indicating a one-time execution ('/sc once') and specifying a path within the Temp folder. The use of temporary directories can be indicative of adversarial tactics aiming to hide or obscure their malicious activities, making this a critical area for monitoring. By checking process creation logs, this rule allows security teams to catch automated or scripted attempts to establish persistence on systems through scheduled tasks.
  ### Investigation Steps
  - Check EDR logs to identify additional context around the process creation, including the user account that initiated the scheduled task and any parent processes associated with it.
  - Review command-line arguments in the process creation logs to determine if there are any unusual or suspicious command-line parameters that might indicate malicious intent.
  - Utilize AV and malware scanning tools to analyze any files that were created or modified in the Temp folder around the time the scheduled task was set up.
  - Consult proxy and network logs to investigate any outbound connections initiated by the created task to determine if it communicates with known malicious domains or IP addresses.
