title: Compress Data and Lock With Password for Exfiltration With 7-ZIP
id: 9fbf5927-5261-4284-a71d-f681029ea574
status: test
description: An adversary may compress or encrypt data that is collected prior to
  exfiltration using 3rd party utilities
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1560.001/T1560.001.md
author: frack113
date: 2021-07-27
modified: 2023-03-13
tags:
- attack.collection
- attack.t1560.001
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Description|contains: '7-Zip'
  - Image|endswith:
    - '\7z.exe'
    - '\7zr.exe'
    - '\7za.exe'
  - OriginalFileName:
    - '7z.exe'
    - '7za.exe'
  selection_password:
    CommandLine|contains: ' -p'
  selection_action:
    CommandLine|contains:
    - ' a '
    - ' u '
  condition: all of selection_*
falsepositives:
- Legitimate activity is expected since compressing files with a password is common.
level: medium
notes: |
  ### Technical Context
  This Sigma rule detects suspicious activities related to the use of 7-Zip, a popular third-party file compression utility, which adversaries may leverage to compress and encrypt data prior to exfiltration. The rule focuses on specific indicators within process creation logs, specifically looking for the execution of 7-Zip commands, identified by their executable names (such as `7z.exe`, `7zr.exe`, and `7za.exe`), along with command-line parameters that indicate the creation or updating of archives with password protection. The necessity of using password-protected file compression is a red flag, as it may indicate the intention to safeguard stolen data against detection or unauthorized access.
  ### Investigation Steps
  - Investigate the process creation events in your EDR to identify instances of `7z.exe` or related executables being launched, along with the corresponding command-line arguments.
  - Review command-line parameters for any occurrence of ` -p`, which indicates password protection was applied during the compression, to assess the likelihood of malicious intent.
  - Check for any unusual data transfers following the execution of these commands by examining logs from your network monitoring tools (NDR) for corresponding outbound connections.
  - Correlate the findings with logs from your AV or endpoint security solutions to determine if any alerts were triggered during the use of 7-Zip that may provide additional context surrounding the event.
