title: Suspicious MSDT Parent Process
id: 7a74da6b-ea76-47db-92cc-874ad90df734
status: test
description: Detects msdt.exe executed by a suspicious parent as seen in CVE-2022-30190
  / Follina exploitation
references:
- https://twitter.com/nao_sec/status/1530196847679401984
- https://app.any.run/tasks/713f05d2-fe78-4b9d-a744-f7c133e3fafb/
author: Nextron Systems
date: 2022-06-01
modified: 2023-02-06
tags:
- attack.defense-evasion
- attack.t1036
- attack.t1218
logsource:
  category: process_creation
  product: windows
detection:
  selection_parent:
    ParentImage|endswith:
    - '\cmd.exe'
    - '\cscript.exe'
    - '\mshta.exe'
    - '\powershell.exe'
    - '\pwsh.exe'
    - '\regsvr32.exe'
    - '\rundll32.exe'
    - '\schtasks.exe'
    - '\wmic.exe'
    - '\wscript.exe'
    - '\wsl.exe'
            # Note: office applications are covered by: 438025f9-5856-4663-83f7-52f878a70a50
  selection_msdt:
  - Image|endswith: '\msdt.exe'
  - OriginalFileName: 'msdt.exe'
  condition: all of selection_*
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This Sigma rule is designed to detect instances where `msdt.exe`, a legitimate Microsoft Support Diagnostic Tool executable, is launched by a suspicious parent process. Specifically, the rule flags events where `msdt.exe` is invoked by commonly abused tools such as `cmd.exe`, `PowerShell`, `wscript.exe`, and others—these are often used by attackers for malicious purposes, particularly in relation to the CVE-2022-30190 vulnerability known as "Follina." The detection criteria focus on analyzing process creation logs to identify when these specific parent-child relationship patterns occur, which can indicate potential exploitation attempts or lateral movements in an environment.
  When `msdt.exe` is executed by these abnormal parent processes, it raises a high-priority alert for incident responders to further investigate. This highlights the need for ongoing vigilance and advanced monitoring, as the misuse of legitimate administrative tools can often lead to significant security incidents.
  ### Investigation Steps
  - Utilize EDR tools to investigate the process tree at the time of the alert, focusing on the parent process that initiated `msdt.exe` to understand the context and potential origins of the execution.
  - Review command-line arguments associated with the `msdt.exe` process to identify any suspicious or unusual parameters that may indicate malicious intent.
  - Check firewall logs for any outbound or suspicious network connections originating from the machine that executed `msdt.exe`, which can help identify possible data exfiltration attempts.
  - Analyze system and application logs within your SIEM for any related events that occurred around the same time, particularly looking for other unusual behavior or indicators of compromise within the environment.
