title: Potential Binary Impersonating Sysinternals Tools
id: 7cce6fc8-a07f-4d84-a53e-96e1879843c9
status: test
description: Detects binaries that use the same name as legitimate sysinternals tools
  to evade detection
references:
- https://learn.microsoft.com/en-us/sysinternals/downloads/sysinternals-suite
author: frack113
date: 2021-12-20
modified: 2022-12-08
tags:
- attack.execution
- attack.defense-evasion
- attack.t1218
- attack.t1202
logsource:
  category: process_creation
  product: windows
detection:
  selection_exe:
    Image|endswith:
    - '\accesschk.exe'
    - '\accesschk64.exe'
    - '\AccessEnum.exe'
    - '\ADExplorer.exe'
    - '\ADExplorer64.exe'
    - '\ADInsight.exe'
    - '\ADInsight64.exe'
    - '\adrestore.exe'
    - '\adrestore64.exe'
    - '\Autologon.exe'
    - '\Autologon64.exe'
    - '\Autoruns.exe'
    - '\Autoruns64.exe'
    - '\autorunsc.exe'
    - '\autorunsc64.exe'
    - '\Bginfo.exe'
    - '\Bginfo64.exe'
    - '\Cacheset.exe'
    - '\Cacheset64.exe'
    - '\Clockres.exe'
    - '\Clockres64.exe'
    - '\Contig.exe'
    - '\Contig64.exe'
    - '\Coreinfo.exe'
    - '\Coreinfo64.exe'
    - '\CPUSTRES.EXE'
    - '\CPUSTRES64.EXE'
    - '\ctrl2cap.exe'
    - '\Dbgview.exe'
    - '\dbgview64.exe'
    - '\Desktops.exe'
    - '\Desktops64.exe'
    - '\disk2vhd.exe'
    - '\disk2vhd64.exe'
    - '\diskext.exe'
    - '\diskext64.exe'
    - '\Diskmon.exe'
    - '\Diskmon64.exe'
    - '\DiskView.exe'
    - '\DiskView64.exe'
    - '\du.exe'
    - '\du64.exe'
    - '\efsdump.exe'
    - '\FindLinks.exe'
    - '\FindLinks64.exe'
    - '\handle.exe'
    - '\handle64.exe'
    - '\hex2dec.exe'
    - '\hex2dec64.exe'
    - '\junction.exe'
    - '\junction64.exe'
    - '\ldmdump.exe'
    - '\listdlls.exe'
    - '\listdlls64.exe'
    - '\livekd.exe'
    - '\livekd64.exe'
    - '\loadOrd.exe'
    - '\loadOrd64.exe'
    - '\loadOrdC.exe'
    - '\loadOrdC64.exe'
    - '\logonsessions.exe'
    - '\logonsessions64.exe'
    - '\movefile.exe'
    - '\movefile64.exe'
    - '\notmyfault.exe'
    - '\notmyfault64.exe'
    - '\notmyfaultc.exe'
    - '\notmyfaultc64.exe'
    - '\ntfsinfo.exe'
    - '\ntfsinfo64.exe'
    - '\pendmoves.exe'
    - '\pendmoves64.exe'
    - '\pipelist.exe'
    - '\pipelist64.exe'
    - '\portmon.exe'
    - '\procdump.exe'
    - '\procdump64.exe'
    - '\procexp.exe'
    - '\procexp64.exe'
    - '\Procmon.exe'
    - '\Procmon64.exe'
    - '\psExec.exe'
    - '\psExec64.exe'
    - '\psfile.exe'
    - '\psfile64.exe'
    - '\psGetsid.exe'
    - '\psGetsid64.exe'
    - '\psInfo.exe'
    - '\psInfo64.exe'
    - '\pskill.exe'
    - '\pskill64.exe'
    - '\pslist.exe'
    - '\pslist64.exe'
    - '\psLoggedon.exe'
    - '\psLoggedon64.exe'
    - '\psloglist.exe'
    - '\psloglist64.exe'
    - '\pspasswd.exe'
    - '\pspasswd64.exe'
    - '\psping.exe'
    - '\psping64.exe'
    - '\psService.exe'
    - '\psService64.exe'
    - '\psshutdown.exe'
    - '\psshutdown64.exe'
    - '\pssuspend.exe'
    - '\pssuspend64.exe'
    - '\RAMMap.exe'
    - '\RDCMan.exe'
    - '\RegDelNull.exe'
    - '\RegDelNull64.exe'
    - '\regjump.exe'
    - '\ru.exe'
    - '\ru64.exe'
    - '\sdelete.exe'
    - '\sdelete64.exe'
    - '\ShareEnum.exe'
    - '\ShareEnum64.exe'
    - '\shellRunas.exe'
    - '\sigcheck.exe'
    - '\sigcheck64.exe'
    - '\streams.exe'
    - '\streams64.exe'
    - '\strings.exe'
    - '\strings64.exe'
    - '\sync.exe'
    - '\sync64.exe'
    - '\Sysmon.exe'
    - '\Sysmon64.exe'
    - '\tcpvcon.exe'
    - '\tcpvcon64.exe'
    - '\tcpview.exe'
    - '\tcpview64.exe'
    - '\Testlimit.exe'
    - '\Testlimit64.exe'
    - '\vmmap.exe'
    - '\vmmap64.exe'
    - '\Volumeid.exe'
    - '\Volumeid64.exe'
    - '\whois.exe'
    - '\whois64.exe'
    - '\Winobj.exe'
    - '\Winobj64.exe'
    - '\ZoomIt.exe'
    - '\ZoomIt64.exe'
  filter_valid:
    Company:
    - 'Sysinternals - www.sysinternals.com'
    - 'Sysinternals'
  filter_empty:
    Company:
  condition: selection_exe and not 1 of filter*
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  This detection rule identifies potential impersonations of legitimate Sysinternals tools, which are widely used for system diagnostics and troubleshooting in Windows environments. The rule specifically looks for executables with names that match a predefined list of Sysinternals utilities (like `procmon.exe`, `psExec.exe`, etc.) but checks if their associated company metadata does not match "Sysinternals" or is absent entirely. This approach is crucial, as adversaries often mimic the names of trusted tools to evade detection and operate stealthily within an environment. The relevant MITRE ATT&CK tactics are **Execution** (T1202) and **Defense Evasion** (T1218), as these activities often pertain to executing malicious payloads masquerading as legitimate administrative tools.
  The data sources utilized for this detection include **process creation logs**, enabling the SIEM to analyze the image names and their company signatures on Windows. By filtering entries that reflect an unauthorized or non-existent company, the rule helps surface potentially dangerous executions that could bypass conventional security measures.
  ### Investigation Steps
  - **Verify Process Origin:** Check the EDR solution for the originating path of the detected executable. Ensure it is not executed from unexpected or temporary directories that are common for malicious activities.
    
  - **Check Company Metadata:** Use a system's Windows Event Logs to review process creation entries for the identified executable's company information. Inconsistencies with expected "Sysinternals" labels can indicate possible impersonation.
  - **Contextualize with Historical Data:** Correlate detection alerts with historical execution data to determine if the executable has been regularly used in the environment. An unusual spike or new presence could indicate a malicious intent.
  - **Assess Network Behavior:** Review network logs and any outbound connections associated with the detected process. Look for unusual external communications, which could signify command and control or data exfiltration.
  ### Prioritization
  The alert is classified as **medium severity** because while the execution of a Sysinternals-simulating binary could indicate a potentially serious threat or unauthorized activity, it may also arise from legitimate administrative tasks, especially if supported by other contextual evidence.
  ### Blind Spots and Assumptions
  This rule relies heavily on accurate company attribution embedded in the executable metadata. If legitimate binaries executed from untrusted sources also have invalid or missing company details, this rule may fail to trigger. Additionally, skilled adversaries might deploy manipulated binaries that appear legitimate or altered metadata, thereby evading detection. There may also be instances when high-volume usage of these utilities by authorized users produces a high number of false positives, complicating alert triaging.
  > **Disclaimer:** This investigation guide was created using generative AI technology and has not been reviewed for its accuracy and relevance. While every effort has been made to ensure its quality, we recommend validating the content and adapting it to suit specific environment and operational needs. Please communicate any changes to the detection engineering team.
