title: Uncommon Child Process Of Defaultpack.EXE
id: b2309017-4235-44fe-b5af-b15363011957
status: test
description: Detects uncommon child processes of "DefaultPack.EXE" binary as a proxy
  to launch other programs
references:
- https://lolbas-project.github.io/lolbas/OtherMSBinaries/DefaultPack/
- https://www.echotrail.io/insights/search/defaultpack.exe
author: frack113
date: 2022-12-31
modified: 2024-04-22
tags:
- attack.t1218
- attack.defense-evasion
- attack.execution
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    ParentImage|endswith: '\DefaultPack.exe'
  condition: selection
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  This detection rule aims to identify uncommon child processes spawned by the `DefaultPack.EXE` binary, which is commonly used as a proxy to start other processes. This executable, part of the Living Off the Land binaries and scripts (LOLBAS), may be manipulated by threat actors to evade detection by using legitimate system tools for malicious purposes. The rule primarily monitors process creation events, focusing on instances where the parent process is `DefaultPack.EXE`. By analyzing attributes such as the command-line parameters and the names of the child processes, analysts can identify suspicious activity linked to this known binary.
  To implement this detection, the rule queries process creation logs within a Windows environment, leveraging data from endpoint detection and response (EDR) systems or SIEM platforms equipped to collect and analyze such logs. The findings can aid in identifying potential backdoor activity or other evasive techniques employed by attackers.
  ### Investigation Steps
  - Review the EDR logs for the instances of `DefaultPack.EXE` to determine which child processes were spawned and assess their legitimacy.
  - Analyze the command-line parameters used for launching any uncommon child processes to identify potential indicators of compromise.
  - Check network logs from firewalls and proxies to see if any unusual outbound connections were initiated by the detected processes.
  - Correlate findings with threat intelligence sources to determine if the observed behavior aligns with known tactics, techniques, and procedures (TTPs) used by threat actors targeting your environment.
