title: UAC Bypass Using PkgMgr and DISM
id: a743ceba-c771-4d75-97eb-8a90f7f4844c
status: test
description: Detects the pattern of UAC Bypass using pkgmgr.exe and dism.exe (UACMe
  23)
references:
- https://github.com/hfiref0x/UACME
author: Christian Burkard (Nextron Systems)
date: 2021-08-23
modified: 2024-12-01
tags:
- attack.defense-evasion
- attack.privilege-escalation
- attack.t1548.002
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    ParentImage|endswith: '\pkgmgr.exe'
    Image|endswith: '\dism.exe'
    IntegrityLevel:
    - 'High'
    - 'System'
    - 'S-1-16-16384'         # System
    - 'S-1-16-12288'         # High
  condition: selection
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This detection rule identifies potential User Account Control (UAC) bypass attempts using the `pkgmgr.exe` and `dism.exe` utilities on Windows systems. Specifically, it looks for instances where `dism.exe` is initiated as a child process by `pkgmgr.exe` under high or system integrity levels. These processes are often exploited by attackers to escalate privileges without triggering security alerts due to their legitimate administrative functions on Windows. The rule leverages process creation logs to monitor for suspicious parent-child process relationships, focusing on the integrity levels that exceed standard user permissions, which could indicate malicious intent. By dissecting the command-line parameters and the execution context, SOC analysts can assess whether the invocation of `dism.exe` is within a normal operational behavior or indicative of a potential breach.
  ### Investigation Steps
  - Review process creation logs to identify instances of `pkgmgr.exe` spawning `dism.exe`, noting the integrity level associated with these processes.
  - Check EDR alerts for any abnormal behavior or anomalies related to `dism.exe` or other system-level processes around the same timeframe.
  - Analyze command-line arguments associated with the `dism.exe` execution to determine if they deviate from standard usage patterns for legitimate operations.
  - Investigate user accounts and permissions associated with the processes to ensure they align with expected administrative activities, focusing on any unauthorized access or unusual privilege escalation.
