title: Suspicious Ping/Del Command Combination
id: 54786ddc-5b8a-11ed-9b6a-0242ac120002
status: test
description: Detects a method often used by ransomware. Which combines the "ping"
  to wait a couple of seconds and then "del" to delete the file in question. Its used
  to hide the file responsible for the initial infection for example
references:
- https://blog.sygnia.co/kaseya-ransomware-supply-chain-attack
- https://media.kasperskycontenthub.com/wp-content/uploads/sites/43/2022/06/23093553/Common-TTPs-of-the-modern-ransomware_low-res.pdf
- https://www.acronis.com/en-us/blog/posts/lockbit-ransomware/
- https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/blackbyte-exbyte-ransomware
author: Ilya Krestinichev
date: 2022-11-03
modified: 2024-03-05
tags:
- attack.defense-evasion
- attack.t1070.004
logsource:
  category: process_creation
  product: windows
detection:
    # Note: In the case of sysmon and similar logging utilities, see this discussion https://github.com/SigmaHQ/sigma/discussions/4277
    # Example: "C:\Windows\System32\cmd.exe"  /C ping 127.0.0.7 -n 3 > Nul & fsutil file setZeroData offset=0 length=524288 "C:\Users\User\Desktop\lockbit\lockbit.exe" & Del /f /q "C:\Users\User\Desktop\lockbit\lockbit.exe".
  selection_count:
    CommandLine|contains|windash: ' -n '
  selection_nul:
    CommandLine|contains: 'Nul'     # Covers "> Nul" and ">Nul "
  selection_del_param:
    CommandLine|contains|windash:
    - ' -f '
    - ' -q '
  selection_all:
    CommandLine|contains|all:
    - 'ping'         # Covers "ping" and "ping.exe"
    - 'del '
  condition: all of selection_*
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This Sigma rule is designed to detect a suspicious command line combination that is often leveraged by ransomware to mask malicious activities. It specifically looks for the execution of a `ping` command followed by a `del` command. The tactic involves using `ping` with parameters (`-n`) to introduce a delay, allowing other processes or actions to occur while the system appears to be engaged in benign activity. The `del` command is subsequently executed to remove the original malicious file, making it difficult for incident responders to trace the source of the infection. This method particularly targets Windows environments, indicating that the rule primarily utilizes process creation logs as its source data to capture the execution of these commands.
  ### Investigation Steps
  - Review the process creation logs in your EDR tool to identify instances where the command line matches the suspicious `ping` and `del` combination.
  - Correlate this alert with any relevant alerts from AV tools that may have flagged associated malicious files prior to the command execution.
  - Investigate network traffic patterns with your NDR solution during the time of the detection to determine if there were any unusual or unauthorized outbound connections related to the suspected ransomware activity.
  - Examine user activity and access logs in your cloud platforms (like AWS, GCP, Azure) to look for any anomalies or unauthorized access that may coincide with the detected command execution.
