title: Suspicious NTLM Authentication on the Printer Spooler Service
id: bb76d96b-821c-47cf-944b-7ce377864492
status: test
description: Detects a privilege elevation attempt by coercing NTLM authentication
  on the Printer Spooler service
references:
- https://twitter.com/med0x2e/status/1520402518685200384
- https://github.com/elastic/detection-rules/blob/dd224fb3f81d0b4bf8593c5f02a029d647ba2b2d/rules/windows/credential_access_relay_ntlm_auth_via_http_spoolss.toml
author: Elastic (idea), Tobias Michalski (Nextron Systems)
date: 2022-05-04
modified: 2023-02-09
tags:
- attack.privilege-escalation
- attack.credential-access
- attack.t1212
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: '\rundll32.exe'
  - OriginalFileName: 'RUNDLL32.EXE'
  selection_cli:
    CommandLine|contains|all:
    - 'C:\windows\system32\davclnt.dll,DavSetCookie'
    - 'http'
    CommandLine|contains:
    - 'spoolss'
    - 'srvsvc'
    - '/print/pipe/'
  condition: all of selection_*
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This detection rule identifies suspicious NTLM authentication attempts that leverage the Printer Spooler service to elevate privileges. It particularly focuses on the execution of the `rundll32.exe` process that interacts with the `davclnt.dll` DLL to set a cookie, indicative of attempts to relay credentials over HTTP. The rule captures key indicators such as command line parameters containing references to the spooler service (e.g., "spoolss") and network interactions over print pipes, which can be exploited by attackers to gain unauthorized access. The primary data source for this rule is Windows process creation logs, which will log the execution of relevant commands and parameters that align with this suspicious activity.
  ### Investigation Steps
  - Inspect recent alerts in the EDR system for any instances of `rundll32.exe` executing with the specified command line parameters, especially those indicating interaction with `davclnt.dll`.
  - Review process creation logs to verify the context behind the execution of any unusual commands related to the Printer Spooler service and analyze the timing of these executions.
  - Correlate the identified processes with network traffic logs from the NGFW or Proxy to determine if there were any outbound connections to suspicious IP addresses or domains during the same time frame.
  - Check for any logged events in Active Directory that could indicate unauthorized NTLM authentication attempts or privilege escalations associated with the user accounts involved in the alerts.
