title: Compress Data and Lock With Password for Exfiltration With WINZIP
id: e2e80da2-8c66-4e00-ae3c-2eebd29f6b6d
status: test
description: An adversary may compress or encrypt data that is collected prior to
  exfiltration using 3rd party utilities
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1560.001/T1560.001.md
author: frack113
date: 2021-07-27
modified: 2022-12-25
tags:
- attack.collection
- attack.t1560.001
logsource:
  category: process_creation
  product: windows
detection:
  selection_winzip:
    CommandLine|contains:
    - 'winzip.exe'
    - 'winzip64.exe'
  selection_password:
    CommandLine|contains: '-s"'
  selection_other:
    CommandLine|contains:
    - ' -min '
    - ' -a '
  condition: all of selection*
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  This Sigma rule aims to detect potential data exfiltration activities where an adversary is leveraging the WinZip application to compress and secure files using passwords before transferring them outside the organization. The rule specifically looks for process creation events with command-line arguments that indicate the usage of WinZip executables (`winzip.exe` or `winzip64.exe`) and checks for common parameters associated with packaging files, such as `-s"` (which indicates password protection), `-min` (to minimize the window), and `-a` (to add files to an archive). The primary technical data sources involved in this detection are process creation logs from Windows environments, which detail the commands executed by processes, allowing analysts to pinpoint potentially malicious activities related to file compression and encryption.
  ### Investigation Steps
  - Review recent process creation logs in your EDR solution to identify instances of `winzip.exe` or `winzip64.exe` being executed with suspicious command-line options.
  - Analyze the command-line arguments for any use of the '-s"' parameter, indicating that files may have been encrypted with a password prior to exfiltration.
  - Check the file locations and user accounts associated with the identified WinZip executions to determine if they align with typical organizational behavior or suggest unauthorized access.
  - Utilize cloud storage logs and proxy logs to investigate any corresponding outbound traffic that may indicate files were uploaded or exfiltrated after compression.
