title: Potentially Suspicious Regsvr32 HTTP IP Pattern
id: 2dd2c217-bf68-437a-b57c-fe9fd01d5de8
status: test
description: Detects regsvr32 execution to download and install DLLs located remotely
  where the address is an IP address.
references:
- https://twitter.com/mrd0x/status/1461041276514623491
- https://twitter.com/tccontre18/status/1480950986650832903
- https://lolbas-project.github.io/lolbas/Binaries/Regsvr32/
author: Florian Roth (Nextron Systems)
date: 2022-01-11
modified: 2023-05-24
tags:
- attack.defense-evasion
- attack.t1218.010
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: '\regsvr32.exe'
  - OriginalFileName: 'REGSVR32.EXE'
  selection_ip:
    CommandLine|contains:
    - ' /i:http://1'
    - ' /i:http://2'
    - ' /i:http://3'
    - ' /i:http://4'
    - ' /i:http://5'
    - ' /i:http://6'
    - ' /i:http://7'
    - ' /i:http://8'
    - ' /i:http://9'
    - ' /i:https://1'
    - ' /i:https://2'
    - ' /i:https://3'
    - ' /i:https://4'
    - ' /i:https://5'
    - ' /i:https://6'
    - ' /i:https://7'
    - ' /i:https://8'
    - ' /i:https://9'
    - ' -i:http://1'
    - ' -i:http://2'
    - ' -i:http://3'
    - ' -i:http://4'
    - ' -i:http://5'
    - ' -i:http://6'
    - ' -i:http://7'
    - ' -i:http://8'
    - ' -i:http://9'
    - ' -i:https://1'
    - ' -i:https://2'
    - ' -i:https://3'
    - ' -i:https://4'
    - ' -i:https://5'
    - ' -i:https://6'
    - ' -i:https://7'
    - ' -i:https://8'
    - ' -i:https://9'
  condition: all of selection_*
falsepositives:
- FQDNs that start with a number such as "7-Zip"
level: high
notes: |
  ### Technical Context
  The "Potentially Suspicious Regsvr32 HTTP IP Pattern" detection rule identifies potentially malicious activity involving the `regsvr32.exe` executable in Windows environments. This rule is focused on the execution of `regsvr32` with command-line parameters pointing to remote locations that are IP addresses. Such behavior is indicative of attempts to download and execute Dynamic Link Library (DLL) files from potentially untrusted sources. The rule captures data mainly from process creation logs, checking for specific command-line arguments that suggest the use of `regsvr32` to interact with URLs that start with an IP address. The reliance on these command-line parameters helps SOC analysts identify potentially nefarious activities such as malware installation and exploitation.
  ### Investigation Steps
  - Examine recent process creation logs in the EDR solution to identify instances of `regsvr32.exe` executed with suspicious command-line arguments pointing to IP addresses.
  - Review command and control (C2) related indicators by inspecting firewall logs for outbound traffic to the identified IPs during the periods of `regsvr32` execution.
  - Utilize AV tools to scan the system for any newly downloaded DLL files associated with the detected `regsvr32` activity and check for known malware signatures.
  - Analyze network proxy logs to track any HTTP/S requests made to the suspicious URLs, correlating the timestamps with `regsvr32` executions for further context.
