title: Schtasks From Suspicious Folders
id: 8a8379b8-780b-4dbf-b1e9-31c8d112fefb
status: test
description: Detects scheduled task creations that have suspicious action command
  and folder combinations
references:
- https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/lazarus-dream-job-chemical
author: Florian Roth (Nextron Systems)
date: 2022-04-15
modified: 2022-11-18
tags:
- attack.execution
- attack.t1053.005
logsource:
  product: windows
  category: process_creation
detection:
  selection_img:
  - Image|endswith: '\schtasks.exe'
  - OriginalFileName: 'schtasks.exe'
  selection_create:
    CommandLine|contains: ' /create '
  selection_command:
    CommandLine|contains:
    - 'powershell'
    - 'pwsh'
    - 'cmd /c '
    - 'cmd /k '
    - 'cmd /r '
    - 'cmd.exe /c '
    - 'cmd.exe /k '
    - 'cmd.exe /r '
  selection_all_folders:
    CommandLine|contains:
    - 'C:\ProgramData\'
    - '%ProgramData%'
  condition: all of selection_*
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This detection rule identifies potentially malicious scheduled task creations occurring through the legitimate Windows utility `schtasks.exe`. The rule is focused on command invocations that include suspicious command parameters, particularly those that use `powershell`, `cmd`, or variations thereof, while specifically targeting folders that may be indicative of malicious activity, such as `C:\ProgramData\` or its environment-variable equivalent `%ProgramData%`. By scrutinizing process creation logs, the rule aims to catch instances where scheduled tasks are established with uncommon intents, often utilized by threat actors for persistence or execution of harmful scripts.
  The detection relies on several criteria: the command must initiate from `schtasks.exe`, include a `/create` flag (indicating a new task is being created), and utilize specific, suspicious command line arguments leading to potential exploitation. By closely monitoring these signals, the SOC can uncover activities that may compromise the integrity of systems and networks.
  ### Investigation Steps
  - Review recent process creation logs for instances of `schtasks.exe` triggering with suspicious command-line parameters related to task creation. 
  - Utilize EDR tools to trace the execution path of the identified processes and correlate them with known malicious indicators or patterns.
  - Check for any scheduled tasks that were created in the identified suspicious directories, noting their configuration and any scheduled execution times.
  - Investigate related events in the security logs, such as failed login attempts or unusual account activity from the user account that initiated the scheduled tasks.
