title: Stop Windows Service Via Sc.EXE
id: 81bcb81b-5b1f-474b-b373-52c871aaa7b1
related:
- id: eb87818d-db5d-49cc-a987-d5da331fbd90
  type: obsolete
status: test
description: Detects the stopping of a Windows service via the "sc.exe" utility
references:
- https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-r2-and-2012/cc742107(v=ws.11)
author: Jakob Weinzettl, oscd.community, Nasreddine Bencherchali (Nextron Systems)
date: 2023-03-05
modified: 2024-01-18
tags:
- attack.impact
- attack.t1489
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - OriginalFileName: 'sc.exe'
  - Image|endswith: '\sc.exe'
  selection_cli:
    CommandLine|contains: ' stop '
  condition: all of selection_*
falsepositives:
- There are many legitimate reasons to stop a service. This rule isn't looking for
  any suspicious behavior in particular. Filter legitimate activity accordingly
level: low
notes: |
  ### Technical Context
  This Sigma rule is designed to detect instances where the Windows utility `sc.exe` is used to stop a service on a Windows operating system. The detection leverages process creation logs and focuses on two key indicators: the execution of `sc.exe` itself and the command-line parameters that include the word "stop." When either of these conditions is met, the rule will trigger an alert. This behavior may be legitimate for system administrators performing routine maintenance, but it can also indicate malicious activities, such as an attacker trying to disable security services. Thus, analysts must consider context when evaluating alerts generated by this rule.
  ### Investigation Steps
  - Review the initial alert in the SIEM to identify the timestamp and user associated with the `sc.exe` execution. 
  - Query EDR logs for further context around the process execution, paying close attention to any child processes spawned by `sc.exe`.
  - Analyze command-line parameters in the trigger event to determine if the command was used for legitimate administrative purposes or could indicate malicious activity.
  - Check for any related network activity through NDR and proxy logs that align with the timing of the service stop action, which could help understand potential external control.
