title: Gpresult Display Group Policy Information
id: e56d3073-83ff-4021-90fe-c658e0709e72
status: test
description: Detects cases in which a user uses the built-in Windows utility gpresult
  to display the Resultant Set of Policy (RSoP) information
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1615/T1615.md
- https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/gpresult
- https://unit42.paloaltonetworks.com/emissary-trojan-changelog-did-operation-lotus-blossom-cause-it-to-evolve/
- https://www.welivesecurity.com/wp-content/uploads/2020/05/ESET_Turla_ComRAT.pdf
author: frack113
date: 2022-05-01
tags:
- attack.discovery
- attack.t1615
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    Image|endswith: '\gpresult.exe'
    CommandLine|contains:
    - '/z'
    - '/v'
  condition: selection
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  The Sigma rule titled "Gpresult Display Group Policy Information" aims to detect the execution of the Windows utility `gpresult.exe`, specifically when it is run with specific command-line arguments that provide detailed information about Group Policy settings. This tool is typically utilized to display the Resultant Set of Policy (RSoP) information for a user’s environment. The detection relies on process creation logs, monitoring instances where the executable path ends with `gpresult.exe` and the command line contains either the `/z` or `/v` flags. These flags denote verbose output, which may be used by an attacker to gather and analyze policy configurations, potentially aiding in further attacks or reconnaissance efforts. Recognizing legitimate vs. malicious use of this tool is crucial for incident responders.
  ### Investigation Steps
  - Investigate the process creation logs in the EDR to identify any instances of `gpresult.exe` being executed, along with associated user accounts to determine the context of the execution.
  - Review the command-line arguments provided alongside `gpresult.exe` to ascertain whether they indicate potential malicious intent, particularly focusing on verbose flags like `/z` and `/v`.
  - Cross-reference the timestamp of the alert with any relevant logs from the SIEM to uncover any suspicious activities performed before or after the execution of the command.
  - Assess endpoint security solutions (like AV) for any indications of compromise that may correlate with the use of `gpresult.exe` and other potential service exploitation patterns.
