title: Terminal Service Process Spawn
id: 1012f107-b8f1-4271-af30-5aed2de89b39
status: test
description: Detects a process spawned by the terminal service server process (this
  could be an indicator for an exploitation of CVE-2019-0708)
references:
- https://securingtomorrow.mcafee.com/other-blogs/mcafee-labs/rdp-stands-for-really-do-patch-understanding-the-wormable-rdp-vulnerability-cve-2019-0708/
author: Florian Roth (Nextron Systems)
date: 2019-05-22
modified: 2023-01-25
tags:
- attack.initial-access
- attack.t1190
- attack.lateral-movement
- attack.t1210
- car.2013-07-002
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    ParentCommandLine|contains|all:
    - '\svchost.exe'
    - 'termsvcs'
  filter_img:
    Image|endswith:
    - '\rdpclip.exe'
    - ':\Windows\System32\csrss.exe'
    - ':\Windows\System32\wininit.exe'
    - ':\Windows\System32\winlogon.exe'
  filter_null:
    Image:
  condition: selection and not 1 of filter_*
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This Sigma rule, titled "Terminal Service Process Spawn," is designed to detect potentially malicious activity associated with the exploitation of CVE-2019-0708, a critical vulnerability in the Remote Desktop Protocol (RDP). The rule focuses on the detection of processes spawned by the terminal services server process (svchost.exe) that are not typical for a normal operating environment. Specifically, it looks for instances where the command-line parameters of a process creation event contain references to 'termsvcs' as a parent command, while simultaneously ensuring that certain processes such as `rdpclip.exe`, `csrss.exe`, `wininit.exe`, and `winlogon.exe` are not involved. By monitoring these criteria, the rule aims to highlight abnormal behavior indicative of lateral movement or unauthorized access through RDP.
  The primary technical data source for this detection is Windows process creation logs, which capture details such as the command-line arguments and parent-child process relationships. Analysts must investigate alerts generated by this rule promptly, as they may indicate a significant security incident.
  ### Investigation Steps
  - Utilize EDR tools to examine the process creation logs associated with the triggered alert, paying close attention to the command-line parameters and parent processes for anomalous entries.
  - Check for any recent connections to Remote Desktop Services (RDP) from suspicious IP addresses by reviewing logs from the NGFW or your internal firewall.
  - Investigate relevant entries in the Windows Event Logs to identify any unexpected or unauthorized logins, particularly those established over RDP.
  - Review current user sessions through Windows Terminal Services logs to determine if any unknown accounts are actively connected or have accessed the system recently.
