title: Reg Add Suspicious Paths
id: b7e2a8d4-74bb-4b78-adc9-3f92af2d4829
status: test
description: Detects when an adversary uses the reg.exe utility to add or modify new
  keys or subkeys
references:
- https://github.com/redcanaryco/atomic-red-team/blob/40b77d63808dd4f4eafb83949805636735a1fd15/atomics/T1112/T1112.md
- https://github.com/redcanaryco/atomic-red-team/blob/40b77d63808dd4f4eafb83949805636735a1fd15/atomics/T1562.001/T1562.001.md
- https://www.absolomb.com/2018-01-26-Windows-Privilege-Escalation-Guide/
author: frack113, Nasreddine Bencherchali (Nextron Systems)
date: 2022-08-19
modified: 2022-10-10
tags:
- attack.defense-evasion
- attack.t1112
- attack.t1562.001
logsource:
  category: process_creation
  product: windows
detection:
  selection_reg:
  - Image|endswith: '\reg.exe'
  - OriginalFileName: 'reg.exe'
  selection_path:
    CommandLine|contains:
            # Add more suspicious registry locations below
    - '\AppDataLow\Software\Microsoft\'
    - '\Policies\Microsoft\Windows\OOBE'
    - '\Policies\Microsoft\Windows NT\CurrentVersion\Winlogon'
    - '\SOFTWARE\Microsoft\Windows NT\Currentversion\Winlogon'
    - '\CurrentControlSet\Control\SecurityProviders\WDigest'
    - '\Microsoft\Windows Defender\'
  condition: all of selection_*
falsepositives:
- Rare legitimate add to registry via cli (to these locations)
level: high
notes: |
  ### Technical Context
  The "Reg Add Suspicious Paths" rule detects potentially malicious activity involving the Windows `reg.exe` utility, which is commonly used to modify or create registry keys and values. By monitoring process creation logs for instances where `reg.exe` is executed, the rule flags activities that target specific registry paths commonly abused by attackers for persistence or defense evasion. Notably, this includes modifications to paths like `\AppDataLow\Software\Microsoft\`, and `\Policies\Microsoft\Windows\OOBE`, among others. The rule examines the command line associated with the `reg.exe` process, particularly looking for these suspicious arguments that indicate an attempt to manipulate system settings or installed software configurations. 
  ### Investigation Steps
  - Investigate the process creation logs associated with the detected `reg.exe` execution, focusing on timestamps and the user account involved to assess whether the activity is legitimate or suspicious.
  - Utilize EDR tools to analyze any associated processes that may have occurred around the same time as the `reg.exe` command to identify potential lateral movement or additional compromise actions.
  - Review registry change logs, if available, to identify the specific keys that were modified and determine the potential impact of these changes on the system’s security posture.
  - Correlate any outgoing traffic from the affected systems, using firewall and proxy logs, to identify hash or patterns that may relate to known malicious activities or additional command and control communication.
