title: Scheduled Task Executing Payload from Registry
id: 86588b36-c6d3-465f-9cee-8f9093e07798
related:
- id: c4eeeeae-89f4-43a7-8b48-8d1bdfa66c78
  type: derived
status: test
description: Detects the creation of a schtasks that potentially executes a payload
  stored in the Windows Registry using PowerShell.
references:
- https://thedfirreport.com/2022/02/21/qbot-and-zerologon-lead-to-full-domain-compromise/
author: X__Junior (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)
date: 2023-07-18
tags:
- attack.execution
- attack.persistence
- attack.t1053.005
- attack.t1059.001
logsource:
  product: windows
  category: process_creation
detection:
  selection_img:
        # schtasks.exe /Create /F /TN "{97F2F70B-10D1-4447-A2F3-9B070C86E261}" /TR "cmd /c start /min \"\" powershell.exe -Command IEX([System.Text.Encoding]::ASCII.GetString([System.Convert]::FromBase64String((Get-ItemProperty -Path HKCU:\SOFTWARE\Pvoeooxf).yzbbvhhdypa))) " /SC MINUTE /MO 30
  - Image|endswith: '\schtasks.exe'
  - OriginalFileName: 'schtasks.exe'
  selection_cli_create:
    CommandLine|contains: '/Create'
  selection_cli_get:
    CommandLine|contains:
    - 'Get-ItemProperty'
    - ' gp '         # Alias
  selection_cli_hive:
    CommandLine|contains:
    - 'HKCU:'
    - 'HKLM:'
    - 'registry::'
    - 'HKEY_'
  filter_main_encoding:
    CommandLine|contains:
    - 'FromBase64String'
    - 'encodedcommand'
  condition: all of selection_* and not 1 of filter_*
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  This Sigma rule is designed to detect the execution of scheduled tasks that potentially run a malicious payload stored in the Windows Registry via PowerShell. It specifically looks for the `schtasks.exe` command-line utility being invoked with specific parameters that indicate the creation of a scheduled task. The rule captures instances where parameters involve registry queries that utilize commands like `Get-ItemProperty`, particularly when they reference keys in the `HKCU` (HKEY_CURRENT_USER) or `HKLM` (HKEY_LOCAL_MACHINE) hives. Additionally, it checks for indications that the command includes encoded strings, which are often used by attackers to obfuscate malicious payloads.
  Alert conditions are met when both the `schtasks.exe` command and specified command-line patterns are present, ensuring that the rule focuses on suspicious behavior while filtering out known benign usage patterns. This helps security professionals identify potential threats that could compromise the integrity of the system or lead to unauthorized access.
  ### Investigation Steps
  - Review recent scheduled tasks created on the affected system by querying relevant logs through your EDR or Windows Event logs.
  - Investigate the command-line arguments of the detected `schtasks.exe` execution to analyze the specific payload being referenced and its source in the registry.
  - Cross-check the registry entries accessed (`HKCU` or `HKLM`) for unauthorized modifications or suspicious values related to the payload.
  - Utilize AV and threat intelligence tools to assess the potential reputation of any executed PowerShell commands and to identify if they have been previously associated with malicious activity.
