title: UAC Bypass Using DismHost
id: 853e74f9-9392-4935-ad3b-2e8c040dae86
status: test
description: Detects the pattern of UAC Bypass using DismHost DLL hijacking (UACMe
  63)
references:
- https://github.com/hfiref0x/UACME
author: Christian Burkard (Nextron Systems)
date: 2021-08-30
modified: 2024-12-01
tags:
- attack.defense-evasion
- attack.privilege-escalation
- attack.t1548.002
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    ParentImage|contains|all:
    - 'C:\Users\'
    - '\AppData\Local\Temp\'
    - '\DismHost.exe'
    IntegrityLevel:
    - 'High'
    - 'System'
    - 'S-1-16-16384'         # System
    - 'S-1-16-12288'         # High
  condition: selection
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This detection rule targets UAC (User Account Control) bypass attempts that leverage the DismHost executable and its associated DLL hijacking techniques, specifically outlined in UACMe. The rule identifies instances where processes with high or system-level integrity are spawned from specific parent image paths such as user directories or temporary folders, which are often indicative of malicious behavior. The key technical data sources for this detection include process creation logs and relevant integrity level indicators, allowing the detection of unauthorized privilege escalation activities. By monitoring for these patterns, the rule helps in identifying potential misuse of system components to bypass security mechanisms, which is a common tactic used by threat actors.
  ### Investigation Steps
  - Review the corresponding process creation logs in the EDR to identify the parent-child process relationship and confirm if DismHost.exe was involved in the UAC bypass attempt.
  - Check the integrity level of the processes spawned by DismHost.exe to ensure they align with the high or system levels specified in the detection rule.
  - Investigate any recent changes or anomalies in the AppData\Local\Temp directory or user directories that might suggest a malicious payload was downloaded or executed.
  - Analyze the associated logs from the SIEM for any unusual user behavior or command-line arguments that may indicate an elevated privilege escalation attempt was made.
