title: Enumeration for Credentials in Registry
id: e0b0c2ab-3d52-46d9-8cb7-049dc775fbd1
status: test
description: |
  Adversaries may search the Registry on compromised systems for insecurely stored credentials.
  The Windows Registry stores configuration information that can be used by the system or other programs.
  Adversaries may query the Registry looking for credentials and passwords that have been stored for use by other programs or services
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1552.002/T1552.002.md
author: frack113
date: 2021-12-20
modified: 2022-12-25
tags:
- attack.credential-access
- attack.t1552.002
logsource:
  category: process_creation
  product: windows
detection:
  reg:
    Image|endswith: '\reg.exe'
    CommandLine|contains|all:
    - ' query '
    - '/t '
    - 'REG_SZ'
    - '/s'
  hive:
  - CommandLine|contains|all:
    - '/f '
    - 'HKLM'
  - CommandLine|contains|all:
    - '/f '
    - 'HKCU'
  - CommandLine|contains: 'HKCU\Software\SimonTatham\PuTTY\Sessions'
  condition: reg and hive
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  This detection rule is designed to identify potential credential enumeration activities by monitoring process creation logs on Windows systems. Specifically, it looks for instances where the executable `reg.exe` is used to query the Windows Registry in ways that indicate an adversary may be attempting to discover insecurely stored credentials. The rule focuses on command-line parameters sent to `reg.exe`, particularly those that include patterns indicating queries for specific registry keys such as `HKLM` (HKEY_LOCAL_MACHINE) and `HKCU` (HKEY_CURRENT_USER), which are common targets for credential storage. By leveraging this data from the Windows API, security teams can detect and respond to potential unauthorized credential access behavior.
  ### Investigation Steps
  - Utilize the EDR tool to search for process creation events that feature `reg.exe` in the command line, specifically those containing the query flags and target registry keys outlined in this rule.
  - Check historical proxy logs to identify if there has been any anomalous outbound activity correlating with the timing of the detected registry queries, which may indicate further malicious intent.
  - Inspect Windows Event Logs for any unusual login attempts or privilege escalations that may accompany the use of `reg.exe`, as attackers may be looking to leverage found credentials.
  - Review security alerts from your AV or NGFW solution to cross-reference any alerts related to known malicious activities or tools that may align with the detected registry queries.
