title: WMI Backdoor Exchange Transport Agent
id: 797011dc-44f4-4e6f-9f10-a8ceefbe566b
status: test
description: Detects a WMI backdoor in Exchange Transport Agents via WMI event filters
references:
- https://twitter.com/cglyer/status/1182389676876980224
- https://twitter.com/cglyer/status/1182391019633029120
author: Florian Roth (Nextron Systems)
date: 2019-10-11
modified: 2023-02-08
tags:
- attack.persistence
- attack.t1546.003
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    ParentImage|endswith: '\EdgeTransport.exe'
  filter_conhost:
    Image: 'C:\Windows\System32\conhost.exe'
  filter_oleconverter:    # FP also documented in https://speakerdeck.com/heirhabarov/hunting-for-persistence-via-microsoft-exchange-server-or-outlook?slide=18
    Image|startswith: 'C:\Program Files\Microsoft\Exchange Server\'
    Image|endswith: '\Bin\OleConverter.exe'
  condition: selection and not 1 of filter_*
falsepositives:
- Unknown
level: critical
notes: |
  ### Technical Context
  The Sigma rule titled "WMI Backdoor Exchange Transport Agent" is designed to detect the presence of a potential backdoor within Microsoft Exchange Transport Agents by monitoring for specific Windows Management Instrumentation (WMI) event filters. It specifically looks for process creation events where the parent image is `EdgeTransport.exe`, which is the executable responsible for routing email in Exchange environments. The rule also checks if the process is spawned from `conhost.exe`, indicating an abnormal execution context. Moreover, it excludes benign processes related to `OleConverter.exe`, a known component of Microsoft Exchange, to reduce false positives. Detecting these suspicious behaviors can reveal attempts to maintain persistence and escalate privileges within an Exchange server environment.
  ### Investigation Steps
  - Utilize the EDR tool to review the process creation logs, specifically looking for instances where `EdgeTransport.exe` is the parent process of suspicious child processes.
  - Investigate the execution context of identified processes in the EDR, focusing on any connections or commands associated with `conhost.exe`.
  - Cross-reference the timestamps of suspicious activities with the scheduled tasks and WMI filters in Exchange Server to identify any unauthorized modifications.
  - Check proxy and network logs for any unusual outbound connections from the `EdgeTransport.exe` process, indicating potential data exfiltration or command and control communication.
