title: CreateDump Process Dump
id: 515c8be5-e5df-4c5e-8f6d-a4a2f05e4b48
related:
- id: 1a1ed54a-2ba4-4221-94d5-01dee560d71e
  type: similar
status: test
description: Detects uses of the createdump.exe LOLOBIN utility to dump process memory
references:
- https://www.crowdstrike.com/blog/overwatch-exposes-aquatic-panda-in-possession-of-log-4-shell-exploit-tools/
- https://twitter.com/bopin2020/status/1366400799199272960
author: Florian Roth (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)
date: 2022-01-04
modified: 2022-08-19
tags:
- attack.defense-evasion
- attack.t1036
- attack.t1003.001
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: '\createdump.exe'
  - OriginalFileName: 'FX_VER_INTERNALNAME_STR'
  selection_cli:
    CommandLine|contains:
    - ' -u '         # Short version of '--full'
    - ' --full '
    - ' -f '         # Short version of '--name'
    - ' --name '
    - '.dmp '
  condition: all of selection_*
falsepositives:
- Command lines that use the same flags
level: high
notes: |
  ### Technical Context
  The rule titled "CreateDump Process Dump" focuses on identifying the usage of the `createdump.exe` tool, specifically utilized by threat actors for obtaining memory dumps of running processes. This utility is commonly associated with threat operations, allowing attackers to extract valuable information from process memory that may include sensitive credentials and other executable code, enhancing capabilities for evasion and lateral movement within the network. The detection leverages process creation logs from Windows systems, specifically monitoring for instances where the `createdump.exe` file is executed with certain command-line arguments indicative of malicious activities. The use of specific parameters, such as `-u` and `--full`, flags the command as part of this investigative rule.
  ### Investigation Steps
  - Review endpoint logs in your EDR solution to identify instances of `createdump.exe` execution along with the corresponding process tree to understand the context of the dump.
  - Inspect command-line parameters used during the execution, especially looking for flags like `-u`, `--full`, or `--name`, which indicate a potential malicious intent for memory dump activities.
  - Cross-reference the alerts against known baselines within your AV and endpoint security tools to rule out legitimate uses or false positives from sanctioned activities.
  - Examine network logs in your Proxy or NGFW for any subsequent suspicious outbound connections that may occur following the execution of `createdump.exe`.
