title: Phishing Pattern ISO in Archive
id: fcdf69e5-a3d3-452a-9724-26f2308bf2b1
status: test
description: Detects cases in which an ISO files is opend within an archiver like
  7Zip or Winrar, which is a sign of phishing as threat actors put small ISO files
  in archives as email attachments to bypass certain filters and protective measures
  (mark of web)
references:
- https://twitter.com/1ZRR4H/status/1534259727059787783
- https://app.any.run/tasks/e1fe6a62-bce8-4323-a49a-63795d9afd5d/
author: Florian Roth (Nextron Systems)
date: 2022-06-07
tags:
- attack.initial-access
- attack.t1566
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    ParentImage|endswith:
    - '\Winrar.exe'
    - '\7zFM.exe'
    - '\peazip.exe'
    Image|endswith:
    - '\isoburn.exe'
    - '\PowerISO.exe'
    - '\ImgBurn.exe'
  condition: selection
falsepositives:
- Legitimate cases in which archives contain ISO or IMG files and the user opens the
  archive and the image via clicking and not extraction
level: high
notes: |
  n
  ### Technical Context
  This Sigma rule is designed to detect potentially malicious behavior associated with the opening of ISO files within archiving software, such as 7-Zip or WinRAR. Phishing attacks often use compressed archives to bypass email filters, making it critical for incident responders to monitor the use of these applications. The rule specifically looks for process creation events where the parent image is one of the supported archivers and the child process is a known ISO handling application like `isoburn.exe`, `PowerISO.exe`, or `ImgBurn.exe`. By flagging instances where ISO files are opened within these contexts, the rule serves as an alert for possible phishing attempts that could jeopardize enterprise security.
  ### Investigation Steps
  - Review process creation logs in the EDR to identify instances where an ISO file was opened by an archiver. Pay attention to the timestamp and the user context of the activity.
  - Analyze command-line parameters associated with the detected processes to determine if any suspicious options were used, indicating a potential attempt to execute embedded payloads.
  - Cross-reference the originating email or file share link associated with the archived file using Proxy or Email logs. Investigate the sender's legitimacy and any previous interactions.
  - Check for any related alerts or anomalies in network traffic that may correspond to the timeframe of the detected events using NDR tools, indicating possible data exfiltration or command and control activity.
