title: Wusa.EXE Executed By Parent Process Located In Suspicious Location
id: ef64fc9c-a45e-43cc-8fd8-7d75d73b4c99
status: experimental
description: |
  Detects execution of the "wusa.exe" (Windows Update Standalone Installer) utility by a parent process that is located in a suspicious location.
  Attackers could instantiate an instance of "wusa.exe" in order to bypass User Account Control (UAC). They can duplicate the access token from "wusa.exe" to gain elevated privileges.
references:
- https://www.fortinet.com/blog/threat-research/konni-campaign-distributed-via-malicious-document
author: X__Junior (Nextron Systems)
date: 2023-11-26
modified: 2024-08-15
tags:
- attack.execution
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
    Image|endswith: '\wusa.exe'
  selection_paths_1:
    ParentImage|contains:
            # Note: Add additional suspicious locations to increase coverage
    - ':\Perflogs\'
    - ':\Users\Public\'
    - ':\Windows\Temp\'
    - '\Appdata\Local\Temp\'
    - '\Temporary Internet'
  selection_paths_2:
  - ParentImage|contains|all:
    - ':\Users\'
    - '\Favorites\'
  - ParentImage|contains|all:
    - ':\Users\'
    - '\Favourites\'
  - ParentImage|contains|all:
    - ':\Users\'
    - '\Contacts\'
  - ParentImage|contains|all:
    - ':\Users\'
    - '\Pictures\'
  filter_main_msu:
        # Note: We exclude MSU extension files. A better approach is to baseline installation of updates in your env to avoid false negatives.
    CommandLine|contains: '.msu'
  condition: selection_img and 1 of selection_paths_* and not 1 of filter_main_*
falsepositives:
- Unknown
level: high
notes: |
  n
  ### Technical Context
  This Sigma rule is designed to detect instances of the "wusa.exe" (Windows Update Standalone Installer) utility being executed by a parent process located in suspicious directories. Such behavior may indicate an attempt by an attacker to bypass User Account Control (UAC) by utilizing "wusa.exe" to gain elevated privileges. The rule leverages Windows process creation logs to identify process execution, focusing on the paths of the parent processes that initiate "wusa.exe", particularly those located in typically non-standard directories such as `C:\Perflogs\`, `C:\Users\Public\`, or `C:\Windows\Temp\`. Additionally, the rule includes a filter to exclude legitimate "wusa.exe" executions that involve files with the MSU extension, which are standard for Windows updates. This detection aligns with the MITRE ATT&CK technique for Execution, indicating a potential execution of a malicious payload leveraging elevated privileges.
  ### Investigation Steps
  - **Check EDR Alerts:** Review EDR alerts related to "wusa.exe" and its parent processes. Utilize your EDR tool to gather detailed information about the context in which "wusa.exe" was executed, including timestamps and system events.
  - **Examine Process Trees:** Investigate the process trees related to any alerts generated by this rule. Trace the hierarchy of processes to determine the origin and legitimacy of the parent process that called "wusa.exe".
  - **Analyze Command Line Arguments:** Inspect the command line used for executing "wusa.exe". Focus on unusual parameters or signs of obfuscation that may suggest malicious intent.
  - **Review System Logs:** Conduct an audit of Windows Event Logs (Security, System) for any further anomalies or indicators of compromise in connection with the detected execution. Pay special attention to account logins, privilege escalations, and other alerts triggered around the same time.
  ### Prioritization
  The alert is classified as high severity due to the potential risk of privilege escalation and system compromise associated with unauthorized use of "wusa.exe", a legitimate system utility.
  ### Blind spots and Assumptions
  This detection rule may not trigger in scenarios where the parent process is legitimate but lives among the suspicious paths. Moreover, savvy adversaries could modify the code or execution paths of "wusa.exe" to mimic legitimate behavior, potentially evading detection. Additionally, false positives may occur if legitimate maintenance scripts inadvertently execute "wusa.exe" from these directories.
  > **Disclaimer:** This investigation guide was created using generative AI technology and has not been reviewed for its accuracy and relevance. While every effort has been made to ensure its quality, we recommend validating the content and adapting it to suit specific environment and operational needs. Please communicate any changes to the detection engineering team.
