title: Browser Execution In Headless Mode
id: ef9dcfed-690c-4c5d-a9d1-482cd422225c
related:
- id: 0e8cfe08-02c9-4815-a2f8-0d157b7ed33e
  type: derived
status: test
description: Detects execution of Chromium based browser in headless mode
references:
- https://twitter.com/mrd0x/status/1478234484881436672?s=12
- https://www.trendmicro.com/en_us/research/23/e/managed-xdr-investigation-of-ducktail-in-trend-micro-vision-one.html
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023-09-12
tags:
- attack.command-and-control
- attack.t1105
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith:
    - '\brave.exe'
    - '\chrome.exe'
    - '\msedge.exe'
    - '\opera.exe'
    - '\vivaldi.exe'
    CommandLine|contains: '--headless'
  condition: selection
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  This Sigma rule is designed to detect the execution of Chromium-based web browsers in headless mode, which is a state where the browser operates without a graphical user interface. Headless mode is commonly used in automated tasks, web scraping, or by malicious actors to execute web-based commands without being visually detected. The rule examines process creation logs specifically for instances of browsers such as Brave, Chrome, Microsoft Edge, Opera, and Vivaldi. It looks for command-line parameters that include '--headless', indicating that the browser is running in a non-visual mode. By analyzing these attributes, the rule helps to identify potentially suspicious or unauthorized browser activities that could signify a security threat.
  ### Investigation Steps
  - Utilize your EDR tool to investigate any alerts related to the execution of Chromium-based browsers in headless mode by reviewing the corresponding process creation events.
  - Analyze command-line parameters associated with the alerted processes to determine if any other suspicious options were included that may indicate malicious intent.
  - Check network logs (e.g., from a Proxy or Firewall) for outgoing connections made by the headless browser to identify if it is communicating with known malicious domains.
  - Review any relevant cloud platform logs, especially if the behavior is linked to cloud-based automation or scraping tasks, to ascertain the context of the headless browser execution.
