title: LSASS Dump Keyword In CommandLine
id: ffa6861c-4461-4f59-8a41-578c39f3f23e
related:
- id: a5a2d357-1ab8-4675-a967-ef9990a59391
  type: derived
status: test
description: |
  Detects the presence of the keywords "lsass" and ".dmp" in the commandline, which could indicate a potential attempt to dump or create a dump of the lsass process.
references:
- https://github.com/Hackndo/lsassy
- https://medium.com/@markmotig/some-ways-to-dump-lsass-exe-c4a75fdc49bf
- https://github.com/elastic/detection-rules/blob/c76a39796972ecde44cb1da6df47f1b6562c9770/rules/windows/credential_access_lsass_memdump_file_created.toml
- https://www.whiteoaksecurity.com/blog/attacks-defenses-dumping-lsass-no-mimikatz/
- https://github.com/helpsystems/nanodump
- https://github.com/CCob/MirrorDump
author: E.M. Anhaus, Tony Lambert, oscd.community, Nasreddine Bencherchali (Nextron
  Systems)
date: 2019-10-24
modified: 2023-08-29
tags:
- attack.credential-access
- attack.t1003.001
logsource:
  category: process_creation
  product: windows
detection:
  selection:
  - CommandLine|contains:
    - 'lsass.dmp'
    - 'lsass.zip'
    - 'lsass.rar'
    - 'Andrew.dmp'
    - 'Coredump.dmp'
    - 'NotLSASS.zip'            # https://github.com/CCob/MirrorDump
    - 'lsass_2'            # default format of procdump v9.0 is lsass_YYMMDD_HHmmss.dmp
    - 'lsassdump'
    - 'lsassdmp'
  - CommandLine|contains|all:
    - 'lsass'
    - '.dmp'
  - CommandLine|contains|all:
    - 'SQLDmpr'
    - '.mdmp'
  - CommandLine|contains|all:
    - 'nanodump'
    - '.dmp'
  condition: selection
falsepositives:
- Unlikely
level: high
notes: |
  ### Technical Context
  This Sigma rule is designed to detect potentially malicious attempts to create memory dumps of the LSASS (Local Security Authority Subsystem Service) process, which is crucial in handling Windows security policies and authentication. By examining process creation logs, the rule looks for command-line arguments containing specific keywords such as "lsass" and ".dmp," which are commonly associated with memory dumping tools like Mimikatz or other similar tools. Other variations, including compressed file formats and tool-specific names (e.g., "nanodump" and "SQLDmpr"), are also monitored to improve detection coverage. The presence of these keywords in command lines can signify a user's attempt to exfiltrate sensitive information, including passwords and other credentials.
  ### Investigation Steps
  - Examine the EDR logs for recent process activities related to the user's account to confirm if there were unauthorized attempts to create LSASS dumps.
  - Analyze command-line arguments logged in the process creation events to identify potential contexts and malicious intents behind the command execution.
  - Cross-reference the timestamp of the detected activity with any related proxy logs or VPN connections to assess if there were unusual external communications around the same time.
  - Investigate other security alerts or anomalies within system logs, such as suspicious network traffic or authentication failures that could provide additional context for the incident.
