title: Potentially Suspicious Execution Of PDQDeployRunner
id: 12b8e9f5-96b2-41e1-9a42-8c6779a5c184
related:
- id: d679950c-abb7-43a6-80fb-2a480c4fc450
  type: similar
status: test
description: Detects suspicious execution of "PDQDeployRunner" which is part of the
  PDQDeploy service stack that is responsible for executing commands and packages
  on a remote machines
references:
- https://twitter.com/malmoeb/status/1550483085472432128
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-07-22
modified: 2024-05-02
tags:
- attack.execution
logsource:
  category: process_creation
  product: windows
detection:
  selection_parent:
    ParentImage|contains: '\PDQDeployRunner-'
  selection_child:
        # Improve this section by adding other suspicious processes, commandlines or paths
  - Image|endswith:
              # If you use any of the following processes legitimately comment them out
    - '\bash.exe'
    - '\certutil.exe'
    - '\cmd.exe'
    - '\csc.exe'
    - '\cscript.exe'
    - '\dllhost.exe'
    - '\mshta.exe'
    - '\msiexec.exe'
    - '\regsvr32.exe'
    - '\rundll32.exe'
    - '\scriptrunner.exe'
    - '\wmic.exe'
    - '\wscript.exe'
    - '\wsl.exe'
  - Image|contains:
    - ':\ProgramData\'
    - ':\Users\Public\'
    - ':\Windows\TEMP\'
    - '\AppData\Local\Temp'
  - CommandLine|contains:
    - ' -decode '
    - ' -enc '
    - ' -encodedcommand '
    - ' -w hidden'
    - 'DownloadString'
    - 'FromBase64String'
    - 'http'
    - 'iex '
    - 'Invoke-'
  condition: all of selection_*
falsepositives:
- Legitimate use of the PDQDeploy tool to execute these commands
level: medium
notes: |
  n
  ### Technical Context
  This detection rule identifies potentially suspicious executions of the "PDQDeployRunner," which is associated with the PDQDeploy service for remotely executing commands and deploying software packages on target machines. The rule leverages process creation logs to monitor for instances where PDQDeployRunner is the parent process to suspicious child processes or command lines that exhibit common characteristics associated with malicious behavior. Specifically, it flags child processes like command shells and scripting engines (e.g., `powershell.exe`, `cmd.exe`) and command-line parameters often used in obfuscation techniques or malicious downloads. This detection aligns with the MITRE ATT&CK tactic of `Execution` and techniques that involve executing commands on external systems.
  ### Investigation Steps
  - **Review Process Creation Logs:** Utilize the EDR tool to examine the process creation logs surrounding the PDQDeployRunner execution for additional context on the executed commands and the user account involved.
  - **Analyze Command Line Arguments:** Check the command-line arguments associated with the detected child processes for any suspicious patterns or obfuscation techniques that may indicate malicious activity.
  - **Investigate Related User Activity:** Use Windows Security logs to investigate user actions leading up to the alert to determine if this activity correlates with known user behavior or if it suggests credential compromise.
  - **Correlate with Network Activity:** Analyze network logs for any outbound connections initiated by the suspicious processes, particularly focusing on uncommon destinations or patterns that may indicate data exfiltration or command and control (C2) communications.
  ### Prioritization
  The severity level of medium reflects a potential threat that, while may indicate legitimate administrative tasks, could also denote misuse or compromise of administrative tools, warranting further investigation to rule out malicious intent.
  ### Blind Spots and Assumptions
  This rule may not trigger if the PDQDeploy tool is used legitimately in contexts where its execution is expected. Additionally, if an adversary utilizes standard or whitelisted processes without distinctive command-line arguments or operates from trusted locations, it may bypass detection. There is also an assumption that process creation logs are enabled and retained adequately to capture necessary events for correlating suspicious activity.
  > **Disclaimer:** This investigation guide was created using generative AI technology and has not been reviewed for its accuracy and relevance. While every effort has been made to ensure its quality, we recommend validating the content and adapting it to suit specific environment and operational needs. Please communicate any changes to the detection engineering team.
