title: Suspicious Manipulation Of Default Accounts Via Net.EXE
id: 5b768e71-86f2-4879-b448-81061cbae951
status: test
description: Detects suspicious manipulations of default accounts such as 'administrator'
  and 'guest'. For example 'enable' or 'disable' accounts or change the password...etc
references:
- https://www.trellix.com/en-sg/about/newsroom/stories/threat-labs/lockergoga-ransomware-family-used-in-targeted-attacks.html
- https://redacted.com/blog/bianlian-ransomware-gang-gives-it-a-go/
- https://www.microsoft.com/security/blog/2022/09/07/profiling-dev-0270-phosphorus-ransomware-operations/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-09-01
modified: 2023-02-21
tags:
- attack.collection
- attack.t1560.001
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith:
    - '\net.exe'
    - '\net1.exe'
  - OriginalFileName:
    - 'net.exe'
    - 'net1.exe'
  selection_user_option:
    CommandLine|contains: ' user '
  selection_username:
    CommandLine|contains:
            # Note: We need to write the full account name for cases starting with 'admin' to avoid lookups only with the user flag
    - ' Järjestelmänvalvoja '         # Finish
    - ' Rendszergazda '         # Hungarian
    - ' Администратор '         # Russian
    - ' Administrateur '         # French
    - ' Administrador '         # Portuguese (Brazil + Portugal) + Spanish
    - ' Administratör '         # Swedish
    - ' Administrator '         # English
    - ' guest '
    - ' DefaultAccount '
            # The cases below are for when an attacker requests the net command via 'cmd /c....'
            # First in double quotes
    - ' "Järjestelmänvalvoja" '         # Finish
    - ' "Rendszergazda" '         # Hungarian
    - ' "Администратор" '         # Russian
    - ' "Administrateur" '         # French
    - ' "Administrador" '         # Portuguese (Brazil + Portugal) + Spanish
    - ' "Administratör" '         # Swedish
    - ' "Administrator" '         # English
    - ' "guest" '
    - ' "DefaultAccount" '
            # Second in single quotes
    - " 'Järjestelmänvalvoja' "         # Finish
    - " 'Rendszergazda' "         # Hungarian
    - " 'Администратор' "         # Russian
    - " 'Administrateur' "         # French
    - " 'Administrador' "         # Portuguese (Brazil + Portugal) + Spanish
    - " 'Administratör' "         # Swedish
    - " 'Administrator' "         # English
    - " 'guest' "
    - " 'DefaultAccount' "
  filter:
    CommandLine|contains|all:
    - 'guest'
    - '/active no'
  condition: all of selection_* and not filter
falsepositives:
- Some false positives could occur with the admin or guest account. It depends on
  the scripts being used by the admins in your env. If you experience a lot of FP
  you could reduce the level to medium
level: high
notes: |
  ### Technical Context
  This detection rule monitors for suspicious manipulations of default user accounts, specifically targeting actions involving accounts like 'administrator' and 'guest' using the `net.exe` command-line tool in Windows environments. The rule captures process creation events where the `net.exe` or `net1.exe` binaries are executed, specifically looking for command-line parameters indicating user management actions. It identifies account manipulation activities, such as enabling or disabling accounts and changing passwords, by examining command-line arguments that contain specific account names in various languages. This high-level detection is crucial in identifying potential malicious activities, such as unauthorized access attempts or lateral movements within the network.
  ### Investigation Steps
  - Use EDR tools to review the detected process creation events related to `net.exe` to validate the context of the command and identify the user responsible for initiating it.
  - Check system logs and audit trails for any recent changes to user accounts, particularly focusing on the 'administrator' and 'guest' accounts to assess if their security posture has been compromised.
  - Query VPN logs and network traffic analysis tools to determine if there are any unusual or unauthorized remote connections coinciding with the detected account manipulations.
  - Cross-reference the results with threat intelligence sources and internal security policies to determine if the action is aligned with acceptable administrative practices or indicative of malicious behavior.
