title: Remote Access Tool - LogMeIn Execution
id: d85873ef-a0f8-4c48-a53a-6b621f11729d
status: test
description: |
  An adversary may use legitimate desktop support and remote access software, such as Team Viewer, Go2Assist, LogMein, AmmyyAdmin, etc, to establish an interactive command and control channel to target systems within networks.
  These services are commonly used as legitimate technical support software, and may be allowed by application control within a target environment.
  Remote access tools like VNC, Ammyy, and Teamviewer are used frequently when compared with other legitimate software commonly used by adversaries. (Citation: Symantec Living off the Land)
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1219/T1219.md#atomic-test-3---logmein-files-detected-test-on-windows
author: frack113
date: 2022-02-11
modified: 2023-03-05
tags:
- attack.command-and-control
- attack.t1219
logsource:
  category: process_creation
  product: windows
detection:
  selection:
  - Description: LMIGuardianSvc
  - Product: LMIGuardianSvc
  - Company: LogMeIn, Inc.
  condition: selection
falsepositives:
- Legitimate use
level: medium
notes: |
  ### Technical Context
  This Sigma rule detects the execution of the LogMeIn remote access tool, which can be leveraged by adversaries to establish a command and control (C2) channel within an enterprise environment. LogMeIn, categorized under desktop support software, is often utilized for legitimate remote assistance. However, its presence could indicate unauthorized remote access attempts when used outside of sanctioned scenarios. The detection mechanism relies on process creation logs that capture details about each process initiated on Windows machines, specifically looking for processes associated with the "LMIGuardianSvc," which is the service responsible for LogMeIn's functionality. By monitoring these logs, security analysts can identify instances of LogMeIn being executed and alert teams to potential security incidents involving remote access.
  ### Investigation Steps
  - Review process creation logs in the EDR to identify the execution of the "LMIGuardianSvc" process and any associated command-line parameters to determine the legitimacy of usage.
  - Check user account activity associated with the remote access event to assess if the session was initiated by authorized personnel or if it appears suspicious.
  - Examine network traffic logs using the NDR to verify if there are unusual connections to external IP addresses corresponding with the timeframe of the detected LogMeIn execution.
  - Consult AV and endpoint security logs to look for any detections or alerts related to remote access tools, which may indicate malicious activity or compromise in the environment.
