title: InfDefaultInstall.exe .inf Execution
id: ce7cf472-6fcc-490a-9481-3786840b5d9b
status: test
description: Executes SCT script using scrobj.dll from a command in entered into a
  specially prepared INF file.
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1218/T1218.md#atomic-test-4---infdefaultinstallexe-inf-execution
- https://lolbas-project.github.io/lolbas/Binaries/Infdefaultinstall/
author: frack113
date: 2021-07-13
modified: 2022-10-09
tags:
- attack.defense-evasion
- attack.t1218
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|contains|all:
    - 'InfDefaultInstall.exe '
    - '.inf'
  condition: selection
fields:
- ComputerName
- User
- CommandLine
- ParentCommandLine
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  The rule "InfDefaultInstall.exe .inf Execution" is designed to detect the execution of a specific Windows component, InfDefaultInstall.exe, which is often utilized in a malicious context to execute scripts through custom INF files. This detection relies on an examination of process creation logs to identify command-line instances that contain both "InfDefaultInstall.exe" and ".inf". This combination is pertinent as it reflects an attempt to utilize the INF file execution method, often linked to evading standard security measures. By monitoring these command-line arguments, the rule serves as a critical alerting mechanism for potential exploitation scenarios wherein malicious actors leverage this functionality.
  This rule is triggered when the defined conditions are met, capturing relevant data fields such as ComputerName, User, CommandLine, and ParentCommandLine. Incident responders should be aware that legitimate usage of this utility is less common, making alerts generated by this rule more likely to represent malicious activity.
  ### Investigation Steps
  - Utilize your EDR tool to investigate the alert and identify the system where the InfDefaultInstall.exe command was executed. Check for any unusual execution patterns or anomalies in the associated user account.
  - Review the command-line arguments and parent processes to understand the context of the execution. This will help identify whether the execution appears legitimate or potentially malicious.
  - Check related logs from the Windows event log for any activity around the same timestamp as the alert, noting any subsequent process creations or unusual user activities.
  - Use your network detection tools (NDR/NGFW) to inspect any outbound traffic that may have been generated by the executing process. Look for any connections to known malicious IPs or unusual data exfiltration activity.
