title: HackTool - SharpImpersonation Execution
id: f89b08d0-77ad-4728-817b-9b16c5a69c7a
related:
- id: cf0c254b-22f1-4b2b-8221-e137b3c0af94
  type: similar
status: test
description: Detects execution of the SharpImpersonation tool. Which can be used to
  manipulate tokens on a Windows computers remotely (PsExec/WmiExec) or interactively
references:
- https://s3cur3th1ssh1t.github.io/SharpImpersonation-Introduction/
- https://github.com/S3cur3Th1sSh1t/SharpImpersonation
author: Sai Prashanth Pulisetti @pulisettis, Nasreddine Bencherchali (Nextron Systems)
date: 2022-12-27
modified: 2023-02-13
tags:
- attack.privilege-escalation
- attack.defense-evasion
- attack.t1134.001
- attack.t1134.003
logsource:
  product: windows
  category: process_creation
detection:
  selection_img:
  - Image|endswith: '\SharpImpersonation.exe'
  - OriginalFileName: 'SharpImpersonation.exe'
  selection_cli:
  - CommandLine|contains|all:
    - ' user:'
    - ' binary:'
  - CommandLine|contains|all:
    - ' user:'
    - ' shellcode:'
  - CommandLine|contains:
    - ' technique:CreateProcessAsUserW'
    - ' technique:ImpersonateLoggedOnuser'
  condition: 1 of selection_*
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This Sigma rule detects the execution of the `SharpImpersonation` tool, which is designed to manipulate Windows user tokens, potentially allowing privilege escalation or evasion of defenses. The rule primarily analyzes process creation logs for specific indicators related to `SharpImpersonation.exe`, focusing on the file name and command-line arguments used during execution. Notably, it looks for commands that include keywords such as "user:" and "binary:" or "shellcode:", which are indicative of the techniques utilized by this tool. By examining these criteria, security teams can identify potentially malicious attempts to exploit user impersonation practices in a Windows environment.
  The key data sources utilized for this detection are Windows process creation logs, which record the execution details of processes, including command-line parameters and original file names. This information is critical for recognizing the use of `SharpImpersonation`, particularly in contexts where unexpected or unauthorized actions may occur.
  ### Investigation Steps
  - Review the EDR logs for instances of `SharpImpersonation.exe` execution and analyze the context of the process launch, including the parent process ID and associated user account.
  - Investigate the command-line parameters utilized alongside the execution by examining process creation logs for any occurrences of keywords like "user:", "binary:", or "shellcode:".
  - Use the SIEM to correlate the `SharpImpersonation` alerts with other security logs, such as authentication attempts, to identify suspicious activity patterns around the same timeframe.
  - Check network traffic via NDR to see if there are any outbound connections or unusual data exfiltration attempts linked to the user accounts involved in the `SharpImpersonation` execution.
