title: File And SubFolder Enumeration Via Dir Command
id: 7c9340a9-e2ee-4e43-94c5-c54ebbea1006
status: test
description: |
  Detects usage of the "dir" command part of Widows CMD with the "/S" command line flag in order to enumerate files in a specified directory and all subdirectories.
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1217/T1217.md
author: frack113
date: 2021-12-13
modified: 2024-04-14
tags:
- attack.discovery
- attack.t1217
logsource:
  category: process_creation
  product: windows
detection:
  selection_cmd:
  - Image|endswith: '\cmd.exe'
  - OriginalFileName: Cmd.Exe
  selection_cli:
    CommandLine|contains|windash: 'dir*-s'
  condition: all of selection_*
falsepositives:
- Likely
level: low
notes: |
  ### Technical Context
  This detection rule identifies the execution of the Windows Command Prompt (`cmd.exe`) with a specific command line parameter that initiates file enumeration. Specifically, it looks for the use of the `dir` command accompanied by the `/S` flag, which lists all files and directories in a specified directory and all its subdirectories. This behavior can be indicative of reconnaissance activity, as it allows an entity to gather information about the file structure within a target system. The primary technical data sources leveraged for this detection include process creation logs that capture the command lines executed, enabling the identification of potentially malicious activities initiated through standard command-line tools.
  ### Investigation Steps
  - Use your EDR tool to review the process creation logs around the time of the alert to determine if the `dir /S` command was executed by an unusual or unauthorized user account.
  - Cross-reference with Windows Event Logs to identify any additional commands run by the same process or user, providing context on the potential intent behind the enumeration.
  - Check proxy logs for any network activity that occurred post-execution, as this may indicate a follow-up action, such as data exfiltration or lateral movement attempts.
  - If applicable, review cloud logs from AWS, GCP, or Azure for any API calls or resource access that correlate with the timestamp of the command execution, which could suggest suspicious behavior extending beyond local enumeration.
