title: Sticky Key Like Backdoor Execution
id: 2fdefcb3-dbda-401e-ae23-f0db027628bc
related:
- id: baca5663-583c-45f9-b5dc-ea96a22ce542
  type: derived
status: test
description: Detects the usage and installation of a backdoor that uses an option
  to register a malicious debugger for built-in tools that are accessible in the login
  screen
references:
- https://learn.microsoft.com/en-us/archive/blogs/jonathantrull/detecting-sticky-key-backdoors
author: Florian Roth (Nextron Systems), @twjackomo, Jonhnathan Ribeiro, oscd.community
date: 2018-03-15
modified: 2023-03-07
tags:
- attack.privilege-escalation
- attack.persistence
- attack.t1546.008
- car.2014-11-003
- car.2014-11-008
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    ParentImage|endswith: '\winlogon.exe'
    Image|endswith:
    - '\cmd.exe'
    - '\cscript.exe'
    - '\mshta.exe'
    - '\powershell.exe'
    - '\pwsh.exe'
    - '\regsvr32.exe'
    - '\rundll32.exe'
    - '\wscript.exe'
    - '\wt.exe'
    CommandLine|contains:
    - 'sethc.exe'
    - 'utilman.exe'
    - 'osk.exe'
    - 'Magnify.exe'
    - 'Narrator.exe'
    - 'DisplaySwitch.exe'
  condition: selection
falsepositives:
- Unlikely
level: critical
notes: |
  ### Technical Context
  The "Sticky Key Like Backdoor Execution" detection rule is designed to identify potential misuse of built-in Windows accessibility tools to execute malicious code. The rule specifically looks for process creation events where common executables (such as `cmd.exe`, `powershell.exe`, or `wscript.exe`) are launched with command-line arguments that reference 'sethc.exe' or other accessibility tools like 'utilman.exe' and 'osk.exe'. By observing the parent process as `winlogon.exe`, the rule zeroes in on suspicious activity that typically indicates attempts to escalate privileges or establish persistence via a backdoor. This technique can enable unauthorized users to bypass security measures while maintaining access to the system during the login screen.
  ### Investigation Steps
  - Analyze recent process creation logs in your EDR to identify instances where the specified tools were invoked with concerning arguments related to accessibility functions.
  - Review command-line parameters associated with the flagged processes for evidence of abnormal usage patterns or scripts invoking these executables.
  - Investigate the user accounts associated with the identified processes to determine if unauthorized access attempts or privilege escalations occurred.
  - Cross-reference alerts with logs from NGFW or Proxy to assess any unusual external connections made during the time of the suspicious activity.
