title: DumpStack.log Defender Evasion
id: 4f647cfa-b598-4e12-ad69-c68dd16caef8
status: test
description: Detects the use of the filename DumpStack.log to evade Microsoft Defender
references:
- https://twitter.com/mrd0x/status/1479094189048713219
author: Florian Roth (Nextron Systems)
date: 2022-01-06
modified: 2022-06-17
tags:
- attack.defense-evasion
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith: '\DumpStack.log'
  selection_download:
    CommandLine|contains: ' -o DumpStack.log'
  condition: 1 of selection*
falsepositives:
- Unknown
level: critical
notes: |
  ### Technical Context
  The "DumpStack.log Defender Evasion" detection rule focuses on identifying attempts to manipulate Microsoft Defender's functionality by using a specific filename, "DumpStack.log." This is typically associated with techniques employed by threat actors to bypass detection mechanisms. The rule inspects process creation logs, particularly looking for instances where a process attempts to create or reference a file with this name. Additionally, it checks for command-line parameters that include the string " -o DumpStack.log," which is often an indicator of potential malicious activity intended to mislead security tools. By monitoring these behaviors, the rule aims to highlight evasion tactics that adversaries might use to remain undetected during the execution of their malicious activities.
  ### Investigation Steps
  - Review the EDR logs for any processes that have been created with "DumpStack.log" in their filename. Pay special attention to the parent processes to analyze the context of execution. 
  - Analyze command-line parameters in the EDR and correlate them with known malicious indicators, particularly those that include " -o DumpStack.log." This can help determine if the activity is part of a broader attack.
  - Check the SIEM for any alerts or anomalies around the same timeframe as the detection to identify any additional suspicious behavior or correlated events that may indicate an ongoing threat.
  - Utilize the AV and endpoint monitoring tools to assess whether any of the detected processes were flagged or quarantined, and gather further insights into the nature and intent of the process behavior.
