title: Python Function Execution Security Warning Disabled In Excel
id: 023c654f-8f16-44d9-bb2b-00ff36a62af9
related:
- id: 17e53739-a1fc-4a62-b1b9-87711c2d5e44
  type: similar
status: test
description: |
  Detects changes to the registry value "PythonFunctionWarnings" that would prevent any warnings or alerts from showing when Python functions are about to be executed.
  Threat actors could run malicious code through the new Microsoft Excel feature that allows Python to run within the spreadsheet.
references:
- https://support.microsoft.com/en-us/office/data-security-and-python-in-excel-33cc88a4-4a87-485e-9ff9-f35958278327
author: '@Kostastsale'
date: 2023-08-22
tags:
- attack.defense-evasion
- attack.t1562.001
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|contains|all:
    - '\Microsoft\Office\'
    - '\Excel\Security'
    - 'PythonFunctionWarnings'
    CommandLine|contains: ' 0'
  condition: selection
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This Sigma rule is designed to detect changes made to a specific registry value in Microsoft Excel that disables security warnings associated with the execution of Python functions. The rule monitors process creation events on Windows systems, particularly focusing on command lines that indicate an alteration to the registry key "PythonFunctionWarnings." If the command line includes the path to Excel along with a parameter that sets the warning value to '0', the rule triggers an alert. This functionality could be exploited by threat actors to run malicious Python scripts within Excel spreadsheets without raising security alerts, posing a significant risk to the organization’s data integrity.
  ### Investigation Steps
  - Review the specific process creation logs in your EDR to identify any unauthorized changes made to the "PythonFunctionWarnings" registry value.
  - Analyze any related command-line activity from the affected Excel processes to determine if suspicious scripts or commands were executed.
  - Check recent activity logs in the security software (AV) to see if any alerts were triggered during the time of the rule detection for additional context.
  - Consult the Windows registry logs for changes to the relevant path, particularly any entries that correlate with the execution of Python code in Excel.
