title: Permission Check Via Accesschk.EXE
id: c625d754-6a3d-4f65-9c9a-536aea960d37
status: test
description: Detects the usage of the "Accesschk" utility, an access and privilege
  audit tool developed by SysInternal and often being abused by attacker to verify
  process privileges
references:
- https://speakerdeck.com/heirhabarov/hunting-for-privilege-escalation-in-windows-environment?slide=43
- https://www.youtube.com/watch?v=JGs-aKf2OtU&ab_channel=OFFZONEMOSCOW
- https://github.com/carlospolop/PEASS-ng/blob/fa0f2e17fbc1d86f1fd66338a40e665e7182501d/winPEAS/winPEASbat/winPEAS.bat
- https://github.com/gladiatx0r/Powerless/blob/04f553bbc0c65baf4e57344deff84e3f016e6b51/Powerless.bat
author: Teymur Kheirkhabarov (idea), Mangatas Tondang, oscd.community, Nasreddine
  Bencherchali (Nextron Systems)
date: 2020-10-13
modified: 2023-02-20
tags:
- attack.discovery
- attack.t1069.001
logsource:
  product: windows
  category: process_creation
detection:
  selection_img:
  - Product|endswith: 'AccessChk'
  - Description|contains: 'Reports effective permissions'
  - Image|endswith:
    - '\accesschk.exe'
    - '\accesschk64.exe'
  - OriginalFileName: 'accesschk.exe'
  selection_cli:
    CommandLine|contains:     # These are the most common flags used with this tool. You could add other combinations if needed
    - 'uwcqv '
    - 'kwsu '
    - 'qwsu '
    - 'uwdqs '
  condition: all of selection*
falsepositives:
- System administrator Usage
level: medium
notes: |
  ### Technical Context
  This detection rule is designed to identify the execution of the "Accesschk" utility, a tool primarily used for privilege auditing in Windows environments. Attackers often misuse Accesschk to verify process privileges as a precursor to privilege escalation. The rule analyzes process creation logs to detect instances where the Accesschk executable is invoked while specifically searching for command-line parameters typically associated with malicious intent. By filtering for specific product names and descriptions linked to Accesschk, along with a focused scrutiny of command-line arguments, the rule captures potentially unauthorized or malicious use of this utility.
  The primary log sources utilized by this rule are process creation logs on Windows systems, which provide vital information such as the executed image, its original filename, and any command-line parameters provided during execution. Instances captured by this rule warrant further investigation to determine whether they are legitimate administrative actions or potential indicators of compromise.
  ### Investigation Steps
  - Examine the EDR alerts for the identified process execution and review the timeline for the event to determine the user context under which Accesschk was executed.
  - Cross-reference the command-line arguments contained in the alert with legitimate administrative activities to understand the intent behind the execution.
  - Utilize the SIEM to query historical logs associated with the user account or system where Accesschk was initiated, looking for any other unusual behavior linked to that timeframe.
  - Investigate network activity and any related proxy logs for outbound connections that might align with unauthorized privilege-checking activities, providing context to the behavior of the application.
