title: Set Suspicious Files as System Files Using Attrib.EXE
id: efec536f-72e8-4656-8960-5e85d091345b
related:
- id: bb19e94c-59ae-4c15-8c12-c563d23fe52b
  type: derived
status: test
description: |
  Detects the usage of attrib with the "+s" option to set scripts or executables located in suspicious locations as system files to hide them from users and make them unable to be deleted with simple rights. The rule limits the search to specific extensions and directories to avoid FPs
references:
- https://app.any.run/tasks/c28cabc8-a19f-40f3-a78b-cae506a5c0d4
- https://app.any.run/tasks/cfc8870b-ccd7-4210-88cf-a8087476a6d0
- https://unit42.paloaltonetworks.com/unit42-sure-ill-take-new-combojack-malware-alters-clipboards-steal-cryptocurrency/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-06-28
modified: 2023-03-14
tags:
- attack.defense-evasion
- attack.t1564.001
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: '\attrib.exe'
  - OriginalFileName: 'ATTRIB.EXE'
  selection_cli:
    CommandLine|contains: ' +s'
  selection_paths:
    CommandLine|contains:
    - ' %'         # Custom Environment variable
    - '\Users\Public\'
    - '\AppData\Local\'
    - '\ProgramData\'
    - '\Downloads\'
    - '\Windows\Temp\'
  selection_ext:
    CommandLine|contains:
    - '.bat'
    - '.dll'
    - '.exe'
    - '.hta'
    - '.ps1'
    - '.vbe'
    - '.vbs'
  filter_optional_installer:
    CommandLine|contains|all:
    - '\Windows\TEMP\'
    - '.exe'
  condition: all of selection* and not 1 of filter_optional_*
falsepositives:
- Unknown
level: high
notes: |
  n
  ### Technical Context
  This detection rule aims to identify the suspicious use of the Windows command-line utility `attrib.exe` with the "+s" (system file) attribute inappropriately applied to executable and script files in known vulnerable directories. The rule focuses on specific file extensions like `.bat`, `.exe`, and `.ps1` typically associated with malware or scripts. By doing so, the rule highlights attempts by malicious actors to hide harmful files from users and standard file management processes, rendering them resistant to deletion. The data sources leveraged in this detection include process creation logs, which capture the invocation of command line processes, and capture details like command line parameters and file paths. This detection is associated with the MITRE ATT&CK tactic of **Defense Evasion** and technique **T1564.001**, which covers obfuscation and manipulation of files to evade detection.
  ### Investigation Steps
  - **Review the Command Line Execution:**
    Examine the process creation logs in your EDR for instances of `attrib.exe` with the "+s" parameter, paying close attention to the associated command lines and arguments.
  - **Check File Attributes:**
    Use PowerShell or other file management tools to inspect the attributes of files in the directories highlighted by the alert, ensuring to verify which files were marked as system files.
  - **Investigate the Source and Time of Execution:**
    Look into the timeline of the detected event by correlating it with additional logs from your Windows Event Logs (Security, System, Application) to identify whether the triggering process was preceded by other suspicious activities.
  - **Inspect Related Network Activity:**
    Query your NDR or firewall logs to find any the network connections correlated with the execution time of `attrib.exe`, as additional malware payloads may be delivered through exploitation of the system.
  ### Prioritization
  Alerts generated by this rule should be treated with high severity, as modifying file attributes like this can indicate advanced techniques used by adversaries to maintain persistence or evade detection mechanisms, potentially leading to larger security incidents.
  ### Blind Spots and Assumptions
  This rule may not fire if the `attrib.exe` command is used in a legitimate context, leading to potential false negatives. The effectiveness might also be reduced if the attacker employs alternate methods for file manipulation or uses other tools to accomplish similar tasks. Additionally, environmental variables set for legitimate processes might inadvertently bypass detection unless every instance of `attrib.exe` is thoroughly monitored. An assumption is made that all critical folders are logged continuously, and any script execution is monitored effectively to provide comprehensive detection coverage.
  > **Disclaimer:** This investigation guide was created using generative AI technology and has not been reviewed for its accuracy and relevance. While every effort has been made to ensure its quality, we recommend validating the content and adapting it to suit specific environment and operational needs. Please communicate any changes to the detection engineering team.
