title: File Download From IP URL Via Curl.EXE
id: 9cc85849-3b02-4cb5-b371-3a1ff54f2218
related:
- id: 5cb299fc-5fb1-4d07-b989-0644c68b6043
  type: similar
status: test
description: Detects file downloads directly from IP address URL using curl.exe
references:
- https://labs.withsecure.com/publications/fin7-target-veeam-servers
- https://github.com/WithSecureLabs/iocs/blob/344203de742bb7e68bd56618f66d34be95a9f9fc/FIN7VEEAM/iocs.csv
- https://github.com/pr0xylife/IcedID/blob/8dd1e218460db4f750d955b4c65b2f918a1db906/icedID_09.28.2023.txt
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023-10-18
tags:
- attack.execution
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: '\curl.exe'
  - OriginalFileName: 'curl.exe'
  selection_ip:
    CommandLine|re: '://[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}'
  selection_http:
    CommandLine|contains: 'http'
  selection_flag:
    CommandLine|contains:
    - ' -O'          # covers the alias for --remote-name and --output
    - '--remote-name'
    - '--output'
  filter_main_ext:
        # Note: This filter exists to avoid duplication with 5cb299fc-5fb1-4d07-b989-0644c68b6043
    CommandLine|endswith:
    - '.bat'
    - '.bat"'
    - '.dat'
    - '.dat"'
    - '.dll'
    - '.dll"'
    - '.exe'
    - '.exe"'
    - '.gif'
    - '.gif"'
    - '.hta'
    - '.hta"'
    - '.jpeg'
    - '.jpeg"'
    - '.log'
    - '.log"'
    - '.msi'
    - '.msi"'
    - '.png'
    - '.png"'
    - '.ps1'
    - '.ps1"'
    - '.psm1'
    - '.psm1"'
    - '.vbe'
    - '.vbe"'
    - '.vbs'
    - '.vbs"'
    - ".bat'"
    - ".dat'"
    - ".dll'"
    - ".exe'"
    - ".gif'"
    - ".hta'"
    - ".jpeg'"
    - ".log'"
    - ".msi'"
    - ".png'"
    - ".ps1'"
    - ".psm1'"
    - ".vbe'"
    - ".vbs'"
  condition: all of selection_* and not 1 of filter_main_*
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  This Sigma rule detects potentially malicious file downloads that utilize `curl.exe` to retrieve files directly from IP address URLs. The rule focuses on process creation logs specifically for the `curl.exe` executable, capturing command-line arguments that indicate the downloading of files. It examines whether the command line includes options for saving the downloaded content (`--remote-name`, `--output`, or `-O`), coupled with a suspicious URL format that matches an IP address (e.g., `http://192.168.1.1`). By filtering out common file extensions associated with potentially harmful downloads, the rule aims to identify misuse of `curl.exe` for executing malicious activities.
  ### Investigation Steps
  - Review the process creation logs in your EDR solution to identify instances where `curl.exe` was executed with IP address URLs in the command line.
  - Examine the full command line parameters associated with the detected processes, noting any unusual options or flags used alongside `curl.exe`.
  - Cross-reference the originating IP address with threat intelligence sources to determine if the IP is associated with known malicious activity or threat actors.
  - Assess other logs such as DNS queries and proxy logs to trace down subsequent network activity that may have followed the file download and confirm whether any files were executed on the system.
