title: HackTool - SharpLdapWhoami Execution
id: d9367cbb-c2e0-47ce-bdc0-128cb6da898d
status: test
description: Detects SharpLdapWhoami, a whoami alternative that queries the LDAP service
  on a domain controller
references:
- https://github.com/bugch3ck/SharpLdapWhoami
author: Florian Roth (Nextron Systems)
date: 2022-08-29
modified: 2023-02-04
tags:
- attack.discovery
- attack.t1033
- car.2016-03-001
logsource:
  category: process_creation
  product: windows
detection:
  selection_name:
    Image|endswith: '\SharpLdapWhoami.exe'
  selection_pe:   # in case the file has been renamed after compilation
  - OriginalFileName|contains: 'SharpLdapWhoami'
  - Product: 'SharpLdapWhoami'
  selection_flags1:
    CommandLine|endswith:
    - ' /method:ntlm'
    - ' /method:kerb'
    - ' /method:nego'
    - ' /m:nego'
    - ' /m:ntlm'
    - ' /m:kerb'
  condition: 1 of selection*
falsepositives:
- Programs that use the same command line flags
level: high
notes: |
  ### Technical Context
  The Sigma rule titled "HackTool 
  - SharpLdapWhoami Execution" is designed to detect the execution of the SharpLdapWhoami tool, which is a utility used to query the LDAP service on a domain controller. This detection focuses on identifying processes related to SharpLdapWhoami by evaluating process creation logs for specific indicators, such as the executable name or command-line arguments associated with known methods for querying LDAP information (e.g., NTLM, Kerberos, and Negotiate). The relevant data sources include process creation logs from Windows systems, which provide insights into which programs are being executed, the full command-line parameters passed to them, and the context surrounding the execution.
  The rule captures events where the image name ends with 'SharpLdapWhoami.exe', or uses any of its identifiers in the original filename. Additionally, it looks for specific command-line flags to ensure that any invocation of the tool is detected. Alerting on these parameters is crucial because SharpLdapWhoami can be misused for reconnaissance within an Active Directory environment, representing an actionable threat alert for SOC analysts and incident responders.
  ### Investigation Steps
  - Query the EDR solution for recent process creation events to identify any executions of `SharpLdapWhoami.exe` and analyze the command line used for its invocation.
  - Check for any associated parent processes in the investigation to determine the context of the tool’s execution and whether it was initiated by a legitimate user or a suspicious process.
  - Review the logs from Active Directory or the domain controller to identify any queries or interactions connected to LDAP that align with the execution timeframe.
  - Examine network traffic logs for any related LDAP queries generated by the SharpLdapWhoami tool to assess potential data exfiltration or further malicious activity.
