title: Suspicious CodePage Switch Via CHCP
id: c7942406-33dd-4377-a564-0f62db0593a3
status: test
description: Detects a code page switch in command line or batch scripts to a rare
  language
references:
- https://learn.microsoft.com/en-us/windows/win32/intl/code-page-identifiers
- https://twitter.com/cglyer/status/1183756892952248325
author: Florian Roth (Nextron Systems), Jonhnathan Ribeiro, oscd.community
date: 2019-10-14
modified: 2023-03-07
tags:
- attack.t1036
- attack.defense-evasion
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith: '\chcp.com'
    CommandLine|endswith:
    - ' 936'            # Chinese
            # - ' 1256' # Arabic
    - ' 1258'           # Vietnamese
            # - ' 855'  # Russian
            # - ' 866'  # Russian
            # - ' 864'  # Arabic
  condition: selection
fields:
- ParentCommandLine
falsepositives:
- Administrative activity (adjust code pages according to your organization's region)
level: medium
notes: |
  ### Technical Context
  This detection rule identifies suspicious behavior related to code page switching through the `chcp.com` command in Windows environments. Specifically, it targets command line or batch scripts that alter the code page to one of several rare languages, which may indicate an attempt to obfuscate malicious activity or evade detection. The rule utilizes process creation logs to monitor the execution of `chcp.com` along with specific command-line parameters associated with Chinese (936), Vietnamese (1258), and Arabic (1256) languages. By observing these parameters, the rule aims to surface potentially deceptive administrative activities that could represent a security risk.
  ### Investigation Steps
  - Check the process creation logs in your EDR tool to identify instances where the `chcp.com` command was executed with unusual code page parameters.
  - Review the ParentCommandLine information for the detected process to determine the context in which the code page switch was initiated, helping to assess if it relates to legitimate administrative tasks.
  - Cross-reference with recent changes in administrative activity logs to validate if the change in code pages aligns with sanctioned operations or is indicative of suspicious behavior.
  - Monitor network activity logs from your NGFW or Proxy solutions for unusual outbound connections that might correlate with the suspicious command execution, providing further investigation leads.
