title: New Firewall Rule Added Via Netsh.EXE
id: cd5cfd80-aa5f-44c0-9c20-108c4ae12e3c
status: test
description: Detects the addition of a new rule to the Windows firewall via netsh
references:
- https://web.archive.org/web/20190508165435/https://www.operationblockbuster.com/wp-content/uploads/2016/02/Operation-Blockbuster-RAT-and-Staging-Report.pdf
author: Markus Neis, Sander Wiebing
date: 2019-01-29
modified: 2023-02-10
tags:
- attack.defense-evasion
- attack.t1562.004
- attack.s0246
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: '\netsh.exe'
  - OriginalFileName: 'netsh.exe'
  selection_cli:
    CommandLine|contains|all:
    - ' firewall '
    - ' add '
  filter_optional_dropbox:
    CommandLine|contains:
    - 'advfirewall firewall add rule name=Dropbox dir=in action=allow "program=?:\Program
      Files (x86)\Dropbox\Client\Dropbox.exe" enable=yes profile=Any'
    - 'advfirewall firewall add rule name=Dropbox dir=in action=allow "program=?:\Program
      Files\Dropbox\Client\Dropbox.exe" enable=yes profile=Any'
  condition: all of selection_* and not 1 of filter_optional_*
falsepositives:
- Legitimate administration activity
- Software installations
level: medium
notes: |
  ### Technical Context
  This detection rule identifies suspicious modifications to the Windows Firewall settings by monitoring process creation events related to the execution of `netsh.exe`. The rule specifically looks for the command-line usage of `netsh` that adds new firewall rules, which can be exploited by attackers to create exceptions, facilitating unauthorized inbound or outbound communication. The technical data sources involved mainly include process creation logs, specifically focusing on the activity generated by `netsh.exe`, along with the command-line parameters indicating firewall rule additions. Furthermore, to reduce false positives, the rule excludes known legitimate command-line options that pertain to Dropbox.
  ### Investigation Steps
  - Review recent process creation logs for `netsh.exe` to identify any instances of firewall rules being added, specifically filtering for command lines that include 'firewall' and 'add'.
  - Use the EDR solution to assess the context of the `netsh.exe` execution, checking for associated user activity, system logs, and anomalies in the system environment during the time of the rule addition.
  - Query the firewall logs from the network security appliances (e.g., NGFW) to find any traffic patterns or connections that may indicate misuse of the newly added firewall rule.
  - Analyze any related events in the SIEM, looking for corroborating incidents such as command execution logs or inbound/outbound network traffic that aligns with the firewall changes reported.
