title: File Download Via InstallUtil.EXE
id: 75edd216-1939-4c73-8d61-7f3a0d85b5cc
status: test
description: |
  Detects use of .NET InstallUtil.exe in order to download arbitrary files. The files will be written to "%LOCALAPPDATA%\Microsoft\Windows\INetCache\IE\"
references:
- https://github.com/LOLBAS-Project/LOLBAS/pull/239
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-08-19
modified: 2023-11-09
tags:
- attack.defense-evasion
- attack.t1218
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: '\InstallUtil.exe'
  - OriginalFileName: 'InstallUtil.exe'
  selection_cli:
    CommandLine|contains:
    - 'ftp://'
    - 'http://'
    - 'https://'
  condition: all of selection_*
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  This Sigma rule focuses on detecting the use of `.NET InstallUtil.exe`, a utility commonly used to install and configure server-based apps. The rule identifies potential malicious activity where this tool is leveraged to download arbitrary files from the internet, specifically through command-line parameters that reference FTP or HTTP protocols. Installed files are typically written to the local user’s cache directory, specifically targeting `%LOCALAPPDATA%\Microsoft\Windows\INetCache\IE\`. By monitoring the process creation logs, particularly the command lines executed with `InstallUtil.exe`, the rule can alert on suspicious file download activities that indicate possible exploitation or lateral movement.
  ### Investigation Steps
  - Review the process creation logs from the EDR solution to identify instances of `InstallUtil.exe` and examine the command-line arguments used in those executions.
  - Check the specified local cache directory (`%LOCALAPPDATA%\Microsoft\Windows\INetCache\IE\`) for any newly created files or unusual file types that correspond to the timeframes when the alerts were triggered.
  - Utilize the SIEM to analyze associated network traffic logs for connections made by the machine during the download activity, focusing on any outbound FTP or HTTP requests.
  - Investigate user behavior through the Proxy logs to determine if the user executed any legitimate actions around the time of the alert, which could help discern between malicious activity and false positives.
