title: Read Contents From Stdin Via Cmd.EXE
id: 241e802a-b65e-484f-88cd-c2dc10f9206d
related:
- id: 00a4bacd-6db4-46d5-9258-a7d5ebff4003
  type: obsolete
status: test
description: Detect the use of "<" to read and potentially execute a file via cmd.exe
references:
- https://github.com/redcanaryco/atomic-red-team/blob/40b77d63808dd4f4eafb83949805636735a1fd15/atomics/T1059.003/T1059.003.md
- https://web.archive.org/web/20220306121156/https://www.x86matthew.com/view_post?id=ntdll_pipe
author: frack113, Nasreddine Bencherchali (Nextron Systems)
date: 2023-03-07
tags:
- attack.execution
- attack.t1059.003
logsource:
  category: process_creation
  product: windows
detection:
  selection_cmd:
  - OriginalFileName: 'Cmd.Exe'
  - Image|endswith: '\cmd.exe'
  selection_cli:
    CommandLine|contains: '<'
  condition: all of selection_*
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  This detection rule identifies potentially malicious activity involving the use of `cmd.exe` on Windows systems where the standard input redirection character (`<`) is utilized. The presence of this character in the command-line arguments may signify attempts to read contents from files through the command line, which is a common tactic used by attackers to execute scripts or commands hidden from standard detection methods. The rule inspects process creation logs specifically targeting instances of `cmd.exe` and analyzes the command-line parameters for the inclusion of the `<` character. By focusing on this behavior, the rule aids in identifying exploitation attempts or other unauthorized activities that leverage command-line interfaces.
  ### Investigation Steps
  - Review the process creation logs within your EDR tool to identify any instances of `cmd.exe` that were invoked, paying particular attention to the command-line arguments used.
  - Analyze any associated command-line parameters for suspicious file paths or unexpected input redirection, which may indicate further malicious intent.
  - Correlate the identified events with additional security logs from the SIEM to determine if there are concurrent alerts or unusual activities from the same or related sources.
  - Monitor network traffic using NDR and proxy logs to verify if any outbound communications occurred immediately following the suspicious command execution, indicating possible data exfiltration or secondary exploit attempts.
