title: Whoami.EXE Execution Anomaly
id: 8de1cbe8-d6f5-496d-8237-5f44a721c7a0
status: test
description: Detects the execution of whoami.exe with suspicious parent processes.
references:
- https://brica.de/alerts/alert/public/1247926/agent-tesla-keylogger-delivered-inside-a-power-iso-daa-archive/
- https://app.any.run/tasks/7eaba74e-c1ea-400f-9c17-5e30eee89906/
- https://www.youtube.com/watch?v=DsJ9ByX84o4&t=6s
author: Florian Roth (Nextron Systems)
date: 2021-08-12
modified: 2023-12-04
tags:
- attack.discovery
- attack.t1033
- car.2016-03-001
logsource:
  category: process_creation
  product: windows
detection:
  selection:
  - Image|endswith: '\whoami.exe'
  - OriginalFileName: 'whoami.exe'
  filter_main_known_parents:
        # This list can be any legitimate shell or application that you expect whoami to run from
    ParentImage|endswith:
    - '\cmd.exe'
    - '\powershell_ise.exe'
    - '\powershell.exe'
    - '\pwsh.exe'
  filter_optional_ms_monitoring_agent:
    ParentImage|endswith: ':\Program Files\Microsoft Monitoring Agent\Agent\MonitoringHost.exe'
  filter_main_parent_null:
    ParentImage:
  filter_main_parent_empty:
    ParentImage: ''
  condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
falsepositives:
- Admin activity
- Scripts and administrative tools used in the monitored environment
- Monitoring activity
level: medium
notes: |
  ### Technical Context
  The "Whoami.EXE Execution Anomaly" rule is designed to identify suspicious executions of the `whoami.exe` utility in a Windows environment. This utility is commonly used to display the user's account name and group memberships, but it can also be exploited by attackers for reconnaissance purposes. The rule monitors process creation events, specifically looking for instances where `whoami.exe` is executed. It analyzes the parent process that triggered its invocation, filtering out known legitimate processes such as `cmd.exe`, `powershell.exe`, and Microsoft Monitoring Agent components. If `whoami.exe` is launched from an unexpected or unknown parent process, it triggers an alert indicating potential malicious activity.
  ### Investigation Steps
  - **Review the Process Tree:** Utilize EDR tools to trace the full process tree leading to the execution of `whoami.exe`, noting any unusual parent processes that could suggest malicious intent.
  - **Examine Command-Line Arguments:** Check the command-line parameters used with the `whoami.exe` execution through process creation logs to identify any anomalous or suspicious flags that may signify abuse.
  - **Cross-reference with User Activity:** Query log sources for the user associated with the suspicious execution to determine if the pattern of usage aligns with typical user behavior or indicates possible compromised credentials.
  - **Inspect Network Connections:** Leverage NDR or firewall logs to determine if any unusual outbound connections were established immediately following the `whoami.exe` execution, which could indicate data exfiltration or communication with a command-and-control server.
