title: PrintBrm ZIP Creation of Extraction
id: cafeeba3-01da-4ab4-b6c4-a31b1d9730c7
status: test
description: Detects the execution of the LOLBIN PrintBrm.exe, which can be used to
  create or extract ZIP files. PrintBrm.exe should not be run on a normal workstation.
references:
- https://lolbas-project.github.io/lolbas/Binaries/PrintBrm/
author: frack113
date: 2022-05-02
tags:
- attack.command-and-control
- attack.t1105
- attack.defense-evasion
- attack.t1564.004
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    Image|endswith: '\PrintBrm.exe'
    CommandLine|contains|all:
    - ' -f'
    - '.zip'
  condition: selection
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This Sigma rule is designed to detect the execution of the PrintBrm.exe executable, a legitimate Windows component primarily used for printing tasks. However, threat actors can misuse this tool for malicious purposes, such as creating or extracting ZIP files, which can lead to further exploitation or data exfiltration. The rule specifically looks for the command line parameters that indicate PrintBrm.exe is being invoked with the flags to create or manipulate ZIP files. The primary data source utilized for this detection is process creation logs, which capture details such as the executable name, command-line arguments, and the environment in which the process was initiated. Given that PrintBrm.exe should not typically run on normal workstations, alerts generated by this rule warrant immediate investigation.
  ### Investigation Steps
  - Review EDR logs to identify the system where PrintBrm.exe was executed and collect associated process details, such as the user context and parent process information.
  - Check command-line parameters in the EDR or process creation logs to confirm the presence of flags indicating a ZIP file operation, particularly the use of ' -f' and file extensions that end in '.zip'.
  - Utilize the SIEM or centralized logging solution to correlate suspicious behavior with past incidents involving PrintBrm.exe, identifying potential patterns or related alerts.
  - Investigate network activity through the NDR or Proxy logs to detect any outbound connections or data transfers initiated by the system, as they may further indicate malicious intentions linked to the ZIP file creation.
