title: Loaded Module Enumeration Via Tasklist.EXE
id: 34275eb8-fa19-436b-b959-3d9ecd53fa1f
status: test
description: |
  Detects the enumeration of a specific DLL or EXE being used by a binary via "tasklist.exe".
  This is often used by attackers in order to find the specific process identifier (PID) that is using the DLL in question.
  In order to dump the process memory or perform other nefarious actions.
references:
- https://www.n00py.io/2021/05/dumping-plaintext-rdp-credentials-from-svchost-exe/
- https://pentestlab.blog/tag/svchost/
author: Swachchhanda Shrawan Poudel
date: 2024-02-12
modified: 2024-03-13
tags:
- attack.t1003
logsource:
  product: windows
  category: process_creation
detection:
  selection_img:
  - Image|endswith: '\tasklist.exe'
  - OriginalFileName: 'tasklist.exe'
  selection_flags:
    CommandLine|contains|windash: '-m'
  selection_module:
        # Note: add other interesting modules or binaries
    CommandLine|contains: 'rdpcorets.dll'
  condition: all of selection_*
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  The Sigma rule titled "Loaded Module Enumeration Via Tasklist.EXE" is designed to detect attempts to enumerate running processes and their associated modules on Windows systems using the command-line utility `tasklist.exe`. This behavior is commonly leveraged by attackers to identify the specific Process ID (PID) of a target process that utilizes a particular dynamic link library (DLL), such as `rdpcorets.dll`. By doing so, attackers can prepare to perform malicious actions including dumping process memory to extract sensitive information. The rule examines multiple parameters, including the command line used to invoke `tasklist.exe`, looking for the presence of the `-m` argument which signifies module enumeration, combined with indications that the targeted DLL (in this case, `rdpcorets.dll`) was specified.
  To successfully implement this rule, relevant data sources include process creation logs from the Windows operating system, which encapsulate the execution details of processes, including command-line parameters and associated image names. Incident responders should consider analysis of these logs to determine the context and intent behind the observed execution of `tasklist.exe`.
  ### Investigation Steps
  - Utilize EDR tools to analyze process creation logs for instances where `tasklist.exe` is executed with the `-m` flag and specifically looks for the `rdpcorets.dll` module.
  - Examine additional logs from the SIEM to correlate the timing of the `tasklist.exe` execution with any suspicious activities, such as unauthorized access or alterations in user sessions.
  - Investigate the local and remote connections using EDR data and relevant AV solutions to identify any unusual processes or network behavior that may align with the execution of the enumerated tasklist instance.
  - Review configuration and audit logs from the relevant systems to identify any changes in permissions or roles within the environment that could indicate an escalation of privilege, facilitating the malicious activities.
