title: HackTool - Windows Credential Editor (WCE) Execution
id: 7aa7009a-28b9-4344-8c1f-159489a390df
status: test
description: Detects the use of Windows Credential Editor (WCE)
references:
- https://www.ampliasecurity.com/research/windows-credentials-editor/
author: Florian Roth (Nextron Systems)
date: 2019-12-31
modified: 2024-11-23
tags:
- attack.credential-access
- attack.t1003.001
- attack.s0005
logsource:
  category: process_creation
  product: windows
detection:
  selection_1:
    Hashes|contains:      # Sysmon field hashes contains all types
    - IMPHASH=a53a02b997935fd8eedcb5f7abab9b9f
    - IMPHASH=e96a73c7bf33a464c510ede582318bf2
  selection_2:
    CommandLine|endswith: '.exe -S'
    ParentImage|endswith: '\services.exe'
  filter:
    Image|endswith: '\clussvc.exe'
  condition: 1 of selection_* and not filter
falsepositives:
- Another service that uses a single -s command line switch
level: critical
notes: |
  ### Technical Context
  This detection rule identifies instances of the Windows Credential Editor (WCE) being executed within an enterprise environment. The rule focuses on specific indicators such as the executable's hash values and command-line parameters commonly associated with WCE's operation. WCE is used for manipulating Windows credential storage, making it a potential tool for credential theft. The rule inspects process creation logs to detect when processes with defined hashes or specific command-line arguments are initiated, particularly when run in the context of a service process like `services.exe`. The presence of these indicators, combined with their exclusion from benign processes such as `clussvc.exe`, helps pinpoint potentially malicious usage.
  ### Investigation Steps
  - Review process creation logs in the EDR to locate any recent execution events related to the identified hashes for the Windows Credential Editor.
  - Examine the associated command-line parameters in the process logs to corroborate the execution context and see if it matches the patterns described in the rule.
  - Utilize network traffic logs from the NDR to check for unusual outbound connections that may indicate data exfiltration following the execution of WCE.
  - Confirm the legitimacy of the parent process (`services.exe`) by investigating other activities of the parent and any related services that were running at the time of the alert.
