title: Operator Bloopers Cobalt Strike Commands
id: 647c7b9e-d784-4fda-b9a0-45c565a7b729
related:
- id: 4f154fb6-27d1-4813-a759-78b93e0b9c48
  type: similar
status: test
description: Detects use of Cobalt Strike commands accidentally entered in the CMD
  shell
references:
- https://hstechdocs.helpsystems.com/manuals/cobaltstrike/current/userguide/content/cobalt-4-5-user-guide.pdf
- https://thedfirreport.com/2021/10/04/bazarloader-and-the-conti-leaks/
- https://thedfirreport.com/2022/06/16/sans-ransomware-summit-2022-can-you-detect-this/
author: _pete_0, TheDFIRReport
date: 2022-05-06
modified: 2023-01-30
tags:
- attack.execution
- attack.t1059.003
- stp.1u
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - OriginalFileName: 'Cmd.Exe'
  - Image|endswith: '\cmd.exe'
  selection_cli:
    CommandLine|startswith:
    - 'cmd '
    - 'cmd.exe'
    - 'c:\windows\system32\cmd.exe'
    CommandLine|contains:
    - 'psinject'
    - 'spawnas'
    - 'make_token'
    - 'remote-exec'
    - 'rev2self'
    - 'dcsync'
    - 'logonpasswords'
    - 'execute-assembly'
    - 'getsystem'
  condition: all of selection_*
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  The Sigma rule titled "Operator Bloopers Cobalt Strike Commands" aims to detect instances where operators inadvertently execute Cobalt Strike commands through the Windows Command Prompt (`cmd.exe`). This can occur when malicious actors misuse these powerful commands, potentially leading to unauthorized actions within a system. To identify these occurrences, the rule analyzes process creation logs specifically targeting commands initiated from `cmd.exe`. Key indicators include command lines that both start with basic command prompts and contain specific Cobalt Strike-related keywords, such as `psinject`, `make_token`, and `logonpasswords`. By focusing on these unique command patterns, the detection rule enables timely identification of potentially harmful activities that could signify compromise or misuse of the environment.
  ### Investigation Steps
  - Query EDR logs for any recent process executions involving `cmd.exe`, filtering for command lines that include any of the specified Cobalt Strike commands.
  - Review user activity in the Proxy logs to detect any unusual web requests or connections made by the user associated with the `cmd.exe` execution.
  - Examine network activity logs using NDR tools for any external connections correlating with the timestamps of the identified command invocations.
  - Investigate any endpoint alerts from AV or EDR solutions that may provide insights into previous attempts or patterns of exploitation relating to the detected commands.
