title: Renamed AdFind Execution
id: df55196f-f105-44d3-a675-e9dfb6cc2f2b
status: test
description: Detects the use of a renamed Adfind.exe. AdFind continues to be seen
  across majority of breaches. It is used to domain trust discovery to plan out subsequent
  steps in the attack chain.
references:
- https://www.joeware.net/freetools/tools/adfind/
- https://thedfirreport.com/2020/05/08/adfind-recon/
- https://thedfirreport.com/2021/01/11/trickbot-still-alive-and-well/
- https://www.microsoft.com/security/blog/2021/01/20/deep-dive-into-the-solorigate-second-stage-activation-from-sunburst-to-teardrop-and-raindrop/
- https://social.technet.microsoft.com/wiki/contents/articles/7535.adfind-command-examples.aspx
- https://github.com/center-for-threat-informed-defense/adversary_emulation_library/blob/bf62ece1c679b07b5fb49c4bae947fe24c81811f/fin6/Emulation_Plan/Phase1.md
author: Florian Roth (Nextron Systems)
date: 2022-08-21
modified: 2024-11-23
tags:
- attack.discovery
- attack.t1018
- attack.t1087.002
- attack.t1482
- attack.t1069.002
logsource:
  category: process_creation
  product: windows
detection:
  selection_1:
    CommandLine|contains:
    - 'domainlist'
    - 'trustdmp'
    - 'dcmodes'
    - 'adinfo'
    - ' dclist '
    - 'computer_pwdnotreqd'
    - 'objectcategory='
    - '-subnets -f'
    - 'name="Domain Admins"'
    - '-sc u:'
    - 'domainncs'
    - 'dompol'
    - ' oudmp '
    - 'subnetdmp'
    - 'gpodmp'
    - 'fspdmp'
    - 'users_noexpire'
    - 'computers_active'
    - 'computers_pwdnotreqd'
  selection_2:
    Hashes|contains:
    - 'IMPHASH=BCA5675746D13A1F246E2DA3C2217492'
    - 'IMPHASH=53E117A96057EAF19C41380D0E87F1C2'
  selection_3:
    OriginalFileName: 'AdFind.exe'
  filter:
    Image|endswith: '\AdFind.exe'
  condition: 1 of selection* and not filter
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This Sigma rule aims to detect the execution of a renamed instance of `AdFind.exe`, a reconnaissance tool frequently used in cyberattacks for domain trust discovery and to gather sensitive information about a network's Active Directory. The rule looks for specific command-line parameters associated with `AdFind.exe`, such as `domainlist`, `trustdmp`, and `subnetdmp`, which are indicative of its use in data collection activities. Additionally, it matches specific hash signatures that correspond to known `AdFind.exe` binaries to minimize false positives. By monitoring process creation logs within Windows systems, the rule identifies instances where the legitimate `AdFind.exe` has been altered, allowing attackers to blend in and conduct reconnaissance without raising immediate alarms.
  ### Investigation Steps
  - Review process creation logs in your EDR solution to identify the process instances flagged by this rule and examine the command-line arguments used.
  - Investigate the file properties of the flagged executable, focusing on its origin and ensuring it has not been renamed from `AdFind.exe`.
  - Check the network activity logs on your firewall or proxy to see if there were any unusual outbound connections made by the identified process that could indicate data exfiltration.
  - Utilize Active Directory logs to identify any suspicious queries or modifications that coincide with the execution of the renamed `AdFind.exe`, assessing the impact on user accounts or domain trust relationships.
