title: Copy From Or To Admin Share Or Sysvol Folder
id: 855bc8b5-2ae8-402e-a9ed-b889e6df1900
status: test
description: Detects a copy command or a copy utility execution to or from an Admin
  share or remote
references:
- https://twitter.com/SBousseaden/status/1211636381086339073
- https://drive.google.com/file/d/1lKya3_mLnR3UQuCoiYruO3qgu052_iS_/view
- https://www.elastic.co/guide/en/security/current/remote-file-copy-to-a-hidden-share.html
- https://www.microsoft.com/en-us/security/blog/2022/10/18/defenders-beware-a-case-for-post-ransomware-investigations/
author: Florian Roth (Nextron Systems), oscd.community, Teymur Kheirkhabarov @HeirhabarovT,
  Zach Stanford @svch0st, Nasreddine Bencherchali
date: 2019-12-30
modified: 2023-11-15
tags:
- attack.lateral-movement
- attack.collection
- attack.exfiltration
- attack.t1039
- attack.t1048
- attack.t1021.002
logsource:
  category: process_creation
  product: windows
detection:
  selection_target:
    CommandLine|contains:
    - '\\\\*$'
    - '\Sysvol\'
  selection_other_tools:
  - Image|endswith:
    - '\robocopy.exe'
    - '\xcopy.exe'
  - OriginalFileName:
    - 'robocopy.exe'
    - 'XCOPY.EXE'
  selection_cmd_img:
  - Image|endswith: '\cmd.exe'
  - OriginalFileName: 'Cmd.Exe'
  selection_cmd_cli:
    CommandLine|contains: 'copy'
  selection_pwsh_img:
  - Image|contains:
    - '\powershell.exe'
    - '\pwsh.exe'
  - OriginalFileName:
    - 'PowerShell.EXE'
    - 'pwsh.dll'
  selection_pwsh_cli:
    CommandLine|contains:
    - 'copy-item'
    - 'copy '
    - 'cpi '
    - ' cp '
    - 'move '
    - 'move-item'
    - ' mi '
    - ' mv '
  condition: selection_target and (selection_other_tools or all of selection_cmd_*
    or all of selection_pwsh_*)
falsepositives:
- Administrative scripts
level: medium
notes: |
  ### Technical Context
  This Sigma rule detects suspicious file copying activities involving administrative shares or the Sysvol folder on Windows systems. These locations are often targeted during lateral movement, data exfiltration, or for unauthorized access to sensitive information. The rule identifies activities by analyzing process creation events, specifically looking for command line arguments associated with file copying tools such as `robocopy`, `xcopy`, or standard commands like `copy` from command-line interfaces. The presence of command-line symbols indicating a remote share (e.g., `\\*`) or references to the Sysvol directory triggers the detection, allowing security teams to identify potential misuse of administrative privileges.
  The data sources leveraged for this detection include process creation logs that capture both the command used and the associated executable. By correlating these data points, analysts can better understand the context of the actions performed, ensuring they can respond appropriately to any potentially malicious activities impacting the environment.
  ### Investigation Steps
  - Review process creation logs in the EDR to identify the execution of `robocopy.exe`, `xcopy.exe`, or unusual instances of `cmd.exe` or `powershell.exe` that match the criteria specified in the Sigma rule.
  - Examine command-line arguments from the logs for references to administrative shares (e.g., `\\*`) or operations targeting the Sysvol folder to confirm potential unauthorized access or data movement.
  - Cross-reference activity with logs from NGFW and Proxy to determine if any external communication occurred during the timeframe of the alert, indicating potential data exfiltration.
  - Assess logs from AV solutions to check if any of the detected tools (like `robocopy` or `xcopy`) were flagged as malicious or misused in previous occurrences, which could provide context to the current alert.
