title: Operator Bloopers Cobalt Strike Commands
id: 647c7b9e-d784-4fda-b9a0-45c565a7b729
related:
- id: 4f154fb6-27d1-4813-a759-78b93e0b9c48
  type: similar
status: test
description: Detects use of Cobalt Strike commands accidentally entered in the CMD
  shell
references:
- https://hstechdocs.helpsystems.com/manuals/cobaltstrike/current/userguide/content/cobalt-4-5-user-guide.pdf
- https://thedfirreport.com/2021/10/04/bazarloader-and-the-conti-leaks/
- https://thedfirreport.com/2022/06/16/sans-ransomware-summit-2022-can-you-detect-this/
author: _pete_0, TheDFIRReport
date: 2022-05-06
modified: 2023-01-30
tags:
- attack.execution
- attack.t1059.003
- stp.1u
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - OriginalFileName: 'Cmd.Exe'
  - Image|endswith: '\cmd.exe'
  selection_cli:
    CommandLine|startswith:
    - 'cmd '
    - 'cmd.exe'
    - 'c:\windows\system32\cmd.exe'
    CommandLine|contains:
    - 'psinject'
    - 'spawnas'
    - 'make_token'
    - 'remote-exec'
    - 'rev2self'
    - 'dcsync'
    - 'logonpasswords'
    - 'execute-assembly'
    - 'getsystem'
  condition: all of selection_*
falsepositives:
- Unknown
level: high
notes: |
  n
  ### Technical Context
  The "Operator Bloopers Cobalt Strike Commands" detection rule is designed to identify the misuse of specific Cobalt Strike commands that an operator may accidentally enter in the Windows command line interface (CMD). This rule captures activities by monitoring process creation logs, particularly for the `cmd.exe` process, and analyzes the command line parameters used during its execution. It looks for command lines that start with `cmd` and contain keywords associated with Cobalt Strike functionalities, such as 'psinject', 'dcsync', and 'make_token'. These commands can indicate an attacker attempting to exploit the environment or misuse administrative capabilities.
  This rule aligns with the MITRE ATT&CK framework, specifically targeting the Execution tactic (TA0002) and the Command-Line Interface (T1059.003) technique. Detecting these command invocations allows security operations teams to scrutinize potentially malicious activities, addressing unauthorized access or misuse by both internal users and external adversaries.
  ### Investigation Steps
  - **Review the Command Line Usage:** Examine the command line parameters associated with any instances of `cmd.exe` that triggered the alert to determine the context and intent behind the command execution.
    
  - **Correlate with EDR Events:** Utilize endpoint detection and response (EDR) tools to track the behavior of the associated process, checking for any unusual actions or further commands executed after the detection event.
  - **Analyze User Activity Logs:** Investigate user activity around the time of the command execution by reviewing related user logs to assess if the command was executed as part of routine operations or if it's suspicious in nature.
  - **Check for Malware Indicators:** Perform a scan of the endpoint in question using antivirus and threat detection tools to identify any related malware or threats that might have been dropped or executed as a result of the command use.
  ### Prioritization
  This alert is classified as high severity due to the potential for exploitation of critical system functions via Cobalt Strike commands, which may indicate a significant security threat requiring immediate investigation.
  ### Blind Spots and Assumptions
  This detection rule may not trigger if an adversary bypasses command line monitoring or utilizes alternative methods to execute the commands (e.g., through compiled binaries or scripts). Additionally, the rule assumes that command-line logging is enabled and operational in the environment, and that the specific Cobalt Strike commands have not been modified or disguised. There could also be false positives due to legitimate tasks performed by users with administrative privileges.
  > **Disclaimer:** This investigation guide was created using generative AI technology and has not been reviewed for its accuracy and relevance. While every effort has been made to ensure its quality, we recommend validating the content and adapting it to suit specific environment and operational needs. Please communicate any changes to the detection engineering team.
