title: HackTool - SharpView Execution
id: b2317cfa-4a47-4ead-b3ff-297438c0bc2d
related:
- id: dcd74b95-3f36-4ed9-9598-0490951643aa
  type: similar
status: test
description: Adversaries may look for details about the network configuration and
  settings of systems they access or through information discovery of remote systems
references:
- https://github.com/tevora-threat/SharpView/
- https://github.com/PowerShellMafia/PowerSploit/blob/dev/Recon/PowerView.ps1
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1049/T1049.md#atomic-test-4---system-discovery-using-sharpview
author: frack113
date: 2021-12-10
modified: 2023-02-14
tags:
- attack.discovery
- attack.t1049
- attack.t1069.002
- attack.t1482
- attack.t1135
- attack.t1033
logsource:
  category: process_creation
  product: windows
detection:
  selection:
  - OriginalFileName: 'SharpView.exe'
  - Image|endswith: '\SharpView.exe'
  - CommandLine|contains:
              # - 'Add-DomainGroupMember'
              # - 'Add-DomainObjectAcl'
              # - 'Add-ObjectAcl'
    - 'Add-RemoteConnection'
    - 'Convert-ADName'
    - 'ConvertFrom-SID'
    - 'ConvertFrom-UACValue'
    - 'Convert-SidToName'
              # - 'ConvertTo-SID'
    - 'Export-PowerViewCSV'
              # - 'Find-DomainLocalGroupMember'
    - 'Find-DomainObjectPropertyOutlier'
    - 'Find-DomainProcess'
    - 'Find-DomainShare'
    - 'Find-DomainUserEvent'
    - 'Find-DomainUserLocation'
    - 'Find-ForeignGroup'
    - 'Find-ForeignUser'
    - 'Find-GPOComputerAdmin'
    - 'Find-GPOLocation'
    - 'Find-Interesting'           # 'Find-InterestingDomainAcl', 'Find-InterestingDomainShareFile', 'Find-InterestingFile'
    - 'Find-LocalAdminAccess'
    - 'Find-ManagedSecurityGroups'
              # - 'Get-ADObject'
    - 'Get-CachedRDPConnection'
    - 'Get-DFSshare'
              # - 'Get-DNSRecord'
              # - 'Get-DNSZone'
              # - 'Get-Domain'
    - 'Get-DomainComputer'
    - 'Get-DomainController'
    - 'Get-DomainDFSShare'
    - 'Get-DomainDNSRecord'
              # - 'Get-DomainDNSZone'
    - 'Get-DomainFileServer'
    - 'Get-DomainForeign'           # 'Get-DomainForeignGroupMember', 'Get-DomainForeignUser'
    - 'Get-DomainGPO'           # 'Get-DomainGPOComputerLocalGroupMapping', 'Get-DomainGPOLocalGroup', 'Get-DomainGPOUserLocalGroupMapping'
    - 'Get-DomainGroup'           # 'Get-DomainGroupMember'
    - 'Get-DomainGUIDMap'
    - 'Get-DomainManagedSecurityGroup'
    - 'Get-DomainObject'           # 'Get-DomainObjectAcl'
    - 'Get-DomainOU'
    - 'Get-DomainPolicy'           # 'Get-DomainPolicyData'
    - 'Get-DomainSID'
    - 'Get-DomainSite'
    - 'Get-DomainSPNTicket'
    - 'Get-DomainSubnet'
    - 'Get-DomainTrust'           # 'Get-DomainTrustMapping'
              # - 'Get-DomainUser'
    - 'Get-DomainUserEvent'
              # - 'Get-Forest'
    - 'Get-ForestDomain'
    - 'Get-ForestGlobalCatalog'
    - 'Get-ForestTrust'
    - 'Get-GptTmpl'
    - 'Get-GroupsXML'
              # - 'Get-GUIDMap'
              # - 'Get-IniContent'
              # - 'Get-IPAddress'
    - 'Get-LastLoggedOn'
    - 'Get-LoggedOnLocal'
    - 'Get-NetComputer'           # 'Get-NetComputerSiteName'
    - 'Get-NetDomain'           # 'Get-NetDomainController', 'Get-NetDomainTrust'
    - 'Get-NetFileServer'
    - 'Get-NetForest'           # 'Get-NetForestCatalog', 'Get-NetForestDomain', 'Get-NetForestTrust'
    - 'Get-NetGPO'           # 'Get-NetGPOGroup'
              # - 'Get-NetGroup'
    - 'Get-NetGroupMember'
    - 'Get-NetLocalGroup'           # 'Get-NetLocalGroupMember'
    - 'Get-NetLoggedon'
    - 'Get-NetOU'
    - 'Get-NetProcess'
    - 'Get-NetRDPSession'
    - 'Get-NetSession'
    - 'Get-NetShare'
    - 'Get-NetSite'
    - 'Get-NetSubnet'
    - 'Get-NetUser'
              # - 'Get-ObjectAcl'
    - 'Get-PathAcl'
    - 'Get-PrincipalContext'
              # - 'Get-Proxy'
    - 'Get-RegistryMountedDrive'
    - 'Get-RegLoggedOn'
              # - 'Get-SiteName'
              # - 'Get-UserEvent'
              # - 'Get-WMIProcess'
    - 'Get-WMIRegCachedRDPConnection'
    - 'Get-WMIRegLastLoggedOn'
    - 'Get-WMIRegMountedDrive'
    - 'Get-WMIRegProxy'
    - 'Invoke-ACLScanner'
    - 'Invoke-CheckLocalAdminAccess'
    - 'Invoke-Kerberoast'
    - 'Invoke-MapDomainTrust'
    - 'Invoke-RevertToSelf'
    - 'Invoke-Sharefinder'
    - 'Invoke-UserImpersonation'
              # - 'New-DomainGroup'
              # - 'New-DomainUser'
    - 'Remove-DomainObjectAcl'
    - 'Remove-RemoteConnection'
    - 'Request-SPNTicket'
              # - 'Resolve-IPAddress'
              # - 'Set-ADObject'
    - 'Set-DomainObject'
              # - 'Set-DomainUserPassword'
    - 'Test-AdminAccess'
  condition: selection
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  The Sigma rule titled "HackTool 
  - SharpView Execution" is designed to detect the execution of SharpView, a PowerShell tool used for network discovery and reconnaissance in Windows environments. This detection focuses specifically on identifying the invocation of the `SharpView.exe` executable, alongside a variety of command-line parameters that indicate reconnaissance activities targeting Active Directory environments. The command-line options being monitored suggest a focus on gathering detailed information about domain users, computers, groups, shares, and other Active Directory objects, which can aid adversaries during the information-gathering phase of an attack.
  The primary data sources for this rule are Windows process creation logs, which include details such as the process name (OriginalFileName and Image) and the specific arguments passed during execution (CommandLine). By tracking these attributes, the detection aims to identify patterns of malicious activity that correlate with the MITRE ATT&CK techniques T1049 (System Network Connections Discovery) and T1482 (Domain Trust Discovery). This enables incident responders to quickly recognize potentially malevolent behaviors that could indicate an initial foothold or lateral movement within the network.
  ### Investigation Steps
  - **Investigate EDR Alerts:** Review endpoint detection and response (EDR) alerts related to the execution of `SharpView.exe` to assess the context in which the command was executed, including user accounts and associated processes.
    
  - **Analyze Process Creation Logs:** Utilize Windows Event Logs to corroborate the process creation details. Pay special attention to the command-line parameters to determine the nature of the queries being performed with SharpView.
  - **Check Network Indicators:** Monitor network connections from the device that executed SharpView for any unusual outbound traffic patterns or connections that could indicate data exfiltration or command-and-control communication.
  - **Review Proxy Logs:** Query proxy logs to check for any external requests originating from the system where SharpView was executed, especially looking for access to known reconnaissance or malicious domains.
  ### Prioritization
  This alert is categorized with a high severity due to the potential for SharpView to be used as part of a wider attack strategy aimed at gathering sensitive information. The ability to discover and understand active directory configurations presents significant risks to the organization’s security posture.
  ### Blind Spots and Assumptions
  This rule may not fire if SharpView is executed with renamed or obfuscated files, thus eluding detection based on file naming conventions. Additionally, if an attacker uses alternative methods or tools for Active Directory enumeration that do not match the specified command-line parameters, this detection may fail. The effectiveness of this rule also assumes that the logging and monitoring infrastructure is properly configured to capture relevant process creation events consistently.
  > **Disclaimer:** This investigation guide was created using generative AI technology and has not been reviewed for its accuracy and relevance. While every effort has been made to ensure its quality and relevance, we recommend validating the content and adapting it to suit specific environment and operational needs. Please communicate any changes to the detection engineering team.
