title: Hiding User Account Via SpecialAccounts Registry Key - CommandLine
id: 9ec9fb1b-e059-4489-9642-f270c207923d
related:
- id: f8aebc67-a56d-4ec9-9fbe-7b0e8b7b4efd
  type: similar
status: experimental
description: |
  Detects changes to the registry key "HKLM\Software\Microsoft\Windows NT\CurrentVersion\Winlogon\SpecialAccounts\Userlist" where the value is set to "0" in order to hide user account from being listed on the logon screen.
references:
- https://thedfirreport.com/2024/01/29/buzzing-on-christmas-eve-trigona-ransomware-in-3-hours/
- https://thedfirreport.com/2024/04/01/from-onenote-to-ransomnote-an-ice-cold-intrusion/
- https://thedfirreport.com/2024/04/29/from-icedid-to-dagon-locker-ransomware-in-29-days/
- https://thedfirreport.com/2022/07/11/select-xmrig-from-sqlserver/
author: '@Kostastsale, @TheDFIRReport'
date: 2022-05-14
modified: 2024-08-23
tags:
- attack.t1564.002
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith: '\reg.exe'
    CommandLine|contains|all:
    - '\SOFTWARE\Microsoft\Windows NT\CurrentVersion\Winlogon\SpecialAccounts\UserList'
    - 'add'
    - '/v'
    - '/d 0'
  condition: selection
falsepositives:
- System administrator activities
level: medium
notes: |
  ### Technical Context
  This Sigma rule is designed to detect malicious alterations to the Windows registry that can hide user accounts from the logon screen by modifying the value at `HKLM\Software\Microsoft\Windows NT\CurrentVersion\Winlogon\SpecialAccounts\UserList`. Specifically, the rule looks for the use of the `reg.exe` command line tool when it is employed to add a registry entry with the value set to "0", indicating the intention to conceal a user account. This type of behavior is commonly associated with attempts to obscure unauthorized or compromised user accounts from visibility, which can be a precursor to more malicious activities, such as unauthorized access or privilege escalation.
  The detection mechanism aligns with process creation logs within Windows environments. Any occurrence of the `reg.exe` process executing commands that include specific parameters (namely, adding a registry key to the UserList with a value of "0") will trigger an alert. This alert allows SOC analysts to further investigate potential malicious activities related to user account manipulation.
  ### Investigation Steps
  - Review process creation logs in your EDR tool to identify occurrences of `reg.exe` invoking commands that modify the UserList registry key.
  - Cross-reference with user account logs to verify any recent changes made to account visibility, noting any discrepancies or unauthorized modifications.
  - Investigate possible lateral movement by checking for anomalies in user behavior or logs associated with the user accounts hidden through this registry manipulation.
  - Utilize the SIEM to correlate the detected event with other security alerts or anomalies that may indicate broader indicators of compromise related to user account activity.
