title: Firewall Configuration Discovery Via Netsh.EXE
id: 0e4164da-94bc-450d-a7be-a4b176179f1f
status: test
description: Adversaries may look for details about the network configuration and
  settings of systems they access or through information discovery of remote systems
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1016/T1016.md#atomic-test-2---list-windows-firewall-rules
- https://ss64.com/nt/netsh.html
author: frack113, Christopher Peacock '@securepeacock', SCYTHE '@scythe_io'
date: 2021-12-07
modified: 2023-12-11
tags:
- attack.discovery
- attack.t1016
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: '\netsh.exe'
  - OriginalFileName: 'netsh.exe'
  selection_cli:
    CommandLine|contains|all:
    - 'netsh '
    - 'show '
    - 'firewall '
    CommandLine|contains:
    - 'config '
    - 'state '
    - 'rule '
    - 'name=all'
  condition: all of selection_*
falsepositives:
- Administrative activity
level: low
notes: |
  ### Technical Context
  This detection rule is designed to identify potential reconnaissance activities by adversaries probing network configurations on Windows systems using the `netsh.exe` command-line utility. Specifically, it detects instances where the command contains keywords related to firewall configuration queries such as "show," "firewall," and parameters like "config," "state," and "rule name=all." These command executions may indicate that an attacker is attempting to discover firewall rules and settings to understand the network environment better.
  To generate alerts for this behavior, the rule focuses on process creation logs, specifically monitoring the execution of `netsh.exe`. The alert is triggered when the command-line parameters suggest an intention to access sensitive network settings. This behavioral indicator aids incident responders by flagging potentially malicious or unauthorized queries while distinguishing them from legitimate administrative activities.
  ### Investigation Steps
  - Review recent process creation logs in the EDR for any instances of `netsh.exe` being executed with commands that match the detection criteria.
  - Cross-reference the user account associated with the `netsh.exe` execution to determine if it aligns with known administrative users or if it appears suspicious.
  - Inspect the command-line arguments used during the execution to assess whether they correspond to standard administrative queries or indicate possible malicious intent.
  - Check for any related network traffic or logs in the firewall or proxy systems that could further illuminate the actions leading up to the `netsh.exe` execution.
