title: Suspicious Diantz Alternate Data Stream Execution
id: 6b369ced-4b1d-48f1-b427-fdc0de0790bd
status: test
description: Compress target file into a cab file stored in the Alternate Data Stream
  (ADS) of the target file.
references:
- https://lolbas-project.github.io/lolbas/Binaries/Diantz/
author: frack113
date: 2021-11-26
modified: 2022-12-31
tags:
- attack.defense-evasion
- attack.t1564.004
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|contains|all:
    - diantz.exe
    - .cab
    CommandLine|re: ':[^\\]'
  condition: selection
falsepositives:
- Very Possible
level: medium
notes: |
  ### Technical Context
  This Sigma rule is designed to detect suspicious use of the Diantz executable, specifically when it is utilized to create a CAB (Cabinet) file that is stored in an Alternate Data Stream (ADS) of a target file. Diantz is a legitimate Microsoft utility that can be exploited by attackers to hide malicious payloads in non-standard file areas, hence enabling evasion of traditional security measures. The rule works by monitoring process creation logs and analyzing command-line arguments for specific indicators that suggest the use of Diantz in conjunction with cabinet files stored in ADS. Analysts should focus on any process creation events where the command line includes both "diantz.exe" and ".cab," along with a regex pattern to identify the presence of an ADS.
  ### Investigation Steps
  - Begin by querying the EDR for process creation logs to identify any instances of "diantz.exe" being executed, noting the user and system context in which it occurred.
  - Analyze the command-line parameters associated with any detected Diantz executions to verify if they include ".cab" and if they reference an Alternate Data Stream.
  - Check for any related file creation events or modifications in the Windows file system, specifically targeting the files that might contain ADS to reveal potential hidden malicious content.
  - Review network activity logs via the NGFW or Proxy to determine if there are any outbound connections made by the system post-execution, which could indicate further malicious actions.
