title: Potential Arbitrary DLL Load Using Winword
id: f7375e28-5c14-432f-b8d1-1db26c832df3
related:
- id: 2621b3a6-3840-4810-ac14-a02426086171
  type: obsolete
status: test
description: Detects potential DLL sideloading using the Microsoft Office winword
  process via the '/l' flag.
references:
- https://github.com/D4Vinci/One-Lin3r/blob/9fdfa5f0b9c698dfbd4cdfe7d2473192777ae1c6/one_lin3r/core/liners/windows/cmd/dll_loader_word.py
author: Victor Sergeev, oscd.community
date: 2020-10-09
modified: 2023-03-29
tags:
- attack.defense-evasion
- attack.t1202
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: '\WINWORD.exe'
  - OriginalFileName: 'WinWord.exe'
  selection_dll:
    CommandLine|contains|all:
    - '/l '
    - '.dll'
  condition: all of selection_*
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  This Sigma rule is designed to identify potential arbitrary DLL loading through the Microsoft Word application (`WINWORD.exe`) using the command line argument `/l`. The detection is focused on monitoring process creation events where the command line for `WINWORD.exe` includes both the `/l` flag and a reference to a `.dll` file. An attacker might exploit this functionality to sideload malicious DLLs under the cover of a legitimate Word process, thereby evading certain security measures. The primary technical data sources for this detection are Windows process creation logs, which provide insights into the execution and command line parameters of running processes.
  ### Investigation Steps
  - Review the process creation logs in your EDR to confirm the presence of `WINWORD.exe` and check the associated command line for parameters including `/l` and any referenced `.dll` files.
  - Correlate the details gathered from the EDR with your SIEM to check for any other processes or events that occurred around the same time, which may indicate a broader malicious campaign.
  - Use antivirus and endpoint protection tools to scan the identified DLLs for known malware signatures and behaviors, as well as to determine if any have been flagged previously.
  - Investigate any outbound connections made by `WINWORD.exe` during the timeframe of the alert, using NDR or firewall logs to identify suspicious network traffic that may indicate data exfiltration or command-and-control activity.
