title: Suspicious Network Command
id: a29c1813-ab1f-4dde-b489-330b952e91ae
status: test
description: Adversaries may look for details about the network configuration and
  settings of systems they access or through information discovery of remote systems
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1016/T1016.md#atomic-test-1---system-network-configuration-discovery-on-windows
author: frack113, Christopher Peacock '@securepeacock', SCYTHE '@scythe_io'
date: 2021-12-07
modified: 2022-04-11
tags:
- attack.discovery
- attack.t1016
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|contains:
    - 'ipconfig /all'
    - 'netsh interface show interface'
    - 'arp -a'
    - 'nbtstat -n'
    - 'net config'
    - 'route print'
  condition: selection
falsepositives:
- Administrator, hotline ask to user
level: low
notes: |
  ### Technical Context
  The "Suspicious Network Command" detection rule is designed to identify potentially malicious activity associated with network discovery commands executed on Windows systems. Adversaries often utilize commands such as `ipconfig /all`, `netsh`, `arp`, and others to gather information about network configuration, interfaces, and routing tables, which can aid in further exploits or lateral movement. The rule specifically monitors process creation logs for command-line arguments containing these network-related keywords, indicating an attempt to map the network environment from the compromised system. By leveraging process creation logs as the primary data source, the SOC can effectively track and respond to suspicious network discovery events that may indicate an ongoing security incident.
  ### Investigation Steps
  - Review the EDR logs to identify the process creation events associated with the detected command-line arguments, and confirm the source user and host involved.
  - Check the timeline of the command execution against user activity logs to establish if the commands were executed by legitimate users or could have been triggered by a potential attacker.
  - Analyze the network traffic logs for any suspicious outbound connections or patterns that correlate with the timings of the command executions.
  - Conduct a review of previous alerting incidents to ascertain if there are patterns of similar commands being executed in conjunction with other suspicious indicators within the environment.
