title: PsExec Service Child Process Execution as LOCAL SYSTEM
id: 7c0dcd3d-acf8-4f71-9570-f448b0034f94
related:
- id: fa91cc36-24c9-41ce-b3c8-3bbc3f2f67ba
  type: similar
status: test
description: Detects suspicious launch of the PSEXESVC service on this system and
  a sub process run as LOCAL_SYSTEM (-s), which means that someone remotely started
  a command on this system running it with highest privileges and not only the privileges
  of the login user account (e.g. the administrator account)
references:
- https://learn.microsoft.com/en-us/sysinternals/downloads/psexec
author: Florian Roth (Nextron Systems)
date: 2022-07-21
modified: 2023-02-28
tags:
- attack.execution
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    ParentImage: 'C:\Windows\PSEXESVC.exe'
    User|contains:     # covers many language settings
    - 'AUTHORI'
    - 'AUTORI'
  condition: selection
falsepositives:
- Users that debug Microsoft Intune issues using the commands mentioned in the official
  documentation; see https://learn.microsoft.com/en-us/mem/intune/apps/intune-management-extension
level: high
notes: |
  ### Technical Context
  This Sigma rule is designed to detect the execution of child processes launched by the PsExec service (`PSEXESVC.exe`) running under the LOCAL_SYSTEM account. PsExec is a tool that allows for remote execution of processes on a Windows system, often used for legitimate administrative tasks. However, when misused, it can enable attackers to execute commands with higher privileges than those of the logged-in user, potentially leading to unauthorized access or malicious activities on the system. The rule specifically looks for instances where `PSEXESVC.exe` is the parent process, and the child process is initiated under the LOCAL_SYSTEM account, indicating a potentially suspicious use of the PsExec functionality. The technical data sources involved in this rule include process creation logs from Windows environments.
  ### Investigation Steps
  - Review the EDR logs for additional context on the parent process `C:\Windows\PSEXESVC.exe` and any executed child processes to determine their nature and legitimacy.
  - Check process creation timestamps to identify if the execution coincides with known maintenance windows or scheduled administrative tasks.
  - Utilize AV logs to verify if the identified child processes have been flagged as malicious or are associated with known threats.
  - Inspect event logs from the Windows system for any related security or system events, focusing on entries that may indicate unusual activity or unauthorized access patterns.
