title: Local Accounts Discovery
id: 502b42de-4306-40b4-9596-6f590c81f073
status: test
description: Local accounts, System Owner/User discovery using operating systems utilities
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1033/T1033.md
author: Timur Zinniatullin, Daniil Yugoslavskiy, oscd.community
date: 2019-10-21
modified: 2023-01-03
tags:
- attack.discovery
- attack.t1033
- attack.t1087.001
logsource:
  category: process_creation
  product: windows
detection:
  selection_other_img:
    Image|endswith:
    - '\whoami.exe'
    - '\quser.exe'
    - '\qwinsta.exe'
  selection_other_wmi:
    Image|endswith: '\wmic.exe'
    CommandLine|contains|all:
    - 'useraccount'
    - 'get'
  selection_other_cmdkey:
    Image|endswith: '\cmdkey.exe'
    CommandLine|contains: ' /l'
  selection_cmd:
    Image|endswith: '\cmd.exe'
    CommandLine|contains|all:
    - ' /c'
    - 'dir '
    - '\Users\'
  filter_cmd:
    CommandLine|contains: ' rmdir '     # don't match on 'dir'   "C:\Windows\System32\cmd.exe" /q /c rmdir /s /q "C:\Users\XX\AppData\Local\Microsoft\OneDrive\19.232.1124.0005"
  selection_net:
    Image|endswith:
    - '\net.exe'
    - '\net1.exe'
    CommandLine|contains: 'user'
  filter_net:
    CommandLine|contains:
    - '/domain'               # local account discovery only
    - '/add'                  # discovery only
    - '/delete'               # discovery only
    - '/active'               # discovery only
    - '/expires'              # discovery only
    - '/passwordreq'          # discovery only
    - '/scriptpath'           # discovery only
    - '/times'                # discovery only
    - '/workstations'         # discovery only
  condition: (selection_cmd and not filter_cmd) or (selection_net and not filter_net)
    or 1 of selection_other_*
falsepositives:
- Legitimate administrator or user enumerates local users for legitimate reason
level: low
notes: |
  n
  ### Technical Context
  The "Local Accounts Discovery" detection rule aims to identify potential reconnaissance activities performed by adversaries seeking to enumerate local user accounts on a Windows system. This behavior is often conducted using built-in utilities such as `whoami.exe`, `net.exe`, `wmic.exe`, and `cmd.exe` with specific command syntax. The rule inspects the command line execution of these utilities and looks for signs that indicate user enumeration, such as specific command flags and parameters. By analyzing event logs related to process creation, it can determine when these tools are used with commands that reveal sensitive account information. The associated tactics and techniques in the MITRE ATT&CK framework include **Discovery** (T1087) and **Account Discovery** (T1033), which are integral components of adversarial behavior during the initial stages of an attack.
  ### Investigation Steps
  - **Verify Alert Source:** Check the security logs in your SIEM for entries related to `process_creation` events, filtering for the identified command-line patterns involving `whoami.exe`, `net.exe`, `wmic.exe`, and `cmd.exe`.
  - **Analyze Process Context:** Use your EDR tool to investigate the process creation context, including parent process information, to determine if the detected commands were executed from a legitimate administrative session or through other means.
  - **Review User Activity:** Correlate the timestamp of the alert with user activity logs (such as Azure AD logs or VPN logs) to identify whether an authorized user was logged in at the time of the discovery activity.
  - **Examine System Configuration:** Check the configuration of local security policies to ascertain if any unusual configurations or permissions exist that could facilitate unauthorized enumeration of local accounts.
  ### Prioritization
  This alert has a low severity level as it can also be triggered by legitimate administrative actions. However, it remains important for SOC analysts to investigate unusual patterns of account discovery, which may indicate preparatory steps for further malicious actions.
  ### Blind spots and Assumptions
  This detection rule may not fire if an adversary uses custom scripts or non-standard tools to enumerate users or if they obfuscate their command line inputs. Additionally, legitimate use of account discovery tools by system administrators or support personnel could lead to false positives. It's also assumed that the tools listed are not disabled or manipulated by adversaries, as this could prevent proper detection of account discovery actions.
  > **Disclaimer:** This investigation guide was created using generative AI technology and has not been reviewed for its accuracy and relevance. While every effort has been made to ensure its quality, we recommend validating the content and adapting it to suit specific environment and operational needs. Please communicate any changes to the detection engineering team.
