title: XSL Script Execution Via WMIC.EXE
id: 05c36dd6-79d6-4a9a-97da-3db20298ab2d
status: test
description: |
  Detects the execution of WMIC with the "format" flag to potentially load XSL files.
  Adversaries abuse this functionality to execute arbitrary files while potentially bypassing application whitelisting defenses.
  Extensible Stylesheet Language (XSL) files are commonly used to describe the processing and rendering of data within XML files.
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1220/T1220.md
author: Timur Zinniatullin, oscd.community, Swachchhanda Shrawan Poudel
date: 2019-10-21
modified: 2024-03-05
tags:
- attack.defense-evasion
- attack.t1220
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith: '\wmic.exe'
    CommandLine|contains|windash: '-format'         # wmic process list -FORMAT /? or wmic process list /FORMAT /?
  filter_main_known_format:
    CommandLine|contains:
    - 'Format:List'
    - 'Format:htable'
    - 'Format:hform'
    - 'Format:table'
    - 'Format:mof'
    - 'Format:value'
    - 'Format:rawxml'
    - 'Format:xml'
    - 'Format:csv'
  condition: selection and not 1 of filter_main_*
falsepositives:
- WMIC.exe FP depend on scripts and administrative methods used in the monitored environment.
- Static format arguments - https://petri.com/command-line-wmi-part-3
level: medium
notes: |
  ### Technical Context
  This Sigma rule monitors the execution of the Windows Management Instrumentation Command-line (WMIC) tool with a specific focus on its use of the "format" flag, which can be exploited by attackers to load Extensible Stylesheet Language (XSL) files. XSL files can serve as a means of executing arbitrary code while bypassing common security measures such as application whitelisting. The rule looks for WMIC process creation events in the log data, specifically targeting command lines that include the `-format` parameter, while excluding certain common format strings that are less likely to indicate malicious activity. This detection is particularly valuable in identifying attempts to leverage WMIC for nefarious purposes, as adversaries increasingly turn to legitimate administrative tools for their operations.
  ### Investigation Steps
  - Search for recent WMIC.exe executions in the EDR logs, focusing on those with command lines containing the `-format` parameter.
  - Correlate the timestamps of the WMIC executions with any reported security incidents or unusual activities in other logs, including network traffic and user accounts.
  - Review the command-line arguments and any associated XSL files to determine if any potentially malicious payloads were delivered or executed.
  - Analyze user activity and permissions associated with the WMIC execution to assess whether it aligns with normal operational behavior or indicates a potential insider threat.
