title: Suspicious File Download From File Sharing Domain Via Curl.EXE
id: 56454143-524f-49fb-b1c6-3fb8b1ad41fb
status: experimental
description: Detects potentially suspicious file download from file sharing domains
  using curl.exe
references:
- https://labs.withsecure.com/publications/fin7-target-veeam-servers
- https://github.com/WithSecureLabs/iocs/blob/344203de742bb7e68bd56618f66d34be95a9f9fc/FIN7VEEAM/iocs.csv
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023-05-05
modified: 2024-10-21
tags:
- attack.execution
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: '\curl.exe'
  - OriginalFileName: 'curl.exe'
  selection_websites:
    CommandLine|contains:
    - '.githubusercontent.com'               # Includes both gists and github repositories / Michael Haag (idea)
    - 'anonfiles.com'
    - 'cdn.discordapp.com'
    - 'ddns.net'
    - 'dl.dropboxusercontent.com'
    - 'ghostbin.co'
    - 'glitch.me'
    - 'gofile.io'
    - 'hastebin.com'
    - 'mediafire.com'
    - 'mega.nz'
    - 'onrender.com'
    - 'pages.dev'
    - 'paste.ee'
    - 'pastebin.com'
    - 'pastebin.pl'
    - 'pastetext.net'
    - 'pixeldrain.com'
    - 'privatlab.com'
    - 'privatlab.net'
    - 'send.exploit.in'
    - 'sendspace.com'
    - 'storage.googleapis.com'
    - 'storjshare.io'
    - 'supabase.co'
    - 'temp.sh'
    - 'transfer.sh'
    - 'trycloudflare.com'
    - 'ufile.io'
    - 'w3spaces.com'
    - 'workers.dev'
  selection_http:
    CommandLine|contains: 'http'
  selection_flag:
    CommandLine|contains:
    - ' -O'          # covers the alias for --remote-name and --output
    - '--remote-name'
    - '--output'
  selection_ext:
    CommandLine|endswith:
    - ".ps1"
    - ".ps1'"
    - '.ps1"'
    - ".dat"
    - ".dat'"
    - '.dat"'
    - ".msi"
    - ".msi'"
    - '.msi"'
    - ".bat"
    - ".bat'"
    - '.bat"'
    - ".exe"
    - ".exe'"
    - '.exe"'
    - ".vbs"
    - ".vbs'"
    - '.vbs"'
    - ".vbe"
    - ".vbe'"
    - '.vbe"'
    - ".hta"
    - ".hta'"
    - '.hta"'
    - ".dll"
    - ".dll'"
    - '.dll"'
    - ".psm1"
    - ".psm1'"
    - '.psm1"'
  condition: all of selection_*
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This detection rule identifies potentially suspicious activities associated with file downloads originating from known file-sharing domains via the use of `curl.exe`. The rule monitors process creation events on Windows systems, focusing on instances where `curl.exe` is executed. It scans the command line for specific patterns indicating that files are being downloaded from various file-sharing sites, such as GitHub, Dropbox, and MediaFire. The rule looks for key parameters typically used in file downloads, such as `-O` or `--output`, along with file extensions often linked to potentially malicious content like `.ps1`, `.exe`, and `.dll`.
  By leveraging process creation logs, the detection can highlight unusual or unauthorized use of `curl.exe` for the purpose of downloading files from suspicious online sources, thereby helping incident responders to identify and mitigate threats before they manifest further into breaches or malware infections.
  ### Investigation Steps
  - Review the EDR logs for the original process creation event associated with `curl.exe` to gather details about the user and machine involved.
  - Query the proxy logs to analyze the connection to the identified file-sharing domains for additional context, such as the volume and timing of requests.
  - Examine the downloaded file's properties and contents for any indications of malicious behavior or connections to known threat actors.
  - Cross-reference findings with threat intelligence sources to determine if the file download is linked to any recent attack patterns or known IOCs.
