title: Suspicious Child Process Of BgInfo.EXE
id: 811f459f-9231-45d4-959a-0266c6311987
related:
- id: aaf46cdc-934e-4284-b329-34aa701e3771
  type: similar
status: test
description: Detects suspicious child processes of "BgInfo.exe" which could be a sign
  of potential abuse of the binary to proxy execution via external VBScript
references:
- https://lolbas-project.github.io/lolbas/OtherMSBinaries/Bginfo/
- https://oddvar.moe/2017/05/18/bypassing-application-whitelisting-with-bginfo/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023-08-16
tags:
- attack.execution
- attack.t1059.005
- attack.defense-evasion
- attack.t1218
- attack.t1202
logsource:
  category: process_creation
  product: windows
detection:
  selection_parent:
    ParentImage|endswith:
    - '\bginfo.exe'
    - '\bginfo64.exe'
  selection_child:
  - Image|endswith:
    - '\calc.exe'
    - '\cmd.exe'
    - '\cscript.exe'
    - '\mshta.exe'
    - '\notepad.exe'
    - '\powershell.exe'
    - '\pwsh.exe'
    - '\wscript.exe'
  - Image|contains:
    - '\AppData\Local\'
    - '\AppData\Roaming\'
    - ':\Users\Public\'
    - ':\Temp\'
    - ':\Windows\Temp\'
    - ':\PerfLogs\'
  condition: all of selection_*
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This detection rule identifies potentially suspicious child processes spawned by the application `BgInfo.exe`, which is used to display system information on the desktop. The rule targets scenarios where `BgInfo.exe` acts as a launcher for unexpected child processes commonly associated with malicious activities, such as `calc.exe`, `cmd.exe`, and various scripting engines like `powershell.exe` and `cscript.exe`. The rule analyzes process creation logs specifically to determine if `BgInfo.exe` is being exploited as a means to execute other executables or scripts from unusual directories, such as `AppData`, `Temp`, or `PerfLogs`. By monitoring the parent-child process relationships, the rule seeks to uncover potential misuse of this legitimate application to bypass security controls.
  ### Investigation Steps
  - Review the process creation logs in your EDR solution to confirm if `BgInfo.exe` is the parent of the suspicious child processes detected by the Sigma rule.
  - Utilize your NGFW or Proxy logs to check for any outbound connections initiated by the suspicious child processes, which may indicate command and control communications.
  - Inspect the file paths of the child processes to determine if they are originating from typical user directories like `AppData` or temporary file locations, as these can be indicative of evasion tactics.
  - Conduct a threat intelligence lookup on the involved executable names to gain context on known malware activities associated with those processes and corroborate your findings against established threat intelligence.
