title: DumpMinitool Execution
id: dee0a7a3-f200-4112-a99b-952196d81e42
status: test
description: Detects the use of "DumpMinitool.exe" a tool that allows the dump of
  process memory via the use of the "MiniDumpWriteDump"
references:
- https://twitter.com/mrd0x/status/1511415432888131586
- https://twitter.com/mrd0x/status/1511489821247684615
- https://lolbas-project.github.io/lolbas/OtherMSBinaries/DumpMinitool/
- https://gist.github.com/nasbench/6d58c3c125e2fa1b8f7a09754c1b087f
author: Nasreddine Bencherchali (Nextron Systems), Florian Roth (Nextron Systems)
date: 2022-04-06
modified: 2023-04-12
tags:
- attack.defense-evasion
- attack.t1036
- attack.t1003.001
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith:
    - '\DumpMinitool.exe'
    - '\DumpMinitool.x86.exe'
    - '\DumpMinitool.arm64.exe'
  - OriginalFileName:
    - 'DumpMinitool.exe'
    - 'DumpMinitool.x86.exe'
    - 'DumpMinitool.arm64.exe'
  selection_cli:
    CommandLine|contains:
    - ' Full'
    - ' Mini'
    - ' WithHeap'
  condition: all of selection_*
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  The "DumpMinitool Execution" Sigma rule is designed to detect the execution of a tool known as "DumpMinitool.exe," which facilitates the dumping of process memory using the Windows API function "MiniDumpWriteDump." The rule identifies instances where this executable runs with specific command-line parameters that may indicate its use for malicious purposes, such as extracting sensitive data from processes. The primary data sources utilized for detection include Windows process creation logs and command-line parameters. By monitoring these logs, the rule captures attempts to use DumpMinitool in potentially harmful ways, enabling SOC analysts to respond to suspicious behavior effectively.
  ### Investigation Steps
  - Review recent process creation logs in the EDR for any entries indicating the execution of "DumpMinitool.exe" or its variants.
  - Check the command-line parameters associated with the detected executions to identify potentially malicious flags like 'Full', 'Mini', or 'WithHeap.'
  - Correlate the findings with endpoint logs to determine if any sensitive applications or processes were targeted during the dump operations.
  - Investigate the context of the alert using the SIEM and relevant cloud logs to assess any unauthorized access or lateral movement attempts related to the workstation in question.
