title: Suspicious Spool Service Child Process
id: dcdbc940-0bff-46b2-95f3-2d73f848e33b
status: test
description: Detects suspicious print spool service (spoolsv.exe) child processes.
references:
- https://github.com/microsoft/Microsoft-365-Defender-Hunting-Queries/blob/efa17a600b43c897b4b7463cc8541daa1987eeb4/Exploits/Print%20Spooler%20RCE/Suspicious%20Spoolsv%20Child%20Process.md
author: Justin C. (@endisphotic), @dreadphones (detection), Thomas Patzke (Sigma rule)
date: 2021-07-11
modified: 2024-12-01
tags:
- attack.execution
- attack.t1203
- attack.privilege-escalation
- attack.t1068
logsource:
  category: process_creation
  product: windows
detection:
  spoolsv:
    ParentImage|endswith: '\spoolsv.exe'
    IntegrityLevel:
    - 'System'
    - 'S-1-16-16384'
  suspicious_unrestricted:
    Image|endswith:
    - '\gpupdate.exe'
    - '\whoami.exe'
    - '\nltest.exe'
    - '\taskkill.exe'
    - '\wmic.exe'
    - '\taskmgr.exe'
    - '\sc.exe'
    - '\findstr.exe'
    - '\curl.exe'
    - '\wget.exe'
    - '\certutil.exe'
    - '\bitsadmin.exe'
    - '\accesschk.exe'
    - '\wevtutil.exe'
    - '\bcdedit.exe'
    - '\fsutil.exe'
    - '\cipher.exe'
    - '\schtasks.exe'
    - '\write.exe'
    - '\wuauclt.exe'
    - '\systeminfo.exe'
    - '\reg.exe'
    - '\query.exe'
  suspicious_net:
    Image|endswith:
    - '\net.exe'
    - '\net1.exe'
  suspicious_net_filter:
    CommandLine|contains: 'start'
  suspicious_cmd:
    Image|endswith: '\cmd.exe'
  suspicious_cmd_filter:
    CommandLine|contains:
    - '.spl'
    - 'route add'
    - 'program files'
  suspicious_netsh:
    Image|endswith: '\netsh.exe'
  suspicious_netsh_filter:
    CommandLine|contains:
    - 'add portopening'
    - 'rule name'
  suspicious_powershell:
    Image|endswith:
    - '\powershell.exe'
    - '\pwsh.exe'
  suspicious_powershell_filter:
    CommandLine|contains: '.spl'
  suspicious_rundll32_img:
  - Image|endswith: '\rundll32.exe'
  - OriginalFileName: 'RUNDLL32.EXE'
  suspicious_rundll32_cli:
    CommandLine|endswith: 'rundll32.exe'
  condition: spoolsv and ( suspicious_unrestricted or (suspicious_net and not suspicious_net_filter)
    or (suspicious_cmd and not suspicious_cmd_filter) or (suspicious_netsh and not
    suspicious_netsh_filter) or (suspicious_powershell and not suspicious_powershell_filter)
    or all of suspicious_rundll32_* )
fields:
- Image
- CommandLine
falsepositives:
- Unknown
level: high
notes: |
  n
  ### Technical Context
  The "Suspicious Spool Service Child Process" rule is designed to detect potentially harmful child processes spawned by the Windows Print Spooler service (spoolsv.exe). Attackers may exploit the print spooler to execute arbitrary code under the context of a system-level service, making this an attractive target for privilege escalation and remote code execution (RCE) attacks. The rule works by monitoring process creation events and looks for any child processes initiated by spoolsv.exe that match specific criteria. These criteria include common tools and commands that are often leveraged in malicious activities, such as command-line utilities (e.g., cmd.exe, powershell.exe, net.exe) and processes like rundll32.exe that can execute DLL files. The detection leverage is primarily drawn from Windows event logs, particularly focusing on the process creation logs.
  This rule aligns with MITRE ATT&CK tactics and techniques in the `Execution` category, specifically the techniques T1203 (Exploitation for Client Execution) and T1068 (Exploitation of Elevation Control Mechanisms). It is critical for incident responders to understand the context of these processes to ascertain legitimate versus suspicious behaviors promptly.
  ### Investigation Steps
  - **Review Process Creation Logs:** Examine process creation logs associated with spoolsv.exe to identify the parent-child relationships and the command-line parameters used at runtime. This will help in assessing whether the child process holds suspicious characteristics.
    
  - **Correlate with EDR Data:** Use the Endpoint Detection and Response (EDR) tool to get deeper insights into the execution context of the processes, including any potential elevated privileges or abnormal behavior exhibited by these child processes.
  - **Analyze Network Traffic:** Investigate any outbound connections from identified suspicious processes using Network Detection and Response (NDR) systems. This can help establish if any data exfiltration or command-and-control communications occurred.
  - **Check for File System Changes:** Use file and registry monitoring tools to review changes made by the detected processes to understand their impact on the system or to identify any persistence mechanisms that might have been employed.
  ### Prioritization
  Given the potential for remote code execution and privilege escalation associated with this alert, it is classified as high severity. Prompt investigation is essential to mitigate risks to the enterprise environment.
  ### Blind Spots and Assumptions
  This rule may not fire if the spoolsv.exe parent process does not exhibit any non-compliant child processes as specified. Additionally, legitimate administrative tasks utilizing the monitored tools may trigger false positives. The effectiveness of the rule also assumes an active logging mechanism that captures all relevant process creation events; without thorough logging, suspicious behaviors may go undetected. It's important to consider that skilled adversaries might use less common tools or methods that bypass this detection, emphasizing the need for comprehensive threat-hunting practices.
  > **Disclaimer:** This investigation guide was created using generative AI technology and has not been reviewed for its accuracy and relevance. While every effort has been made to ensure its quality, we recommend validating the content and adapting it to suit specific environment and operational needs. Please communicate any changes to the detection engineering team.
