title: Run Once Task Execution as Configured in Registry
id: 198effb6-6c98-4d0c-9ea3-451fa143c45c
status: test
description: This rule detects the execution of Run Once task as configured in the
  registry
references:
- https://twitter.com/pabraeken/status/990717080805789697
- https://lolbas-project.github.io/lolbas/Binaries/Runonce/
- https://twitter.com/0gtweet/status/1602644163824156672?s=20&t=kuxbUnZPltpvFPZdCrqPXA
author: 'Avneet Singh @v3t0_, oscd.community, Christopher Peacock @SecurePeacock (updated)'
date: 2020-10-18
modified: 2022-12-13
tags:
- attack.defense-evasion
- attack.t1112
logsource:
  product: windows
  category: process_creation
detection:
  selection_img:
  - Image|endswith: '\runonce.exe'
  - Description: 'Run Once Wrapper'
  selection_cli:
  - CommandLine|contains: '/AlternateShellStartup'
  - CommandLine|endswith: '/r'
  condition: all of selection_*
falsepositives:
- Unknown
level: low
notes: |
  ### Technical Context
  The Sigma rule titled "Run Once Task Execution as Configured in Registry" is designed to identify potentially suspicious executions of the `runonce.exe` application. This executable is often used to run commands or scripts at user login, and its behavior can be exploited for malicious purposes. The rule focuses on specific characteristics of the process creation logs from Windows environments, particularly looking for instances where the image path ends with `\runonce.exe` and the process description is labeled as “Run Once Wrapper.” Additionally, it examines command-line parameters that are indicative of atypical usage patterns, such as containing `/AlternateShellStartup` or ending with `/r`. The detection mechanism leverages logs captured by endpoint detection and response (EDR) tools, which provide insights into process creations and associated command-line arguments.
  ### Investigation Steps
  - Verify the process execution by searching EDR logs for any instances of `runonce.exe` and ensure that it matches the details defined in the detection rule, including the command-line arguments.
  - Investigate the user context under which the `runonce.exe` was executed by checking Windows Event Logs for any account activity correlated with the alert.
  - Review the system registry settings related to `RunOnce` tasks using registry auditing tools to determine if there have been any unauthorized modifications or configurations.
  - If the execution is deemed suspicious, utilize the AV and incident response capabilities to perform further analysis on the system for potential artifacts or benign explanation possibilities.
