title: Conhost Spawned By Uncommon Parent Process
id: cbb9e3d1-2386-4e59-912e-62f1484f7a89
status: test
description: Detects when the Console Window Host (conhost.exe) process is spawned
  by an uncommon parent process, which could be indicative of potential code injection
  activity.
references:
- https://www.elastic.co/guide/en/security/current/conhost-spawned-by-suspicious-parent-process.html
author: Tim Rauch, Elastic (idea)
date: 2022-09-28
modified: 2023-03-29
tags:
- attack.execution
- attack.t1059
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith: '\conhost.exe'
    ParentImage|endswith:
    - '\explorer.exe'
            # - '\csrss.exe'  # Legitimate parent as seen in EchoTrail https://www.echotrail.io/insights/search/csrss.exe
            # - '\ctfmon.exe'  # Seen several times in a testing environment
            # - '\dllhost.exe'  # FP on clean system from grandparent 'svchost.exe -k DcomLaunch -p'
    - '\lsass.exe'
    - '\regsvr32.exe'
    - '\rundll32.exe'
    - '\services.exe'
    - '\smss.exe'
    - '\spoolsv.exe'
    - '\svchost.exe'
    - '\userinit.exe'
            # - '\wermgr.exe'  # Legitimate parent as seen in EchoTrail https://www.echotrail.io/insights/search/wermgr.exe
    - '\wininit.exe'
    - '\winlogon.exe'
  filter_main_svchost:
    ParentCommandLine|contains:
    - '-k apphost -s AppHostSvc'
    - '-k imgsvc'
    - '-k localService -p -s RemoteRegistry'
    - '-k LocalSystemNetworkRestricted -p -s NgcSvc'
    - '-k NetSvcs -p -s NcaSvc'
    - '-k netsvcs -p -s NetSetupSvc'
    - '-k netsvcs -p -s wlidsvc'
    - '-k NetworkService -p -s DoSvc'
    - '-k wsappx -p -s AppXSvc'
    - '-k wsappx -p -s ClipSVC'
  filter_optional_dropbox:
    ParentCommandLine|contains:
    - 'C:\Program Files (x86)\Dropbox\Client\'
    - 'C:\Program Files\Dropbox\Client\'
  condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  This detection rule aims to identify instances where the Console Window Host process (`conhost.exe`) is spawned by an unusual parent process, which may indicate potential malicious activity like code injection. This is significant because `conhost.exe` is a common target for threat actors attempting to execute commands invisibly, often leveraging environment variables and parent-child process relationships to obscure their actions. The rule analyzes process creation logs, specifically looking for instances where `conhost.exe` is initiated by parent processes typically not associated with it, such as `lsass.exe`, `regsvr32.exe`, and several others while excluding known benign parent processes. This behavior can indicate advanced persistent threats or other forms of exploitation that aim to evade traditional detection methods.
  ### Investigation Steps
  - Use your EDR solution to investigate the process tree and confirm the parent-child relationship involving `conhost.exe`. Document any unusual parent processes that deviate from the expected behaviors.
  - Review the command-line parameters of the suspicious parent process to look for any indications of exploitation. Focus on any commands that may involve the launch of hidden processes or unusual network activity.
  - Check Windows Event Logs related to process creation for timestamps and user context. This information can help you understand if the alert corresponds with other suspicious activity.
  - If applicable, correlate the findings with network activity using your NDR or firewall logs to identify potential command-and-control communications that could link back to the identified processes.
