title: Taskkill Symantec Endpoint Protection
id: 4a6713f6-3331-11ed-a261-0242ac120002
status: test
description: |
  Detects one of the possible scenarios for disabling Symantec Endpoint Protection.
  Symantec Endpoint Protection antivirus software services incorrectly implement the protected service mechanism.
  As a result, the NT AUTHORITY/SYSTEM user can execute the taskkill /im command several times ccSvcHst.exe /f, thereby killing the process belonging to the service, and thus shutting down the service.
references:
- https://www.exploit-db.com/exploits/37525
- https://community.spiceworks.com/topic/2195015-batch-script-to-uninstall-symantec-endpoint-protection
- https://community.broadcom.com/symantecenterprise/communities/community-home/digestviewer/viewthread?MessageKey=6ce94b67-74e1-4333-b16f-000b7fd874f0&CommunityKey=1ecf5f55-9545-44d6-b0f4-4e4a7f5f5e68&tab=digestviewer
author: Ilya Krestinichev, Florian Roth (Nextron Systems)
date: 2022-09-13
tags:
- attack.defense-evasion
- attack.t1562.001
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|contains|all:
    - 'taskkill'
    - ' /F '
    - ' /IM '
    - 'ccSvcHst.exe'
  condition: selection
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This Sigma rule is designed to detect attempts to terminate the Symantec Endpoint Protection (SEP) service, which is critical for maintaining endpoint security. It looks for instances where the `taskkill` command is executed with specific parameters that target the `ccSvcHst.exe` process, a critical component of the Symantec endpoint protection architecture. The rule alerts on command lines containing the keywords `taskkill`, `/F`, and `/IM`, signifying a forceful termination of the `ccSvcHst.exe` process by the NT AUTHORITY/SYSTEM user. By identifying this specific command usage, the rule helps in recognizing potential unauthorized actions aimed at disabling essential security measures on Windows systems.
  ### Investigation Steps
  - Review recent process creation logs in the EDR platform to identify when and by whom the `taskkill` command was executed, particularly focusing on those that included `ccSvcHst.exe`.
  - Check the command-line parameters used in the taskkill execution to confirm if they match the indicators specified in the detection rule.
  - Investigate the authentication and user activity around the time of the command execution in the VPN logs to determine if any anomalies suggest privileged access exploitation.
  - Cross-reference the timings and originating systems with logs from the NGFW or other network monitoring tools to identify potential external access or lateral movement related to the incident.
