title: Potential Data Stealing Via Chromium Headless Debugging
id: 3e8207c5-fcd2-4ea6-9418-15d45b4890e4
related:
- id: b3d34dc5-2efd-4ae3-845f-8ec14921f449
  type: derived
status: test
description: Detects chromium based browsers starting in headless and debugging mode
  and pointing to a user profile. This could be a sign of data stealing or remote
  control
references:
- https://github.com/defaultnamehere/cookie_crimes/
- https://mango.pdf.zone/stealing-chrome-cookies-without-a-password
- https://embracethered.com/blog/posts/2020/cookie-crimes-on-mirosoft-edge/
- https://embracethered.com/blog/posts/2020/chrome-spy-remote-control/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-12-23
tags:
- attack.credential-access
- attack.t1185
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|contains|all:
    - '--remote-debugging-'         # Covers: --remote-debugging-address, --remote-debugging-port, --remote-debugging-socket-name, --remote-debugging-pipe....etc
    - '--user-data-dir'
    - '--headless'
  condition: selection
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This Sigma rule is designed to detect suspicious activities involving Chromium-based browsers, particularly when they are launched in headless mode with remote debugging capabilities enabled. Headless mode allows the browser to run without a user interface, making it conducive for automated scripts and malicious actors to access and harvest data silently. The rule looks for process creation events that include command-line parameters indicating remote debugging (`--remote-debugging-*`), a specified user profile directory (`--user-data-dir`), and the headless flag (`--headless`). When a browser requests to start with these configurations, it raises flags for potential data theft or unauthorized remote control of the user's session. The log data involved primarily comes from process creation logs on Windows systems.
  ### Investigation Steps
  - Examine the EDR logs for related process creation events, focusing on instances of Chromium-based browsers initiated with the headless and remote debugging flags. 
  - Review the command-line parameters captured in the process creation logs to verify whether these processes are related to legitimate applications or potentially malicious activities.
  - Investigate any associated user accounts or profiles through the user data directory referenced in the command-line arguments to determine if any unauthorized access or data exfiltration has occurred.
  - Cross-reference proxy logs for outbound communications made by the affected browser instance during the time frame of the alert to identify any suspicious network activity or data transfers.
