title: Potential Homoglyph Attack Using Lookalike Characters
id: 32e280f1-8ad4-46ef-9e80-910657611fbc
status: test
description: |
  Detects the presence of unicode characters which are homoglyphs, or identical in appearance, to ASCII letter characters.
  This is used as an obfuscation and masquerading techniques. Only "perfect" homoglyphs are included; these are characters that
  are indistinguishable from ASCII characters and thus may make excellent candidates for homoglyph attack characters.
references:
- https://redcanary.com/threat-detection-report/threats/socgholish/#threat-socgholish
- http://www.irongeek.com/homoglyph-attack-generator.php
author: Micah Babinski, @micahbabinski
date: 2023-05-07
tags:
- attack.defense-evasion
- attack.t1036
- attack.t1036.003
   # - attack.t1036.008
logsource:
  category: process_creation
  product: windows
detection:
  selection_upper:
    CommandLine|contains:
    - "А"              # А/A
    - "В"              # В/B
    - "Е"              # Е/E
    - "К"              # К/K
    - "М"              # М/M
    - "Н"              # Н/H
    - "О"              # О/O
    - "Р"              # Р/P
    - "С"              # С/C
    - "Т"              # Т/T
    - "Х"              # Х/X
    - "Ѕ"              # Ѕ/S
    - "І"              # І/I
    - "Ј"              # Ј/J
    - "Ү"              # Ү/Y
    - "Ӏ"              # Ӏ/I
    - "Ԍ"              # Ԍ/G
    - "Ԛ"              # Ԛ/Q
    - "Ԝ"              # Ԝ/W
    - "Α"              # Α/A
    - "Β"              # Β/B
    - "Ε"              # Ε/E
    - "Ζ"              # Ζ/Z
    - "Η"              # Η/H
    - "Ι"              # Ι/I
    - "Κ"              # Κ/K
    - "Μ"              # Μ/M
    - "Ν"              # Ν/N
    - "Ο"              # Ο/O
    - "Ρ"              # Ρ/P
    - "Τ"              # Τ/T
    - "Υ"              # Υ/Y
    - "Χ"              # Χ/X
  selection_lower:
    CommandLine|contains:
    - "а"              # а/a
    - "е"              # е/e
    - "о"              # о/o
    - "р"              # р/p
    - "с"              # с/c
    - "х"              # х/x
    - "ѕ"              # ѕ/s
    - "і"              # і/i
    - "ӏ"              # ӏ/l
    - "ј"              # ј/j
    - "һ"              # һ/h
    - "ԁ"              # ԁ/d
    - "ԛ"              # ԛ/q
    - "ԝ"              # ԝ/w
    - "ο"              # ο/o
  condition: 1 of selection_*
falsepositives:
- Commandlines with legitimate Cyrillic text; will likely require tuning (or not be
  usable) in countries where these alphabets are in use.
level: medium
notes: |
  ### Technical Context
  This Sigma rule identifies potential homoglyph attacks—malicious tactics utilizing characters that resemble standard ASCII letters but are actually Unicode characters, making them harder to detect. The rule specifically looks for the presence of "perfect" homoglyph characters, which closely mimic specific ASCII letters. By focusing on command line arguments in process creation logs, the rule can identify command executions that may be obfuscated using these lookalike characters. The data sources involved in this detection include Windows process creation logs, allowing for effective monitoring of potentially suspicious command execution patterns.
  ### Investigation Steps
  - Use EDR tools to analyze process creation events. Examine the command line arguments for any instances of Unicode characters that match those outlined in the rule.
  - Cross-reference the identified processes with known software and business applications to determine if the commands were legitimate. Pay particular attention to any unusual or unexpected command-line usage.
  - Review the historical behavior of the affected endpoints, focusing on user behavior and any recent changes in user permissions or roles that could facilitate abnormal command execution.
  - Utilize log data from the NGFW and Proxy to monitor external communications initiated by the affected processes. Assess for any connections that may indicate data exfiltration attempts or interactions with known malicious infrastructure.
