title: Gzip Archive Decode Via PowerShell
id: 98767d61-b2e8-4d71-b661-e36783ee24c1
status: test
description: Detects attempts of decoding encoded Gzip archives via PowerShell.
references:
- https://www.zscaler.com/blogs/security-research/onenote-growing-threat-malware-distribution
author: Hieu Tran
date: 2023-03-13
tags:
- attack.command-and-control
- attack.t1132.001
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    CommandLine|contains|all:
    - 'GZipStream'
    - '::Decompress'
  condition: selection
falsepositives:
- Legitimate administrative scripts may use this functionality. Use "ParentImage"
  in combination with the script names and allowed users and applications to filter
  legitimate executions
level: medium
notes: |
  ### Technical Context
  This detection rule is designed to identify instances where PowerShell is used to decode Gzip archives, which can be an indicator of potentially malicious activity, such as malware distribution or command-and-control operations. The rule looks for specific command line arguments within process creation logs, specifically targeting instances where "GZipStream" and "::Decompress" are present. By monitoring these command line parameters, the SOC can detect unauthorized attempts to decompress potentially harmful payloads that may be hidden within Gzip files. The primary data source utilized by this rule is Windows process creation logs, which capture detailed information about processes initiated on the system, along with their respective command line arguments.
  ### Investigation Steps
  - Review the process creation logs in the EDR solution to identify the originating PowerShell commands and the context of their execution. 
  - Examine the parent process of the identified PowerShell execution to determine if it was initiated by a legitimate application or user.
  - Search for any associated files or Gzip archives that may have been processed during the same timeframe and assess their legitimacy.
  - Consult proxy logs for any external communications or downloads that coincide with the timeline of the detected Gzip processing activity.
