title: PowerShell Base64 Encoded FromBase64String Cmdlet
id: fdb62a13-9a81-4e5c-a38f-ea93a16f6d7c
status: test
description: Detects usage of a base64 encoded "FromBase64String" cmdlet in a process
  command line
references:
- Internal Research
author: Florian Roth (Nextron Systems)
date: 2019-08-24
modified: 2023-04-06
tags:
- attack.defense-evasion
- attack.t1140
- attack.execution
- attack.t1059.001
logsource:
  category: process_creation
  product: windows
detection:
  selection:
  - CommandLine|base64offset|contains: '::FromBase64String'
        # UTF-16 LE
  - CommandLine|contains:
    - 'OgA6AEYAcgBvAG0AQgBhAHMAZQA2ADQAUwB0AHIAaQBuAGcA'
    - 'oAOgBGAHIAbwBtAEIAYQBzAGUANgA0AFMAdAByAGkAbgBnA'
    - '6ADoARgByAG8AbQBCAGEAcwBlADYANABTAHQAcgBpAG4AZw'
  condition: selection
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This detection rule identifies potentially malicious use of the PowerShell cmdlet `FromBase64String`, which decodes Base64-encoded strings into their original binary form. The rule triggers when the process command line contains either the reference to `::FromBase64String` or specific Base64-encoded strings often associated with payload delivery or data obfuscation techniques. By monitoring process creation logs, particularly focusing on command-line parameters, this rule helps detect suspicious behaviors that could indicate attempts to evade detection mechanisms and execute unauthorized scripts or commands.
  The primary data source involved in this detection is the Windows process creation log, which captures relevant command-line input each time a process starts. By analyzing these logs, incident responders can pinpoint potentially harmful activities that may stem from exploitation attempts or script-based attacks leveraging PowerShell.
  ### Investigation Steps
  - Review the process creation logs in your EDR solution to identify processes that triggered the alert, paying particular attention to the parent-child process relationships.
  - Analyze the command-line arguments associated with the flagged processes to determine if they align with standard operational activities or if they seem suspicious.
  - Utilize memory analysis tools to inspect the running processes for any injected code or unusual behaviors, especially focusing on the identified Base64-decoded content.
  - Check the network logs (from your NDR or proxy solution) for any connections made by the flagged processes to identify any malicious communication patterns or unusual outbound activity.
