title: HackTool - LaZagne Execution
id: c2b86e67-b880-4eec-b045-50bc98ef4844
status: experimental
description: |
  Detects the execution of the LaZagne. A utility used to retrieve multiple types of passwords stored on a local computer.
  LaZagne has been leveraged multiple times by threat actors in order to dump credentials.
references:
- https://github.com/AlessandroZ/LaZagne/tree/master
- https://thedfirreport.com/2022/05/09/seo-poisoning-a-gootloader-story/
- https://cloud.google.com/blog/topics/threat-intelligence/alphv-ransomware-backup/
- https://securelist.com/defttorero-tactics-techniques-and-procedures/107610/
- https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/800c0e06571993a54e39571cf27fd474dcc5c0bc/2017/2017.11.14.Muddying_the_Water/muddying-the-water-targeted-attacks.pdf
author: Nasreddine Bencherchali (Nextron Systems)
date: 2024-06-24
modified: 2024-08-16
tags:
- attack.credential-access
logsource:
  product: windows
  category: process_creation
detection:
  selection_img:
    Image|endswith: '\lazagne.exe'
  selection_clionly:
        # Note: This selection can be prone to FP. An initial baseline is required
    Image|contains:
    - ':\PerfLogs\'
    - ':\ProgramData\'
    - ':\Temp\'
    - ':\Tmp\'
    - ':\Windows\Temp\'
    - '\AppData\'
    - '\Downloads\'
    - '\Users\Public\'
    CommandLine|endswith:
    - '.exe all'
    - '.exe browsers'
    - '.exe chats'
    - '.exe databases'
    - '.exe games'
    - '.exe git'
    - '.exe mails'
    - '.exe maven'
    - '.exe memory'
    - '.exe multimedia'
            # - '.exe php' # Might be prone to FP
            # - '.exe svn' # Might be prone to FP
    - '.exe sysadmin'
    - '.exe unused'
    - '.exe wifi'
    - '.exe windows'
  selection_cli_modules:
    CommandLine|contains:
    - 'all '
    - 'browsers '
    - 'chats '
    - 'databases '
    - 'games '
    - 'git '
    - 'mails '
    - 'maven '
    - 'memory '
    - 'multimedia '
    - 'php '
    - 'svn '
    - 'sysadmin '
    - 'unused '
    - 'wifi '
    - 'windows '
  selection_cli_options:
    CommandLine|contains:
    - '-oA'
    - '-oJ'
    - '-oN'
    - '-output'
    - '-password'
    - -1Password
    - '-apachedirectorystudio'
    - '-autologon'
    - '-ChromiumBased'
    - '-composer'
    - '-coreftp'
    - '-credfiles'
    - '-credman'
    - '-cyberduck'
    - '-dbvis'
    - '-EyeCon'
    - '-filezilla'
    - '-filezillaserver'
    - '-ftpnavigator'
    - '-galconfusion'
    - '-gitforwindows'
    - '-hashdump'
    - '-iisapppool'
    - '-IISCentralCertP'
    - '-kalypsomedia'
    - '-keepass'
    - '-keepassconfig'
    - '-lsa_secrets'
    - '-mavenrepositories'
    - '-memory_dump'
    - '-Mozilla'
    - '-mRemoteNG'
    - '-mscache'
    - '-opensshforwindows'
    - '-openvpn'
    - '-outlook'
    - '-pidgin'
    - '-postgresql'
    - '-psi-im'
    - '-puttycm'
    - '-pypykatz'
    - '-Rclone'
    - '-rdpmanager'
    - '-robomongo'
    - '-roguestale'
    - '-skype'
    - '-SQLDeveloper'
    - '-squirrel'
    - '-tortoise'
    - '-turba'
    - '-UCBrowser'
    - '-unattended'
    - '-vault'
    - '-vaultfiles'
    - '-vnc'
    - '-windows'
    - '-winscp'
    - '-wsl'
  condition: selection_img or selection_clionly or (selection_cli_modules and selection_cli_options)
falsepositives:
- Some false positive is expected from tools with similar command line flags.
# Note: Increase the level to "high" after an initial baseline
level: medium
notes: |
  ### Technical Context
  The Sigma rule "HackTool 
  - LaZagne Execution" is designed to detect the execution of LaZagne, a tool utilized by threat actors to extract various passwords stored on a local computer. The execution of this utility could indicate malicious activity in the environment, especially if it is run from unusual directories or with specific command-line parameters that could reveal user credentials. The rule employs several criteria for detection, mainly focusing on the `process_creation` logs, which include characteristics such as file paths, command-line arguments, and the executable image name.
  To effectively capture suspicious behavior, the detection logic targets scenarios where `lazagne.exe` is executed, particularly from directories like `PerfLogs`, `ProgramData`, `Temp`, and `AppData`, which can be common locations for both legitimate and nefarious activity. Furthermore, it analyzes command-line arguments, looking for certain keywords that signify the tool's intended usage, reflecting the MITRE ATT&CK tactic and technique for credential access.
  ### Investigation Steps
  - **Review Process Creation Events**: Utilize EDR tools to filter and review process creation logs for instances of `lazagne.exe` along with associated command-line arguments to determine context and intent of use.
    
  - **Check File Locations**: Analyze the source file paths from which `lazagne.exe` was executed; examine logs from Windows Security or System to identify any anomalous activity or patterns related to these directories.
    
  - **Correlate with User Activity**: Investigate user behavior in conjunction with the alert, utilizing VPN, Proxy, and other relevant logs to assess whether the execution aligns with legitimate user activity or indicates potential insider threats.
  - **Scan for Artifact Evidence**: Utilize AV tools to scan the system for remnants of LaZagne or other credential dumping tools to confirm malware presence; also, check for evidence of lateral movement or further exploitation.
  ### Prioritization
  This alert has a medium severity level because the execution of LaZagne can signify credential theft, which poses a notable risk to enterprise security. However, the potential for false positives from legitimate administrative tasks necessitates careful investigation.
  ### Blind spots and Assumptions
  - The rule may fail to fire if the execution of `lazagne.exe` is obfuscated or if command-line parameters are altered to avoid detection. Additionally, legitimate applications that use similar command-line structures could trigger false positives.
  - It is also assumed that the organization's baseline allows for the identification of normal versus malicious behavior; without established baselines, the reliability of detection could be impaired.
  > **Disclaimer:** This investigation guide was created using generative AI technology and has not been reviewed for its accuracy and relevance. While every effort has been made to ensure its quality, we recommend validating the content and adapting it to suit specific environment and operational needs. Please communicate any changes to the detection engineering team.
