title: LOLBIN Execution From Abnormal Drive
id: d4ca7c59-e9e4-42d8-bf57-91a776efcb87
related:
- id: 5b80cf53-3a46-4adc-960b-05ec19348d74
  type: similar
status: test
description: Detects LOLBINs executing from an abnormal or uncommon drive such as
  a mounted ISO.
references:
- https://thedfirreport.com/2021/12/13/diavol-ransomware/
- https://www.scythe.io/library/threat-emulation-qakbot
- https://sec-consult.com/blog/detail/bumblebee-hunting-with-a-velociraptor/
author: Christopher Peacock '@securepeacock', SCYTHE '@scythe_io', Angelo Violetti
  - SEC Consult '@angelo_violetti', Aaron Herman
date: 2022-01-25
modified: 2023-08-29
tags:
- attack.defense-evasion
logsource:
  category: process_creation
  product: windows
detection:
  selection:
        # Note: add more lolbins for additional coverage
  - Image|endswith:
    - '\calc.exe'
    - '\certutil.exe'
    - '\cmstp.exe'
    - '\cscript.exe'
    - '\installutil.exe'
    - '\mshta.exe'
    - '\regsvr32.exe'
    - '\rundll32.exe'
    - '\wscript.exe'
  - OriginalFileName:
    - 'CALC.EXE'
    - 'CertUtil.exe'
    - 'CMSTP.EXE'
    - 'cscript.exe'
    - 'installutil.exe'
    - 'MSHTA.EXE'
    - 'REGSVR32.EXE'
    - 'RUNDLL32.EXE'
    - 'wscript.exe'
  filter_main_currentdirectory:
    CurrentDirectory|contains: 'C:\'
  filter_main_empty:
    CurrentDirectory: ''
  filter_main_null:
    CurrentDirectory:
  condition: selection and not 1 of filter_main_*
falsepositives:
- Rare false positives could occur on servers with multiple drives.
level: medium
notes: |
  ### Technical Context
  This detection rule identifies the execution of Living Off the Land Binary (LOLBIN) activities from abnormal or uncommon drives, such as mounted ISOs. The rule specifically targets well-known Windows executables like `calc.exe`, `certutil.exe`, and `mshta.exe`, which are often abused by attackers for malicious purposes. It does so by monitoring the `process_creation` logs to check the execution paths of these binaries; the rule flags instances when they are launched from a location that is not a standard system drive (e.g., `C:\`). The intent is to discern potential malicious activity that may indicate an attempt to execute payloads or other nefarious actions using native Windows tools, thereby evading traditional detection mechanisms. This rule is aligned with the MITRE ATT&CK tactic of [Defense Evasion](https://attack.mitre.org/tactics/TA0005/) and the technique of using LOLBINs.
  ### Investigation Steps
  - **Review Process Creation Logs:** Check the EDR for process creation logs to identify instances of the specified LOLBINs that have been executed. Pay close attention to the execution context and the current working directory for unusual drive paths.
  - **Analyze File System Activity:** Use the file monitoring capabilities of your security tools to examine any files or artifacts created during the execution of the LOLBINs. Determine if any additional malicious files were created or accessed during this activity.
  - **Check Network Traffic:** Investigate any network connections made immediately before or after the LOLBIN execution. Correlate with proxy logs to identify any unusual outbound communications that may coincide with the alert.
  - **Assess User Behavior:** Look into the user account that executed the LOLBIN. Analyze the timeline of their activities and establish whether they fit normal operational behavior to help determine if the execution was part of legitimate maintenance or potentially malicious behavior.
  ### Prioritization
  The severity of this alert is categorized as medium due to the potential for serious breaches; however, LOLBIN executions can sometimes be part of legitimate administrative tasks. Therefore, while they require immediate investigation, there is a need for context to discern between benign and malicious intent.
  ### Blind Spots and Assumptions
  This rule may not fire if the legitimate execution of these binaries occurs from an expected location that is not monitored or if privilege escalation has taken place to sidestep detection. There is also the assumption that adverse actors will not employ obfuscation techniques or rename LOLBINs to less recognizable payloads that do not match the rule's specified criteria. Additionally, environments with cloud workloads or Docker containers may present a blind spot if they are not monitored adequately for similar binaries.
  > **Disclaimer:** This investigation guide was created using generative AI technology and has not been reviewed for its accuracy and relevance. While every effort has been made to ensure its quality, we recommend validating the content and adapting it to suit specific environment and operational needs. Please communicate any changes to the detection engineering team.
