title: Chopper Webshell Process Pattern
id: fa3c117a-bc0d-416e-a31b-0c0e80653efb
status: test
description: Detects patterns found in process executions cause by China Chopper like
  tiny (ASPX) webshells
references:
- https://www.microsoft.com/security/blog/2022/09/30/analyzing-attacks-using-the-exchange-vulnerabilities-cve-2022-41040-and-cve-2022-41082/
author: Florian Roth (Nextron Systems), MSTI (query)
date: 2022-10-01
tags:
- attack.persistence
- attack.t1505.003
- attack.t1018
- attack.t1033
- attack.t1087
logsource:
  category: process_creation
  product: windows
detection:
  selection_origin:
  - Image|endswith: '\w3wp.exe'
  - ParentImage|endswith: '\w3wp.exe'
  selection_cmdline:
    CommandLine|contains:
    - '&ipconfig&echo'
    - '&quser&echo'
    - '&whoami&echo'
    - '&c:&echo'
    - '&cd&echo'
    - '&dir&echo'
    - '&echo [E]'
    - '&echo [S]'
  condition: all of selection_*
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  The "Chopper Webshell Process Pattern" detection rule is designed to identify malicious webshell activity linked to the China Chopper tool, particularly through the execution of ASPX webshells. Specifically, the rule targets processes that are spawned by `w3wp.exe`, the IIS worker process, indicating potential exploitation of web applications. The rule looks for distinct command-line patterns associated with these webshells, which often include specific commands like `ipconfig`, `quser`, and `whoami`, followed by the output redirection command `echo`. By leveraging Windows process creation logs, this rule enables the identification of suspicious activity that could indicate potential persistence mechanisms utilized by attackers to maintain control in compromised environments.
  ### Investigation Steps
  - Review process creation logs in the EDR to identify any instances of `w3wp.exe` initiating processes with suspicious command-line parameters matching those specified in the rule.
  - Investigate parent processes associated with any alerts to determine if `w3wp.exe` was invoked by legitimate web applications or if it appears alongside other potentially malicious activities.
  - Correlate findings with network activity in the NDR to identify any outbound connections that may be related to the detected webshell executions, focusing on anomalous traffic patterns.
  - Conduct a search in cloud UI and logs (e.g., AWS, Azure) for recent deployments or modifications that could indicate compromised resources or web applications tied to these suspicious process executions.
