title: Nltest.EXE Execution
id: 903076ff-f442-475a-b667-4f246bcc203b
related:
- id: 5cc90652-4cbd-4241-aa3b-4b462fa5a248
  type: similar
- id: eeb66bbb-3dde-4582-815a-584aee9fe6d1
  type: obsolete
status: test
description: Detects nltest commands that can be used for information discovery
references:
- https://jpcertcc.github.io/ToolAnalysisResultSheet/details/nltest.htm
author: Arun Chauhan
date: 2023-02-03
tags:
- attack.discovery
- attack.t1016
- attack.t1018
- attack.t1482
logsource:
  category: process_creation
  product: windows
detection:
  selection:
  - Image|endswith: '\nltest.exe'
  - OriginalFileName: 'nltestrk.exe'
  condition: selection
falsepositives:
- Legitimate administration activity
level: low
notes: |
  ### Technical Context
  The Sigma rule "Nltest.EXE Execution" is designed to detect the execution of `nltest.exe`, a Windows command-line tool that can perform network-related tasks, including querying domain controllers and testing trust relationships. This tool can be misused for information discovery by malicious actors looking to gather details about system configurations, including group policies and domain trusts. The rule primarily analyzes process creation logs to identify instances where the image name ends with `nltest.exe` or where the original file name indicates a legitimate variant of this executable (i.e., `nltestrk.exe`). By focussing on these specific characteristics, the detection intends to highlight potentially unauthorized usage of the tool that could signify reconnaissance activities.
  ### Investigation Steps
  - Review the EDR logs for the specific execution of `nltest.exe` to assess the context of the command and identify the originating user account and workstation.
  - Query system event logs to check for any preceding activities or commands that could indicate malicious intent or unusual administrative behavior prior to the execution of `nltest.exe`.
  - Analyze network logs (e.g., from the firewall or proxy) for unusual outbound connections initiated shortly after the execution of `nltest.exe` that could correlate with an information-gathering attack.
  - Investigate user activity logs in the enterprise identity management system to determine if the user has the appropriate privileges and whether their actions align with their normal behavior patterns.
