title: Kavremover Dropped Binary LOLBIN Usage
id: d047726b-c71c-4048-a99b-2e2f50dc107d
status: test
description: Detects the execution of a signed binary dropped by Kaspersky Lab Products
  Remover (kavremover) which can be abused as a LOLBIN to execute arbitrary commands
  and binaries.
references:
- https://nasbench.medium.com/lolbined-using-kaspersky-endpoint-security-kes-installer-to-execute-arbitrary-commands-1c999f1b7fea
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-11-01
tags:
- attack.defense-evasion
- attack.t1127
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    CommandLine|contains: ' run run-cmd '
  filter_main_legit_parents:
    ParentImage|endswith:
    - '\cleanapi.exe'         # When launched from KES installer
    - '\kavremover.exe'         # When launched from kavremover.exe
  condition: selection and not 1 of filter_main_*
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This detection rule focuses on identifying the execution of a signed binary that has been dropped by the Kaspersky Lab Products Remover (kavremover). Specifically, it looks for instances where the command line includes the phrase 'run run-cmd', which is indicative of possible abuse of this binary as a Living Off the Land Binary (LOLBIN). Such binaries can be misused to execute arbitrary commands and files, posing a security risk. The rule utilizes data from process creation logs, particularly examining the `CommandLine` parameters and the associated parent process images, such as `cleanapi.exe` and `kavremover.exe`, to determine the legitimacy of the execution context.
  ### Investigation Steps
  - Utilize EDR tools to query for process creation logs containing the command line parameter 'run run-cmd' to locate instances of the suspicious binary execution.
  - Inspect the parent process of each alert to determine if it was initiated by a legitimate Kaspersky-related process, such as `cleanapi.exe` or `kavremover.exe`.
  - Review event logs from the endpoint to identify any unusual patterns or other indicators of compromise associated with the execution of this binary.
  - Check network traffic logs via NDR or firewall solutions for any outbound connections that might suggest data exfiltration or command-and-control activity following the execution event.
