title: ShimCache Flush
id: b0524451-19af-4efa-a46f-562a977f792e
status: stable
description: Detects actions that clear the local ShimCache and remove forensic evidence
references:
- https://medium.com/@blueteamops/shimcache-flush-89daff28d15e
author: Florian Roth (Nextron Systems)
date: 2021-02-01
tags:
- attack.defense-evasion
- attack.t1112
logsource:
  category: process_creation
  product: windows
detection:
  selection1a:
    CommandLine|contains|all:
    - 'rundll32'
    - 'apphelp.dll'
  selection1b:
    CommandLine|contains:
    - 'ShimFlushCache'
    - '#250'
  selection2a:
    CommandLine|contains|all:
    - 'rundll32'
    - 'kernel32.dll'
  selection2b:
    CommandLine|contains:
    - 'BaseFlushAppcompatCache'
    - '#46'
  condition: ( selection1a and selection1b ) or ( selection2a and selection2b )
fields:
- Image
- CommandLine
- ParentCommandLine
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  The "ShimCache Flush" detection rule is designed to identify attempts to clear the local ShimCache, a Windows feature that keeps a record of executed applications and their paths. Attackers often target the ShimCache to erase forensic footprints as part of their defense evasion tactics. This rule leverages process creation logs, specifically monitoring command-line parameters to detect suspicious executions of `rundll32` along with either `apphelp.dll` or `kernel32.dll`. The detection conditions aim to identify combinations of these commands that indicate an effort to flush cached application compatibility information, which would typically suggest a malicious intent to obscure artifacts of past user activities.
  ### Investigation Steps
  - Review the process creation logs in your EDR solution to identify occurrences of `rundll32` invoked with either `apphelp.dll` or `kernel32.dll` between the specified timestamps of interest.
  - Analyze the command-line parameters associated with the detected processes, particularly looking for usages of `ShimFlushCache` or `BaseFlushAppcompatCache`, which can indicate deliberate attempts to clear the ShimCache.
  - Check the parent command lines of the processes to understand the context from which these malicious commands were initiated, which may help identify the attacker or method of access.
  - Correlate findings with other logs from your SIEM, such as network traffic and user activity, to determine if this activity was part of a broader attack or if it was seen in conjunction with other unusual behaviors.
