title: Process Proxy Execution Via Squirrel.EXE
id: 45239e6a-b035-4aaf-b339-8ad379fcb67e
related:
- id: 1e75c1cc-c5d4-42aa-ac3d-91b0b68b3b4c
  type: similar
- id: fa4b21c9-0057-4493-b289-2556416ae4d7
  type: obsolete
status: test
description: |
  Detects the usage of the "Squirrel.exe" binary to execute arbitrary processes. This binary is part of multiple Electron based software installations (Slack, Teams, Discord, etc.)
references:
- https://lolbas-project.github.io/lolbas/OtherMSBinaries/Squirrel/
- http://www.hexacorn.com/blog/2019/03/30/sqirrel-packages-manager-as-a-lolbin-a-k-a-many-electron-apps-are-lolbins-by-default/
- http://www.hexacorn.com/blog/2018/08/16/squirrel-as-a-lolbin/
author: Nasreddine Bencherchali (Nextron Systems), Karneades / Markus Neis, Jonhnathan
  Ribeiro, oscd.community
date: 2022-06-09
modified: 2023-11-09
tags:
- attack.defense-evasion
- attack.execution
- attack.t1218
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
    Image|endswith:
    - '\squirrel.exe'
    - '\update.exe'
  selection_exec:
    CommandLine|contains:
    - '--processStart'
    - '--processStartAndWait'
    - '--createShortcut'
  filter_optional_discord:
    CommandLine|contains|all:
    - ':\Users\'
    - '\AppData\Local\Discord\Update.exe'
    - ' --processStart'
    - 'Discord.exe'
  filter_optional_github_desktop:
    CommandLine|contains|all:
    - ':\Users\'
    - '\AppData\Local\GitHubDesktop\Update.exe'
    - 'GitHubDesktop.exe'
    CommandLine|contains:
    - '--createShortcut'
    - '--processStartAndWait'
  filter_optional_teams:
    CommandLine|contains|all:
    - ':\Users\'
    - '\AppData\Local\Microsoft\Teams\Update.exe'
    - 'Teams.exe'
    CommandLine|contains:
    - '--processStart'
    - '--createShortcut'
  filter_optional_yammer:
    CommandLine|contains|all:
    - ':\Users\'
    - '\AppData\Local\yammerdesktop\Update.exe'
    - 'Yammer.exe'
    CommandLine|contains:
    - '--processStart'
    - '--createShortcut'
  condition: all of selection_* and not 1 of filter_optional_*
falsepositives:
- Expected FP with some Electron based applications such as (1Clipboard, Beaker Browser,
  Caret, Discord, GitHub Desktop, etc.)
level: medium
notes: |
  ### Technical Context
  The Sigma rule titled "Process Proxy Execution Via Squirrel.EXE" is designed to identify the execution of arbitrary processes using the "Squirrel.exe" binary, which is commonly leveraged by various Electron-based applications like Slack, Teams, and Discord. This detection mechanism operates by monitoring process creation logs for instances where "Squirrel.exe" or similar executables (like "update.exe") are invoked through command-line parameters containing specific keywords such as `--processStart`, `--processStartAndWait`, or `--createShortcut`. By tracking these indicators of execution, the rule effectively highlights potential misuse of Squirrel as a living-off-the-land binary (LOLBin) in an enterprise environment, aligning that detection with the MITRE ATT&CK tactic of execution (T1218) and defense evasion. 
  The primary data sources involved in this rule include Windows process creation logs and command-line parameters, specifically focusing on the context under which "Squirrel.exe" is executed—indicating potential evasion techniques employed by adversaries. Response teams should be alerted to instances that match these criteria and should consider contextual verification based on the environment and application deployment.
  ### Investigation Steps
  - **Check Process Creation Logs:** Utilize your EDR tool to look for recent execution events of "Squirrel.exe" or "update.exe". Verify the command-line arguments against those defined in the detection rule for any anomalies.
  - **Validate Application Context:** Investigate the legitimacy of the application context by cross-referencing the installation logs and application usage patterns for Electron apps, such as Slack or Teams, being utilized in the environment.
  - **Review User Activity:** Analyze user behavior around the time of the alert to ascertain if the usage correlates with expected user activities or if it seems suspicious, which may indicate potential adversarial behavior.
  - **Correlate with Network Traffic:** Use NDR tools to check if any unusual network connections were established around the same time as the detected process execution, potentially indicating attempts to exfiltrate data or communicate with command-and-control infrastructure.
  ### Prioritization
  This alert is classified as a medium severity level because while the usage of "Squirrel.exe" can indicate legitimate application updates, its exploitation may lead to unauthorized process execution and possible system compromise, warranting prompt investigation.
  ### Blind spots and Assumptions
  This rule may not fire in instances where the Squirrel.exe process timings do not align with the expected command-line parameters, limiting its visibility on custom builds or modified applications. Additionally, the rule might not cover all possible Electron-based applications that utilize Squirrel, potentially rendering genuine threats undetected. Engineers should also consider the possibility that attackers may rename or obfuscate these binaries to avoid detection or modify command-line usage patterns in a way that circumvents this rule.
  > **Disclaimer:** This investigation guide was created using generative AI technology and has not been reviewed for its accuracy and relevance. While every effort has been made to ensure its quality, we recommend validating the content and adapting it to suit specific environment and operational needs. Please communicate any changes to the detection engineering team.
