title: PUA - Fast Reverse Proxy (FRP) Execution
id: 32410e29-5f94-4568-b6a3-d91a8adad863
status: test
description: Detects the use of Fast Reverse Proxy. frp is a fast reverse proxy to
  help you expose a local server behind a NAT or firewall to the Internet.
references:
- https://asec.ahnlab.com/en/38156/
- https://github.com/fatedier/frp
author: frack113, Florian Roth
date: 2022-09-02
modified: 2024-11-23
tags:
- attack.command-and-control
- attack.t1090
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
    Image|endswith:
    - '\frpc.exe'
    - '\frps.exe'
  selection_cli:
    CommandLine|contains: '\frpc.ini'
  selection_hashes:
        # v0.44.0
    Hashes|contains:
    - "MD5=7D9C233B8C9E3F0EA290D2B84593C842"
    - "SHA1=06DDC9280E1F1810677935A2477012960905942F"
    - "SHA256=57B0936B8D336D8E981C169466A15A5FD21A7D5A2C7DAF62D5E142EE860E387C"
  condition: 1 of selection_*
falsepositives:
- Legitimate use
level: high
notes: |
  ### Technical Context
  This Sigma rule is designed to detect the execution of Fast Reverse Proxy (FRP) applications, specifically `frpc.exe` and `frps.exe`. These applications are commonly used for exposing local servers behind NAT or firewall configurations to the internet, which makes them attractive to attackers for establishing command-and-control (C2) channels. The rule focuses on several indicators, including the process image name, command-line parameters containing `frpc.ini`, and specific hash values associated with known versions of FRP. The data sources involved primarily consist of process creation logs collected from Windows systems, which capture details such as executed process names and command-line arguments.
  Incident responders should be aware that while the detection level is marked as high, there may be legitimate use cases for FRP, necessitating careful analysis before taking action.
  ### Investigation Steps
  - Examine recent process creation logs in your EDR to identify instances of `frpc.exe` or `frps.exe` running on endpoints.
  - Review the command-line parameters associated with the detected processes for references to `frpc.ini`, which may indicate configuration settings used by the proxy.
  - Check the hashes of the executed files against known malicious and benign signatures to determine if the executed binaries are legitimate or potentially harmful.
  - Investigate network traffic patterns from the affected endpoints in your NDR to identify any anomalous connections that may indicate C2 activity associated with the detected FRP usage.
