title: User Added to Local Administrators Group
id: ad720b90-25ad-43ff-9b5e-5c841facc8e5
related:
- id: ffa28e60-bdb1-46e0-9f82-05f7a61cc06e     # Remote Desktop groups
  type: similar
- id: 10fb649c-3600-4d37-b1e6-56ea90bb7e09     # Privileged groups
  type: similar
status: test
description: Detects addition of users to the local administrator group via "Net"
  or "Add-LocalGroupMember".
references:
- https://blog.talosintelligence.com/2022/08/recent-cyber-attack.html?m=1
author: Florian Roth (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)
date: 2022-08-12
modified: 2023-03-02
tags:
- attack.persistence
- attack.t1098
logsource:
  category: process_creation
  product: windows
detection:
  selection_main:
  - CommandLine|contains|all:
              # net.exe
    - 'localgroup '
    - ' /add'
  - CommandLine|contains|all:
              # powershell.exe
    - 'Add-LocalGroupMember '
    - ' -Group '
  selection_group:
    CommandLine|contains:
    - ' administrators '
    - ' administrateur'         # Typo without an 'S' so we catch both
  condition: all of selection_*
falsepositives:
- Administrative activity
level: medium
notes: |
  ### Technical Context
  The detection rule "User Added to Local Administrators Group" identifies potential unauthorized changes to the local administrators group on Windows systems. This is achieved by monitoring process creation logs, specifically looking for command lines that indicate the use of the `net.exe` utility with the parameters 'localgroup' and '/add', as well as PowerShell commands that invoke `Add-LocalGroupMember` targeting the 'administrators' group. These commands, often leveraged by malicious actors to elevate their privileges on a compromised system, can be indicative of an attempt to maintain persistence. The rule uses criteria based on the presence of specific keywords in the command line to trigger alerts upon detection.
  ### Investigation Steps
  - Review the EDR alerts related to the corresponding process creation events to identify the user account that executed the command and any preceding activity that might link to a malicious event.
  - Check the Windows event logs (Event ID 4728) for detailed information on user additions to the local administrators group to understand who was added and when.
  - Utilize the SIEM to correlate logs from other sources, such as VPN and Proxy data, to confirm the legitimacy of the user's actions preceding the command issued.
  - Investigate the execution context of the command by analyzing process parent-child relationships to determine if the command was executed by an expected administrative process or if it was spawned from an unusual source.
