title: File Download Via Windows Defender MpCmpRun.EXE
id: 46123129-1024-423e-9fae-43af4a0fa9a5
status: test
description: Detects the use of Windows Defender MpCmdRun.EXE to download files
references:
- https://web.archive.org/web/20200903194959/https://twitter.com/djmtshepana/status/1301608169496612866
- https://lolbas-project.github.io/lolbas/Binaries/MpCmdRun/
author: Matthew Matchen
date: 2020-09-04
modified: 2023-11-09
tags:
- attack.defense-evasion
- attack.t1218
- attack.command-and-control
- attack.t1105
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - OriginalFileName: 'MpCmdRun.exe'
  - Image|endswith: '\MpCmdRun.exe'
  - CommandLine|contains: 'MpCmdRun.exe'
  - Description: 'Microsoft Malware Protection Command Line Utility'
  selection_cli:
    CommandLine|contains|all:
    - 'DownloadFile'
    - 'url'
  condition: all of selection_*
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This detection rule identifies the usage of Windows Defender's command-line utility, MpCmdRun.EXE, to download files from external URLs. Specifically, it focuses on command-line parameters that include 'DownloadFile' along with a referencing 'url', indicating an attempt to execute file downloads potentially for malicious purposes. The rule looks for specific attributes in process creation logs, ensuring that the detected processes match characteristics of legitimate Windows Defender operations while also monitoring for unauthorized file downloads. By utilizing parameters like `OriginalFileName`, `Image`, and `CommandLine`, the rule leverages process creation events from Windows systems to flag suspicious behaviors indicative of command-and-control activity or attempts at defense evasion.
  ### Investigation Steps
  - Analyze recent process creation logs in your EDR system for instances of `MpCmdRun.exe` that match the detection criteria. Focus on the command-line parameters used to identify any malicious intents.
  - Use the SIEM to correlate alerts related to `MpCmdRun.EXE` with other security events, such as network connections to suspicious external URLs or any process anomalies that occurred around the same time.
  - Examine any outbound proxy logs for connections initiated by `MpCmdRun.EXE` to external domains, which may indicate command-and-control communications or potentially harmful downloads.
  - Review file integrity monitoring logs in case any files downloaded via this utility have been executed or interacted with, which may provide insight into the impact of the detected activity.
