title: Potential File Download Via MS-AppInstaller Protocol Handler
id: 180c7c5c-d64b-4a63-86e9-68910451bc8b
related:
- id: 7cff77e1-9663-46a3-8260-17f2e1aa9d0a
  type: derived
status: test
description: |
  Detects usage of the "ms-appinstaller" protocol handler via command line to potentially download arbitrary files via AppInstaller.EXE
  The downloaded files are temporarly stored in ":\Users\%username%\AppData\Local\Packages\Microsoft.DesktopAppInstaller_8wekyb3d8bbwe\AC\INetCache\<RANDOM-8-CHAR-DIRECTORY>"
references:
- https://lolbas-project.github.io/lolbas/Binaries/AppInstaller/
author: Nasreddine Bencherchali (Nextron Systems), Swachchhanda Shrawan Poudel
date: 2023-11-09
tags:
- attack.defense-evasion
- attack.execution
- attack.t1218
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|contains|all:
    - 'ms-appinstaller://?source='
    - 'http'
  condition: selection
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  This detection rule identifies the usage of the "ms-appinstaller" protocol handler through command line arguments, which may indicate an attempt to download arbitrary files via the AppInstaller.EXE application. By monitoring process creation logs specifically for instances where the command line contains "ms-appinstaller://?source=" followed by a URL, the rule flags potential file downloads that occur through this protocol. The downloaded files are temporarily stored in a specific directory under the user's AppData, making them accessible for further examination. This behavior can be indicative of both legitimate software installations as well as an evasion tactic for potential malicious activity, thus warranting investigation.
  ### Investigation Steps
  - Use EDR tools to correlate the detected process with user activity logs for any suspicious command line executions involving AppInstaller.EXE.
  - Examine the temporary file storage location: `C:\Users\%username%\AppData\Local\Packages\Microsoft.DesktopAppInstaller_8wekyb3d8bbwe\AC\INetCache\` to identify any unusual or unexpected files downloaded during the time of this alert.
  - Review the logs from the NGFW to check for any outbound traffic to the specified URLs in the command line, which can reveal the nature of the downloaded files.
  - Investigate any related alerts or previous incidents involving the same user or endpoint to determine if this is part of a larger pattern of suspicious behavior.
