title: Uncommon System Information Discovery Via Wmic.EXE
id: 9d5a1274-922a-49d0-87f3-8c653483b909
related:
- id: d85ecdd7-b855-4e6e-af59-d9c78b5b861e
  type: derived
status: test
description: |
  Detects the use of the WMI command-line (WMIC) utility to identify and display various system information,
  including OS, CPU, GPU, and disk drive names; memory capacity; display resolution; and baseboard, BIOS,
  and GPU driver products/versions.
  Some of these commands were used by Aurora Stealer in late 2022/early 2023.
references:
- https://github.com/redcanaryco/atomic-red-team/blob/a2ccd19c37d0278b4ffa8583add3cf52060a5418/atomics/T1082/T1082.md#atomic-test-25---system-information-discovery-with-wmic
- https://nwgat.ninja/getting-system-information-with-wmic-on-windows/
- https://blog.sekoia.io/aurora-a-rising-stealer-flying-under-the-radar
- https://blog.cyble.com/2023/01/18/aurora-a-stealer-using-shapeshifting-tactics/
- https://app.any.run/tasks/a6aa0057-82ec-451f-8f99-55650ca537da/
- https://www.virustotal.com/gui/file/d6f6bc10ae0e634ed4301d584f61418cee18e5d58ad9af72f8aa552dc4aaeca3/behavior
author: TropChaud
date: 2023-01-26
modified: 2023-12-19
tags:
- attack.discovery
- attack.t1082
logsource:
  category: process_creation
  product: windows
detection:
  selection_wmic:
  - Description: 'WMI Commandline Utility'
  - OriginalFileName: 'wmic.exe'
  - Image|endswith: '\WMIC.exe'
  selection_commands:
    CommandLine|contains:
    - 'LOGICALDISK get Name,Size,FreeSpace'
    - 'os get Caption,OSArchitecture,Version'
  condition: all of selection_*
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  This detection rule identifies the use of the Windows Management Instrumentation Command-line (WMIC) utility, specifically focusing on uncommon commands that may indicate system information discovery. WMIC can be utilized by threat actors for reconnaissance purposes, allowing them to retrieve details about the operating system, hardware components, and other critical system information, such as disk drives and memory capacity. By monitoring specific process creation logs that indicate WMIC execution alongside command-line parameters, this rule flags potentially suspicious activity. The commands targeted by this rule have been associated with the actions of malware, such as the Aurora Stealer, which gained traction in late 2022 and early 2023.
  ### Investigation Steps
  - Review the EDR logs for instances of `wmic.exe` execution, focusing on the command-line arguments used to identify potentially malicious queries.
  - Correlate the detected activity with other logs, such as AV or NDR, to check for additional associated malicious behavior or indicators.
  - Investigate the source of the WMIC command execution to determine if it originated from a legitimate user process or if it might be indicative of an unauthorized access attempt.
  - Check cloud platform logs (if applicable) for any anomalous behavior that aligns with the time of detected WMIC usage, especially if the host interacts with cloud resources.
