title: HackTool - EDRSilencer Execution
id: eb2d07d4-49cb-4523-801a-da002df36602
status: test
description: |
  Detects the execution of EDRSilencer, a tool that leverages Windows Filtering Platform (WFP) to block Endpoint Detection and Response (EDR) agents from reporting security events to the server based on PE metadata information.
references:
- https://github.com/netero1010/EDRSilencer
author: '@gott_cyber'
date: 2024-01-02
tags:
- attack.defense-evasion
- attack.t1562
logsource:
  category: process_creation
  product: windows
detection:
  selection:
  - Image|endswith: '\EDRSilencer.exe'
  - OriginalFileName: 'EDRSilencer.exe'
  - Description|contains: 'EDRSilencer'
  condition: selection
falsepositives:
- Unlikely
level: high
notes: |
  ### Technical Context
  This Sigma rule is designed to detect the execution of EDRSilencer, a malicious tool that exploits the Windows Filtering Platform (WFP) for defense evasion by preventing Endpoint Detection and Response (EDR) agents from communicating security events to their centralized servers. The rule identifies signs of EDRSilencer's activity by monitoring process creation logs specifically looking for instances of the executable file `EDRSilencer.exe`. The detection criteria include checking the file’s metadata, such as its original file name and description, ensuring that alerts are generated when this tool executes on Windows systems. By leveraging process creation data, this rule aims to enhance visibility into potential attempts to evade detection by standard security measures.
  ### Investigation Steps
  - Review the EDR logs for any process creation events related to `EDRSilencer.exe`, focusing particularly on the time and system where the execution occurred.
  - Correlate the alerts with network traffic logs from your NDR and NGFW to identify any unusual outbound connections or behavior potentially associated with this tool's operation.
  - Examine the command-line parameters and parent process of the detected EDRSilencer execution through EDR tools to understand how it was initiated and if it was part of a larger attack vector.
  - Check antivirus logs and alerts for any prior detections of EDRSilencer or related artifacts on the affected endpoint to determine if this may be a recurring issue or a new incident.
