title: Potential Provisioning Registry Key Abuse For Binary Proxy Execution
id: 2a4b3e61-9d22-4e4a-b60f-6e8f0cde6f25
related:
- id: 7f5d1c9a-3e83-48df-95a7-2b98aae6c13c     # CLI Generic
  type: similar
- id: f9999590-1f94-4a34-a91e-951e47bedefd     # CLI Abuse
  type: similar
- id: 7021255e-5db3-4946-a8b9-0ba7a4644a69     # Registry
  type: similar
status: test
description: Detects potential abuse of the provisioning registry key for indirect
  command execution through "Provlaunch.exe".
references:
- https://lolbas-project.github.io/lolbas/Binaries/Provlaunch/
- https://twitter.com/0gtweet/status/1674399582162153472
author: Nasreddine Bencherchali (Nextron Systems), Swachchhanda Shrawan Poudel
date: 2023-08-08
tags:
- attack.defense-evasion
- attack.t1218
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|contains: 'SOFTWARE\Microsoft\Provisioning\Commands\'
  condition: selection
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This detection rule identifies potential abuse of the provisioning registry key utilized by `Provlaunch.exe` for circumventing standard command execution controls. The rule examines process creation logs, specifically focusing on command-line parameters that reference the path `SOFTWARE\Microsoft\Provisioning\Commands\`. If a process is spawned with this command line, it triggers an alert, indicating possible indirect command execution tactics common in defense-evasion scenarios. The use of provisioning components often signifies that an actor is attempting to leverage trusted system binaries for malicious purposes, making this a key area for monitoring within an enterprise environment.
  ### Investigation Steps
  - Review alerts generated by the EDR to identify the specific instances where `Provlaunch.exe` was executed with the suspicious command line.
  - Cross-reference the process creation logs with user account activity to determine any anomalous behavior or unauthorized access associated with the command execution.
  - Analyze network activity through NDR tools to assess if subsequent connections were made to known malicious IP addresses or domains following the execution of the command.
  - Check registry modification logs to identify if there were any recent changes made to the provisioning keys or related registry entries that could indicate further compromise.
