title: PsExec/PAExec Escalation to LOCAL SYSTEM
id: 8834e2f7-6b4b-4f09-8906-d2276470ee23
related:
- id: 207b0396-3689-42d9-8399-4222658efc99     # Generic rule based on similar cli flags
  type: similar
status: test
description: Detects suspicious commandline flags used by PsExec and PAExec to escalate
  a command line to LOCAL_SYSTEM rights
references:
- https://learn.microsoft.com/en-us/sysinternals/downloads/psexec
- https://www.poweradmin.com/paexec/
- https://www.fireeye.com/blog/threat-research/2020/10/kegtap-and-singlemalt-with-a-ransomware-chaser.html
author: Florian Roth (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)
date: 2021-11-23
modified: 2024-03-05
tags:
- attack.resource-development
- attack.t1587.001
logsource:
  category: process_creation
  product: windows
detection:
  selection_sys:   # Escalation to LOCAL_SYSTEM
    CommandLine|contains|windash:
            # Note that you don't need to add the ".exe" part when using psexec/paexec
            # The "-" can also be replaced with "/"
            # The order of args isn't important
            # "cmd" can be replaced by "powershell", "pwsh" or any other console like software
    - ' -s cmd'
    - ' -s -i cmd'
    - ' -i -s cmd'
            # Pwsh (For PowerShell 7)
    - ' -s pwsh'
    - ' -s -i pwsh'
    - ' -i -s pwsh'
            # PowerShell (For PowerShell 5)
    - ' -s powershell'
    - ' -s -i powershell'
    - ' -i -s powershell'
  selection_other:
    CommandLine|contains:
    - 'psexec'
    - 'paexec'
    - 'accepteula'
  condition: all of selection_*
falsepositives:
- Admins that use PsExec or PAExec to escalate to the SYSTEM account for maintenance
  purposes (rare)
- Users that debug Microsoft Intune issues using the commands mentioned in the official
  documentation; see https://learn.microsoft.com/en-us/mem/intune/apps/intune-management-extension
level: high
notes: |
  ### Technical Context
  This detection rule identifies the use of PsExec and PAExec tools that may attempt to escalate privileges to the LOCAL SYSTEM account on Windows systems. It specifically looks for command-line arguments that indicate the use of these utilities with flags typically associated with privilege escalation, such as `-s` (for system account) and various forms of `cmd` or `powershell`. The rule captures command-line logs from the process creation events to detect instances where these commands are run. The presence of those command-line parameters is a red flag, indicating possible malicious intent or misuse of legitimate administrative tools. 
  Investigation should focus on understanding the context of the command execution and whether it aligns with authorized administrative practices, as there are known false positives involving legitimate system maintenance tasks performed by administrators.
  ### Investigation Steps
  - Utilize EDR tools to review the process creation logs for the specific command-line strings identified in the rule, including combinations of `psexec` or `paexec` with the escalation flags.
  - Cross-reference the timestamps of the alerts with user activity logs in the SIEM to determine whether the actions correlate with known administrative activities or potential insider threat scenarios. 
  - Examine neighboring network traffic through the NDR to identify any unusual outbound connections or data exfiltration attempts that may relate to the use of PsExec or PAExec.
  - Review cloud access logs from platforms like AWS or Azure if relevant, focusing on user actions around the time of the alert to evaluate any cloud-based administrative activities that may mirror local system escalation tactics.
