title: PUA - Crassus Execution
id: 2c32b543-1058-4808-91c6-5b31b8bed6c5
status: test
description: Detects Crassus, a Windows privilege escalation discovery tool, based
  on PE metadata characteristics.
references:
- https://github.com/vu-ls/Crassus
author: pH-T (Nextron Systems)
date: 2023-04-17
tags:
- attack.discovery
- attack.t1590.001
logsource:
  category: process_creation
  product: windows
detection:
  selection:
  - Image|endswith: '\Crassus.exe'
  - OriginalFileName: 'Crassus.exe'
  - Description|contains: 'Crassus'
  condition: selection
falsepositives:
- Unlikely
level: high
notes: |
  ### Technical Context
  The "PUA 
  - Crassus Execution" detection rule is designed to identify the execution of Crassus, a Windows-based privilege escalation discovery tool. The rule operates by monitoring process creation logs for specific attributes that characterize the Crassus executable, namely the image name, original file name, and description containing the word "Crassus." When any process creation event matches these criteria, it triggers an alert, indicating a potential use of the tool. This detection leverages data sourced from Windows process creation logs, focusing on PE (Portable Executable) metadata that could signify malicious intent or unauthorized privilege escalation attempts.
  Given the nature of Crassus as a potentially unwanted application (PUA), identifying its execution is crucial for maintaining security posture. Organizations should remain vigilant against the misuse of such tools, which can be leveraged by threat actors to gain or elevate privileges on Windows systems.
  ### Investigation Steps
  - Utilize the EDR tool to track the execution path and associated activity of `Crassus.exe` on the affected endpoint, looking for unusual patterns or behaviors.
  - Check the SIEM for corresponding logs to identify any related logins or suspicious activities occurring around the time of the detected execution.
  - Review firewall and proxy logs to see if there were any outbound connections initiated by `Crassus.exe`, potentially indicating data exfiltration or command-and-control activity.
  - Conduct an audit of user permissions and roles within the impacted system to assess whether the execution of this tool resulted in any unauthorized privilege escalations.
