title: Arbitrary File Download Via IMEWDBLD.EXE
id: 863218bd-c7d0-4c52-80cd-0a96c09f54af
related:
- id: 8d7e392e-9b28-49e1-831d-5949c6281228
  type: derived
status: test
description: Detects usage of "IMEWDBLD.exe" to download arbitrary files
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1105/T1105.md#atomic-test-10---windows---powershell-download
- https://lolbas-project.github.io/lolbas/Binaries/IMEWDBLD/
author: Swachchhanda Shrawan Poudel
date: 2023-11-09
tags:
- attack.defense-evasion
- attack.execution
- attack.t1218
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: '\IMEWDBLD.exe'
  - OriginalFileName: 'imewdbld.exe'
  selection_cli:
    CommandLine|contains:
    - 'http://'
    - 'https://'
  condition: all of selection_*
falsepositives:
- Unknown
# Note: Please reduce this to medium if you find legitimate use case of this utility with a URL
level: high
notes: |
  ### Technical Context
  The Sigma rule "Arbitrary File Download Via IMEWDBLD.EXE" is designed to detect instances where the executable `IMEWDBLD.exe` is used to download arbitrary files from external locations, specifically via HTTP or HTTPS. This behavior may indicate malicious activity, as `IMEWDBLD.exe` is known for its potential misuse in executing unintended file downloads. The rule analyzes process creation logs, focusing on the command line arguments associated with `IMEWDBLD.exe` to identify any URLs included in the execution command. By triggering alerts on the presence of specific URL patterns, the rule helps identify potential instances of defense evasion or execution of unauthorized file downloads within a Windows environment.
  ### Investigation Steps
  - Review the EDR logs for any recent executions of `IMEWDBLD.exe` and check the associated command line arguments for included URLs.
  - Correlate the identified process with network activity logs to determine if any downloads occurred from suspicious or malicious domains.
  - Utilize AV solutions to scan any files downloaded through `IMEWDBLD.exe` for potential malware indicators or high-risk threats.
  - Investigate connected user accounts and their behaviors for any further anomalies or repeated use of `IMEWDBLD.exe` in a short time frame, as this may indicate a compromised account.
