title: Suspicious Key Manager Access
id: a4694263-59a8-4608-a3a0-6f8d3a51664c
status: test
description: Detects the invocation of the Stored User Names and Passwords dialogue
  (Key Manager)
references:
- https://twitter.com/NinjaParanoid/status/1516442028963659777
author: Florian Roth (Nextron Systems)
date: 2022-04-21
modified: 2023-02-09
tags:
- attack.credential-access
- attack.t1555.004
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: '\rundll32.exe'
  - OriginalFileName: 'RUNDLL32.EXE'
  selection_cli:
    CommandLine|contains|all:
    - 'keymgr'
    - 'KRShowKeyMgr'
  condition: all of selection_*
falsepositives:
- Administrative activity
level: high
notes: |
  ### Technical Context
  The "Suspicious Key Manager Access" Sigma rule is designed to identify potentially malicious access to Windows' Stored User Names and Passwords dialogue, commonly known as Key Manager. This rule specifically looks for processes that invoke `rundll32.exe` with command-line parameters containing 'keymgr' and 'KRShowKeyMgr', indicating an attempt to manipulate stored credentials. The technical data sources involved in this detection include process creation logs that capture details such as the executing image name and corresponding command-line arguments. By establishing these parameters, the rule helps security teams detect unauthorized access to sensitive user credentials, which is often a precursor to credential theft or lateral movement within the network.
  ### Investigation Steps
  - Utilize EDR tools to review the execution context of `rundll32.exe`, focusing on the process tree and parent-child relationships to understand how the Key Manager was invoked.
  - Examine command-line parameters associated with the execution of `rundll32.exe` to verify if any unauthorized scripts or commands were used.
  - Check recent user account activities in Windows logs to identify any unusual access patterns or user accounts that may be involved in credential manipulation.
  - Correlate findings with threat intelligence sources to determine if the observed activity aligns with known malicious behaviors or techniques linked to credential access (ATT&CK T1555.004).
