title: Service Registry Key Deleted Via Reg.EXE
id: 05b2aa93-1210-42c8-8d9a-2fcc13b284f5
status: test
description: Detects execution of "reg.exe" commands with the "delete" flag on services
  registry key. Often used by attacker to remove AV software services
references:
- https://www.virustotal.com/gui/file/2bcd5702a7565952c44075ac6fb946c7780526640d1264f692c7664c02c68465
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-08-01
modified: 2023-02-04
tags:
- attack.defense-evasion
- attack.t1562.001
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: 'reg.exe'
  - OriginalFileName: 'reg.exe'
  selection_delete:
    CommandLine|contains: ' delete '
  selection_key:
        # Add specific services if you would like the rule to be more specific
    CommandLine|contains: '\SYSTEM\CurrentControlSet\services\'
  condition: all of selection_*
falsepositives:
- Unlikely
level: high
notes: |
  ### Technical Context
  This Sigma rule is designed to detect instances where the `reg.exe` utility is executed with the "delete" flag specifically targeting service registry keys within the Windows operating system. In many cases, cyber attackers utilize this command to remove or disable antivirus software services, effectively bypassing security measures. The rule primarily analyzes process creation logs to identify when `reg.exe` is invoked with command-line parameters that include both "delete" and the path to the service registry keys, which typically reside under `\SYSTEM\CurrentControlSet\services\`. The detection method hinges on capturing the relevant execution events, allowing incident responders to identify potentially malicious activity.
  ### Investigation Steps
  - Review the process creation logs in your EDR solution to identify the specific instance(s) of `reg.exe` execution, noting the associated user and timestamp.
  - Examine the command-line parameters used during the execution for specific target service registry paths to determine if they correspond to known antivirus or monitoring services.
  - Query your SIEM or log management solution for any correlated alerts or anomalies that occurred around the same time as the `reg.exe` execution to get additional context.
  - Perform a check on the impacted service(s) to assess service status and verify if any critical services have been disabled or removed, prompting further investigation if necessary.
