title: Msxsl.EXE Execution
id: 9e50a8b3-dd05-4eb8-9153-bdb6b79d50b0
status: test
description: |
  Detects the execution of the MSXSL utility. This can be used to execute Extensible Stylesheet Language (XSL) files. These files are commonly used to describe the processing and rendering of data within XML files.
  Adversaries can abuse this functionality to execute arbitrary files while potentially bypassing application whitelisting defenses.
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1220/T1220.md
- https://lolbas-project.github.io/lolbas/OtherMSBinaries/Msxsl/
author: Timur Zinniatullin, oscd.community
date: 2019-10-21
modified: 2023-11-09
tags:
- attack.defense-evasion
- attack.t1220
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith: '\msxsl.exe'
  condition: selection
falsepositives:
- Msxsl is not installed by default and is deprecated, so unlikely on most systems.
# Note: If you levreage this utility please consider adding additional filters. As this is looking for "any" type of execition
level: medium
notes: |
  ### Technical Context
  The detection rule for Msxsl.EXE execution identifies instances where the MSXSL utility is executed on Windows systems. Msxsl.EXE is a tool used to apply Extensible Stylesheet Language (XSL) files for processing XML data. While this utility can serve legitimate purposes, cyber adversaries may exploit it to run arbitrary code, circumventing application whitelisting controls. The rule specifically monitors process creation logs, filtering for entries where the executed image name ends with 'msxsl.exe'. Given that Msxsl.EXE is not commonly installed and is considered deprecated, any detection of its execution warrants further investigation.
  ### Investigation Steps
  - Review process execution logs in your EDR solution to identify the full command line parameters and the context of the Msxsl.EXE execution.
  - Cross-reference User Access logs to determine which user executed the Msxsl.EXE command and if they have a legitimate reason for doing so.
  - Check network logs in the NGFW or proxy to assess outbound connections initiated by the system where Msxsl.EXE was executed, looking for unusual data exfiltration patterns.
  - Search for any recent changes in system configuration or installed applications to understand whether Msxsl.EXE was deployed maliciously or for legitimate purposes.
