title: Suspicious Driver/DLL Installation Via Odbcconf.EXE
id: cb0fe7c5-f3a3-484d-aa25-d350a7912729
related:
- id: 3f5491e2-8db8-496b-9e95-1029fce852d4
  type: derived
status: test
description: Detects execution of "odbcconf" with the "INSTALLDRIVER" action where
  the driver doesn't contain a ".dll" extension. This is often used as a defense evasion
  method.
references:
- https://lolbas-project.github.io/lolbas/Binaries/Odbcconf/
- https://web.archive.org/web/20191023232753/https://twitter.com/Hexacorn/status/1187143326673330176
- https://www.hexacorn.com/blog/2020/08/23/odbcconf-lolbin-trifecta/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023-05-23
tags:
- attack.defense-evasion
- attack.t1218.008
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: '\odbcconf.exe'
  - OriginalFileName: 'odbcconf.exe'
  selection_cli:
        # Note: The "/A" flag is not required to call a specific action
    CommandLine|contains: 'INSTALLDRIVER '
  filter_main_dll_ext:
    CommandLine|contains: '.dll'
  condition: all of selection_* and not 1 of filter_main_*
falsepositives:
- Unlikely
level: high
notes: |
  ### Technical Context
  The SigmaHQ rule "Suspicious Driver/DLL Installation Via Odbcconf.EXE" is designed to detect a specific method of driver installation that may indicate an attempt at evading security measures. This rule focuses on the execution of the `odbcconf.exe` binary—a legitimate Windows tool typically used for configuring ODBC data sources—when it is invoked with the `INSTALLDRIVER` action. The rule particularly scrutinizes command-line parameters for the presence of the `.dll` extension. If a driver is being installed without the expected `.dll` extension, this could suggest malicious activity as attackers often exploit such methods to bypass detection mechanisms.
  To implement the rule, it relies on process creation logs from Windows, capturing relevant attributes such as the image name and command line used during execution. By analyzing these parameters, the SOC can flag potentially suspicious installations that deviate from standard behavior, enabling responders to investigate underlying threats.
  ### Investigation Steps
  - **Review EDR logs** for instances of `odbcconf.exe` running with the `INSTALLDRIVER` flag, and check the command line parameters to identify the driver being installed.
  - **Investigate the source of the binary** by confirming its original file name and path to ensure it hasn’t been tampered with or replaced with a malicious version.
  - **Correlate with other security alerts** in the SIEM to ascertain if the detected action is part of a larger pattern of suspicious behavior, such as lateral movement or the presence of known threats.
  - **Examine network traffic** through the NDR and Proxy logs to identify any external communications from the system during the time the `odbcconf.exe` command was executed, as this could indicate an attempted data exfiltration or command-and-control activity.
