title: Potentially Suspicious Child Process of KeyScrambler.exe
id: ca5583e9-8f80-46ac-ab91-7f314d13b984
related:
- id: d2451be2-b582-4e15-8701-4196ac180260
  type: similar
status: experimental
description: Detects potentially suspicious child processes of KeyScrambler.exe
references:
- https://twitter.com/DTCERT/status/1712785421845790799
author: Swachchhanda Shrawan Poudel
date: 2024-05-13
tags:
- attack.execution
- attack.defense-evasion
- attack.privilege-escalation
- attack.t1203
- attack.t1574.002
logsource:
  category: process_creation
  product: windows
detection:
  selection_parent:
    ParentImage|endswith: '\KeyScrambler.exe'
  selection_binaries:
        # Note: add additional binaries that the attacker might use
  - Image|endswith:
    - '\cmd.exe'
    - '\cscript.exe'
    - '\mshta.exe'
    - '\powershell.exe'
    - '\pwsh.exe'
    - '\regsvr32.exe'
    - '\rundll32.exe'
    - '\wscript.exe'
  - OriginalFileName:
    - 'Cmd.Exe'
    - 'cscript.exe'
    - 'mshta.exe'
    - 'PowerShell.EXE'
    - 'pwsh.dll'
    - 'regsvr32.exe'
    - 'RUNDLL32.EXE'
    - 'wscript.exe'
  condition: all of selection_*
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  This detection rule targets potentially malicious behavior linked to child processes spawned by the application KeyScrambler.exe, a legitimate software designed to protect keystrokes from keyloggers. The rule specifically looks for instances where KeyScrambler.exe serves as a parent process generating child processes that are known to be commonly abused by adversaries, including command-line interpreters and scripting environments like `cmd.exe`, `powershell.exe`, and `mshta.exe`. By monitoring the process creation logs, the rule identifies any parent-child relationship where KeyScrambler.exe launches one of these suspicious binaries, which can indicate an attempt to execute malicious scripts or commands stealthily while bypassing standard security measures. The monitored fields include the ParentImage to confirm the parent process and the Image and OriginalFileName to match against known binaries leveraged by attackers.
  ### Investigation Steps
  - Check the process creation logs in your EDR solution for any instances of `KeyScrambler.exe` spawning child processes, focusing on the timestamps of the alerts to correlate with user activity.
  - Analyze the command-line parameters associated with the detected child processes to determine their intended operations and whether they align with expected behavior.
  - Review network logs using the NDR for any outbound connections made by the suspicious child processes, as this could indicate data exfiltration or command-and-control behavior.
  - Verify the integrity of the parent process, `KeyScrambler.exe`, by checking its file reputation in your endpoint protection software and ensuring that it is running from a legitimate path.
