title: WMI Persistence - Script Event Consumer
id: ec1d5e28-8f3b-4188-a6f8-6e8df81dc28e
status: test
description: Detects WMI script event consumers
references:
- https://www.eideon.com/2018-03-02-THL03-WMIBackdoors/
author: Thomas Patzke
date: 2018-03-07
modified: 2022-10-11
tags:
- attack.persistence
- attack.privilege-escalation
- attack.t1546.003
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image: C:\WINDOWS\system32\wbem\scrcons.exe
    ParentImage: C:\Windows\System32\svchost.exe
  condition: selection
falsepositives:
- Legitimate event consumers
- Dell computers on some versions register an event consumer that is known to cause
  false positives when brightness is changed by the corresponding keyboard button
level: medium
notes: |
  ### Technical Context
  The WMI Persistence 
  - Script Event Consumer rule is designed to detect unauthorized persistence mechanisms utilizing Windows Management Instrumentation (WMI). Specifically, it looks for instances of the `scrcons.exe` process, which is a script event consumer, launched from `svchost.exe`. This can indicate a potential backdoor or adversary activity, as malicious actors often use WMI event consumers to maintain persistent access to a system. The detection is focused on process creation logs, particularly monitoring the properties of the processes involved (e.g., image paths and parent-child relationships) to identify any suspicious behavior.
  WMI event consumers can be legitimately used in many enterprise environments, which is why this rule may generate false positives. For instance, known legitimate event consumers may appear in normal operations, while certain Dell computer configurations can also trigger this detection when adjusting screen brightness through specific keyboard inputs.
  ### Investigation Steps
  - Review process creation logs using your EDR solution to identify the last executed instances of `scrcons.exe` and check their parent processes. 
  - Investigate the command-line parameters associated with `scrcons.exe` to determine if they match expected usage or suggest malicious activity.
  - Cross-reference any detected instances with your organization's inventory to identify any legitimate uses of WMI consumers that may have triggered the alert.
  - Analyze network traffic logs from your NDR or Proxy tools to see if there were any suspicious outbound connections associated with the detected process, indicating possible command-and-control communications.
