title: Potentially Suspicious Event Viewer Child Process
id: be344333-921d-4c4d-8bb8-e584cf584780
related:
- id: 7c81fec3-1c1d-43b0-996a-46753041b1b6
  type: derived
status: test
description: Detects uncommon or suspicious child processes of "eventvwr.exe" which
  might indicate a UAC bypass attempt
references:
- https://enigma0x3.net/2016/08/15/fileless-uac-bypass-using-eventvwr-exe-and-registry-hijacking/
- https://www.hybrid-analysis.com/sample/e122bc8bf291f15cab182a5d2d27b8db1e7019e4e96bb5cdbd1dfe7446f3f51f?environmentId=100
author: Florian Roth (Nextron Systems)
date: 2017-03-19
modified: 2023-09-28
tags:
- attack.defense-evasion
- attack.privilege-escalation
- attack.t1548.002
- car.2019-04-001
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    ParentImage|endswith: '\eventvwr.exe'
  filter_main_generic:
    Image|endswith:
    - ':\Windows\System32\mmc.exe'
    - ':\Windows\System32\WerFault.exe'
    - ':\Windows\SysWOW64\WerFault.exe'
  condition: selection and not 1 of filter_main_*
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  The Sigma rule "Potentially Suspicious Event Viewer Child Process" is designed to identify suspicious child processes spawned by `eventvwr.exe`, the Windows Event Viewer application. This rule specifically looks for unusual command-line executions in instances where `eventvwr.exe` is the parent process, aiming to detect potential User Account Control (UAC) bypass attempts. The presence of specific child processes, such as `mmc.exe` or `WerFault.exe`, is filtered out to minimize false positives, as these processes are commonly associated with legitimate activities. The technical data sources involved primarily include process creation logs collected from Windows systems.
  When an event is logged indicating that an uncommon child process was initiated by `eventvwr.exe`, it raises an alert for further investigation to determine if the activity is malicious or benign. The significance lies in the association of certain processes with tactics that attackers may use to gain elevated privileges or evade detection mechanisms within an enterprise environment.
  ### Investigation Steps
  - Utilize EDR tools to review process trees and confirm whether the identified child process was indeed launched by `eventvwr.exe`. Check for any irregular behavior or unusual parameters associated with the child process.
  - Analyze the command-line parameters of the detected child process to identify any potentially malicious flags or arguments that could indicate an attack.
  - Cross-reference the event with security logs from SIEM solutions to evaluate any prior behavior or events related to the user or system involved in the alert.
  - Investigate potential external sources by reviewing threat intelligence feeds and known malicious behaviors associated with the detected child process to assess the risk.
