title: Suspicious Microsoft Office Child Process
id: 438025f9-5856-4663-83f7-52f878a70a50
related:
- id: c27515df-97a9-4162-8a60-dc0eeb51b775     # Speicifc OneNote rule due to its recent usage in phishing attacks
  type: derived
- id: e1693bc8-7168-4eab-8718-cdcaa68a1738
  type: derived
- id: 23daeb52-e6eb-493c-8607-c4f0246cb7d8
  type: obsolete
- id: 518643ba-7d9c-4fa5-9f37-baed36059f6a
  type: obsolete
- id: 04f5363a-6bca-42ff-be70-0d28bf629ead
  type: obsolete
status: test
description: Detects a suspicious process spawning from one of the Microsoft Office
  suite products (Word, Excel, PowerPoint, Publisher, Visio, etc.)
references:
- https://www.hybrid-analysis.com/sample/465aabe132ccb949e75b8ab9c5bda36d80cf2fd503d52b8bad54e295f28bbc21?environmentId=100
- https://mgreen27.github.io/posts/2018/04/02/DownloadCradle.html
- https://thedfirreport.com/2021/03/29/sodinokibi-aka-revil-ransomware/
- https://doublepulsar.com/follina-a-microsoft-office-code-execution-vulnerability-1a47fce5629e
- https://github.com/vadim-hunter/Detection-Ideas-Rules/blob/02bcbfc2bfb8b4da601bb30de0344ae453aa1afe/Threat%20Intelligence/The%20DFIR%20Report/20210329_Sodinokibi_(aka_REvil)_Ransomware.yaml
- https://github.com/splunk/security_content/blob/develop/detections/endpoint/office_spawning_control.yml
- https://twitter.com/andythevariable/status/1576953781581144064?s=20&t=QiJILvK4ZiBdR8RJe24u-A
- https://www.elastic.co/security-labs/exploring-the-ref2731-intrusion-set
- https://github.com/elastic/detection-rules/blob/c76a39796972ecde44cb1da6df47f1b6562c9770/rules/windows/defense_evasion_execution_msbuild_started_by_office_app.toml
- https://www.vmray.com/analyses/2d2fa29185ad/report/overview.html
- https://app.any.run/tasks/c903e9c8-0350-440c-8688-3881b556b8e0/
author: Florian Roth (Nextron Systems), Markus Neis, FPT.EagleEye Team, Vadim Khrykov,
  Cyb3rEng, Michael Haag, Christopher Peacock @securepeacock, @scythe_io
date: 2018-04-06
modified: 2023-04-24
tags:
- attack.defense-evasion
- attack.execution
- attack.t1047
- attack.t1204.002
- attack.t1218.010
logsource:
  category: process_creation
  product: windows
detection:
  selection_parent:
    ParentImage|endswith:
    - '\EQNEDT32.EXE'
    - '\EXCEL.EXE'
    - '\MSACCESS.EXE'
    - '\MSPUB.exe'
    - '\ONENOTE.EXE'
    - '\POWERPNT.exe'
    - '\VISIO.exe'
    - '\WINWORD.EXE'
    - '\wordpad.exe'
    - '\wordview.exe'
  selection_child_processes:
  - OriginalFileName:
    - 'bitsadmin.exe'
    - 'CertOC.exe'
    - 'CertUtil.exe'
    - 'Cmd.Exe'
    - 'CMSTP.EXE'
    - 'cscript.exe'
    - 'curl.exe'
    - 'HH.exe'
    - 'IEExec.exe'
    - 'InstallUtil.exe'
    - 'javaw.exe'
    - 'Microsoft.Workflow.Compiler.exe'
    - 'msdt.exe'
    - 'MSHTA.EXE'
    - 'msiexec.exe'
    - 'Msxsl.exe'
    - 'odbcconf.exe'
    - 'pcalua.exe'
    - 'PowerShell.EXE'
    - 'RegAsm.exe'
    - 'RegSvcs.exe'
    - 'REGSVR32.exe'
    - 'RUNDLL32.exe'
    - 'schtasks.exe'
    - 'ScriptRunner.exe'
    - 'wmic.exe'
    - 'WorkFolders.exe'
    - 'wscript.exe'
  - Image|endswith:
    - '\AppVLP.exe'
    - '\bash.exe'
    - '\bitsadmin.exe'
    - '\certoc.exe'
    - '\certutil.exe'
    - '\cmd.exe'
    - '\cmstp.exe'
    - '\control.exe'
    - '\cscript.exe'
    - '\curl.exe'
    - '\forfiles.exe'
    - '\hh.exe'
    - '\ieexec.exe'
    - '\installutil.exe'
    - '\javaw.exe'
    - '\mftrace.exe'
    - '\Microsoft.Workflow.Compiler.exe'
    - '\msbuild.exe'
    - '\msdt.exe'
    - '\mshta.exe'
    - '\msidb.exe'
    - '\msiexec.exe'
    - '\msxsl.exe'
    - '\odbcconf.exe'
    - '\pcalua.exe'
    - '\powershell.exe'
    - '\pwsh.exe'
    - '\regasm.exe'
    - '\regsvcs.exe'
    - '\regsvr32.exe'
    - '\rundll32.exe'
    - '\schtasks.exe'
    - '\scrcons.exe'
    - '\scriptrunner.exe'
    - '\sh.exe'
    - '\svchost.exe'
    - '\verclsid.exe'
    - '\wmic.exe'
    - '\workfolders.exe'
    - '\wscript.exe'
  selection_child_susp_paths:   # Idea: Laiali Kazalbach, Mohamed Elsayed (#4142)
    Image|contains:
    - '\AppData\'
    - '\Users\Public\'
    - '\ProgramData\'
    - '\Windows\Tasks\'
    - '\Windows\Temp\'
    - '\Windows\System32\Tasks\'
  condition: selection_parent and 1 of selection_child_*
falsepositives:
- Unknown
level: high
notes: |
  n
  ### Technical Context
  This Sigma rule is designed to detect instances where a suspicious process is spawned by applications within the Microsoft Office suite, such as Word, Excel, PowerPoint, and Publisher. The rule specifically monitors process creation logs to identify if known risky child processes are launched by any of these parent Office applications. The detection criteria include the parent process name (e.g., `WINWORD.EXE`, `EXCEL.EXE`) and a set of commonly exploited child processes (e.g., `powershell.exe`, `mshta.exe`) known for their usage in attacks such as phishing and malware execution. By leveraging telemetry from Windows Process Creation events, the rule helps to identify potential execution of malicious code facilitated by trusted applications.
  This detection rule is aligned with the MITRE ATT&CK techniques T1204.002 (Malicious File Execution) and T1047 (Windows Management Instrumentation), highlighting the risk of executing hostile payloads that masquerade within popular productivity tools.
  ### Investigation Steps
  - **Review Process Creation Logs**: Use EDR tools to analyze the process creation logs associated with the suspicious Office application activity to confirm the parent-child process relationship identified in the alert.
  - **Check for Anomalous Command-Line Parameters**: Investigate the command-line parameters of the identified child process to understand the execution context and check for indicators of compromise.
  - **Analyze Network Connections**: Utilize NDR logs to evaluate any outbound connections made by the suspicious child process that may indicate malicious behavior or data exfiltration.
  - **Inspect File Locations**: Examine file paths leading to the execution of the identified child process for unusual behavior, especially if they reside in common temporary or Application Data folders.
  ### Prioritization
  The alert is classified as high severity due to the potential for significant impact stemming from malicious activity leveraging trusted Office applications for execution. Responding promptly is crucial, as such threats often aim to manipulate dependencies for stealthy execution.
  ### Blind spots and Assumptions
  This rule may not fire in scenarios where the child process is executed in a non-standard way, or if the parent-child relationships deviate from the specified criteria due to changes in software or legitimate application behavior. Furthermore, detection relies heavily on the integrity of process creation logs; any gaps or configurations preventing the capturing of these logs may lead to missed detections. It is also assumed that adversaries could use various evasion techniques such as renaming malicious executables or launching payloads outside the monitored parent processes, thus evading detection.
  > **Disclaimer:** This investigation guide was created using generative AI technology and has not been reviewed for its accuracy and relevance. While every effort has been made to ensure its quality, we recommend validating the content and adapting it to suit specific environment and operational needs. Please communicate any changes to the detection engineering team.
