title: Sysmon Driver Unloaded Via Fltmc.EXE
id: 4d7cda18-1b12-4e52-b45c-d28653210df8
related:
- id: 4931188c-178e-4ee7-a348-39e8a7a56821     # Generic
  type: similar
status: test
description: Detects possible Sysmon filter driver unloaded via fltmc.exe
references:
- https://www.darkoperator.com/blog/2018/10/5/operating-offensively-against-sysmon
author: Kirill Kiryanov, oscd.community
date: 2019-10-23
modified: 2023-02-13
tags:
- attack.defense-evasion
- attack.t1070
- attack.t1562
- attack.t1562.002
logsource:
  product: windows
  category: process_creation
detection:
  selection_img:
  - Image|endswith: '\fltMC.exe'
  - OriginalFileName: 'fltMC.exe'
  selection_cli:
    CommandLine|contains|all:
    - 'unload'
    - 'sysmon'
  condition: all of selection_*
falsepositives:
- Unlikely
level: high
notes: |
  ### Technical Context
  This detection rule identifies potential security events related to the unloading of Sysmon filter drivers via the legitimate Windows tool `fltmc.exe`. The rule leverages event logs for process creation on Windows to look for instances where `fltmc.exe` is invoked with command-line parameters indicating an unload operation specifically targeting Sysmon. Since Sysmon is a powerful tool for monitoring system activity, any unauthorized unloading of its filter could signify a defense evasion tactic employed by attackers. By focusing on the command line and executable name, the detection rule aims to flag these high-risk activities for further investigation.
  Technical data sources utilized in this rule include process creation logs from Windows, which capture details about every new process, including both the executable image and associated command-line parameters. Observations of suspicious command-line arguments related to Sysmon can indicate attempts to disable monitoring capabilities, warranting immediate attention from SOC analysts.
  ### Investigation Steps
  - Review the process creation logs in the EDR to identify instances of `fltmc.exe` running and check the associated command-line parameters for any unload requests related to Sysmon.
  - Use the AV solution to scan for any changes in Sysmon configurations or potential malicious behavior related to the interruption of service.
  - Look into network traffic logs from the NDR to determine if there were any unusual communications from the host where the unloading was detected, which may indicate a compromise.
  - Correlate findings with historical logs from SIEM to identify if similar unload attempts have occurred previously, examining timelines that could establish malicious patterns.
