title: Directory Removal Via Rmdir
id: 41ca393d-538c-408a-ac27-cf1e038be80c
status: test
description: |
  Detects execution of the builtin "rmdir" command in order to delete directories.
  Adversaries may delete files left behind by the actions of their intrusion activity.
  Malware, tools, or other non-native files dropped or created on a system by an adversary may leave traces to indicate to what was done within a network and how.
  Removal of these files can occur during an intrusion, or as part of a post-intrusion process to minimize the adversary's footprint.
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1070.004/T1070.004.md
- https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/erase
author: frack113
date: 2022-01-15
modified: 2023-03-07
tags:
- attack.defense-evasion
- attack.t1070.004
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: '\cmd.exe'
  - OriginalFileName: 'Cmd.Exe'
  selection_rmdir:
    CommandLine|contains: 'rmdir'
  selection_flags:
    CommandLine|contains:
    - '/s'
    - '/q'
  condition: all of selection_*
falsepositives:
- Unknown
level: low
notes: |
  ### Technical Context
  The "Directory Removal Via Rmdir" detection rule is designed to identify the execution of the command-line utility `rmdir`, which is used to remove directories in Windows environments. This is particularly relevant to security operations as adversaries may use this command to delete files or directories that they created or accessed during their intrusion activities, potentially erasing traces of their actions. The rule looks for process creation events where `cmd.exe` is invoked with command-line arguments that include `rmdir`, especially with flags such as `/s` (to remove directories and their contents recursively) and `/q` (to suppress confirmation prompts). By analyzing these parameters within process creation logs, the rule aims to detect suspicious directory deletions that could indicate an attempt to cover tracks or eliminate evidence post-intrusion.
  ### Investigation Steps
  - Check EDR logs for recent executions of `cmd.exe` that involved the `rmdir` command, focusing on the specific command-line parameters used.
  - Review process creation logs for the associated user context and the timing of the command execution to identify any anomalous user behavior.
  - Analyze file system logs to determine what directories or files were deleted and whether they were associated with known unauthorized activities.
  - Consult cloud logs from any connected services (AWS, GCP, Azure) for alerts or anomalies that correspond with the timeline of the detected `rmdir` execution.
