title: Query Usage To Exfil Data
id: 53ef0cef-fa24-4f25-a34a-6c72dfa2e6e2
status: test
description: Detects usage of "query.exe" a system binary to exfil information such
  as "sessions" and "processes" for later use
references:
- https://twitter.com/MichalKoczwara/status/1553634816016498688
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-08-01
modified: 2023-01-19
tags:
- attack.execution
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith: ':\Windows\System32\query.exe'
    CommandLine|contains:
    - 'session >'
    - 'process >'
  condition: selection
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  This detection rule is designed to identify the execution of "query.exe", a legitimate Windows system utility that can be misused for data exfiltration. The rule focuses on command-line parameters that suggest an intent to extract session or process information, specifically looking for the patterns 'session >' and 'process >', which indicate redirection of output to another location, potentially for unauthorized data collection. The primary data sources for this rule are process creation logs, which capture detailed information about process execution, including the image path and command-line arguments used. By monitoring these logs, the SOC can detect potentially malicious usage of system binaries that are typically benign under normal circumstances.
  ### Investigation Steps
  - Review the relevant process creation logs within the EDR tool to identify entries related to "query.exe", noting the timestamp and any user accounts involved.
  - Analyze the command-line parameters for the detected instances to confirm the specific arguments ('session >' or 'process >') used during execution, which might indicate an attempt to exfiltrate data.
  - Correlate the alerts with firewall logs from the NGFW to check for abnormal outbound traffic patterns or connections to external IPs following execution of the detected queries.
  - Investigate user activity in authentication logs for any suspicious logins or remote access efforts that align with the timing of the "query.exe" execution to assess potential insider threats.
