title: Uncommon Extension Shim Database Installation Via Sdbinst.EXE
id: 18ee686c-38a3-4f65-9f44-48a077141f42
related:
- id: 517490a7-115a-48c6-8862-1a481504d5a8
  type: derived
status: test
description: |
  Detects installation of a potentially suspicious new shim with an uncommon extension using sdbinst.exe.
  Adversaries may establish persistence and/or elevate privileges by executing malicious content triggered by application shims
references:
- https://www.fireeye.com/blog/threat-research/2017/05/fin7-shim-databases-persistence.html
- https://github.com/nasbench/Misc-Research/blob/8ee690e43a379cbce8c9d61107442c36bd9be3d3/Other/Undocumented-Flags-Sdbinst.md
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023-08-01
modified: 2024-01-10
tags:
- attack.persistence
- attack.privilege-escalation
- attack.t1546.011
logsource:
  category: process_creation
  product: windows
detection:
  selection:
  - Image|endswith: '\sdbinst.exe'
  - OriginalFileName: 'sdbinst.exe'
  filter_main_legit_ext:
    CommandLine|contains: '.sdb'
  filter_main_legit_extensions:
        # ParentImage|endswith: ':\Windows\System32\svchost.exe'
  - CommandLine|endswith:
    - ' -c'
    - ' -f'
    - ' -mm'
    - ' -t'
  - CommandLine|contains: ' -m -bg'
  filter_main_null:
    CommandLine:
  filter_main_empty:
    CommandLine: ''
  condition: selection and not 1 of filter_main_*
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  This detection rule identifies the installation of potentially malicious shim databases using the `sdbinst.exe` process on Windows systems. The rule specifically looks for instances where `sdbinst.exe` is executed with unusual extensions, which may indicate an attempt to establish persistence or escalate privileges by adversaries. The key indicators for this detection include the presence of command-line arguments associated with `sdbinst.exe`, particularly those that are atypical for legitimate use, such as the inclusion of uncommon file extensions or specific flags like `-m -bg`. The data sources leveraged for this detection are primarily derived from process creation logs that capture the execution details of Windows processes.
  ### Investigation Steps
  - Review the process creation logs in your EDR solution to identify other instances of `sdbinst.exe` being executed with suspicious command-line arguments.
  - Check the integrity and reputation of any identified `.sdb` files against known malware databases to determine if they are associated with malicious activity.
  - Utilize network monitoring tools to assist in identifying any unusual outbound connections that may have been initiated by `sdbinst.exe` or other related processes.
  - Investigate the user account activity to determine if a non-administrative account executed the `sdbinst.exe`, and assess for any abnormal privilege escalation events.
