title: Potential Credential Dumping Via LSASS Process Clone
id: c8da0dfd-4ed0-4b68-962d-13c9c884384e
status: test
description: Detects a suspicious LSASS process process clone that could be a sign
  of credential dumping activity
references:
- https://www.matteomalvica.com/blog/2019/12/02/win-defender-atp-cred-bypass/
- https://twitter.com/Hexacorn/status/1420053502554951689
- https://twitter.com/SBousseaden/status/1464566846594691073?s=20
author: Florian Roth (Nextron Systems), Samir Bousseaden
date: 2021-11-27
modified: 2023-03-02
tags:
- attack.credential-access
- attack.t1003
- attack.t1003.001
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    ParentImage|endswith: '\Windows\System32\lsass.exe'
    Image|endswith: '\Windows\System32\lsass.exe'
  condition: selection
falsepositives:
- Unknown
level: critical
notes: |
  ### Technical Context
  This detection rule focuses on identifying instances of potential credential dumping via the Local Security Authority Subsystem Service (LSASS) process. LSASS is responsible for enforcing security policies on Windows systems, including password validation and processes related to user logins. When an attacker aims to capture credentials, they may clone the LSASS process to extract sensitive information such as passwords and Kerberos tickets. This rule looks specifically for any instances where a process has been spawned with LSASS as its parent, signaling a potential illicit activity that could signify credential theft. The primary data sources used by this rule are process creation logs, which provide insights into the hierarchy of running processes on the system.
  ### Investigation Steps
  - Review process creation logs in your EDR to identify the timestamp and user context of the detected LSASS clone process.
  - Analyze the full command-line parameters associated with the LSASS clone to determine any suspicious arguments or obfuscation techniques that may have been used.
  - Check for any related network activity or anomalous outbound connections that may indicate data exfiltration tied to the cloned LSASS process.
  - Cross-reference the user account involved with known baselines to assess whether it has been associated with legitimate administrative actions or prior security incidents.
