title: Suspicious PowerShell Parent Process
id: 754ed792-634f-40ae-b3bc-e0448d33f695
related:
- id: 692f0bec-83ba-4d04-af7e-e884a96059b6
  type: derived
status: test
description: Detects a suspicious or uncommon parent processes of PowerShell
references:
- https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse?slide=26
author: Teymur Kheirkhabarov, Harish Segar
date: 2020-03-20
modified: 2023-02-04
tags:
- attack.execution
- attack.t1059.001
logsource:
  category: process_creation
  product: windows
detection:
  selection_parent:
  - ParentImage|contains: 'tomcat'
  - ParentImage|endswith:
    - '\amigo.exe'
    - '\browser.exe'
    - '\chrome.exe'
    - '\firefox.exe'
    - '\httpd.exe'
    - '\iexplore.exe'
    - '\jbosssvc.exe'
    - '\microsoftedge.exe'
    - '\microsoftedgecp.exe'
    - '\MicrosoftEdgeSH.exe'
    - '\mshta.exe'
    - '\nginx.exe'
    - '\outlook.exe'
    - '\php-cgi.exe'
    - '\regsvr32.exe'
    - '\rundll32.exe'
    - '\safari.exe'
    - '\services.exe'
    - '\sqlagent.exe'
    - '\sqlserver.exe'
    - '\sqlservr.exe'
    - '\vivaldi.exe'
    - '\w3wp.exe'
  selection_powershell:
  - Image|endswith:
    - '\powershell.exe'
    - '\pwsh.exe'
  - CommandLine|contains:
    - '/c powershell'            # FPs with sub processes that contained "powershell" somewhere in the command line
    - '/c pwsh'
  - Description: 'Windows PowerShell'
  - Product: 'PowerShell Core 6'
  - OriginalFileName:
    - 'PowerShell.EXE'
    - 'pwsh.dll'
  condition: all of selection_*
falsepositives:
- Other scripts
level: high
notes: |
  ### Technical Context
  This detection rule identifies suspicious use of PowerShell that may indicate an abnormal behavior initiated by uncommon or unexpected parent processes. It focuses on scenarios where PowerShell (either `powershell.exe` or `pwsh.exe`) is executed, particularly when its parent process is one of several potential indicators of compromise, such as web browsers, email clients, or other application executables that are not typically associated with PowerShell execution. The rule analyzes process creation logs from a Windows environment, specifically looking at the 'ParentImage' field to flag any malicious activity that could be linked to exploitation or lateral movement within the enterprise network.
  To effectively identify such patterns, the rule evaluates both the command-line parameters used in the PowerShell execution and the characteristics of the parent process. Certain command-line syntax (e.g., `/c powershell` or `/c pwsh`) further refines the detection capabilities, allowing analysts to prioritize further investigation on these alerts.
  ### Investigation Steps
  - Review the process creation logs in your EDR solution to identify instances of `powershell.exe` or `pwsh.exe` alongside the associated parent processes that triggered the alert.
  - Cross-reference the alert data with current threat intelligence to ascertain whether the flagged parent processes are known to have been abused in recent attacks.
  - Analyze command-line arguments associated with the PowerShell instances to determine if they exhibit indicators of malicious behavior (e.g., obfuscation or unusual parameters).
  - Check network logs from the NGFW or Proxy solution for any outbound communications initiated by the PowerShell process, particularly connections to suspicious or untrusted domains.
