title: Suspicious File Download From File Sharing Domain Via Wget.EXE
id: a0d7e4d2-bede-4141-8896-bc6e237e977c
status: experimental
description: Detects potentially suspicious file downloads from file sharing domains
  using wget.exe
references:
- https://labs.withsecure.com/publications/fin7-target-veeam-servers
- https://github.com/WithSecureLabs/iocs/blob/344203de742bb7e68bd56618f66d34be95a9f9fc/FIN7VEEAM/iocs.csv
- https://www.microsoft.com/en-us/security/blog/2024/01/17/new-ttps-observed-in-mint-sandstorm-campaign-targeting-high-profile-individuals-at-universities-and-research-orgs/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023-05-05
modified: 2024-10-21
tags:
- attack.execution
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: '\wget.exe'
  - OriginalFileName: 'wget.exe'
  selection_websites:
    CommandLine|contains:
    - '.githubusercontent.com'               # Includes both gists and github repositories / Michael Haag (idea)
    - 'anonfiles.com'
    - 'cdn.discordapp.com'
    - 'ddns.net'
    - 'dl.dropboxusercontent.com'
    - 'ghostbin.co'
    - 'glitch.me'
    - 'gofile.io'
    - 'hastebin.com'
    - 'mediafire.com'
    - 'mega.nz'
    - 'onrender.com'
    - 'pages.dev'
    - 'paste.ee'
    - 'pastebin.com'
    - 'pastebin.pl'
    - 'pastetext.net'
    - 'pixeldrain.com'
    - 'privatlab.com'
    - 'privatlab.net'
    - 'send.exploit.in'
    - 'sendspace.com'
    - 'storage.googleapis.com'
    - 'storjshare.io'
    - 'supabase.co'
    - 'temp.sh'
    - 'transfer.sh'
    - 'trycloudflare.com'
    - 'ufile.io'
    - 'w3spaces.com'
    - 'workers.dev'
  selection_http:
    CommandLine|contains: 'http'
  selection_flag:
  - CommandLine|re: '\s-O\s'
  - CommandLine|contains: '--output-document'
  selection_ext:
    CommandLine|endswith:
    - '.ps1'
    - ".ps1'"
    - '.ps1"'
    - '.dat'
    - ".dat'"
    - '.dat"'
    - '.msi'
    - ".msi'"
    - '.msi"'
    - '.bat'
    - ".bat'"
    - '.bat"'
    - '.exe'
    - ".exe'"
    - '.exe"'
    - '.vbs'
    - ".vbs'"
    - '.vbs"'
    - '.vbe'
    - ".vbe'"
    - '.vbe"'
    - '.hta'
    - ".hta'"
    - '.hta"'
    - '.dll'
    - ".dll'"
    - '.dll"'
    - '.psm1'
    - ".psm1'"
    - '.psm1"'
  condition: all of selection_*
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This Sigma rule is designed to detect potentially suspicious file downloads initiated using `wget.exe` from file-sharing domains. The rule inspects process creation logs, focusing on the command-line parameters utilized when `wget.exe` is executed. Specifically, it looks for command lines that point to known file-sharing websites and includes certain flags and file extensions associated with executable or script files, such as `.ps1`, `.exe`, and `.vbs`. By identifying these patterns, security analysts can raise alerts on potentially malicious file downloads that could pose a risk to organizational assets or facilitate further exploitation.
  ### Investigation Steps
  - Examine the command-line arguments associated with the detected `wget.exe` execution in your EDR tool to identify the specific file being downloaded and its source URL.
  - Check file reputation using your AV or threat intelligence services to determine if the downloaded file has been flagged or associated with malicious activity.
  - Review historical Proxy or Network logs to see if there was any previous connection to the same file-sharing domain or if similar downloads were initiated from the same host.
  - Investigate the endpoint's activity and behavior surrounding the time of the alert to ascertain whether there were any related suspicious processes or network connections established.
