title: Potential Persistence Via Logon Scripts - CommandLine
id: 21d856f9-9281-4ded-9377-51a1a6e2a432
related:
- id: 0a98a10c-685d-4ab0-bddc-b6bdd1d48458
  type: derived
status: test
description: Detects the addition of a new LogonScript to the registry value "UserInitMprLogonScript"
  for potential persistence
references:
- https://cocomelonc.github.io/persistence/2022/12/09/malware-pers-20.html
author: Tom Ueltschi (@c_APT_ure)
date: 2019-01-12
modified: 2023-06-09
tags:
- attack.persistence
- attack.t1037.001
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|contains: 'UserInitMprLogonScript'
  condition: selection
falsepositives:
- Legitimate addition of Logon Scripts via the command line by administrators or third
  party tools
level: high
notes: |
  ### Technical Context
  This Sigma rule is designed to detect potential persistence mechanisms employed by threat actors through the modification of the Windows registry key `UserInitMprLogonScript`. Specifically, it looks for the presence of the string "UserInitMprLogonScript" in command-line parameters of process creation logs. By monitoring changes to this registry value, which is responsible for executing logon scripts during user sessions, the rule aims to identify unauthorized or malicious modifications that could enable an attacker to persist within a system. The primary data sources for this detection are process creation logs, which provide valuable context around the execution of commands and the associated command-line arguments.
  ### Investigation Steps
  - Review process creation logs in your EDR tool for any processes that executed with the command-line containing "UserInitMprLogonScript." Pay attention to the user context and the source of the execution. 
  - Cross-examine registry logs to confirm any recent changes made to the `UserInitMprLogonScript` registry key, ensuring that you understand what script has been added or modified.
  - Check for related network activity using your NDR tool, focusing on connections initiated by the identified processes to see if they correlate with known malicious behavior.
  - Investigate any legitimate administrative activity or third-party tool usage that could explain the modification, and confirm if such actions were properly documented and approved.
