title: Audio Capture via PowerShell
id: 932fb0d8-692b-4b0f-a26e-5643a50fe7d6
status: test
description: Detects audio capture via PowerShell Cmdlet.
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1123/T1123.md
- https://eqllib.readthedocs.io/en/latest/analytics/ab7a6ef4-0983-4275-a4f1-5c6bd3c31c23.html
- https://github.com/frgnca/AudioDeviceCmdlets
author: E.M. Anhaus (originally from Atomic Blue Detections, Endgame), oscd.community,
  Nasreddine Bencherchali (Nextron Systems)
date: 2019-10-24
modified: 2023-04-06
tags:
- attack.collection
- attack.t1123
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|contains:
    - 'WindowsAudioDevice-Powershell-Cmdlet'
    - 'Toggle-AudioDevice'
    - 'Get-AudioDevice '
    - 'Set-AudioDevice '
    - 'Write-AudioDevice '
  condition: selection
falsepositives:
- Legitimate audio capture by legitimate user.
level: medium
notes: |
  ### Technical Context
  This detection rule identifies instances of unauthorized audio capture utilizing PowerShell Cmdlets in a Windows environment. Specifically, it looks for command lines that include keywords associated with audio device manipulation, such as 'WindowsAudioDevice-Powershell-Cmdlet', 'Toggle-AudioDevice', and related commands that may indicate a malicious attempt to capture audio without user consent. The rule leverages process creation logs, which record events and details about processes executed on the system, including command-line parameters that provide insight into the executed commands. By monitoring these logs, the rule helps in detecting potentially harmful activities that could compromise user privacy or be indicative of malicious intent.
  ### Investigation Steps
  - Review process creation logs in the EDR solution to identify the presence of flagged PowerShell commands and their originating user account.
  - Correlate the identified processes with user activity logs to determine if the audio capture attempt aligns with legitimate user behavior.
  - Analyze network traffic using NDR tools to look for any unusual data exfiltration attempts that may coincide with the identified audio capture activities.
  - Check for any alerts or records in the AV or NGFW systems that may indicate prior malicious behavior or known indicators related to unauthorized audio capture.
