title: User Added To Highly Privileged Group
id: 10fb649c-3600-4d37-b1e6-56ea90bb7e09 # Privileged groups
related:
- id: ffa28e60-bdb1-46e0-9f82-05f7a61cc06e     # Remote Desktop groups
  type: similar
- id: ad720b90-25ad-43ff-9b5e-5c841facc8e5     # Admin groups
  type: similar
status: test
description: Detects addition of users to highly privileged groups via "Net" or "Add-LocalGroupMember".
references:
- https://www.huntress.com/blog/slashandgrab-screen-connect-post-exploitation-in-the-wild-cve-2024-1709-cve-2024-1708
author: Nasreddine Bencherchali (Nextron Systems)
date: 2024-02-23
tags:
- attack.persistence
- attack.t1098
logsource:
  category: process_creation
  product: windows
detection:
  selection_main:
  - CommandLine|contains|all:
              # net.exe
    - 'localgroup '
    - ' /add'
  - CommandLine|contains|all:
              # powershell.exe
    - 'Add-LocalGroupMember '
    - ' -Group '
  selection_group:
    CommandLine|contains:
    - 'Group Policy Creator Owners'
    - 'Schema Admins'
  condition: all of selection_*
falsepositives:
- Administrative activity that must be investigated
level: high
notes: |
  ### Technical Context
  This detection rule identifies when a user is added to a highly privileged group in a Windows environment. It specifically looks for command-line activities involving `net.exe` or `powershell.exe`, utilizing commands such as "localgroup" with the "/add" option or "Add-LocalGroupMember" with the parameter for the group name. The rule is designed to monitor for key privileged group names such as "Group Policy Creator Owners" and "Schema Admins," which are often targeted by attackers to escalate their privileges within a network. By capturing this activity, the rule helps ensure that any unauthorized changes to group memberships are flagged for further investigation.
  ### Investigation Steps
  - Review process creation logs in the EDR to identify the full command-line execution context surrounding the user addition to a privileged group.
  - Cross-reference the timestamps of the detected activity with user access logs from the directory service to determine if there was an authorized operational need for the changes.
  - Utilize the SIEM to analyze historical log data and identify any prior instances of similar modifications or suspicious activities tied to the implicated user accounts.
  - Check the network activity logs in the Proxy or Firewall to see if there were any related external communications or command-and-control (C2) activities coinciding with the time of the group membership change.
