title: Cscript/Wscript Potentially Suspicious Child Process
id: b6676963-0353-4f88-90f5-36c20d443c6a
status: test
description: |
  Detects potentially suspicious child processes of Wscript/Cscript. These include processes such as rundll32 with uncommon exports or PowerShell spawning rundll32 or regsvr32.
  Malware such as Pikabot and Qakbot were seen using similar techniques as well as many others.
references:
- Internal Research
- https://github.com/pr0xylife/Pikabot/blob/main/Pikabot_30.10.2023.txt
- https://github.com/pr0xylife/Pikabot/blob/main/Pikabot_22.12.2023.txt
author: Nasreddine Bencherchali (Nextron Systems), Alejandro Houspanossian ('@lekz86')
date: 2023-05-15
modified: 2024-01-02
tags:
- attack.execution
logsource:
  category: process_creation
  product: windows
detection:
  selection_parent:
    ParentImage|endswith:
    - '\wscript.exe'
    - '\cscript.exe'
  selection_cli_script_main:
    Image|endswith:
    - '\cmd.exe'
    - '\powershell.exe'
    - '\pwsh.exe'
    # Note: Add other combinations that are suspicious
  selection_cli_script_option_mshta:
    CommandLine|contains|all:
    - 'mshta'
    - 'http'
  selection_cli_script_option_other:
    CommandLine|contains:
    - 'rundll32'
    - 'regsvr32'
    - 'msiexec'
  selection_cli_standalone:
    Image|endswith: '\rundll32.exe'
  filter_main_rundll32_known_exports:
    Image|endswith: '\rundll32.exe'
    CommandLine|contains:
    - 'UpdatePerUserSystemParameters'
    - 'PrintUIEntry'
    - 'ClearMyTracksByProcess'
  condition: selection_parent and ( selection_cli_standalone or (selection_cli_script_main
    and 1 of selection_cli_script_option_*) ) and not 1 of filter_main_*
falsepositives:
- Some false positives might occur with admin or third party software scripts. Investigate
  and apply additional filters accordingly.
level: medium
notes: |
  ### Technical Context
  This Sigma rule is designed to identify potentially suspicious child processes spawned by Windows scripting engines, specifically Wscript and Cscript. The rule looks for processes like `rundll32.exe` or `regsvr32.exe` being initiated by these script engines, especially in conjunction with suspicious command-line parameters that may indicate malicious behavior. It focuses on detecting unusual combinations where known benign exports of `rundll32.exe` are absent, thus flagging processes that may align with known malware techniques, such as those employed by Pikabot and Qakbot. To achieve this, the rule utilizes process creation logs, capturing critical details from the operating system regarding parent-child process relationships and command-line usage.
  ### Investigation Steps
  - Review EDR logs to trace the execution path of the detected process. Identify the parent scripts that initiated the suspicious activity and analyze their command-line parameters.
  - Check for additional context in the SIEM related to prior occurrences of the parent processes (`wscript.exe` or `cscript.exe`). Correlate these events with any alerts or historical data to assess the behavior over time.
  - Use antivirus and endpoint protection tools to search for signatures or heuristics linked to the processes in question. This may help confirm whether the detected activity is malicious or benign.
  - Investigate cloud logs (if applicable) for any interactions with external URLs that might indicate data exfiltration or command-and-control activity related to the flagged processes.
