title: Remote XSL Execution Via Msxsl.EXE
id: 75d0a94e-6252-448d-a7be-d953dff527bb
status: test
description: Detects the execution of the "msxsl" binary with an "http" keyword in
  the command line. This might indicate a potential remote execution of XSL files.
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1220/T1220.md
- https://lolbas-project.github.io/lolbas/OtherMSBinaries/Msxsl/
author: Swachchhanda Shrawan Poudel
date: 2023-11-09
tags:
- attack.defense-evasion
- attack.t1220
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith: '\msxsl.exe'
    CommandLine|contains: 'http'
  condition: selection
falsepositives:
- Msxsl is not installed by default and is deprecated, so unlikely on most systems.
level: high
notes: |
  ### Technical Context
  This Sigma rule detects the execution of the `msxsl.exe` binary when the command line includes the keyword "http." `msxsl.exe` is a deprecated Microsoft utility that allows for the transformation of XML documents using XSLT stylesheets. The usage of "http" in command line parameters can indicate attempts to execute XSL files remotely, which can be a tactic used by threat actors for remote code execution. This detection rule focuses on Windows process creation events, specifically targeting logs that capture the execution of processes and their command-line arguments. Such detections are crucial for identifying potentially malicious activities leveraging outdated or unknown binaries in an enterprise environment.
  ### Investigation Steps
  - Review the process creation logs in your EDR solution to locate instances of `msxsl.exe` being executed, paying particular attention to the associated command line arguments.
  - Check the timeline of the event to correlate any suspicious activity, such as other related processes that executed around the same time.
  - Analyze the network logs from your NGFW or Proxy to identify any outbound connections made by `msxsl.exe`, especially those targeting external HTTP servers, for signs of data exfiltration or command-and-control activity.
  - Inspect for any unusual file creation or modifications in the environment that could correlate with the execution of `msxsl.exe`, including any new or altered XML/XSL files that might have been processed.
