title: Recon Command Output Piped To Findstr.EXE
id: ccb5742c-c248-4982-8c5c-5571b9275ad3
related:
- id: fe63010f-8823-4864-a96b-a7b4a0f7b929
  type: derived
status: experimental
description: |
  Detects the execution of a potential recon command where the results are piped to "findstr". This is meant to trigger on inline calls of "cmd.exe" via the "/c" or "/k" for example.
  Attackers often time use this technique to extract specific information they require in their reconnaissance phase.
references:
- https://github.com/redcanaryco/atomic-red-team/blob/02cb591f75064ffe1e0df9ac3ed5972a2e491c97/atomics/T1057/T1057.md#atomic-test-6---discover-specific-process---tasklist
- https://www.hhs.gov/sites/default/files/manage-engine-vulnerability-sector-alert-tlpclear.pdf
- https://www.trendmicro.com/en_us/research/22/d/spring4shell-exploited-to-deploy-cryptocurrency-miners.html
author: Nasreddine Bencherchali (Nextron Systems), frack113
date: 2023-07-06
modified: 2024-06-27
tags:
- attack.discovery
- attack.t1057
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|contains:
            # Note: Add additional CLI to increase and enhance coverage
            # Note: We use wildcards in this instance to avoid writing a lot of variations that can be avoided easily. You can switch to regex if its supported by your backend.
    - 'ipconfig*|*find'
    - 'net*|*find'
    - 'netstat*|*find'
    - 'ping*|*find'
    - 'systeminfo*|*find'
    - 'tasklist*|*find'
    - 'whoami*|*find'
  condition: selection
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  This Sigma rule is designed to detect the execution of potentially malicious reconnaissance commands that utilize the Windows command interpreter, `cmd.exe`, with results piped to the `findstr.exe` utility. Attackers may employ this technique during the reconnaissance phase to extract specific information from the system, such as network configurations or user account details. The rule focuses on identifying command-line activities that include common networking or system information commands—like `ipconfig`, `net`, `netstat`, `ping`, `systeminfo`, `tasklist`, and `whoami`—specifically when these commands utilize a pipe to `findstr`. Logs related to process creation are monitored to capture these scenarios, allowing for timely detection of potentially malicious activities based on command-line parameters.
  ### Investigation Steps
  - Review process creation logs in your EDR solution to identify instances of `cmd.exe` being executed with a command line containing the noted parameters piped to `findstr`.
  - Utilize the SIEM to correlate these events with user account activity to determine if the commands were run by legitimate users or align with suspicious behavior patterns.
  - Analyze network data using NDR tools to see if there were any outbound connections or unusual network activity occurring alongside the timestamp of the detected command execution.
  - Investigate any relevant logs from proxies and cloud platforms to identify if the commands were part of a broader attack or reconnaissance strategy involving external resources.
