title: Computer System Reconnaissance Via Wmic.EXE
id: 9d7ca793-f6bd-471c-8d0f-11e68b2f0d2f
status: test
description: Detects execution of wmic utility with the "computersystem" flag in order
  to obtain information about the machine such as the domain, username, model, etc.
references:
- https://www.microsoft.com/security/blog/2022/09/07/profiling-dev-0270-phosphorus-ransomware-operations/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-09-08
modified: 2023-02-14
tags:
- attack.discovery
- attack.execution
- attack.t1047
logsource:
  product: windows
  category: process_creation
detection:
  selection_img:
  - Image|endswith: '\wmic.exe'
  - OriginalFileName: 'wmic.exe'
  selection_cli:
    CommandLine|contains: 'computersystem'
  condition: all of selection_*
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  This detection rule identifies the use of the Windows Management Instrumentation Command-line (WMIC) tool, specifically when executed with the "computersystem" parameter. WMIC is a powerful command-line utility for accessing Windows Management Instrumentation (WMI) data, which can be used by attackers to gather sensitive information about a target machine, such as domain details, usernames, and hardware specifications. The rule utilizes process creation logs from Windows, monitoring when the `wmic.exe` image is invoked with command-line arguments containing the word "computersystem." By focusing on this specific command, which is commonly associated with reconnaissance activities, the SOC can proactively identify indicators of potential malicious behavior.
  ### Investigation Steps
  - Review the EDR logs for the process execution of `wmic.exe`, filtering for instances that include the "computersystem" command-line argument. This will help confirm if the command was executed maliciously.
  - Validate the authenticity of the user executing the command by correlating with user activity logs and access permissions. Check if this user typically runs such commands in their normal workflow.
  - Analyze any system or network logs to determine if there were additional suspicious activities or communications that occurred around the same time as the WMIC execution.
  - Conduct a review of endpoint security logs (such as AV or NGFW) to identify if any alerts were triggered and correlate these findings with the WMIC execution event. This will provide context to the behavior and the potential threat level.
