title: Conhost Spawned By Uncommon Parent Process
id: cbb9e3d1-2386-4e59-912e-62f1484f7a89
status: test
description: Detects when the Console Window Host (conhost.exe) process is spawned
  by an uncommon parent process, which could be indicative of potential code injection
  activity.
references:
- https://www.elastic.co/guide/en/security/current/conhost-spawned-by-suspicious-parent-process.html
author: Tim Rauch, Elastic (idea)
date: 2022-09-28
modified: 2023-03-29
tags:
- attack.execution
- attack.t1059
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith: '\conhost.exe'
    ParentImage|endswith:
    - '\explorer.exe'
            # - '\csrss.exe'  # Legitimate parent as seen in EchoTrail https://www.echotrail.io/insights/search/csrss.exe
            # - '\ctfmon.exe'  # Seen several times in a testing environment
            # - '\dllhost.exe'  # FP on clean system from grandparent 'svchost.exe -k DcomLaunch -p'
    - '\lsass.exe'
    - '\regsvr32.exe'
    - '\rundll32.exe'
    - '\services.exe'
    - '\smss.exe'
    - '\spoolsv.exe'
    - '\svchost.exe'
    - '\userinit.exe'
            # - '\wermgr.exe'  # Legitimate parent as seen in EchoTrail https://www.echotrail.io/insights/search/wermgr.exe
    - '\wininit.exe'
    - '\winlogon.exe'
  filter_main_svchost:
    ParentCommandLine|contains:
    - '-k apphost -s AppHostSvc'
    - '-k imgsvc'
    - '-k localService -p -s RemoteRegistry'
    - '-k LocalSystemNetworkRestricted -p -s NgcSvc'
    - '-k NetSvcs -p -s NcaSvc'
    - '-k netsvcs -p -s NetSetupSvc'
    - '-k netsvcs -p -s wlidsvc'
    - '-k NetworkService -p -s DoSvc'
    - '-k wsappx -p -s AppXSvc'
    - '-k wsappx -p -s ClipSVC'
  filter_optional_dropbox:
    ParentCommandLine|contains:
    - 'C:\Program Files (x86)\Dropbox\Client\'
    - 'C:\Program Files\Dropbox\Client\'
  condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  This Sigma rule detects the spawning of the Console Window Host (conhost.exe) by uncommon parent processes, which may indicate potential code injection attempts or other malicious activities. While conhost.exe is a built-in Windows process responsible for handling console windows, its invocation by unexpected parent processes can be a red flag. The rule utilizes telemetry from process creation logs, focusing on the `Image` and `ParentImage` fields to identify instances where conhost.exe is being initialized by processes that typically don't spawn it, such as `lsass.exe`, `regsvr32.exe`, or `svchost.exe`. The rule also includes filtering based on certain command-line parameters associated with legitimate instances of `svchost.exe` to minimize false positives. This detection aligns with the MITRE ATT&CK execution tactic, specifically technique T1059 (Command and Scripting Interpreter), as it pertains to the execution of potentially harmful scripts and commands via a console.
  ### Investigation Steps
  - **Examine Parent Processes:** Review the process tree in your EDR tool to identify the parent process of the detected conhost.exe instance, noting any unusual activity associated with the parent.
  - **Check Process Command Line:** Analyze the command line used to spawn conhost.exe for any suspicious parameters or entries that deviate from typical usage patterns.
  - **Correlate with Other Logs:** Investigate supplementary logs, such as Windows Security, to identify any related events such as logon attempts, process access events, or file modifications occurring around the same time as the alert.
  - **Monitor Network Activities:** Utilize NDR or firewall logs to look for any outbound network connections from the suspicious conhost.sh.exe instance that may indicate data exfiltration or communication with a malicious endpoint.
  ### Prioritization
  This alert holds a medium severity level due to the potential indication of malicious activity, particularly because the spawning of conhost.exe by uncommon parents is not typical behavior and may warrant immediate investigation to prevent further exploitation.
  ### Blind Spots and Assumptions
  This rule relies heavily on accurate process creation telemetry and may not fire in environments where auditing is not sufficiently enabled. Furthermore, a determined adversary may utilize techniques to obscure or masquerade their process spawning behavior, such as using legitimate parent processes under atypical circumstances. Additionally, false positives may occur due to benign software that improperly invokes conhost.exe, such as certain backup or sync applications.
  > **Disclaimer:** This investigation guide was created using generative AI technology and has not been reviewed for its accuracy and relevance. While every effort has been made to ensure its quality, we recommend validating the content and adapting it to suit specific environment and operational needs. Please communicate any changes to the detection engineering team.
