title: Potential ReflectDebugger Content Execution Via WerFault.EXE
id: fabfb3a7-3ce1-4445-9c7c-3c27f1051cdd
related:
- id: 0cf2e1c6-8d10-4273-8059-738778f981ad
  type: derived
status: test
description: Detects execution of "WerFault.exe" with the "-pr" commandline flag that
  is used to run files stored in the ReflectDebugger key which could be used to store
  the path to the malware in order to masquerade the execution flow
references:
- https://cocomelonc.github.io/malware/2022/11/02/malware-pers-18.html
- https://www.hexacorn.com/blog/2018/08/31/beyond-good-ol-run-key-part-85/
author: X__Junior (Nextron Systems)
date: 2023-06-30
tags:
- attack.execution
- attack.defense-evasion
- attack.t1036
logsource:
  product: windows
  category: process_creation
detection:
  selection_img:
  - Image|endswith: '\WerFault.exe'
  - OriginalFileName: 'WerFault.exe'
  selection_cli:
    CommandLine|contains: ' -pr '
  condition: all of selection_*
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  The detection rule titled "Potential ReflectDebugger Content Execution Via WerFault.EXE" is designed to identify the execution of the Windows Error Reporting tool, `WerFault.exe`, specifically when it is invoked with the `-pr` command line flag. This flag allows for the running of files stored in the ReflectDebugger registry key, which can potentially include malicious payloads. By monitoring process creation logs, the rule looks for entries that indicate `WerFault.exe` was executed, alongside the specified command line argument. This behavior could suggest an attempt to conceal the execution of malware under the guise of legitimate system processes, making it a critical detection point for threat hunters and incident responders.
  ### Investigation Steps
  - Utilize EDR solutions to search for recent executions of `WerFault.exe` with the `-pr` command-line argument to determine the authenticity and context of these processes.
  - Review process creation logs within your SIEM to correlate the timing of `WerFault.exe` executions with other suspicious activities on the affected endpoint.
  - Check the ReflectDebugger registry key for any references to unfamiliar or unauthorized files that may point to potential malware or malicious behavior.
  - Analyze any associated network activity through NDR tools and firewall logs to see if there are outbound connections related to the execution of `WerFault.exe`, which may indicate data exfiltration or command-and-control communications.
