title: Suspicious Where Execution
id: 725a9768-0f5e-4cb3-aec2-bc5719c6831a
status: test
description: |
  Adversaries may enumerate browser bookmarks to learn more about compromised hosts.
  Browser bookmarks may reveal personal information about users (ex: banking sites, interests, social media, etc.) as well as details about
  internal network resources such as servers, tools/dashboards, or other related infrastructure.
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1217/T1217.md
author: frack113, Nasreddine Bencherchali (Nextron Systems)
date: 2021-12-13
modified: 2022-06-29
tags:
- attack.discovery
- attack.t1217
logsource:
  category: process_creation
  product: windows
detection:
  where_exe:
  - Image|endswith: '\where.exe'
  - OriginalFileName: 'where.exe'
  where_opt:
    CommandLine|contains:
            # Firefox Data
    - 'places.sqlite'
    - 'cookies.sqlite'
    - 'formhistory.sqlite'
    - 'logins.json'
    - 'key4.db'
    - 'key3.db'
    - 'sessionstore.jsonlz4'
            # Chrome Data
    - 'History'
    - 'Bookmarks'
    - 'Cookies'
    - 'Login Data'
  condition: all of where_*
falsepositives:
- Unknown
level: low
notes: |
  n
  ### Technical Context
  The "Suspicious Where Execution" Sigma rule is designed to detect potential reconnaissance activity by looking for instances where the "where.exe" executable is utilized to enumerate browser bookmark files and other sensitive data stored by popular web browsers. By examining the command line parameters and original filename associated with "where.exe," the rule identifies attempts to access specific browser databases that may contain personal information about users' interests, financial sites, social media, and internal network resources. This type of activity could imply an adversary's effort to discover valuable information in order to further exploit compromised hosts. The rule is associated with the MITRE ATT&CK tactic "Discovery" and the technique T1217, focusing on uncovering browser data that could be beneficial for malicious purposes.
  ### Investigation Steps
  - **Check Process Creation Logs**: Investigate the process creation logs in your EDR solution for instances of "where.exe" being executed alongside the identified command line parameters. Focus on timestamps and the associated user accounts to determine if the activity aligns with legitimate usage.
    
  - **Inspect Browser Data Access**: Search through the system logs for activity related to accessing the specific browser files mentioned in the command line parameters (e.g., "places.sqlite", "History", "Bookmarks"). This can help ascertain whether the access was initiated by a legitimate user or an unauthorized entity.
    
  - **Correlate with User Activity**: Review User Account and VPN logs to correlate the identified process execution with legitimate user activities. Check if any recent account compromises or suspicious logins exist that might explain the flag being raised.
    
  - **Conduct a File Integrity Check**: Utilize file integrity monitoring tools to confirm whether any suspicious modifications or access patterns have occurred to the relevant browser files in tandem with the "where.exe" execution. This can help in identifying potential exfiltration activities.
  ### Prioritization
  The alert is classified with a low severity level since the detection of this specific rule does not directly indicate a breach but rather suggests potential reconnaissance efforts. However, its relevance should not be dismissed, as enumerating browser data can lead to more severe attacks if not investigated promptly.
  ### Blind Spots and Assumptions
  This rule might not trigger if the adversary executes "where.exe" using a different filename or if command line arguments do not match the specified patterns. Additionally, if the browser data files have been renamed or moved, it could result in missed detections. The rule assumes access to standard event logs and operational systems without manipulations that might affect normal logging behavior. Furthermore, if thorough auditing and monitoring practices are not enforced, there might be a lack of visibility into potential malicious activities.
  > **Disclaimer:** This investigation guide was created using generative AI technology and has not been reviewed for its accuracy and relevance. While every effort has been made to ensure its quality, we recommend validating the content and adapting it to suit specific environment and operational needs. Please communicate any changes to the detection engineering team.
