title: MsiExec Web Install
id: f7b5f842-a6af-4da5-9e95-e32478f3cd2f
related:
- id: 8150732a-0c9d-4a99-82b9-9efb9b90c40c
  type: similar
status: test
description: Detects suspicious msiexec process starts with web addresses as parameter
references:
- https://blog.trendmicro.com/trendlabs-security-intelligence/attack-using-windows-installer-msiexec-exe-leads-lokibot/
author: Florian Roth (Nextron Systems)
date: 2018-02-09
modified: 2022-01-07
tags:
- attack.defense-evasion
- attack.t1218.007
- attack.command-and-control
- attack.t1105
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|contains|all:
    - ' msiexec'
    - '://'
  condition: selection
falsepositives:
- False positives depend on scripts and administrative tools used in the monitored
  environment
level: medium
notes: |
  ### Technical Context
  The "MsiExec Web Install" detection rule is designed to identify potentially malicious use of the Windows Installer service (msiexec.exe) where it is invoked with internet-based web addresses as parameters. Attackers often exploit msiexec to execute remote code or download malware packages directly from the internet, taking advantage of its legitimacy as a system service. This rule monitors process creation logs, specifically looking for command line arguments that include both "msiexec" and "://", signaling the execution of installation commands that originate from web resources. By correlating these indicators, the rule aims to mitigate threats associated with command-and-control (C2) communications and other forms of defense evasion utilized by adversaries.
  ### Investigation Steps
  - Review recent process creation logs in the EDR for msiexec.exe executions that were launched with command lines containing "://".
  - Analyze the source of the requests made by msiexec using network log data to determine if any malicious URLs or IP addresses were reached.
  - Check other logs (e.g., firewall or proxy) to trace the traffic generated by the msiexec process and evaluate if there were any unauthorized outbound connections made.
  - If applicable, cross-reference alerts with AV/EDR detections to identify any known malware signatures or malicious patterns related to the executed installations.
