title: Suspicious X509Enrollment - Ps Script
id: 504d63cb-0dba-4d02-8531-e72981aace2c
related:
- id: 114de787-4eb2-48cc-abdb-c0b449f93ea4
  type: similar
status: test
description: Detect use of X509Enrollment
references:
- https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse?slide=42
- https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse?slide=41
- https://learn.microsoft.com/en-us/dotnet/api/microsoft.hpc.scheduler.store.cx509enrollmentwebclassfactoryclass?view=hpc-sdk-5.1.6115
author: frack113
date: 2022-12-23
tags:
- attack.defense-evasion
- attack.t1553.004
logsource:
  product: windows
  category: ps_script
  definition: 'Requirements: Script Block Logging must be enabled'
detection:
  selection:
    ScriptBlockText|contains:
    - 'X509Enrollment.CBinaryConverter'
    - '884e2002-217d-11da-b2a4-000e7bbb2b09'
  condition: selection
falsepositives:
- Legitimate administrative script
level: medium
notes: |
  ### Technical Context
  The "Suspicious X509Enrollment 
  - Ps Script" Sigma rule is designed to identify suspicious PowerShell script activity involving the `X509Enrollment` class, which is commonly used for certificate management. The rule specifically looks for script blocks that contain the term `X509Enrollment.CBinaryConverter` or a specific GUID associated with certificate enrollment. This detection primarily utilizes PowerShell script block logging data as a source, which must be enabled on Windows systems to capture these activities effectively. By analyzing these logs, security teams can proactively spot potential misuse of legitimate tools for malicious purposes, such as code injection or creating unauthorized certificates.
  ### Investigation Steps
  - Review the PowerShell execution logs in your EDR for the detected script block content to confirm the context of the command execution.
  - Check for any associated process creation events related to the PowerShell processes that triggered the alert to see if suspicious patterns emerge.
  - Analyze the network activity logs, particularly from the NGFW and Proxy, to identify any unusual outbound connections initiated by the affected host around the time of the alert.
  - Investigate related user accounts to assess for unusual behavior, privilege escalations, or unauthorized access attempts, ensuring to cross-reference with cloud access logs if applicable.
