title: PowerShell Remote Session Creation
id: a0edd39f-a0c6-4c17-8141-261f958e8d8f
status: test
description: |
  Adversaries may abuse PowerShell commands and scripts for execution.
  PowerShell is a powerful interactive command-line interface and scripting environment included in the Windows operating system
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1059.001/T1059.001.md#atomic-test-10---powershell-invoke-downloadcradle
- https://learn.microsoft.com/en-us/powershell/module/microsoft.powershell.core/new-pssession?view=powershell-7.4
author: frack113
date: 2022-01-06
modified: 2023-01-02
tags:
- attack.execution
- attack.t1059.001
logsource:
  product: windows
  category: ps_script
  definition: 'Requirements: Script Block Logging must be enabled'
detection:
  selection:
    ScriptBlockText|contains|all:
    - 'New-PSSession'
    - '-ComputerName '
  condition: selection
falsepositives:
- Legitimate administrative script
level: medium
notes: |
  n
  ### Technical Context
  The "PowerShell Remote Session Creation" detection rule identifies the use of PowerShell commands that may indicate malicious activity, specifically the creation of new remote PowerShell sessions. The rule looks for the `New-PSSession` command, which is commonly employed by attackers to establish remote management sessions on target systems. This behavior, normally used for legitimate administrative tasks, can also be exploited to execute commands or scripts on remote machines without a direct user presence. The rule requires the use of Windows Sysmon logs, particularly monitoring PowerShell script execution activities through `ScriptBlockText`, and necessitates that Script Block Logging be enabled to capture the relevant command details. This behavior correlates with the MITRE ATT&CK framework under the tactic of Execution and technique T1059.001, highlighting its association with PowerShell as an execution method.
  ### Investigation Steps
  - **Check EDR Logs:** Review EDR logs for any unusual PowerShell activity that coincided with the alert timestamp, specifically focusing on process creation logs associating `powershell.exe` with the execution of `New-PSSession`.
  - **Review Script Logs:** Verify the PowerShell script block logs for the full command and context surrounding the alert. Determine if the command was part of a legitimate administrative task or if it appears suspicious.
  - **Investigate Process Tree:** Analyze the process tree for the instance of PowerShell to identify its parent processes and any immediate child processes. This context can help uncover how the command was initiated and whether it has been used in a broader attack strategy.
  - **Correlate with Network Activity:** Check network logs to determine if there is any outbound connection to a remote host following the PowerShell session creation. Such connections could signal exfiltration attempts or command-and-control activity.
  ### Prioritization
  The severity of this alert is considered medium because while not every use of `New-PSSession` indicates malicious intent, it can signify potentially harmful actions, especially if initiated without clear administrative purpose.
  ### Blind Spots and Assumptions
  This rule may not fire if Script Block Logging is disabled, as essential PowerShell activities wouldn't be recorded. Additionally, legitimate administrative scripts using remote PowerShell sessions can generate false positives. Attackers might also obfuscate their commands or suppress logging to evade detection. Understanding the normal environment's PowerShell usage patterns is crucial in mitigating these challenges.
  > **Disclaimer:** This investigation guide was created using generative AI technology and has not been reviewed for its accuracy and relevance. While every effort has been made to ensure its quality, we recommend validating the content and adapting it to suit specific environment and operational needs. Please communicate any changes to the detection engineering team.
