title: Automated Collection Bookmarks Using Get-ChildItem PowerShell
id: e0565f5d-d420-4e02-8a68-ac00d864f9cf
status: test
description: |
  Adversaries may enumerate browser bookmarks to learn more about compromised hosts.
  Browser bookmarks may reveal personal information about users (ex: banking sites, interests, social media, etc.) as well as details about
  internal network resources such as servers, tools/dashboards, or other related infrastructure.
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1217/T1217.md
author: frack113
date: 2021-12-13
modified: 2022-12-25
tags:
- attack.discovery
- attack.t1217
logsource:
  product: windows
  category: ps_script
  definition: 'Requirements: Script Block Logging must be enabled'
detection:
  selection:
    ScriptBlockText|contains|all:
    - 'Get-ChildItem'
    - ' -Recurse '
    - ' -Path '
    - ' -Filter Bookmarks'
    - ' -ErrorAction SilentlyContinue'
    - ' -Force'
  condition: selection
falsepositives:
- Unknown
level: low
notes: |
  ### Technical Context
  This Sigma rule identifies potentially malicious PowerShell commands that may be used by adversaries to enumerate browser bookmarks on Windows systems. The rule specifically looks for the execution of the `Get-ChildItem` cmdlet with parameters that indicate a recursive search for bookmark files, aiming to expose sensitive information about users' online activities or internal resources. Key parameters involved include `-Recurse`, `-Path`, `-Filter Bookmarks`, and `-ErrorAction SilentlyContinue`, which suggest an intent to traverse directories for bookmark files while suppressing errors. For this detection to be effective, Script Block Logging must be enabled to capture these PowerShell script executions.
  ### Investigation Steps
  - Use the EDR to check the timeline of PowerShell activity on affected endpoints, focusing on occurrences of the `Get-ChildItem` command logged during suspicious timeframes.
  - Investigate the command-line parameters and script block logs related to any associated processes to confirm the presence of the specific parameters indicating bookmark enumeration.
  - Review the browser usage logs from the Proxy or network logs to identify any unusual access patterns to bookmarks or related sites that may have been enumerated.
  - Cross-reference user activity and endpoint configurations to determine whether there are legitimate reasons for bookmark enumeration, mitigating potential false positives from the alert.
