title: Execute Invoke-command on Remote Host
id: 7b836d7f-179c-4ba4-90a7-a7e60afb48e6
status: test
description: Adversaries may use Valid Accounts to interact with remote systems using
  Windows Remote Management (WinRM). The adversary may then perform actions as the
  logged-on user.
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1021.006/T1021.006.md#atomic-test-2---invoke-command
- https://learn.microsoft.com/en-us/powershell/module/microsoft.powershell.core/invoke-command?view=powershell-7.4
author: frack113
date: 2022-01-07
tags:
- attack.lateral-movement
- attack.t1021.006
logsource:
  product: windows
  category: ps_script
  definition: 'Requirements: Script Block Logging must be enabled'
detection:
  selection_cmdlet:
    ScriptBlockText|contains|all:
    - 'invoke-command '
    - ' -ComputerName '
  condition: selection_cmdlet
falsepositives:
- Legitimate script
level: medium
notes: |
  ### Technical Context
  This detection rule identifies potential lateral movement by monitoring for the use of the PowerShell `Invoke-Command` cmdlet. Adversaries often use this technique to execute commands on remote systems under the context of valid user accounts, leveraging Windows Remote Management (WinRM) capabilities. The rule specifically looks for script block text containing the `Invoke-Command` keyword along with the `-ComputerName` parameter, indicating that a command is being executed on a remote host. To effectively detect these activities, it relies on the logging of PowerShell script blocks, which must be enabled on the target systems. By flagging such occurrences, the rule helps to highlight potentially malicious interactions that could compromise the security of the network.
  ### Investigation Steps
  - Review the related PowerShell logs in the EDR for instances of `Invoke-Command` and identify the associated `-ComputerName` values to determine where the command was directed.
  - Cross-reference the user account that executed the command with the organization's user access logs to confirm if the account activity aligns with expected behavior.
  - Validate the legitimacy of the script by analyzing the full PowerShell command and any parameters used during execution against known scripts within your environment.
  - Check network traffic logs in NGFW and Proxy to see if there were any unusual connections made to the target `-ComputerName` during the same time frame the command was executed.
