title: Malicious ShellIntel PowerShell Commandlets
id: 402e1e1d-ad59-47b6-bf80-1ee44985b3a7
status: test
description: Detects Commandlet names from ShellIntel exploitation scripts.
references:
- https://github.com/Shellntel/scripts/
author: Max Altgelt (Nextron Systems), Tobias Michalski (Nextron Systems)
date: 2021-08-09
modified: 2023-01-02
tags:
- attack.execution
- attack.t1059.001
logsource:
  product: windows
  category: ps_script
  definition: 'Requirements: Script Block Logging must be enabled'
detection:
  selection:
    ScriptBlockText|contains:
    - 'Invoke-SMBAutoBrute'
    - 'Invoke-GPOLinks'
            # - 'Out-Minidump' # Covered in 89819aa4-bbd6-46bc-88ec-c7f7fe30efa6
    - 'Invoke-Potato'
  condition: selection
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  The detection rule identifies potentially malicious PowerShell commandlets that are commonly associated with exploitation scripts attributed to the ShellIntel framework. By looking for specific commandlet names such as "Invoke-SMBAutoBrute," "Invoke-GPOLinks," and "Invoke-Potato," the rule aims to uncover unauthorized or suspicious PowerShell executions that could indicate an attempt to exploit vulnerabilities in the environment. This detection relies on process creation logs that incorporate script block logging, allowing visibility into the commands being executed via PowerShell. Activation of Script Block Logging is vital to ensure that the relevant details are captured and logged, which subsequently facilitates effective threat detection.
  ### Investigation Steps
  - Review the EDR logs to identify the PowerShell execution context, including the user account and the working directory at the time of execution.
  - Utilize the SIEM to correlate network activity and review logs for any suspicious connections originating from the host that executed the commandlets.
  - Check proxy logs to see if there were any unusual requests made to external domains or services, which may indicate data exfiltration or callback attempts.
  - Inspect cloud activity logs in AWS, GCP, or Azure for any unauthorized or anomalous account activity that might align with the execution of the detected commandlets.
