title: PowerShell Script Change Permission Via Set-Acl - PsScript
id: cae80281-ef23-44c5-873b-fd48d2666f49
related:
- id: 0944e002-e3f6-4eb5-bf69-3a3067b53d73     # ProcCreation Susp
  type: derived
- id: bdeb2cff-af74-4094-8426-724dc937f20a     # ProcCreation Low
  type: derived
- id: 3bf1d859-3a7e-44cb-8809-a99e066d3478     # PsScript High
  type: derived
status: test
description: Detects PowerShell scripts set ACL to of a file or a folder
references:
- https://github.com/redcanaryco/atomic-red-team/blob/74438b0237d141ee9c99747976447dc884cb1a39/atomics/T1505.005/T1505.005.md
author: frack113, Nasreddine Bencherchali (Nextron Systems)
date: 2023-07-18
tags:
- attack.defense-evasion
- attack.t1222
logsource:
  product: windows
  category: ps_script
  definition: bade5735-5ab0-4aa7-a642-a11be0e40872
detection:
  selection:
    ScriptBlockText|contains|all:
    - 'Set-Acl '
    - '-AclObject '
    - '-Path '
  condition: selection
falsepositives:
- Unknown
level: low
notes: |
  ### Technical Context
  This detection rule targets potentially malicious activity involving PowerShell scripts that modify the access control list (ACL) of files or folders using the `Set-Acl` command. It specifically looks for scripts containing the keywords 'Set-Acl', '-AclObject', and '-Path', indicating a modification of permissions that could be part of a defensive evasion tactic by an attacker. The relevant log source for this rule is the PowerShell script event logs collected from Windows environments, which provide insights into command execution and parameters used. Given the nature of this command, modification of ACLs can be indicative of attempts to escalate privileges or manipulate file access control for malicious purposes.
  ### Investigation Steps
  - Use EDR tools to review the execution context of the detected PowerShell script, noting the user account and any command-line arguments associated with the activity.
  - Examine process creation logs to trace the parent-child relationship of processes involved in the PowerShell execution for potential signs of lateral movement or exploitation.
  - Query your SIEM for any related alerts or anomalies preceding the PowerShell execution to uncover any suspicious activity that may have led to the use of the ACL modification.
  - Review system logs and file access logs around the time of the incident to ascertain the impact of the ACL change on file access and potential data exfiltration activities.
