title: Get-ADUser Enumeration Using UserAccountControl Flags
id: 96c982fe-3d08-4df4-bed2-eb14e02f21c8
status: test
description: Detects AS-REP roasting is an attack that is often-overlooked. It is
  not very common as you have to explicitly set accounts that do not require pre-authentication.
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1069.002/T1069.002.md#atomic-test-11---get-aduser-enumeration-using-useraccountcontrol-flags-as-rep-roasting
- https://shellgeek.com/useraccountcontrol-flags-to-manipulate-properties/
author: frack113
date: 2022-03-17
tags:
- attack.discovery
- attack.t1033
logsource:
  product: windows
  category: ps_script
  definition: 'Requirements: Script Block Logging must be enabled'
detection:
  selection:
        # 4194304 DONT_REQ_PREAUTH
    ScriptBlockText|contains|all:
    - 'Get-ADUser'
    - '-Filter'
    - 'useraccountcontrol'
    - '-band'
    - '4194304'
  condition: selection
falsepositives:
- Legitimate PowerShell scripts
level: medium
notes: |
  ### Technical Context
  This Sigma rule is designed to detect potential enumeration attacks on Active Directory (AD) users, specifically targeting a technique known as AS-REP roasting. The detection focuses on the use of PowerShell commands that manipulate UserAccountControl flags in a way that indicates an attempt to identify user accounts that do not require pre-authentication. The rule looks for the execution of the `Get-ADUser` cmdlet with parameters that query UserAccountControl flags, particularly filtering for the value `4194304`, which represents accounts that allow such attacks. The data source for this rule is Windows PowerShell script block logging, which must be enabled for effective monitoring.
  ### Investigation Steps
  - Use your EDR tool to search for any PowerShell script block logs that contain the `Get-ADUser` command along with the `
  - band 4194304` parameters. Review the context of the execution to assess if it was initiated by an authorized or unauthorized user.
  - Analyze the system and user account activity in the logs to check for any other related inquiries or suspicious behavior leading up to the execution of the command, particularly focusing on account status changes or repeated queries.
  - Confirm whether the target accounts flagged by this rule are indeed legitimate and verify whether they have been configured to not require pre-authentication through AD user attributes.
  - Review firewall and proxy logs for any external connections or downloads that may coincide with the detected activities, which could indicate further malicious intent or exploitation.
