title: Suspicious Get Local Groups Information - PowerShell
id: fa6a5a45-3ee2-4529-aa14-ee5edc9e29cb
status: test
description: |
  Adversaries may attempt to find local system groups and permission settings.
  The knowledge of local system permission groups can help adversaries determine which groups exist and which users belong to a particular group.
  Adversaries may use this information to determine which users have elevated permissions, such as the users found within the local administrators group.
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1069.001/T1069.001.md
author: frack113
date: 2021-12-12
modified: 2022-11-25
tags:
- attack.discovery
- attack.t1069.001
logsource:
  product: windows
  category: ps_script
  definition: 'Requirements: Script Block Logging must be enabled'
detection:
  test_3:
    ScriptBlockText|contains:
    - 'get-localgroup'
    - 'Get-LocalGroupMember'
  test_6:
    ScriptBlockText|contains|all:
    - 'Get-WMIObject'
    - 'Win32_Group'
  condition: 1 of test_*
falsepositives:
- Unknown
level: low
notes: |
  ### Technical Context
  This detection rule focuses on identifying potentially malicious use of PowerShell commands that aim to discover local system groups and their membership, particularly focusing on elevated permissions. The rule looks for specific patterns in PowerShell Script Block Logging that may indicate an adversary's reconnaissance efforts. By monitoring for commands such as `get-localgroup` and `Get-LocalGroupMember`, as well as the use of `Get-WMIObject` to query `Win32_Group`, the detection aims to uncover attempts to discern user group memberships. This insight can reveal which users have administrative privileges and are therefore of interest to threat actors.
  To ensure effective detection, this rule relies on Windows event logging, specifically requiring Script Block Logging to be enabled. This capability allows for capturing detailed information about executed PowerShell scripts, enabling the monitoring of suspicious commands that might suggest unauthorized or malicious activity on the network.
  ### Investigation Steps
  - Review the EDR logs for any recent instances of PowerShell execution that include the flagged commands related to group membership inquiries.
  - Check for correlated events in the SIEM, including other indicators of suspicious activities around the same timeframe, to establish the context of the detected behavior.
  - Utilize Windows Event logs to gather additional information about user accounts, including any associated logins or processes that occurred around the time of the detected activity.
  - Analyze any web traffic through the Proxy logs to identify if there were any outbound connections or suspicious downloads initiated by the same user or host.
