title: Add Windows Capability Via PowerShell Script
id: 155c7fd5-47b4-49b2-bbeb-eb4fab335429
related:
- id: b36d01a3-ddaf-4804-be18-18a6247adfcd
  type: similar
status: test
description: Detects usage of the "Add-WindowsCapability" cmdlet to add Windows capabilities.
  Notable capabilities could be "OpenSSH" and others.
references:
- https://learn.microsoft.com/en-us/windows-server/administration/openssh/openssh_install_firstuse?tabs=powershell
- https://www.virustotal.com/gui/file/af1c82237b6e5a3a7cdbad82cc498d298c67845d92971bada450023d1335e267/content
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023-01-22
modified: 2023-05-09
tags:
- attack.execution
logsource:
  product: windows
  category: ps_script
  definition: 'Requirements: Script Block Logging must be enabled'
detection:
  selection_cmdlet:
    ScriptBlockText|contains: 'Add-WindowsCapability '
  selection_capa:
    ScriptBlockText|contains: '-Name OpenSSH.'     # For both "OpenSSH.Server" and "OpenSSH.Client"
  condition: all of selection_*
falsepositives:
- Legitimate usage of the capabilities by administrators or users. Add additional
  filters accordingly.
level: medium
notes: |
  ### Technical Context
  This detection rule focuses on the usage of the PowerShell cmdlet `Add-WindowsCapability`, which allows the addition of features or capabilities to Windows operating systems. The rule specifically looks for instances where this cmdlet is used to add notable capabilities such as OpenSSH, which can provide remote access functionalities. To effectively detect this activity, the rule relies on script block logging, where the logs capture PowerShell script execution including command parameters and cmdlets utilized. By monitoring the `ScriptBlockText` for specific strings related to `Add-WindowsCapability`, security teams can identify potentially unauthorized attempts to modify the system's capabilities, flagging them for further investigation.
  ### Investigation Steps
  - Review PowerShell logs in the EDR solution to identify the context of the `Add-WindowsCapability` cmdlet execution, noting when and by whom it was invoked. 
  - Investigate related process creation events to observe the parent-child relationships and ensure that the command was not initiated by an unexpected source.
  - Check the access logs in the Windows Event Viewer for any modifications or changes to capabilities that coincide with the timing of the detection alert.
  - Validate user permissions by reviewing the identity and role of the account that executed the command to ensure it aligns with expected administrative behaviors.
