title: Powershell Add Name Resolution Policy Table Rule
id: 4368354e-1797-463c-bc39-a309effbe8d7
status: test
description: |
  Detects powershell scripts that adds a Name Resolution Policy Table (NRPT) rule for the specified namespace.
  This will bypass the default DNS server and uses a specified server for answering the query.
references:
- https://twitter.com/NathanMcNulty/status/1569497348841287681
- https://learn.microsoft.com/en-us/powershell/module/dnsclient/add-dnsclientnrptrule?view=windowsserver2022-ps
author: Borna Talebi
date: 2021-09-14
modified: 2022-10-09
tags:
- attack.impact
- attack.t1565
logsource:
  product: windows
  category: ps_script
  definition: 'Requirements: Script Block Logging must be enabled'
detection:
  selection:
    ScriptBlockText|contains|all:
    - 'Add-DnsClientNrptRule'
    - '-Namesp'
    - '-NameSe'
  condition: selection
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This detection rule identifies the execution of PowerShell scripts that utilize the `Add-DnsClientNrptRule` cmdlet to modify the Name Resolution Policy Table (NRPT). The NRPT is a security feature in Windows that can be leveraged to influence DNS resolution by directing queries to a specified DNS server for particular namespaces, potentially bypassing the organization’s default DNS settings. This behavior can be indicative of malicious activity, like DNS tunneling or circumvention of security measures, and can be detected through process creation logs and script block logging. To trigger the rule, the script must contain specific parameters associated with the `Add-DnsClientNrptRule` cmdlet.
  ### Investigation Steps
  - Review the PowerShell script execution logs within the EDR to assess the context of the command and identify the user or process that initiated it.
  - Analyze related network logs to confirm if any unusual DNS queries are being resolved against unexpected external servers.
  - Investigate the configuration and history of the affected systems to determine if any unauthorized changes were made to DNS settings or the NRPT.
  - Check for any abnormal behavior or alerts generated by the AV or NGFW that could provide further context around the use of this PowerShell command.
