title: Password Policy Discovery With Get-AdDefaultDomainPasswordPolicy
id: bbb9495b-58fc-4016-b9df-9a3a1b67ca82
status: test
description: Detetcts PowerShell activity in which Get-Addefaultdomainpasswordpolicy
  is used to get the default password policy for an Active Directory domain.
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1201/T1201.md#atomic-test-9---enumerate-active-directory-password-policy-with-get-addefaultdomainpasswordpolicy
- https://learn.microsoft.com/en-us/powershell/module/activedirectory/get-addefaultdomainpasswordpolicy?view=windowsserver2022-ps
author: frack113
date: 2022-03-17
tags:
- attack.discovery
- attack.t1201
logsource:
  product: windows
  category: ps_script
  definition: 'Requirements: Script Block Logging must be enabled'
detection:
  selection:
    ScriptBlockText|contains: Get-AdDefaultDomainPasswordPolicy
  condition: selection
falsepositives:
- Legitimate PowerShell scripts
level: low
notes: |
  ### Technical Context
  This Sigma rule is designed to detect the usage of the PowerShell command `Get-AdDefaultDomainPasswordPolicy`, which can reveal the default password policy settings for an Active Directory (AD) domain. The detection methodology relies on monitoring PowerShell script block logs to identify instances where this specific command is executed. When executed, it can provide an attacker with valuable information about the domain’s security posture, especially in relation to password management. To effectively utilize this rule, it's crucial that script block logging is enabled on monitored systems, as this feature captures the PowerShell commands being run in a detailed format. 
  The primary data source for this detection is Windows PowerShell script block logs, which record the actions taken within PowerShell, including the command used, parameters passed, and the execution context. The rule’s low alert level indicates that while this may be part of routine administrative activities, it necessitates investigation to rule out any unauthorized exploration of domain security settings.
  ### Investigation Steps
  - Review the PowerShell script block logs in the EDR tool to identify the context and source of the `Get-AdDefaultDomainPasswordPolicy` command execution.
  - Check the execution history of the user account involved in the alert by querying the relevant system or user activity logs in the SIEM for additional suspicious or anomalous behavior.
  - Consult the Active Directory logs for any related activities during the same time frame to determine if there were other commands executed that could indicate an exploration for weaknesses.
  - Assess any recent changes to the organization's password policies within Active Directory to differentiate between legitimate administrative tasks and potential malicious activities.
