title: Suspicious PowerShell Mailbox Export to Share - PS
id: 4a241dea-235b-4a7e-8d76-50d817b146c4
related:
- id: 889719ef-dd62-43df-86c3-768fb08dc7c0
  type: derived
status: test
description: Detects usage of the powerShell New-MailboxExportRequest Cmdlet to exports
  a mailbox to a remote or local share, as used in ProxyShell exploitations
references:
- https://youtu.be/5mqid-7zp8k?t=2481
- https://blog.orange.tw/2021/08/proxylogon-a-new-attack-surface-on-ms-exchange-part-1.html
- https://peterjson.medium.com/reproducing-the-proxyshell-pwn2own-exploit-49743a4ea9a1
- https://m365internals.com/2022/10/07/hunting-in-on-premises-exchange-server-logs/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-10-26
tags:
- attack.exfiltration
logsource:
  product: windows
  category: ps_script
  definition: 'Requirements: Script Block Logging must be enabled'
detection:
  selection:
    ScriptBlockText|contains|all:
    - 'New-MailboxExportRequest'
    - ' -Mailbox '
    - ' -FilePath \\\\'
  condition: selection
fields:
- CommandLine
- ParentCommandLine
falsepositives:
- Unknown
level: critical
notes: |
  ### Technical Context
  This detection rule identifies suspicious PowerShell activity related to mailbox exports from Microsoft Exchange servers. Specifically, it looks for the execution of the `New-MailboxExportRequest` cmdlet, which is commonly used to export mailboxes to either remote or local file shares. The presence of a file path that begins with a double backslash (e.g., `\\`) indicates an attempt to export data to a network share, which may correlate to attacks exploiting vulnerabilities like ProxyShell. The rule is designed to trigger alerts when this specific command is detected in PowerShell script block logs, provided that script block logging is enabled on the system. The underlying data sources involve process execution logs where command-line parameters and parent command-line details can provide additional context for investigators.
  ### Investigation Steps
  - Review the PowerShell execution logs in the EDR system to locate instances of the `New-MailboxExportRequest` cmdlet being executed during the specified time frame.
  - Investigate the command-line parameters and parent command-line context to identify the account or process that initiated the export request.
  - Check the network logs and file share access records to determine if there were any unauthorized access attempts to the specified remote share during the same period.
  - Analyze user activity logs or alerts from the SIEM to assess if the account associated with the export request has a history of suspicious behavior or if it has been flagged for any anomalies.
