title: PowerShell Deleted Mounted Share
id: 66a4d409-451b-4151-94f4-a55d559c49b0
status: test
description: Detects when when a mounted share is removed. Adversaries may remove
  share connections that are no longer useful in order to clean up traces of their
  operation
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1070.005/T1070.005.md
author: 'oscd.community, @redcanary, Zach Stanford @svch0st'
date: 2020-10-08
modified: 2022-12-25
tags:
- attack.defense-evasion
- attack.t1070.005
logsource:
  product: windows
  category: ps_script
  definition: 'Requirements: Script Block Logging must be enabled'
detection:
  selection:
    ScriptBlockText|contains:
    - 'Remove-SmbShare'
    - 'Remove-FileShare'
  condition: selection
falsepositives:
- Administrators or Power users may remove their shares via cmd line
level: medium
notes: |
  ### Technical Context
  This Sigma rule is designed to detect instances where a mounted share is deleted using PowerShell commands, specifically `Remove-SmbShare` or `Remove-FileShare`. Such actions are often employed by adversaries to erase evidence of their activities, thereby evading detection. The rule relies on data collected from Windows Script Block Logging, which captures detailed information about the scripts executed, including the command line parameters used. In an incident response context, recognizing the removal of mounted shares can be crucial, as it may indicate an attempt to obscure malicious actions on a compromised system.
  To effectively utilize this rule, ensure that Script Block Logging is enabled within your organization's Windows environments, as this is a prerequisite for capturing the relevant log entries. Analyzing these logs will help differentiate between legitimate administrative actions and potential malicious activities.
  ### Investigation Steps
  - Review recent PowerShell execution logs within the EDR tool to identify the context around the execution of `Remove-SmbShare` or `Remove-FileShare` commands.
  - Correlate the timestamps of the detected share removals with other logged activities, such as user logins or related system changes, to establish a timeline of events.
  - Check for additional indicators of compromise in the environment by examining the network traffic logs through the NDR tool to determine if there were any unusual connections around the same time.
  - Consult the user activity logs from the SIEM to identify any potentially malicious user behavior or unusual access patterns that may coincide with the share removal events.
