title: PowerShell ADRecon Execution
id: bf72941a-cba0-41ea-b18c-9aca3925690d
status: test
description: Detects execution of ADRecon.ps1 for AD reconnaissance which has been
  reported to be actively used by FIN7
references:
- https://github.com/sense-of-security/ADRecon/blob/11881a24e9c8b207f31b56846809ce1fb189bcc9/ADRecon.ps1
- https://bi-zone.medium.com/from-pentest-to-apt-attack-cybercriminal-group-fin7-disguises-its-malware-as-an-ethical-hackers-c23c9a75e319
author: Bhabesh Raj
date: 2021-07-16
modified: 2022-09-06
tags:
- attack.discovery
- attack.execution
- attack.t1059.001
logsource:
  product: windows
  category: ps_script
  definition: 'Requirements: Script Block Logging must be enabled'
detection:
  selection:
    ScriptBlockText|contains:
    - 'Function Get-ADRExcelComOb'
    - 'Get-ADRGPO'
    - 'Get-ADRDomainController'
    - 'ADRecon-Report.xlsx'         # Default
  condition: selection
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  The Sigma rule titled "PowerShell ADRecon Execution" is designed to detect the use of the PowerShell script "ADRecon.ps1," which is known for performing Active Directory reconnaissance. This script includes various functions aimed at gathering information about Active Directory environments, such as domain controllers and Group Policy Objects (GPOs). The detection relies on monitoring PowerShell script block logs, specifically looking for snippets of code that pertain to the execution of common functions found within the ADRecon script. The requirement for this rule to be effective is that Script Block Logging must be enabled on the monitored systems to capture the relevant information.
  This rule is particularly critical due to its association with the threat actor group FIN7, which has utilized the ADRecon script in their campaigns. By identifying the execution of this script, the SOC can potentially uncover ongoing reconnaissance activities within the network, enabling faster responses to potential security breaches.
  ### Investigation Steps
  - Utilize your EDR solution to query for any recent PowerShell executions, filtering specifically for instances involving "ADRecon.ps1" or related script blocks.
  - Review the execution context of the detected PowerShell activity, including user accounts and the originating process to determine if the execution was legitimate or suspicious.
  - Cross-reference alerts with network traffic logs from the NGFW or NDR systems to identify any unusual outbound connections or data exfiltration attempts that may correlate with the reconnaissance activity.
  - Leverage cloud logs from AWS, GCP, or Azure if applicable, to investigate any associated activities or resources that may connect to the PowerShell execution and further assess the impact.
