title: AD Groups Or Users Enumeration Using PowerShell - ScriptBlock
id: 88f0884b-331d-403d-a3a1-b668cf035603
status: test
description: |
  Adversaries may attempt to find domain-level groups and permission settings.
  The knowledge of domain-level permission groups can help adversaries determine which groups exist and which users belong to a particular group.
  Adversaries may use this information to determine which users have elevated permissions, such as domain administrators.
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1069.002/T1069.002.md
author: frack113
date: 2021-12-15
modified: 2022-12-25
tags:
- attack.discovery
- attack.t1069.001
logsource:
  product: windows
  category: ps_script
  definition: 'Requirements: Script Block Logging must be enabled'
detection:
  test_2:
    ScriptBlockText|contains: get-ADPrincipalGroupMembership
  test_7:
    ScriptBlockText|contains|all:
    - get-aduser
    - '-f '
    - '-pr '
    - DoesNotRequirePreAuth
  condition: 1 of test_*
falsepositives:
- Unknown
level: low
notes: |
  ### Technical Context
  This detection rule identifies potentially malicious use of PowerShell to enumerate Active Directory (AD) groups and users which can be indicative of reconnaissance activity by adversaries. The rule looks for specific script block commands that are commonly used for querying AD, such as `get-ADPrincipalGroupMembership` and `get-aduser`, along with key parameters that could signal an attempt to list groups or users without requiring pre-authentication. Collectively, these actions can indicate reconnaissance efforts aimed at identifying targets with elevated permissions or gathering information on domain structures. The effective monitoring of such activities requires that Script Block Logging be enabled within the Windows environment to capture these command invocations.
  ### Investigation Steps
  - Review recent PowerShell execution logs on endpoints using your EDR tool to identify instances where the `get-ADPrincipalGroupMembership` or `get-aduser` commands were executed. 
  - Assess the user accounts associated with the PowerShell executions to determine if they are legitimate administrative accounts or if they exhibit signs of compromise.
  - Check Active Directory logs for any unusual account activity or failed logon attempts that may indicate a security breach aimed at gathering sensitive group membership information.
  - Utilize SIEM solutions to correlate alerts based on the execution of these commands with other potential indicators of compromise, such as unusual outbound network connections or lateral movement patterns.
