title: AADInternals PowerShell Cmdlets Execution - PsScript
id: 91e69562-2426-42ce-a647-711b8152ced6
related:
- id: c86500e9-a645-4680-98d7-f882c70c1ea3
  type: similar
status: test
description: Detects ADDInternals Cmdlet execution. A tool for administering Azure
  AD and Office 365. Which can be abused by threat actors to attack Azure AD or Office
  365.
references:
- https://o365blog.com/aadinternals/
- https://github.com/Gerenios/AADInternals
author: Austin Songer (@austinsonger), Nasreddine Bencherchali (Nextron Systems),
  Swachchhanda Shrawan Poudel (Nextron Systems)
date: 2022-12-23
modified: 2025-02-06
tags:
- attack.execution
- attack.reconnaissance
- attack.discovery
- attack.credential-access
- attack.impact
logsource:
  product: windows
  category: ps_script
  definition: Script Block Logging must be enable
detection:
  selection:
    ScriptBlockText|contains:
            # Since most of the cmdlets use a unique enough string which is "-AADInt" we only used that portion. For a complete list please check the references linked above
    - 'Add-AADInt'
    - 'ConvertTo-AADInt'
    - 'Disable-AADInt'
    - 'Enable-AADInt'
    - 'Export-AADInt'
    - 'Find-AADInt'
    - 'Get-AADInt'
    - 'Grant-AADInt'
    - 'Initialize-AADInt'
    - 'Install-AADInt'
    - 'Invoke-AADInt'
    - 'Join-AADInt'
    - 'New-AADInt'
    - 'Open-AADInt'
    - 'Read-AADInt'
    - 'Register-AADInt'
    - 'Remove-AADInt'
    - 'Reset-AADInt'
    - 'Resolve-AADInt'
    - 'Restore-AADInt'
    - 'Save-AADInt'
    - 'Search-AADInt'
    - 'Send-AADInt'
    - 'Set-AADInt'
    - 'Start-AADInt'
    - 'Unprotect-AADInt'
    - 'Update-AADInt'
  condition: selection
falsepositives:
- Legitimate use of the library for administrative activity
level: high
notes: |
  ### Technical Context
  This detection rule identifies the execution of specific Azure AD Internals PowerShell cmdlets that may indicate unauthorized or malicious activity. AADInternals is a set of tools designed for managing Azure Active Directory and Office 365 environments, but threat actors can exploit these cmdlets to gain unauthorized access or exfiltrate sensitive information. The rule leverages Script Block Logging on Windows systems to monitor and catch command executions that contain specific cmdlet identifiers, all starting with the string "-AADInt." By analyzing logs that capture PowerShell script execution, the rule aims to detect potential misuse of these powerful commands, which could signal a compromise or attack on Azure resources.
  ### Investigation Steps
  - Review the EDR logs for the timestamps of the alert to identify the user account associated with the execution of the cmdlets and check for unusual behavior or privilege escalation.
  - Cross-reference the PowerShell execution logs with Azure AD logs to verify if there were any unauthorized changes or accesses to sensitive resources around the same time.
  - Analyze any related network logs from the firewall or proxy to determine if there were unusual outbound connections or attempts to access external resources during the execution of the cmdlets.
  - Consult threat intelligence sources and the provided references to assess the legitimacy of the cmdlet usage and if the activity aligns with known good operational practices.
