title: Suspicious PowerShell Invocations - Specific
id: ae7fbf8e-f3cb-49fd-8db4-5f3bed522c71
related:
- id: fce5f582-cc00-41e1-941a-c6fabf0fdb8c
  type: obsolete
- id: 8ff28fdd-e2fa-4dfa-aeda-ef3d61c62090
  type: similar
- id: 536e2947-3729-478c-9903-745aaffe60d2
  type: similar
status: test
description: Detects suspicious PowerShell invocation command parameters
references:
- Internal Research
author: Florian Roth (Nextron Systems), Jonhnathan Ribeiro
date: 2017-03-05
modified: 2023-01-05
tags:
- attack.execution
- attack.t1059.001
logsource:
  product: windows
  category: ps_script
  definition: 'Requirements: Script Block Logging must be enabled'
detection:
  selection_convert_b64:
    ScriptBlockText|contains|all:
    - '-nop'
    - ' -w '
    - 'hidden'
    - ' -c '
    - '[Convert]::FromBase64String'
  selection_iex_selection:
    ScriptBlockText|contains|all:
    - ' -w '
    - 'hidden'
    - '-noni'
    - '-nop'
    - ' -c '
    - 'iex'
    - 'New-Object'
  selection_enc_selection:
    ScriptBlockText|contains|all:
    - ' -w '
    - 'hidden'
    - '-ep'
    - 'bypass'
    - '-Enc'
  selection_reg_selection:
    ScriptBlockText|contains|all:
    - 'powershell'
    - 'reg'
    - 'add'
    - 'HKCU\software\microsoft\windows\currentversion\run'
  selection_webclient_selection:
    ScriptBlockText|contains|all:
    - 'bypass'
    - '-noprofile'
    - '-windowstyle'
    - 'hidden'
    - 'new-object'
    - 'system.net.webclient'
    - '.download'
  selection_iex_webclient:
    ScriptBlockText|contains|all:
    - 'iex'
    - 'New-Object'
    - 'Net.WebClient'
    - '.Download'
  filter_chocolatey:
    ScriptBlockText|contains:
    - "(New-Object System.Net.WebClient).DownloadString('https://community.chocolatey.org/install.ps1"
    - "(New-Object System.Net.WebClient).DownloadString('https://chocolatey.org/install.ps1')"
    - 'Write-ChocolateyWarning'
  condition: 1 of selection_* and not 1 of filter_*
falsepositives:
- Unknown
level: high
notes: |
  n
  ### Technical Context
  This detection rule targets suspicious invocations of PowerShell scripts that may indicate potential malicious behavior. Specifically, it identifies command parameters related to script execution that are commonly employed by adversaries to obfuscate their activities. The rule examines PowerShell script block logs that contain certain keywords suggesting encoded or hidden commands, such as `-nop`, `-w`, `hidden`, `-c`, and variations of script downloading methods, indicating possible attempts to execute malicious scripts. Additionally, the rule filters out calls related to Chocolatey, a legitimate package manager, to minimize false positives. This detection aligns with the MITRE ATT&CK tactic of **Execution** and technique **T1059.001: Command and Scripting Interpreter: Windows PowerShell**.
  ### Investigation Steps
  - **Examine PowerShell Logs:** Utilize the EDR tool to investigate the PowerShell command line and script block logs mentioned in the alert for context on the specific invocation that triggered the alert.
  - **Review Process Tree:** Look into the process tree surrounding the PowerShell execution to identify any parent processes that may indicate how the PowerShell script was initiated.
  - **Check for Persistence Mechanisms:** Investigate registry changes or file modifications within `HKCU\software\microsoft\windows\currentversion\run` to ascertain if there is an attempt for persistence linked to the suspicious PowerShell activity.
  - **Analyze Network Activity:** Use network logs from the NDR or firewall to review any outbound connections that may link back to the PowerShell commands, such as downloads from suspicious URLs.
  ### Prioritization
  Given the ability of PowerShell to execute scripts and commands that can lead to significant security threats, alerts triggered by this rule should be treated with high priority. The nature of the parameters being monitored indicates a nuanced method of executing potentially malicious commands, warranting prompt attention from the incident response team.
  ### Blind spots and Assumptions
  This rule assumes that script block logging is enabled; if it is not, the rule may fail to trigger. Additionally, the effectiveness of this rule may be limited if an adversary employs highly sophisticated obfuscation techniques beyond those identified in the current selection queries. Furthermore, legitimate administrative tasks or scripts may inadvertently trigger the alert if they use the same parameters that the rule monitors.
  > **Disclaimer:** This investigation guide was created using generative AI technology and has not been reviewed for its accuracy and relevance. While every effort has been made to ensure its quality, we recommend validating the content and adapting it to suit specific environment and operational needs. Please communicate any changes to the detection engineering team.
