title: Certificate Exported Via PowerShell - ScriptBlock
id: aa7a3fce-bef5-4311-9cc1-5f04bb8c308c
related:
- id: 9e716b33-63b2-46da-86a4-bd3c3b9b5dfb
  type: similar
status: test
description: Detects calls to cmdlets inside of PowerShell scripts that are used to
  export certificates from the local certificate store. Threat actors were seen abusing
  this to steal private keys from compromised machines.
references:
- https://us-cert.cisa.gov/ncas/analysis-reports/ar21-112a
- https://learn.microsoft.com/en-us/powershell/module/pki/export-pfxcertificate?view=windowsserver2022-ps
- https://www.splunk.com/en_us/blog/security/breaking-the-chain-defending-against-certificate-services-abuse.html
author: Florian Roth (Nextron Systems)
date: 2021-04-23
modified: 2023-05-18
tags:
- attack.credential-access
- attack.t1552.004
logsource:
  product: windows
  category: ps_script
  definition: 'Requirements: Script Block Logging must be enabled'
detection:
  selection:
    ScriptBlockText|contains:
    - 'Export-PfxCertificate'
    - 'Export-Certificate'
  filter_optional_module_export:
    ScriptBlockText|contains: 'CmdletsToExport = @('
  condition: selection and not 1 of filter_optional_*
falsepositives:
- Legitimate certificate exports by administrators. Additional filters might be required.
level: medium
notes: |
  ### Technical Context
  This Sigma rule is designed to detect suspicious PowerShell activity related to the export of certificates from the local certificate store. Threat actors may exploit PowerShell commands to extract sensitive data, such as private keys, from compromised machines. The rule specifically looks for instances where cmdlets like `Export-PfxCertificate` or `Export-Certificate` are invoked within PowerShell scripts. To successfully trigger this rule, it requires that Script Block Logging be enabled, allowing the observation of PowerShell commands in execution. Analysts should note that while this rule identifies potential malicious behavior, legitimate administrative tasks can also trigger alerts.
  ### Investigation Steps
  - Investigate the alert in the EDR to identify the user account that executed the PowerShell command and check for any associated anomalous behavior during that session.
  - Review process creation logs in the SIEM to determine if the detected PowerShell command was executed by a known legitimate process or if it originated from a suspicious process.
  - Analyze network logs from the NGFW or NDR to look for any unusual outbound traffic patterns that may correspond with the timing of the certificate export attempt.
  - Conduct a review of the local certificate store to verify if any unauthorized certificates have been exported or if there are discrepancies in the certificate history.
