title: Recon Information for Export with PowerShell
id: a9723fcc-881c-424c-8709-fd61442ab3c3
status: test
description: Once established within a system or network, an adversary may use automated
  techniques for collecting internal data
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1119/T1119.md
author: frack113
date: 2021-07-30
modified: 2022-12-25
tags:
- attack.collection
- attack.t1119
logsource:
  product: windows
  category: ps_script
  definition: 'Requirements: Script Block Logging must be enabled'
detection:
  selection_action:
    ScriptBlockText|contains:
    - 'Get-Service '
    - 'Get-ChildItem '
    - 'Get-Process '
  selection_redirect:
    ScriptBlockText|contains: '> $env:TEMP\'
  condition: all of selection*
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  This Sigma rule is designed to detect potential reconnaissance activities conducted by adversaries using PowerShell on Windows systems. Specifically, it identifies the use of common PowerShell commands—including `Get-Service`, `Get-ChildItem`, and `Get-Process`—which are often used to gather information about system services, file structures, and running processes. The rule further scrutinizes PowerShell script blocks that redirect output to the temporary folder, as this behavior can suggest data is being collected or exfiltrated without raising immediate alarms. For effective detection, it requires that Script Block Logging is enabled, allowing the capture of the full content of the executed PowerShell commands.
  ### Investigation Steps
  - Review the EDR logs to identify the timestamps of any detected PowerShell command executions and correlate them with user activity to determine if the actions were authorized.
  - Check the Command-Line parameters for the PowerShell process to gain deeper insights into the context and purpose of the executed commands.
  - Analyze the content found in the temporary folder (`$env:TEMP\`) to identify any suspicious files or data that may have been generated by the detected commands.
  - Consult firewall and proxy logs for any unusual outbound connections that could indicate data exfiltration attempts related to the reconnaissance activity.
