title: Windows Screen Capture with CopyFromScreen
id: d4a11f63-2390-411c-9adf-d791fd152830
status: test
description: |
  Adversaries may attempt to take screen captures of the desktop to gather information over the course of an operation.
  Screen capturing functionality may be included as a feature of a remote access tool used in post-compromise operations
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1113/T1113.md#atomic-test-6---windows-screen-capture-copyfromscreen
author: frack113
date: 2021-12-28
modified: 2022-07-07
tags:
- attack.collection
- attack.t1113
logsource:
  product: windows
  category: ps_script
  definition: 'Requirements: Script Block Logging must be enabled'
detection:
  selection:
    ScriptBlockText|contains: '.CopyFromScreen'
  condition: selection
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  This detection rule identifies potential malicious activity related to screen capturing on Windows systems. Specifically, it looks for the use of the `.CopyFromScreen` method, which is employed in PowerShell scripts to take screenshots of the user's desktop. Such functionality can indicate an adversary's attempt to gather sensitive information as part of a broader post-compromise operation, often associated with remote access tools. To effectively utilize this rule, Script Block Logging must be enabled in order to capture detailed logs that include the PowerShell commands executed on the system. The relevant data sources for this detection include PowerShell script logs, which help provide context to the script execution and the intent behind the commands.
  ### Investigation Steps
  - Review recent PowerShell execution logs in the EDR to identify the scripts that invoked the `.CopyFromScreen` method.
  - Examine the command-line arguments and parameters associated with the identified scripts to assess their context and intent.
  - Correlate the timestamps of the screen capture events with other suspicious activities in the environment using SIEM or cloud logs for comprehensive investigation.
  - Check user activity logs for the accounts that executed the scripts to understand potential unauthorized access or privilege escalation.
