title: Veeam Backup Servers Credential Dumping Script Execution
id: 976d6e6f-a04b-4900-9713-0134a353e38b
status: test
description: Detects execution of a PowerShell script that contains calls to the "Veeam.Backup"
  class, in order to dump stored credentials.
references:
- https://www.pwndefend.com/2021/02/15/retrieving-passwords-from-veeam-backup-servers/
- https://labs.withsecure.com/publications/fin7-target-veeam-servers
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023-05-04
tags:
- attack.credential-access
logsource:
  product: windows
  category: ps_script
  definition: bade5735-5ab0-4aa7-a642-a11be0e40872
detection:
  selection:
    ScriptBlockText|contains|all:
    - '[Credentials]'
    - '[Veeam.Backup.Common.ProtectedStorage]::GetLocalString'
    - 'Invoke-Sqlcmd'
    - 'Veeam Backup and Replication'
  condition: selection
falsepositives:
- Administrators backup scripts (must be investigated)
level: high
notes: |
  ### Technical Context
  This detection rule identifies potentially malicious PowerShell script executions targeting Veeam Backup servers, specifically scripts that invoke methods for dumping stored credentials. The rule focuses on monitoring the PowerShell command line for specific keywords and class calls associated with Veeam's backup capabilities, such as `Veeam.Backup.Common.ProtectedStorage::GetLocalString` and `Invoke-Sqlcmd`. By analyzing script block text from PowerShell execution logs, the rule aims to detect unauthorized access attempts that could compromise sensitive information managed by Veeam. The data source primarily involved is PowerShell script execution logs from the Windows operating system, which provide insight into the specific commands being executed in the environment.
  ### Investigation Steps
  - Review the relevant PowerShell execution logs in the EDR system, focusing on recent script executions that contain the flagged keywords. 
  - Investigate the processes spawned by these scripts to determine if any potentially malicious activities or abnormal behavior occurred during execution.
  - Check the access and change logs for the Veeam Backup server to see if there are any unauthorized modifications or access attempts to stored credentials.
  - If applicable, analyze network traffic using NDR tools for suspicious API calls or data exfiltration attempts related to Veeam services following the script execution.
