title: Request A Single Ticket via PowerShell
id: a861d835-af37-4930-bcd6-5b178bfb54df
status: test
description: |
  utilize native PowerShell Identity modules to query the domain to extract the Service Principal Names for a single computer.
  This behavior is typically used during a kerberos or silver ticket attack.
  A successful execution will output the SPNs for the endpoint in question.
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1558.003/T1558.003.md#atomic-test-4---request-a-single-ticket-via-powershell
author: frack113
date: 2021-12-28
tags:
- attack.credential-access
- attack.t1558.003
logsource:
  product: windows
  category: ps_script
  definition: 'Requirements: Script Block Logging must be enabled'
detection:
  selection:
    ScriptBlockText|contains: System.IdentityModel.Tokens.KerberosRequestorSecurityToken
  condition: selection
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This Sigma rule monitors for suspicious PowerShell activity that indicates a potential Kerberos ticket attack, specifically focusing on the extraction of Service Principal Names (SPNs) for a single computer in the domain. By utilizing native PowerShell Identity modules, an attacker may employ the function `System.IdentityModel.Tokens.KerberosRequestorSecurityToken`, which allows them to query the domain for critical authentication information. Such behavior is characteristic of attempting to retrieve a “silver ticket,” which can facilitate unauthorized access to services in an Active Directory environment. For detection, the rule leverages PowerShell script block logging, requiring this feature to be enabled to capture relevant command executions in a Windows environment.
  ### Investigation Steps
  - Review the PowerShell script execution logs in your EDR to identify any recent commands that include the string `System.IdentityModel.Tokens.KerberosRequestorSecurityToken`.
  - Check for any unusual account activity in your Active Directory logs that corresponds with the execution time of the suspicious PowerShell commands.
  - Utilize network traffic logs from the NDR to investigate any unusual authentication requests or anomalies targeting specific services following the PowerShell execution.
  - Examine the Proxy logs for any outbound connections made by the implicated endpoint, which could indicate exfiltration of the extracted SPN information.
