title: Suspicious Unblock-File
id: 5947497f-1aa4-41dd-9693-c9848d58727d
status: test
description: Remove the Zone.Identifier alternate data stream which identifies the
  file as downloaded from the internet.
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1553.005/T1553.005.md#atomic-test-3---remove-the-zoneidentifier-alternate-data-stream
- https://learn.microsoft.com/en-us/powershell/module/microsoft.powershell.utility/unblock-file?view=powershell-7.2
author: frack113
date: 2022-02-01
tags:
- attack.defense-evasion
- attack.t1553.005
logsource:
  product: windows
  category: ps_script
  definition: 'Requirements: Script Block Logging must be enabled'
detection:
  selection:
    ScriptBlockText|contains|all:
    - 'Unblock-File '
    - '-Path '
  condition: selection
falsepositives:
- Legitimate PowerShell scripts
level: medium
notes: |
  ### Technical Context
  The "Suspicious Unblock-File" detection rule identifies potential misuse of the PowerShell `Unblock-File` cmdlet, which is commonly used to remove the Zone.Identifier alternate data stream. This stream is automatically added to files downloaded from the internet to mark them as potentially unsafe. Attackers may use this cmdlet to evade detection by stripping away this marking, thereby reducing the likelihood of alerts triggered by security tools. The rule looks for specific keywords within PowerShell script block logs, particularly focusing on instances where `Unblock-File` is invoked with the `-Path` parameter. For this detection to work, it is crucial that Script Block Logging is enabled on the Windows systems being monitored.
  ### Investigation Steps
  - Review the EDR logs for historical executions of PowerShell that contain the `Unblock-File` cmdlet to determine if the action was performed unexpectedly.
  - Analyze command-line parameters used in conjunction with `Unblock-File` to assess whether the associated files are legitimate or suspicious.
  - Investigate any associated file operations in the file system, especially focusing on newly modified files that have Zone.Identifier streams removed.
  - Check proxy logs for any web requests related to the downloaded files to verify their source and assess overall trustworthiness.
