title: Enable Windows Remote Management
id: 991a9744-f2f0-44f2-bd33-9092eba17dc3
status: test
description: Adversaries may use Valid Accounts to interact with remote systems using
  Windows Remote Management (WinRM). The adversary may then perform actions as the
  logged-on user.
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1021.006/T1021.006.md#atomic-test-1---enable-windows-remote-management
- https://learn.microsoft.com/en-us/powershell/module/microsoft.powershell.core/enable-psremoting?view=powershell-7.2
author: frack113
date: 2022-01-07
tags:
- attack.lateral-movement
- attack.t1021.006
logsource:
  product: windows
  category: ps_script
  definition: 'Requirements: Script Block Logging must be enabled'
detection:
  selection_cmdlet:
    ScriptBlockText|contains: 'Enable-PSRemoting '
  condition: selection_cmdlet
falsepositives:
- Legitimate script
level: medium
notes: |
  ### Technical Context
  This detection rule identifies the use of the `Enable-PSRemoting` cmdlet, which is employed to configure Windows Remote Management (WinRM) on a system. WinRM allows for remote management of Windows servers, enabling an attacker with valid credentials to execute commands and scripts remotely as the logged-on user. This capability can be misused by adversaries to perform lateral movement within the network, making it critical for security analysts to monitor such activities. The rule relies on Windows PowerShell script block logging to analyze the content of executed scripts, specifically searching for instances where the cmdlet `Enable-PSRemoting` is invoked. To ensure this rule functions effectively, script block logging must be enabled across all monitored systems.
  ### Investigation Steps
  - Retrieve recent PowerShell logs from the EDR to identify execution instances of the `Enable-PSRemoting` cmdlet and assess context around the user accounts utilized.
  - Examine related user activity to determine if there were any prior logins or actions on the system that could suggest valid account misuse.
  - Review network traffic logs in the NDR system for any suspicious lateral movement patterns or unauthorized access attempts that could correlate with the use of WinRM.
  - Cross-reference alerts against the list of legitimate administrative tasks performed on the network to filter out possible false positives.
