title: Clfs.SYS Loaded By Process Located In a Potential Suspicious Location
id: fb4e2211-6d08-426b-8e6f-0d4a161e3b1d
status: experimental
description: Detects Clfs.sys being loaded by a process running from a potentially
  suspicious location. Clfs.sys is loaded as part of many CVEs exploits that targets
  Common Log File.
references:
- https://ssd-disclosure.com/ssd-advisory-common-log-file-system-clfs-driver-pe/
- https://x.com/Threatlabz/status/1879956781360976155
author: X__Junior
date: 2025-01-20
tags:
- attack.execution
- attack.t1059
logsource:
  category: image_load
  product: windows
detection:
  selection_dll:
    ImageLoaded|endswith: '\clfs.sys'
  selection_folders_1:
    Image|contains:
    - ':\Perflogs\'
    - ':\Users\Public\'
    - '\Temporary Internet'
    - '\Windows\Temp\'
  selection_folders_2:
  - Image|contains|all:
    - ':\Users\'
    - '\Favorites\'
  - Image|contains|all:
    - ':\Users\'
    - '\Favourites\'
  - Image|contains|all:
    - ':\Users\'
    - '\Contacts\'
  - Image|contains|all:
    - ':\Users\'
    - '\Pictures\'
  condition: selection_dll and 1 of selection_folders_*
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  This detection rule identifies potential malicious activity involving the Windows kernel driver file `clfs.sys`, which is a critical component of the Common Log File System. The rule specifically looks for instances where `clfs.sys` is loaded by a process executing from directories commonly associated with suspicious or non-standard user activity, such as `C:\Perflogs\`, `C:\Users\Public\`, or temporary directories like `C:\Windows\Temp\`. The inclusion of such paths raises red flags, as they may be indicative of attempts to exploit vulnerabilities, particularly those that leverage `clfs.sys` in known CVEs. The data sources involved primarily consist of process creation logs and image load events on Windows systems.
  ### Investigation Steps
  - Review the process creation logs to identify the parent process that loaded `clfs.sys`, noting any unusual behavior or command-line parameters.
  - Utilize EDR tools to assess the runtime behavior of the identified process, checking for any signs of malicious activity, such as attempts to access sensitive files or connect to external servers.
  - Examine network logs from the NGFW to look for any suspicious outbound traffic initiated by the process, particularly towards known malicious IPs or domains.
  - Consult cloud platforms (if applicable) to check for related activities or anomalous behavior in user accounts that might correlate with the suspicious process execution.
