title: Potentially Suspicious Volume Shadow Copy Vsstrace.dll Load
id: 48bfd177-7cf2-412b-ad77-baf923489e82
related:
- id: 333cdbe8-27bb-4246-bf82-b41a0dca4b70     # vss_ps.dll
  type: similar
- id: 37774c23-25a1-4adb-bb6d-8bb9fd59c0f8     # vssapi.dll
  type: similar
status: test
description: Detects the image load of VSS DLL by uncommon executables
references:
- https://github.com/ORCx41/DeleteShadowCopies
author: frack113
date: 2023-02-17
modified: 2025-01-19
tags:
- attack.defense-evasion
- attack.impact
- attack.t1490
logsource:
  category: image_load
  product: windows
detection:
  selection:
    ImageLoaded|endswith: '\vsstrace.dll'
  filter_main_windows:
  - Image:
    - 'C:\Windows\explorer.exe'
    - 'C:\Windows\ImmersiveControlPanel\SystemSettings.exe'
  - Image|startswith:
    - 'C:\Windows\System32\'
    - 'C:\Windows\SysWOW64\'
    - 'C:\Windows\Temp\{'           # Installers
    - 'C:\Windows\WinSxS\'
    - 'C:\ProgramData\Package Cache\{'            # Microsoft Visual Redistributable installer  VC_redist/vcredist EXE
  filter_optional_program_files:
        # When using this rule in your environment replace the "Program Files" folder by the exact applications you know use this. Examples would be software such as backup solutions
    Image|startswith:
    - 'C:\Program Files\'
    - 'C:\Program Files (x86)\'
  condition: selection and not 1 of filter_*
falsepositives:
- Unknown
level: medium
notes: |
  n
  ### Technical Context
  This detection rule aims to identify potentially suspicious loading of the `vsstrace.dll` dynamic link library (DLL) by uncommon executables. Volume Shadow Copy Service (VSS) components like `vsstrace.dll` are typically loaded during legitimate processes related to system backups and restore operations. In this rule, we focus on those instances where the DLL is loaded by uncommon or suspicious executables, which could be indicative of evasion tactics by threat actors using these DLLs to manipulate backups or maintain persistence. The rule leverages Windows image load logs, specifically looking for the `vsstrace.dll` file, and applies a series of filters to reduce false positives by excluding known legitimate executables that commonly load this DLL. This aligns with the MITRE ATT&CK tactics of defense evasion and impact (T1490).
  ### Investigation Steps
  - **Check Source Process:** Inspect the process that triggered the alert in your EDR tool to determine whether it is a legitimate application or an uncommon executable that could indicate malicious activity.
  - **Review Sysmon Logs:** Utilize Sysmon logs to trace the process tree and see if any parent processes can provide further context on the nature of the suspicious executable.
  - **Analyze Network Connections:** Use network detection tools to check for any unusual outbound connections that may correlate with the execution of the suspicious process.
  - **Inspect System Changes:** Review system and application logs for any recent changes or modifications related to Volume Shadow Copy to identify any unauthorized attempts to manipulate shadow copies.
  ### Prioritization
  The alert is deemed medium severity due to the potential implications of unauthorized manipulation of backup processes, which can serve as an avenue for data exfiltration or system compromise.
  ### Blind Spots and Assumptions
  This rule may not fire if the `vsstrace.dll` is legitimately loaded by a common executable that is not covered by the specified filters. Adversaries can employ various tactics to conceal their actions, such as using whitelisted applications for executing malicious code. Additionally, if the monitoring settings for image load events are misconfigured or incomplete, this could lead to missed detections.
  > **Disclaimer:** This investigation guide was created using generative AI technology and has not been reviewed for its accuracy and relevance. While every effort has been made to ensure its quality, we recommend validating the content and adapting it to suit specific environment and operational needs. Please communicate any changes to the detection engineering team.
