title: WMI ActiveScriptEventConsumers Activity Via Scrcons.EXE DLL Load
id: b439f47d-ef52-4b29-9a2f-57d8a96cb6b8
status: test
description: Detects signs of the WMI script host process "scrcons.exe" loading scripting
  DLLs which could indicates WMI ActiveScriptEventConsumers EventConsumers activity.
references:
- https://twitter.com/HunterPlaybook/status/1301207718355759107
- https://www.mdsec.co.uk/2020/09/i-like-to-move-it-windows-lateral-movement-part-1-wmi-event-subscription/
- https://threathunterplaybook.com/hunts/windows/200902-RemoteWMIActiveScriptEventConsumers/notebook.html
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
date: 2020-09-02
modified: 2023-02-22
tags:
- attack.lateral-movement
- attack.privilege-escalation
- attack.persistence
- attack.t1546.003
logsource:
  category: image_load
  product: windows
detection:
  selection:
    Image|endswith: '\scrcons.exe'
    ImageLoaded|endswith:
    - '\vbscript.dll'
    - '\wbemdisp.dll'
    - '\wshom.ocx'
    - '\scrrun.dll'
  condition: selection
falsepositives:
- Legitimate event consumers
- Dell computers on some versions register an event consumer that is known to cause
  false positives when brightness is changed by the corresponding keyboard button
level: medium
notes: |
  ### Technical Context
  This Sigma rule is designed to detect suspicious activity involving the WMI (Windows Management Instrumentation) script host process known as "scrcons.exe." The rule specifically monitors for the loading of certain scripting DLLs, including `vbscript.dll`, `wbemdisp.dll`, `wshom.ocx`, and `scrrun.dll`, which can be indicative of malicious use of WMI ActiveScriptEventConsumers for lateral movement or privilege escalation. The detection is based on image load events where `scrcons.exe` is responsible for executing scripts, raising red flags when it loads these DLLs. This activity could signify an attacker using WMI to execute scripts and potentially manipulate system settings or extract data without direct user interaction. The data sources involved primarily include the Windows event logs that capture DLL loading events.
  ### Investigation Steps
  - **Review EDR Alerts:** Investigate the alerts generated by your Endpoint Detection and Response (EDR) system for any recent activity involving `scrcons.exe` alongside the suspicious DLLs listed in the rule.
  - **Analyze Process Trees:** Check the process hierarchy in your EDR tool to determine the parent processes of `scrcons.exe` to identify any unusual or unexpected execution contexts.
  - **Inspect Command Line Parameters:** Look for any specific command-line arguments used with `scrcons.exe`, as these parameters may provide additional context about the intention behind the execution.
  - **Correlate with Proxy Logs:** Investigate network traffic associated with the machine running `scrcons.exe` by analyzing proxy logs for any unusual outgoing connections that may correlate with the timing of the alert.
