title: Potential DLL Sideloading Via JsSchHlp
id: 68654bf0-4412-43d5-bfe8-5eaa393cd939
status: test
description: Detects potential DLL sideloading using JUSTSYSTEMS Japanese word processor
references:
- https://www.welivesecurity.com/2022/12/14/unmasking-mirrorface-operation-liberalface-targeting-japanese-political-entities/
- http://www.windowexe.com/bbs/board.php?q=jsschhlp-exe-c-program-files-common-files-justsystem-jsschhlp-jsschhlp
author: frack113
date: 2022-12-14
tags:
- attack.defense-evasion
- attack.persistence
- attack.privilege-escalation
- attack.t1574.001
- attack.t1574.002
logsource:
  category: image_load
  product: windows
detection:
  selection:
    ImageLoaded|endswith: '\JSESPR.dll'
  filter:
    ImageLoaded|startswith: 'C:\Program Files\Common Files\Justsystem\JsSchHlp\'
  condition: selection and not filter
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  This Sigma rule focuses on detecting potential DLL sideloading attempts through the Justsystems Japanese word processor's helper executable, JsSchHlp. DLL sideloading occurs when a malicious DLL is loaded alongside a legitimate application, enabling execution of unauthorized code. In this case, the rule looks for instances where the JsSchHlp process attempts to load a DLL named JSESPR.dll, but the request does not originate from the expected installation path (C:\Program Files\Common Files\Justsystem\JsSchHlp\). By examining image load events in Windows, the rule aims to identify instances where an application improperly utilizes DLL files, which could signal a compromise or malicious activity.
  ### Investigation Steps
  - Review the process creation logs for JsSchHlp to identify the command-line parameters used during execution and any associated parent processes that indicate unusual behavior.
  - Use EDR tools to check the execution history of JSESPR.dll and establish whether it has legitimate origins or if it exhibits suspicious characteristics.
  - Query network logs from the NGFW to determine if there were any external communications from the JsSchHlp process that could suggest data exfiltration or command-and-control activity.
  - Consult AV logs for any detections or quarantines related to JSESPR.dll and cross-reference against known threat intelligence to assess potential malicious indicators.
