title: Load Of RstrtMgr.DLL By A Suspicious Process
id: b48492dc-c5ef-4572-8dff-32bc241c15c8
related:
- id: 3669afd2-9891-4534-a626-e5cf03810a61
  type: derived
status: test
description: |
  Detects the load of RstrtMgr DLL (Restart Manager) by a suspicious process.
  This library has been used during ransomware campaigns to kill processes that would prevent file encryption by locking them (e.g. Conti ransomware, Cactus ransomware). It has also recently been seen used by the BiBi wiper for Windows.
  It could also be used for anti-analysis purposes by shut downing specific processes.
references:
- https://www.crowdstrike.com/blog/windows-restart-manager-part-1/
- https://www.crowdstrike.com/blog/windows-restart-manager-part-2/
- https://web.archive.org/web/20231221193106/https://www.swascan.com/cactus-ransomware-malware-analysis/
- https://taiwan.postsen.com/business/88601/Hamas-hackers-use-data-destruction-software-BiBi-which-consumes-a-lot-of-processor-resources-to-wipe-Windows-computer-data--iThome.html
author: Luc Génaux
date: 2023-11-28
tags:
- attack.impact
- attack.defense-evasion
- attack.t1486
- attack.t1562.001
logsource:
  category: image_load
  product: windows
detection:
  selection_img:
  - ImageLoaded|endswith: '\RstrtMgr.dll'
  - OriginalFileName: 'RstrtMgr.dll'
  selection_folders_1:
    Image|contains:
            # Note: increase coverage by adding more suspicious paths
    - ':\Perflogs\'
    - ':\Users\Public\'
    - '\Temporary Internet'
  selection_folders_2:
  - Image|contains|all:
    - ':\Users\'
    - '\Favorites\'
  - Image|contains|all:
    - ':\Users\'
    - '\Favourites\'
  - Image|contains|all:
    - ':\Users\'
    - '\Contacts\'
  condition: selection_img and 1 of selection_folders_*
falsepositives:
- Processes related to software installation
level: high
notes: |
  ### Technical Context
  This detection rule identifies potentially malicious activities involving the loading of the `RstrtMgr.dll` (Restart Manager) by suspicious processes. The Restart Manager is typically used within Windows environments to manage application shutdown and restart procedures, but threat actors have leveraged its functionality in various ransomware attacks, such as Conti and Cactus ransomware, to terminate processes that could impede file encryption. Additionally, it has been employed by the BiBi wiper to execute anti-analysis techniques by shutting down specific processes. The rule focuses on examining image load events in Windows, specifically looking for instances where `RstrtMgr.dll` is loaded, particularly from unusual directories often associated with malicious activity (e.g., temporary files or user directories).
  The primary data sources utilized for this rule include image load logs, which detail loaded DLLs and their originating processes, along with indications of the processes that utilize the Restart Manager. By triggering alerts when this DLL is loaded from suspicious paths, analysts can investigate potential malicious intentions and take appropriate actions to secure the environment.
  ### Investigation Steps
  - Examine EDR logs for process creation and command-line parameters associated with the suspicious process that loaded `RstrtMgr.dll` to identify any abnormal behavior or tactics being used.
  - Check for additional loaded DLLs and the full parent-child process relationships to ascertain if the suspicious process has any known ties to ransomware or destructive malware.
  - Review historical and real-time network logs from the NGFW and Proxy to detect any outbound connections or command and control (C2) activity linked to the identified process.
  - Query relevant cloud logs from AWS or Azure to find any correlated cloud actions that may correspond to the timeline of the detected event, allowing for broader context in the investigation.
