title: Potential Vivaldi_elf.DLL Sideloading
id: 2092cacb-d77b-4f98-ab0d-32b32f99a054
status: test
description: Detects potential DLL sideloading of "vivaldi_elf.dll"
references:
- https://research.checkpoint.com/2023/beyond-the-horizon-traveling-the-world-on-camaro-dragons-usb-flash-drives/
author: X__Junior (Nextron Systems)
date: 2023-08-03
tags:
- attack.defense-evasion
- attack.privilege-escalation
- attack.t1574.001
- attack.t1574.002
logsource:
  category: image_load
  product: windows
detection:
  selection:
    ImageLoaded|endswith: '\vivaldi_elf.dll'
  filter_main_legit_path:
    Image|endswith: '\Vivaldi\Application\vivaldi.exe'
    ImageLoaded|contains: '\Vivaldi\Application\'
  condition: selection and not 1 of filter_main_*
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  This Sigma rule is designed to detect potential DLL sideloading attacks involving the "vivaldi_elf.dll" file within Windows environments. DLL sideloading is a technique where an attacker exploits a legitimate application to load a malicious DLL file, often to execute unauthorized actions. In this case, the rule specifically looks for instances where "vivaldi_elf.dll" is loaded by a legitimate process, namely "vivaldi.exe," which is part of the Vivaldi web browser. The detection leverages image load events from application process logs, particularly monitoring the paths of the loaded images to determine if the DLL is used improperly, indicating a potential security risk.
  ### Investigation Steps
  - Review the EDR logs to identify all instances where "vivaldi_elf.dll" was loaded and correlate them with the process activities around "vivaldi.exe."
  - Utilize the SIEM to gather contextual information regarding the source of the "vivaldi_elf.dll," including any unusual file paths or changes that coincide with its use.
  - Examine network logs and Proxy records to identify if there were any suspicious outbound connections made by the "vivaldi.exe" process around the same time the DLL loading occurred.
  - Investigate the system for any unauthorized changes or anomalies in directory structures within the Vivaldi application path, including timestamps and file integrity verification.
