title: VMMap Signed Dbghelp.DLL Potential Sideloading
id: 98ffaed4-aec2-4e04-9b07-31492fe68b3d
related:
- id: 273a8dd8-3742-4302-bcc7-7df5a80fe425
  type: similar
status: test
description: Detects potential DLL sideloading of a signed dbghelp.dll by the Sysinternals
  VMMap.
references:
- https://techcommunity.microsoft.com/t5/sysinternals-blog/zoomit-v7-1-procdump-2-0-for-linux-process-explorer-v17-05/ba-p/3884766
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023-09-05
tags:
- attack.defense-evasion
- attack.persistence
- attack.privilege-escalation
- attack.t1574.001
- attack.t1574.002
logsource:
  category: image_load
  product: windows
detection:
  selection:
    ImageLoaded|contains: 'C:\Debuggers\dbghelp.dll'
    Image|endswith:
    - '\vmmap.exe'
    - '\vmmap64.exe'
    Signed: 'true'
  condition: selection
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  This Sigma rule is designed to identify potential DLL sideloading incidents involving the Sysinternals tool, VMMap, using the signed `dbghelp.dll` library. DLL sideloading is a technique used by attackers to run malicious code by masquerading it as a legitimate DLL, facilitating unauthorized actions or privilege escalation. The rule specifically looks for instances where VMMap loads `dbghelp.dll` from a non-standard location (in this case, `C:\Debuggers\dbghelp.dll`), while also ensuring that the loaded DLL is marked as signed. The detection leverages image load logs from Windows to capture these events, providing critical visibility into the behavior of applications and their dependencies.
  ### Investigation Steps
  - Investigate EDR logs to confirm the process creation details of VMMap and examine the command-line parameters used during its execution for any suspicious arguments.
  - Check the file properties of `dbghelp.dll` from `C:\Debuggers\` to verify its origin and legitimacy, noting whether it matches expected signatures and hash values.
  - Review related network traffic through the NGFW or Proxy logs to determine if there were any unusual connections or downloads that could suggest exfiltration or further malicious activity following the incident.
  - Correlate findings with broader threat intelligence and contextual logs (e.g., user activity logs, access patterns) to assess if this behavior is part of a larger attack surface targeting the environment.
