title: Potential DLL Sideloading Using Coregen.exe
id: 0fa66f66-e3f6-4a9c-93f8-4f2610b00171
status: test
description: Detect usage of the "coregen.exe" (Microsoft CoreCLR Native Image Generator)
  binary to sideload arbitrary DLLs.
references:
- https://lolbas-project.github.io/lolbas/OtherMSBinaries/Coregen/
author: frack113
date: 2022-12-31
tags:
- attack.defense-evasion
- attack.t1218
- attack.t1055
logsource:
  category: image_load
  product: windows
detection:
  selection:
    Image|endswith: '\coregen.exe'
  filter_main_legit_paths:
    ImageLoaded|startswith:
    - 'C:\Program Files (x86)\Microsoft Silverlight\'
    - 'C:\Program Files\Microsoft Silverlight\'
    - 'C:\Windows\System32\'
    - 'C:\Windows\SysWOW64\'
  condition: selection and not 1 of filter_main_*
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  This Sigma rule is designed to detect potential DLL sideloading activities involving the execution of `coregen.exe`, which is the Microsoft CoreCLR Native Image Generator. The rule monitors for the loading of libraries associated with `coregen.exe` and flags instances where it does not originate from trusted Microsoft directories. By specifically filtering out legitimate paths, the detection aims to identify possible misuse of this binary to load arbitrary or malicious DLLs, which can be a technique employed by attackers to evade security controls. The primary technical data sources for this detection include image load logs from Windows, which track executed binaries and their associated libraries.
  ### Investigation Steps
  - Verify the origin and integrity of the `coregen.exe` process by querying EDR for its execution context, including process creation details and any parent-child relationships.
  - Cross-reference the loaded DLLs associated with `coregen.exe` against known good libraries using AV or threat intelligence feeds to identify any anomalies.
  - Inspect other logs from your SIEM, such as process creation or security event logs, to check for any suspicious activity before or after the detection event that could indicate a broader attack.
  - Review network activity related to the system using NDR tools to ensure that there were no outbound connections to known malicious domains that could suggest a compromised environment.
