title: Unsigned Module Loaded by ClickOnce Application
id: 060d5ad4-3153-47bb-8382-43e5e29eda92
status: test
description: Detects unsigned module load by ClickOnce application.
references:
- https://posts.specterops.io/less-smartscreen-more-caffeine-ab-using-clickonce-for-trusted-code-execution-1446ea8051c5
author: '@SerkinValery'
date: 2023-06-08
tags:
- attack.persistence
- attack.t1574.002
logsource:
  category: image_load
  product: windows
detection:
  selection_path:
    Image|contains: '\AppData\Local\Apps\2.0\'
  selection_sig_status:
  - Signed: 'false'
  - SignatureStatus: 'Expired'
  condition: all of selection_*
falsepositives:
- Unlikely
level: medium
notes: |
  ### Technical Context
  This Sigma rule is designed to detect the loading of unsigned modules by ClickOnce applications, specifically focusing on modules residing in the `AppData\Local\Apps\2.0\` directory. ClickOnce technology allows users to install and run software applications with minimal installation time, but malicious actors can exploit this by loading unsigned or expired signature modules to execute harmful code. The rule inspects process creation logs and image load events in Windows environments to identify instances where an executable is loading a module that lacks a valid signature or has an expired signature, thus indicating a potential security threat.
  To trigger the rule, the detection looks for specific path indicators associated with ClickOnce applications. The conditions set forth in the rule require all specified criteria to be met: the image must be loaded from the designated directory and exhibit an unsigned or expired signature status. This provides a more precise filtering of potentially malicious activity while minimizing false positives.
  ### Investigation Steps
  - Utilize EDR tools to investigate the process creation logs and examine the execution paths of the ClickOnce application to determine the legitimacy and integrity of the loaded modules.
  - Check the application’s properties and signature details in the Windows environment to confirm the presence of an unsigned module and gather information on any associated threats.
  - Review network logs for any unusual outbound connections or data exfiltration attempts that may correlate with the execution of the ClickOnce application.
  - Explore relevant logs from cloud platforms (if applicable) to identify any interactions with cloud resources that coincide with the alert, highlighting potential exploitation scenarios.
