title: CredUI.DLL Loaded By Uncommon Process
id: 9ae01559-cf7e-4f8e-8e14-4c290a1b4784
status: test
description: Detects loading of "credui.dll" and related DLLs by an uncommon process.
  Attackers might leverage this DLL for potential use of "CredUIPromptForCredentials"
  or "CredUnPackAuthenticationBufferW".
references:
- https://securitydatasets.com/notebooks/atomic/windows/credential_access/SDWIN-201020013208.html
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1056.002/T1056.002.md#atomic-test-2---powershell---prompt-user-for-password
- https://learn.microsoft.com/en-us/windows/win32/api/wincred/nf-wincred-creduipromptforcredentialsa
- https://github.com/S12cybersecurity/RDPCredentialStealer
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
date: 2020-10-20
modified: 2023-07-28
tags:
- attack.credential-access
- attack.collection
- attack.t1056.002
logsource:
  category: image_load
  product: windows
detection:
  selection:
  - ImageLoaded|endswith:
    - '\credui.dll'
    - '\wincredui.dll'
  - OriginalFileName:
    - 'credui.dll'
    - 'wincredui.dll'
  filter_main_generic:
    Image|startswith:
    - 'C:\Program Files (x86)\'
    - 'C:\Program Files\'
    - 'C:\Windows\System32\'
    - 'C:\Windows\SysWOW64\'
  filter_main_full:
    Image:
    - 'C:\Windows\explorer.exe'
    - 'C:\Windows\ImmersiveControlPanel\SystemSettings.exe'
    - 'C:\Windows\regedit.exe'         # This FP is triggered for example when choosing the "Connect Network Registry" from the menu
  filter_optional_opera:
    Image|endswith: '\opera_autoupdate.exe'
  filter_optional_process_explorer:
    Image|endswith:
    - '\procexp64.exe'
    - '\procexp.exe'
  filter_optional_teams:
    Image|startswith: 'C:\Users\'
    Image|contains: '\AppData\Local\Microsoft\Teams\'
    Image|endswith: '\Teams.exe'
  filter_optional_onedrive:
    Image|startswith: 'C:\Users\'
    Image|contains: '\AppData\Local\Microsoft\OneDrive\'
  condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
falsepositives:
- Other legitimate processes loading those DLLs in your environment.
level: medium
notes: |
  n
  ### Technical Context
  The detection rule "CredUI.DLL Loaded By Uncommon Process" aims to identify instances where `credui.dll` or its related libraries (`wincredui.dll`) are loaded by processes that are not typically associated with these operations. This rule leverages Windows image load telemetry to monitor whether the DLL is invoked by uncommon and potentially malicious processes. An adversary may exploit these DLLs for credential harvesting using functions like `CredUIPromptForCredentials` or `CredUnPackAuthenticationBufferW`, which can facilitate unauthorized access to user credentials.
  The rule focuses on processes that are uncommon in the context of loading these specific DLLs, while filtering out legitimate processes like `explorer.exe`, `SystemSettings.exe`, `regedit.exe`, and others that might access these libraries during normal operations. This detection closely aligns with the MITRE ATT&CK technique for credential access (T1056.002).
  ### Investigation Steps
  - **Verify the Source of the Alert:** Utilize EDR to examine the process that triggered this alert. Review the command-line arguments and context of the associated process for indicators of malicious behavior.
    
  - **Check Process Parentage:** Look into the parent process of the triggering process using EDR tools. Understanding the lineage of the process can reveal whether it was spawned by a legitimate application or a potentially malicious script.
  - **Examine User Context:** Review Windows Security logs to identify the user account that initiated the process. Pay attention to known user behavior patterns or any anomalies that may suggest compromise.
  - **Analyze Network Activity:** Cross-reference network connections associated with the process using your NDR tools. Unexpected outbound connections could indicate data exfiltration or communication with a command-and-control server.
  ### Prioritization
  This rule's medium severity implies a recognition that while the invocation of `credui.dll` by uncommon processes can be benign in some cases, it poses a significant risk of credential theft and potential account compromise, warranting prompt investigation.
  ### Blind spots and Assumptions
  This rule assumes that most legitimate processes that load `credui.dll` will be filtered out through the specified conditions. However, it may not detect malicious activity if an adversary uses a legitimate process that is not excluded in the filters. Furthermore, some benign processes in certain environments might also trigger false positives, which can dilute the effectiveness of the rule. Lastly, the rule may not fire if the DLL is loaded in unusual ways or through custom methods that evade standard telemetry.
  > **Disclaimer:** This investigation guide was created using generative AI technology and has not been reviewed for its accuracy and relevance. While every effort has been made to ensure its quality, we recommend validating the content and adapting it to suit specific environment and operational needs. Please communicate any changes to the detection engineering team.
