title: Aruba Network Service Potential DLL Sideloading
id: 90ae0469-0cee-4509-b67f-e5efcef040f7
status: test
description: Detects potential DLL sideloading activity via the Aruba Networks Virtual
  Intranet Access "arubanetsvc.exe" process using DLL Search Order Hijacking
references:
- https://twitter.com/wdormann/status/1616581559892545537?t=XLCBO9BziGzD7Bmbt8oMEQ&s=09
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023-01-22
modified: 2023-03-15
tags:
- attack.privilege-escalation
- attack.persistence
- attack.t1574.001
- attack.t1574.002
logsource:
  category: image_load
  product: windows
detection:
  selection:
    Image|endswith: '\arubanetsvc.exe'
    ImageLoaded|endswith:
    - '\wtsapi32.dll'
    - '\msvcr100.dll'
    - '\msvcp100.dll'
    - '\dbghelp.dll'
    - '\dbgcore.dll'
    - '\wininet.dll'
    - '\iphlpapi.dll'
    - '\version.dll'
    - '\cryptsp.dll'
    - '\cryptbase.dll'
    - '\wldp.dll'
    - '\profapi.dll'
    - '\sspicli.dll'
    - '\winsta.dll'
    - '\dpapi.dll'
  filter:
    ImageLoaded|startswith:
    - 'C:\Windows\System32\'
    - 'C:\Windows\SysWOW64\'
    - 'C:\Windows\WinSxS\'
  condition: selection and not filter
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This Sigma rule is designed to detect potential DLL sideloading activity associated with the Aruba Networks Virtual Intranet Access process, `arubanetsvc.exe`. DLL sideloading is a technique where an attacker places a malicious DLL file in the search path of a legitimate executable, allowing it to be loaded instead of the intended library. The rule specifically looks for `arubanetsvc.exe` in combination with suspicious DLLs that are commonly used in privilege escalation or persistence attacks. It analyzes process image load events to check if `arubanetsvc.exe` is loading DLLs from unauthorized or unexpected directories, such as those outside of standard system paths (like `C:\Windows\System32\`, `C:\Windows\SysWOW64\`, and `C:\Windows\WinSxS\`).
  The detection leverages image load logs from Windows systems, focusing on the specific DLL file names that may indicate malicious intent. By identifying processes that do not adhere to the expected loading conventions, this rule helps in flagging DLL hijacking attempts in real-time, which can be critical for responding to potential breaches or escalations in the organization.
  ### Investigation Steps
  - Review the alerts generated by this rule in the SIEM to identify the timing and context of the DLL sideloading attempts.
  - Utilize EDR to examine the behavior of `arubanetsvc.exe` upon loading these suspicious DLLs, focusing on additional process activity or network connections established.
  - Investigate file activities and alterations in the suspected DLL path using file integrity monitoring tools to check for any unauthorized modifications.
  - Analyze proxy logs to determine if there have been any related inbound or outbound connections that coincide with the alert, correlating this with potential data exfiltration activities.
