title: DLL Loaded From Suspicious Location Via Cmspt.EXE
id: 75e508f7-932d-4ebc-af77-269237a84ce1
status: test
description: Detects cmstp loading "dll" or "ocx" files from suspicious locations
references:
- https://github.com/vadim-hunter/Detection-Ideas-Rules/blob/02bcbfc2bfb8b4da601bb30de0344ae453aa1afe/TTPs/Defense%20Evasion/T1218%20-%20Signed%20Binary%20Proxy%20Execution/T1218.003%20-%20CMSTP/Procedures.yaml
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-08-30
modified: 2023-02-17
tags:
- attack.defense-evasion
- attack.t1218.003
logsource:
  category: image_load
  product: windows
detection:
  selection:
    Image|endswith: '\cmstp.exe'
    ImageLoaded|contains:
            # Add more suspicious paths as you see fit in your env
    - '\PerfLogs\'
    - '\ProgramData\'
    - '\Users\'
    - '\Windows\Temp\'
    - 'C:\Temp\'
    ImageLoaded|endswith:
    - '.dll'
    - '.ocx'
  condition: selection
falsepositives:
- Unikely
level: high
notes: |
  ### Technical Context
  This Sigma rule is designed to detect instances where the Windows utility `cmstp.exe` (the Connection Manager Profile Installer) loads dynamic link libraries (DLLs) or ActiveX controls (OCX files) from suspicious locations, often indicative of a defense evasion tactic used in malicious software execution. The rule monitors for the loading of these files from specific paths that are commonly exploited, such as `C:\PerfLogs\`, `C:\ProgramData\`, and temporary directories, where unauthorized DLLs might be stored to bypass traditional defenses. By focusing on the image load events associated with `cmstp.exe`, this rule helps identify anomalous behavior linked to potential attacks, allowing for a proactive response to threats that leverage this legitimate tool for nefarious purposes.
  ### Investigation Steps
  - Review process creation logs to identify the execution chain leading to `cmstp.exe`, including the parent process and command-line parameters used.
  - Examine EDR alerts related to `cmstp.exe` to gather additional context on file interactions and other potential malicious activity within the system.
  - Analyze file attributes and behaviors of the loaded DLLs or OCX files to determine any known associations or anomalies that raise concerns.
  - Inspect network logs from NGFW or Proxy to identify any suspicious outbound connections initiated by `cmstp.exe` or the loaded DLLs, which could indicate further compromise.
