title: Potential Libvlc.DLL Sideloading
id: bf9808c4-d24f-44a2-8398-b65227d406b6
status: test
description: Detects potential DLL sideloading of "libvlc.dll", a DLL that is legitimately
  used by "VLC.exe"
references:
- https://www.trendmicro.com/en_us/research/23/c/earth-preta-updated-stealthy-strategies.html
- https://hijacklibs.net/entries/3rd_party/vlc/libvlc.html
author: X__Junior
date: 2023-04-17
tags:
- attack.defense-evasion
- attack.persistence
- attack.privilege-escalation
- attack.t1574.001
- attack.t1574.002
logsource:
  category: image_load
  product: windows
detection:
  selection:
    ImageLoaded|endswith: '\libvlc.dll'
  filter_main_vlc:
    ImageLoaded|startswith:
    - 'C:\Program Files (x86)\VideoLAN\VLC\'
    - 'C:\Program Files\VideoLAN\VLC\'
  condition: selection and not 1 of filter_main_*
falsepositives:
- False positives are expected if VLC is installed in non-default locations
level: medium
notes: |
  ### Technical Context
  This detection rule focuses on identifying potential DLL sideloading of "libvlc.dll," which is a legitimate dynamic link library used by the VLC media player. The rule works by monitoring image load events on Windows systems, specifically looking for instances where the "libvlc.dll" is loaded from a location that deviates from the standard installation paths of VLC, such as "C:\Program Files (x86)\VideoLAN\VLC\" or "C:\Program Files\VideoLAN\VLC\". This is significant because attackers may exploit DLL sideloading techniques to execute malicious code by placing rogue versions of legitimate DLL files in unmonitored directories to gain unauthorized access or escalate privileges.
  Technical data sources involved in this rule include image load logs which capture details about processes and the associated libraries they load into memory. By filtering for abnormal paths from which "libvlc.dll" is loaded, the rule helps SOC analysts promptly detect potential threats and respond accordingly.
  ### Investigation Steps
  - Review recent image load events in the EDR console to identify instances of "libvlc.dll" being loaded from unusual directories, beyond the standard installation paths.
  - Cross-reference the file's properties using the antivirus tool to determine if the loaded "libvlc.dll" matches known malicious signatures.
  - Inspect command-line arguments and parent-child process relationships for any suspicious behavior surrounding the process that loaded "libvlc.dll."
  - Analyze network traffic logs via the Proxy and NDR tools to identify any unexpected communications initiated by the process, which may indicate further malicious activity.
