title: Python Image Load By Non-Python Process
id: cbb56d62-4060-40f7-9466-d8aaf3123f83
status: test
description: Detects the image load of "Python Core" by a non-Python process. This
  might be indicative of a Python script bundled with Py2Exe.
references:
- https://www.py2exe.org/
- https://unit42.paloaltonetworks.com/unit-42-technical-analysis-seaduke/
author: Patrick St. John, OTR (Open Threat Research)
date: 2020-05-03
modified: 2023-09-18
tags:
- attack.defense-evasion
- attack.t1027.002
logsource:
  product: windows
  category: image_load
detection:
  selection:
    Description: 'Python Core'
  filter_main_generic:
  - Image|contains: 'Python'        # FPs with python38.dll, python.exe etc.
  - Image|startswith:
    - 'C:\Program Files\'
    - 'C:\Program Files (x86)\'
    - 'C:\ProgramData\Anaconda3\'           # Comment out if you don't use Anaconda in your environment
  filter_optional_aurora:
    Image:
  condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
falsepositives:
- Legitimate Py2Exe Binaries
- Known false positive caused with Python Anaconda
level: medium
notes: |
  ### Technical Context
  This detection rule aims to identify instances of the "Python Core" being loaded by non-Python processes, which may indicate potential misuse or malicious activity, specifically when Python scripts have been bundled into executables via tools like Py2Exe. The rule inspects the image load events on Windows systems, focusing on the image description to confirm it is "Python Core" and filtering out common legitimate uses of Python, such as known applications from `C:\Program Files`, `C:\Program Files (x86)`, and `C:\ProgramData\Anaconda3`, if applicable. By monitoring these image load events, the rule helps in distinguishing potentially suspicious activities from benign operations involving legitimate Python processes.
  ### Investigation Steps
  - Review process creation logs in the EDR for any non-Python processes that have loaded the suspected Python Core images.
  - Check command-line parameters for these processes in the EDR to identify whether any suspicious scripts or known malicious commands were executed.
  - Inspect network logs in the NGFW or Proxy for any unusual outbound connections that coincide with the timing of the detection alert.
  - Analyze user activity logs in the SIEM to determine whether the user account involved has exhibited any anomalous behavior or if it has been temporarily compromised.
