title: Suspicious Volume Shadow Copy Vssapi.dll Load
id: 37774c23-25a1-4adb-bb6d-8bb9fd59c0f8
related:
- id: 333cdbe8-27bb-4246-bf82-b41a0dca4b70     # vss_ps.dll
  type: similar
- id: 48bfd177-7cf2-412b-ad77-baf923489e82     # vsstrace.dll
  type: similar
status: test
description: Detects the image load of VSS DLL by uncommon executables
references:
- https://github.com/ORCx41/DeleteShadowCopies
author: frack113
date: 2022-10-31
modified: 2023-05-03
tags:
- attack.defense-evasion
- attack.impact
- attack.t1490
logsource:
  category: image_load
  product: windows
detection:
  selection:
    ImageLoaded|endswith: '\vssapi.dll'
  filter_windows:
  - Image:
    - 'C:\Windows\explorer.exe'
    - 'C:\Windows\ImmersiveControlPanel\SystemSettings.exe'
  - Image|startswith:
    - 'C:\Windows\System32\'
    - 'C:\Windows\SysWOW64\'
    - 'C:\Windows\Temp\{'           # Installers
    - 'C:\Windows\WinSxS\'
  filter_program_files:
        # When using this rule in your environment replace the "Program Files" folder by the exact applications you know use this. Examples would be software such as backup solutions
    Image|startswith:
    - 'C:\Program Files\'
    - 'C:\Program Files (x86)\'
  filter_programdata_packagecache:
        # The following filter is required because of many FPs cause by:
        #   C:\ProgramData\Package Cache\{10c6cfdc-27af-43fe-bbd3-bd20aae88451}\dotnet-sdk-3.1.425-win-x64.exe
        #   C:\ProgramData\Package Cache\{b9cfa33e-ace4-49f4-8bb4-82ded940990a}\windowsdesktop-runtime-6.0.11-win-x86.exe
        #   C:\ProgramData\Package Cache\{50264ff2-ad47-4569-abc4-1c350f285fb9}\aspnetcore-runtime-6.0.11-win-x86.exe
        #   C:\ProgramData\Package Cache\{2dcef8c3-1563-4149-a6ec-5b6c98500d7d}\dotnet-sdk-6.0.306-win-x64.exe
        #   etc.
    Image|startswith: 'C:\ProgramData\Package Cache\'
  condition: selection and not 1 of filter_*
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  The detection rule titled "Suspicious Volume Shadow Copy Vssapi.dll Load" aims to identify the loading of the Windows Volume Shadow Copy Service (VSS) library `vssapi.dll` by executables that are not commonly associated with its use. This rule primarily analyzes image load events in Windows environments, focusing on the process initiating the load of `vssapi.dll`. By excluding well-known processes such as `explorer.exe` and `SystemSettings.exe`, as well as standard program file paths, the rule reduces false positives and increases the likelihood of capturing potentially malicious activity that could involve unauthorized manipulation of shadow copies, a technique often leveraged by attackers to evade detection and facilitate ransomware operations.
  To achieve this, the rule inspects columns like `ImageLoaded` and applies filters against the paths from which the load is attempted. If the image loading is detected from uncommon executables, the rule triggers an alert, alerting SOC analysts to investigate a potential security incident.
  ### Investigation Steps
  - Use the EDR tool to review the processes that triggered the alert, focusing on the parent processes and their command-line arguments to gather context around their execution.
  - Check the Windows Event Logs for any unusual activities or error messages related to Volume Shadow Copy operations around the same time as the alert was triggered.
  - Examine the network logs to determine if the flagged process initiated any outbound connections that may indicate data exfiltration or command-and-control activity.
  - Analyze AV and proxy logs for any related detections or anomalies involving the concerned executables or similar activities targeting VSS functionalities.
