title: Potential SmadHook.DLL Sideloading
id: 24b6cf51-6122-469e-861a-22974e9c1e5b
status: test
description: Detects potential DLL sideloading of "SmadHook.dll", a DLL used by SmadAV
  antivirus
references:
- https://research.checkpoint.com/2023/malware-spotlight-camaro-dragons-tinynote-backdoor/
- https://www.qurium.org/alerts/targeted-malware-against-crph/
author: X__Junior (Nextron Systems)
date: 2023-06-01
tags:
- attack.defense-evasion
- attack.privilege-escalation
- attack.t1574.001
- attack.t1574.002
logsource:
  category: image_load
  product: windows
detection:
  selection:
    ImageLoaded|endswith:
    - '\SmadHook32c.dll'
    - '\SmadHook64c.dll'
  filter_main_legit_path:
    Image:
    - 'C:\Program Files (x86)\SMADAV\SmadavProtect32.exe'
    - 'C:\Program Files (x86)\SMADAV\SmadavProtect64.exe'
    - 'C:\Program Files\SMADAV\SmadavProtect32.exe'
    - 'C:\Program Files\SMADAV\SmadavProtect64.exe'
    ImageLoaded|startswith:
    - 'C:\Program Files (x86)\SMADAV\'
    - 'C:\Program Files\SMADAV\'
  condition: selection and not 1 of filter_main_*
falsepositives:
- Unlikely
level: high
notes: |
  ### Technical Context
  This detection rule identifies potential DLL sideloading associated with the `SmadHook.dll` file, commonly used by the SmadAV antivirus software. DLL sideloading is a technique where an attacker tricks an application into loading a malicious DLL instead of a legitimate one, often exploiting the trust placed in the application’s original directory. The rule monitors for the loading of `SmadHook32c.dll` and `SmadHook64c.dll` in the context of legitimate SmadAV executables, specifically the paths where SmadAV software is installed. By correlating the loaded DLLs with their respective parent processes and expected legitimate paths, this rule aims to spot instances where these potentially harmful DLLs might be executed from unauthorized locations, thereby facilitating further investigation into potential exploitation or evasion attempts.
  ### Investigation Steps
  - Check EDR logs for the execution history of `SmadavProtect32.exe` or `SmadavProtect64.exe` to determine if these processes initiated the loading of the flagged DLL.
  - Review process and image load logs to confirm whether `SmadHook32c.dll` or `SmadHook64c.dll` were loaded from unintended directories that deviate from the expected installation paths.
  - Investigate network traffic generated by the same SMADAV processes for any suspicious outbound connections that could indicate data exfiltration or command-and-control communication.
  - Analyze the behavior of the parent processes in the context of your AV/Endpoint Protection tools to identify any unusual actions or system modifications stemming from the DLL loading incident.
