title: Potential DLL Sideloading Of Libcurl.DLL Via GUP.EXE
id: e49b5745-1064-4ac1-9a2e-f687bc2dd37e
status: test
description: Detects potential DLL sideloading of "libcurl.dll" by the "gup.exe" process
  from an uncommon location
references:
- https://labs.withsecure.com/publications/fin7-target-veeam-servers
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023-05-05
tags:
- attack.defense-evasion
- attack.persistence
- attack.privilege-escalation
- attack.t1574.001
- attack.t1574.002
logsource:
  category: image_load
  product: windows
detection:
  selection:
    Image|endswith: '\gup.exe'
    ImageLoaded|endswith: '\libcurl.dll'
  filter_main_notepad_plusplus:
    Image|endswith: '\Notepad++\updater\GUP.exe'
  condition: selection and not 1 of filter_main_*
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  This detection rule is designed to identify potential DLL sideloading activity involving the `gup.exe` process, which is part of the updater for Notepad++. The rule specifically looks for instances where `gup.exe` is loading the `libcurl.dll` library from an atypical directory, potentially indicating malicious behavior. The primary data sources involved in this detection are image load logs from Windows, which record events related to executable files and dynamically loaded libraries. A common technique for attackers involves sideloading a malicious DLL into a legitimate executable process, which this rule aims to catch by monitoring for deviations from expected file paths.
  ### Investigation Steps
  - Investigate the process tree from the EDR solution to determine the parent-child relationships of the `gup.exe` process, identifying any unexpected processes that may have invoked it.
  - Check the path from which `libcurl.dll` was loaded using process creation logs to ensure it originated from a known and legitimate directory.
  - Review endpoint logs for any recent changes or anomalies in the installation or update processes related to Notepad++ to assess if this behavior aligns with legitimate operations.
  - Query network logs through the Proxy or NDR tools to identify any outbound connections initiated by the `gup.exe` process during the time of detection, looking for suspicious or unrecognized IP addresses.
