title: CredUI.DLL Loaded By Uncommon Process
id: 9ae01559-cf7e-4f8e-8e14-4c290a1b4784
status: test
description: Detects loading of "credui.dll" and related DLLs by an uncommon process.
  Attackers might leverage this DLL for potential use of "CredUIPromptForCredentials"
  or "CredUnPackAuthenticationBufferW".
references:
- https://securitydatasets.com/notebooks/atomic/windows/credential_access/SDWIN-201020013208.html
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1056.002/T1056.002.md#atomic-test-2---powershell---prompt-user-for-password
- https://learn.microsoft.com/en-us/windows/win32/api/wincred/nf-wincred-creduipromptforcredentialsa
- https://github.com/S12cybersecurity/RDPCredentialStealer
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
date: 2020-10-20
modified: 2023-07-28
tags:
- attack.credential-access
- attack.collection
- attack.t1056.002
logsource:
  category: image_load
  product: windows
detection:
  selection:
  - ImageLoaded|endswith:
    - '\credui.dll'
    - '\wincredui.dll'
  - OriginalFileName:
    - 'credui.dll'
    - 'wincredui.dll'
  filter_main_generic:
    Image|startswith:
    - 'C:\Program Files (x86)\'
    - 'C:\Program Files\'
    - 'C:\Windows\System32\'
    - 'C:\Windows\SysWOW64\'
  filter_main_full:
    Image:
    - 'C:\Windows\explorer.exe'
    - 'C:\Windows\ImmersiveControlPanel\SystemSettings.exe'
    - 'C:\Windows\regedit.exe'         # This FP is triggered for example when choosing the "Connect Network Registry" from the menu
  filter_optional_opera:
    Image|endswith: '\opera_autoupdate.exe'
  filter_optional_process_explorer:
    Image|endswith:
    - '\procexp64.exe'
    - '\procexp.exe'
  filter_optional_teams:
    Image|startswith: 'C:\Users\'
    Image|contains: '\AppData\Local\Microsoft\Teams\'
    Image|endswith: '\Teams.exe'
  filter_optional_onedrive:
    Image|startswith: 'C:\Users\'
    Image|contains: '\AppData\Local\Microsoft\OneDrive\'
  condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
falsepositives:
- Other legitimate processes loading those DLLs in your environment.
level: medium
notes: |
  ### Technical Context
  This detection rule identifies the loading of the "credui.dll" and "wincredui.dll" by processes that are not commonly associated with these critical Windows components. The rule targets potential malicious activities where attackers may exploit these DLLs using functions such as "CredUIPromptForCredentials" to capture user credentials or manipulate authentication processes. It primarily analyzes image load events, focusing on the original file names to ensure that potential abuse is not coming from known legitimate processes like `explorer.exe` or `regedit.exe`. By filtering out commonly benign process paths, this rule enhances its accuracy in detecting suspicious activity while minimizing false positives.
  ### Investigation Steps
  - Utilize EDR tools to perform a detailed analysis of the alert, reviewing the process tree and confirming the parent-child relationships of the involved processes.
  - Check Windows Event Logs and process creation logs for additional context around the execution of the uncommon process that loaded the DLL, noting the execution time and any related user activity.
  - Investigate network traffic through the NGFW and Proxy logs to determine if there were any outbound connections initiated by the uncommon process that may indicate data exfiltration or command-and-control communications.
  - Review user account logs and authentication events within Windows and any cloud logs to identify if the affected user has reported issues or if there are any indicators of unauthorized access attempts.
