title: Third Party Software DLL Sideloading
id: f9df325d-d7bc-4a32-8a1a-2cc61dcefc63
status: test
description: Detects DLL sideloading of DLLs that are part of third party software
  (zoom, discord....etc)
references:
- https://hijacklibs.net/     # For list of DLLs that could be sideloaded (search for dlls mentioned here in there)
author: Nasreddine Bencherchali (Nextron Systems), Wietze Beukema (project and research)
date: 2022-08-17
tags:
- attack.defense-evasion
- attack.persistence
- attack.privilege-escalation
- attack.t1574.001
- attack.t1574.002
logsource:
  category: image_load
  product: windows
detection:
    # Lenovo
  selection_lenovo:
    ImageLoaded|endswith: '\commfunc.dll'
  filter_lenovo:
  - ImageLoaded|contains: '\AppData\local\Google\Chrome\Application\'
  - ImageLoaded|startswith:
    - 'C:\Program Files\Lenovo\Communications Utility\'
    - 'C:\Program Files (x86)\Lenovo\Communications Utility\'
    # Toshiba
  selection_toshiba:
    ImageLoaded|endswith: '\tosbtkbd.dll'
  filter_toshiba:
    ImageLoaded|startswith:
    - 'C:\Program Files\Toshiba\Bluetooth Toshiba Stack\'
    - 'C:\Program Files (x86)\Toshiba\Bluetooth Toshiba Stack\'
    # Zoom (FP with System32)
    # selection_zoom:
    #     ImageLoaded|endswith: '\version.dll'
    # filter_zoom:
    #     ImageLoaded|startswith: 'C:\Users\'
    #     ImageLoaded|contains: '\AppData\Roaming\Zoom\bin\'
  condition: (selection_lenovo and not filter_lenovo) or (selection_toshiba and not
    filter_toshiba)
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  This detection rule focuses on identifying DLL sideloading techniques related to third-party software, specifically targeting applications like Lenovo Utilities and Toshiba Bluetooth software. DLL sideloading is a method whereby a legitimate application is tricked into loading a malicious DLL, allowing attackers to execute arbitrary code. The detection is rooted in monitoring image load events on Windows systems, particularly the instances where specific DLLs are loaded from known paths associated with these applications. The rule utilizes process creation logs and checks whether the loaded DLLs, such as `commfunc.dll` and `tosbtkbd.dll`, reside outside their expected locations (e.g., the proper program directories), indicating a potential sideloading attempt.
  ### Investigation Steps
  - Utilize the EDR to review the process creation logs for any instances of the suspicious DLLs being loaded. Pay special attention to the file paths to identify deviations from expected application directories.
  - Cross-reference the affected endpoints with your inventory of installed third-party software to understand the context of the application’s usage on the device.
  - Leverage your AV or endpoint security tools to scan for any known malicious signatures associated with the identified DLLs, especially those flagged as potential side-loading threats.
  - Examine cloud logs (if applicable) for unusual network traffic patterns or other suspicious activity that correlates with the time the DLL was loaded, as this may indicate an ongoing or past compromise.
