title: VMGuestLib DLL Sideload
id: 70e8e9b4-6a93-4cb7-8cde-da69502e7aff
status: test
description: Detects DLL sideloading of VMGuestLib.dll by the WmiApSrv service.
references:
- https://decoded.avast.io/martinchlumecky/png-steganography/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-12-01
tags:
- attack.defense-evasion
- attack.persistence
- attack.privilege-escalation
- attack.t1574.001
- attack.t1574.002
logsource:
  category: image_load
  product: windows
detection:
  selection:
    ImageLoaded|contains|all:
    - '\VMware\VMware Tools\vmStatsProvider\win32'
    - '\vmGuestLib.dll'
    Image|endswith: '\Windows\System32\wbem\WmiApSrv.exe'
  filter:
    Signed: 'true'
  condition: selection and not filter
falsepositives:
- FP could occur if the legitimate version of vmGuestLib already exists on the system
level: medium
notes: |
  ### Technical Context
  The "VMGuestLib DLL Sideload" detection rule identifies instances of potentially malicious DLL sideloading involving the `VMGuestLib.dll` file by the Windows Management Instrumentation (WMI) service, specifically the `WmiApSrv.exe`. The detection works by monitoring image loading events on Windows systems, specifically looking for a scenario where `WmiApSrv.exe` loads the `vmGuestLib.dll` file from a non-standard directory, suggesting that a different or malicious version of the DLL may be used for evasion or privilege escalation. This rule checks that the DLL is signed, ruling out possible alerts for legitimate files. It combines information from process creation logs and image load events to pinpoint these suspicious activities.
  ### Investigation Steps
  - Examine the EDR logs for the process tree involving `WmiApSrv.exe` to identify parent and child processes associated with the DLL load. This will help assess whether the process execution path is legitimate or indicative of unauthorized software.
  - Investigate the image load logs to track the source and integrity of the `vmGuestLib.dll` file. Corroborate any discrepancies with system whitelists and trusted software repositories.
  - Query the Proxy and firewall logs for any suspicious outbound connections originating from `WmiApSrv.exe` that could indicate data exfiltration or command and control communication.
  - Review the Windows Event Logs for other anomalies around the time of the alert, such as unusual login events or service changes, which might provide context to the alert and highlight potential lateral movement.
