title: Potential Edputil.DLL Sideloading
id: e4903324-1a10-4ed3-981b-f6fe3be3a2c2
status: test
description: Detects potential DLL sideloading of "edputil.dll"
references:
- https://alternativeto.net/news/2023/5/cybercriminals-use-wordpad-vulnerability-to-spread-qbot-malware/
author: X__Junior (Nextron Systems)
date: 2023-06-09
tags:
- attack.defense-evasion
- attack.privilege-escalation
- attack.t1574.001
- attack.t1574.002
logsource:
  category: image_load
  product: windows
detection:
  selection:
    ImageLoaded|endswith: '\edputil.dll'
  filter_main_generic:
    ImageLoaded|startswith:
    - 'C:\Windows\System32\'
    - 'C:\Windows\SysWOW64\'
    - 'C\Windows\WinSxS\'
  condition: selection and not 1 of filter_main_*
falsepositives:
- Unlikely
level: high
notes: |
  n
  ### Technical Context
  The potential DLL sideloading detection rule is designed to identify instances where the "edputil.dll" file is being loaded into memory, which is often a sign of malicious activity, particularly in relation to privilege escalation and defense evasion techniques. The rule observes for image load events, specifically looking for the specified DLL file in various system directories, such as `C:\Windows\System32\`, `C:\Windows\SysWOW64\`, and `C:\Windows\WinSxS\`. By detecting these events, the rule can help security teams identify and respond to potential exploitation attempts involving the edputil.dll, which cybercriminals might leverage to spread malware like Qbot. This aligns with MITRE ATT&CK techniques T1574.001 and T1574.002, which focus on DLL side-loading to evade security measures.
  ### Investigation Steps
  - **Check Image Load Events:** Utilize EDR tools to review image load event logs for the process that loaded edputil.dll, noting the parent process and context.
  - **Examine Process Creation Logs:** Analyze specific process creation logs around the time the DLL was loaded to determine if any suspicious or unexpected processes were executed.
  - **Review Command-Line Arguments:** Investigate the command-line parameters associated with the processes that loaded edputil.dll to uncover potentially malicious invocation patterns.
  - **Analyze Network Activity:** Utilize NDR tools to check for any outbound network connections from the process associated with edputil.dll to identify potential command and control communications.
  ### Prioritization
  The severity level of this alert is high due to the potential implications of DLL sideloading on system integrity and security, which can facilitate more significant attacks if not addressed promptly.
  ### Blind Spots and Assumptions
  This rule may not fire if the application or process loading the DLL is whitelisted or otherwise trusted by the enterprise security posture. Additionally, it assumes that DLL loading is being actively monitored and that potential adversaries may employ obfuscation techniques or non-standard file paths to evade detection. It's also critical to understand that legitimate applications may also load this DLL, leading to potential false positives.
  > **Disclaimer:** This investigation guide was created using generative AI technology and has not been reviewed for its accuracy and relevance. While every effort has been made to ensure its quality, we recommend validating the content and adapting it to suit specific environment and operational needs. Please communicate any changes to the detection engineering team.
