title: Potential Rcdll.DLL Sideloading
id: 6e78b74f-c762-4800-82ad-f66787f10c8a
status: test
description: Detects potential DLL sideloading of rcdll.dll
references:
- https://www.trendmicro.com/en_us/research/23/c/iron-tiger-sysupdate-adds-linux-targeting.html
author: X__Junior (Nextron Systems)
date: 2023-03-13
modified: 2023-03-15
tags:
- attack.defense-evasion
- attack.privilege-escalation
- attack.t1574.001
- attack.t1574.002
logsource:
  category: image_load
  product: windows
detection:
  selection:
    ImageLoaded|endswith: '\rcdll.dll'
  filter:
    ImageLoaded|startswith:
    - 'C:\Program Files (x86)\Microsoft Visual Studio\'
    - 'C:\Program Files (x86)\Windows Kits\'
  condition: selection and not filter
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This Sigma rule aims to detect potential DLL sideloading involving the `rcdll.dll` file, which is often exploited to inject malicious code through legitimate applications. DLL sideloading occurs when a malicious DLL is loaded in place of a legitimate one, leading to privilege escalation or the circumvention of security measures. The rule specifically monitors process image loads within Windows environments and is particularly interested in instances where `rcdll.dll` is loaded from non-standard directories. By assessing the `ImageLoaded` field for the presence of `rcdll.dll`, while simultaneously checking that it does not originate from Microsoft development directories, analysts can identify potentially suspicious activity related to this DLL's execution.
  ### Investigation Steps
  - Query EDR for the specific endpoint that triggered the alert to track any related processes initiated around the time of the DLL load. 
  - Review process creation logs to determine which application attempted to load `rcdll.dll` and check for any abnormal command-line parameters.
  - Utilize AV logs to analyze if `rcdll.dll` was flagged as malicious or has a known threat signature associated with it.
  - Inspect network traffic logs from the NDR or Proxy to identify any external connections made by the application that loaded `rcdll.dll`, as this could indicate further malicious activity.
