title: Local Privilege Escalation Indicator TabTip
id: bc2e25ed-b92b-4daa-b074-b502bdd1982b
status: test
description: Detects the invocation of TabTip via CLSID as seen when JuicyPotatoNG
  is used on a system in brute force mode
references:
- https://github.com/antonioCoco/JuicyPotatoNG
author: Florian Roth (Nextron Systems)
date: 2022-10-07
modified: 2023-04-14
tags:
- attack.execution
- attack.t1557.001
logsource:
  product: windows
  service: system
detection:
  selection:
    Provider_Name: 'Microsoft-Windows-DistributedCOM'
    EventID: 10001
    param1: 'C:\Program Files\Common Files\microsoft shared\ink\TabTip.exe'      # Binary starting/started
    param2: 2147943140                                                           # ERROR id
    param3: '{054AAE20-4BEA-4347-8A35-64A533254A9D}'                             # DCOM Server
  condition: selection
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This detection rule identifies potential local privilege escalation attempts via a method known as JuicyPotatoNG, specifically targeting the invocation of the TabTip application. The rule looks for events generated by the Distributed Component Object Model (DCOM) service that specifically indicate the execution of TabTip.exe, along with certain error parameters and a predefined CLSID, which is unique to this application. By monitoring Windows system logs, particularly the ones related to DCOM activities, the rule aims to capture anomalous patterns that suggest exploitation attempts by threat actors against local privileges. This can help in detecting operational activities associated with malware or attackers trying to elevate their system access.
  ### Investigation Steps
  - Examine the Windows Event Logs for Event ID 10001 from the Microsoft-Windows-DistributedCOM provider, focusing on instances that match the specified parameters.
  - Utilize EDR tools to investigate the process tree and behavior of TabTip.exe, checking for any signs of malicious activity or unusual process spawning.
  - Query the firewall logs to determine if there were any outbound connections made shortly after the TabTip execution, which could suggest data exfiltration or command-and-control communication.
  - Review user activity logs from the security information and event management (SIEM) system to validate whether the account triggering the event had appropriate permissions and recent unusual access patterns.
