title: Narrator's Feedback-Hub Persistence
id: f663a6d9-9d1b-49b8-b2b1-0637914d199a
status: test
description: Detects abusing Windows 10 Narrator's Feedback-Hub
references:
- https://giuliocomi.blogspot.com/2019/10/abusing-windows-10-narrators-feedback.html
author: Dmitriy Lifanov, oscd.community
date: 2019-10-25
modified: 2022-03-26
tags:
- attack.persistence
- attack.t1547.001
logsource:
  category: registry_event
  product: windows
detection:
  selection1:
    EventType: DeleteValue
    TargetObject|endswith: '\AppXypsaf9f1qserqevf0sws76dx4k9a5206\Shell\open\command\DelegateExecute'
  selection2:
    TargetObject|endswith: '\AppXypsaf9f1qserqevf0sws76dx4k9a5206\Shell\open\command\(Default)'
    # Add the payload in the (Default)
  condition: 1 of selection*
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  The "Narrator's Feedback-Hub Persistence" detection rule is designed to identify the manipulation of Windows 10’s Narrator application through specific registry changes that are indicative of persistence techniques. This rule focuses on two selection criteria involving the deletion of a registry value associated with the Feedback Hub component, which attackers may exploit to maintain persistence on a compromised system. The detection logic looks for events where the registry values under the command associated with the targeted Feedback Hub application are deleted or altered. The primary data source for this rule is Windows registry event logs, specifically monitoring for `DeleteValue` event types related to specific paths, which can indicate exploitation attempts as part of a broader persistence strategy.
  ### Investigation Steps
  - Review the Windows registry event logs, particularly focusing on any `DeleteValue` actions related to the Feedback Hub's registry paths.
  - Use EDR solutions to examine the processes that were active during the time of the registry changes, looking for any unauthorized applications or scripts.
  - Cross-reference any associated alerts with network activity logs from the NDR or firewall to identify any potentially malicious outbound connections.
  - Investigate user accounts that executed commands around the time of the registry event to determine if they were performing unusual activities or using credentials improperly.
