title: Wdigest CredGuard Registry Modification
id: 1a2d6c47-75b0-45bd-b133-2c0be75349fd
status: test
description: |
  Detects potential malicious modification of the property value of IsCredGuardEnabled from
  HKLM:\SYSTEM\CurrentControlSet\Control\SecurityProviders\WDigest to disable Cred Guard on a system.
  This is usually used with UseLogonCredential to manipulate the caching credentials.
references:
- https://teamhydra.blog/2020/08/25/bypassing-credential-guard/
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
date: 2019-08-25
modified: 2021-11-27
tags:
- attack.defense-evasion
- attack.t1112
logsource:
  category: registry_event
  product: windows
detection:
  selection:
    TargetObject|endswith: '\IsCredGuardEnabled'
  condition: selection
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This detection rule targets potential malicious modifications to the Windows Registry, specifically monitoring changes to the `IsCredGuardEnabled` property located at `HKLM:\SYSTEM\CurrentControlSet\Control\SecurityProviders\WDigest`. By tracking this registry modification, the rule aims to identify attempts to disable Credential Guard (CredGuard), which could facilitate the caching of credentials for passive extraction. The rule specifically looks for any instances where this particular registry key is altered, as disabling CredGuard is often employed in conjunction with the `UseLogonCredential` property to manipulate cached credential mechanisms. The primary data source involved is Windows Registry event logs.
  ### Investigation Steps
  - Review the changes made to the `IsCredGuardEnabled` registry key using EDR tools to analyze which processes made the modifications and when they occurred.
  - Cross-reference the timestamps of the registry change with user logon events in your proxy and VPN logs to assess if there were any unusual access patterns during that time frame.
  - Utilize AV logs to check for any related threats or malicious activities flagged on the system around the time of the registry modification.
  - Conduct a broader threat hunt using NDR and network logs to identify any related command and control traffic or lateral movement that may correlate with the changes made.
