title: Shell Open Registry Keys Manipulation
id: 152f3630-77c1-4284-bcc0-4cc68ab2f6e7
status: test
description: Detects the shell open key manipulation (exefile and ms-settings) used
  for persistence and the pattern of UAC Bypass using fodhelper.exe, computerdefaults.exe,
  slui.exe via registry keys (e.g. UACMe 33 or 62)
references:
- https://github.com/hfiref0x/UACME
- https://winscripting.blog/2017/05/12/first-entry-welcome-and-uac-bypass/
- https://github.com/RhinoSecurityLabs/Aggressor-Scripts/tree/master/UACBypass
- https://tria.ge/211119-gs7rtshcfr/behavioral2 [Lokibot sample from Nov 2021]
author: Christian Burkard (Nextron Systems)
date: 2021-08-30
modified: 2022-01-13
tags:
- attack.defense-evasion
- attack.privilege-escalation
- attack.t1548.002
- attack.t1546.001
logsource:
  category: registry_event
  product: windows
detection:
  selection1:
    EventType: SetValue
    TargetObject|endswith: 'Classes\ms-settings\shell\open\command\SymbolicLinkValue'
    Details|contains: '\Software\Classes\{'
  selection2:
    TargetObject|endswith: 'Classes\ms-settings\shell\open\command\DelegateExecute'
  selection3:
    EventType: SetValue
    TargetObject|endswith:
    - 'Classes\ms-settings\shell\open\command\(Default)'
    - 'Classes\exefile\shell\open\command\(Default)'
  filter_sel3:
    Details: '(Empty)'
  condition: selection1 or selection2 or (selection3 and not filter_sel3)
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This detection rule identifies attempts to manipulate the Windows Registry for persistence and to bypass User Account Control (UAC) by monitoring specific changes to key locations within the registry related to application execution. The rule looks for registry events where executable command associations are altered, specifically targeting the `ms-settings` and `exefile` classes. It utilizes data from registry event logs, focusing on actions such as setting values for registry keys that may indicate malicious intent. Techniques like UAC bypass often exploit these registry keys by associating malicious executables to legitimate processes (e.g., `fodhelper.exe`, `computerdefaults.exe`, `slui.exe`). By monitoring these changes, the organization can detect suspicious behavior indicative of privilege escalation and defense evasion tactics.
  ### Investigation Steps
  - Review recent registry event logs from the endpoint using the EDR tool to identify any SetValue actions that match the specified criteria.
  - Cross-reference any identified registry changes with process creation logs to track associated executable activity around the same time.
  - Investigate the associated command-line arguments of processes linked to the manipulated registry keys using the EDR for any signs of abnormal behavior.
  - Check the firewall and network logs for unusual outbound connections that may relate to the altered command executions, especially for known malicious indicators.
