title: Run Once Task Configuration in Registry
id: c74d7efc-8826-45d9-b8bb-f04fac9e4eff
status: test
description: Rule to detect the configuration of Run Once registry key. Configured
  payload can be run by runonce.exe /AlternateShellStartup
references:
- https://twitter.com/pabraeken/status/990717080805789697
- https://lolbas-project.github.io/lolbas/Binaries/Runonce/
author: 'Avneet Singh @v3t0_, oscd.community'
date: 2020-11-15
modified: 2024-03-25
tags:
- attack.defense-evasion
- attack.t1112
logsource:
  product: windows
  category: registry_event
detection:
  selection:
    TargetObject|contains: '\Microsoft\Active Setup\Installed Components'
    TargetObject|endswith: '\StubPath'
  filter_optional_chrome:
    Details|contains|all:
    - 'C:\Program Files\Google\Chrome\Application\'
    - '\Installer\chrmstp.exe" --configure-user-settings --verbose-logging --system-level'         # In some cases the Details will contain an additional flag called "--channel=stable" at the end
  filter_optional_edge:
    Details|contains:
    - 'C:\Program Files (x86)\Microsoft\Edge\Application\'
    - 'C:\Program Files\Microsoft\Edge\Application\'
    Details|endswith: '\Installer\setup.exe" --configure-user-settings --verbose-logging
      --system-level --msedge --channel=stable'
  condition: selection and not 1 of filter_optional_*
falsepositives:
- Legitimate modification of the registry key by legitimate program
level: medium
notes: |
  ### Technical Context
  The detection rule identifies potentially malicious modifications to the Windows registry's "Run Once" key related to Active Setup components. Specifically, it looks for changes to the registry path `\Microsoft\Active Setup\Installed Components` where the `StubPath` key resides. The rule is particularly concerned with command-line parameters indicating that an application may be set to run at user login using non-standard behavior — for example, if the parameters suggest configuration changes to widely used applications such as Google Chrome or Microsoft Edge. The relevant data sources for this rule include registry event logs, which capture the activity surrounding modifications to critical system configurations.
  This rule serves as a vital point of detection for activities associated with the defense evasion tactic in the MITRE ATT&CK framework, specifically T1112. Alerts generated by this rule may require further investigation to differentiate between legitimate administrative tasks and potential malicious activities that could compromise system integrity.
  ### Investigation Steps
  - Utilize your EDR tool to examine the full context of the process that modified the registry key, focusing on the parent process and any associated command-line arguments.
  - Review historical logs from your NGFW or Proxy to identify any unusual external communications or connections made by processes associated with the registry modification.
  - Check the system's AV logs to see if the modified application has flagged any suspicious activity or known malware.
  - Consult cloud platform logs (if applicable) to ascertain whether this activity is correlated with any recent deployments or changes within your infrastructure that may justify the modification.
