title: Creation of a Local Hidden User Account by Registry
id: 460479f3-80b7-42da-9c43-2cc1d54dbccd
status: test
description: Sysmon registry detection of a local hidden user account.
references:
- https://twitter.com/SBousseaden/status/1387530414185664538
author: Christian Burkard (Nextron Systems)
date: 2021-05-03
modified: 2022-08-05
tags:
- attack.persistence
- attack.t1136.001
logsource:
  product: windows
  category: registry_event
detection:
  selection:
    TargetObject|contains: '\SAM\SAM\Domains\Account\Users\Names\'
    TargetObject|endswith: '$'
    Image|endswith: '\lsass.exe'
  condition: selection
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This detection rule monitors for the unauthorized creation of local hidden user accounts in a Windows environment by examining the Windows registry. Specifically, it looks for registry events where the target object contains the path `\SAM\SAM\Domains\Account\Users\Names\`, indicates that an object ends with a dollar sign (which is a common convention for hidden accounts), and is associated with the `lsass.exe` process, which is responsible for security policy and account management. When the specified conditions are met, it suggests that a malicious actor may be trying to create a covert user account on the system, which is often a tactic used for persistence in an environment. The data sources involved in this detection include Sysmon logs that capture registry changes, particularly focusing on changes to user accounts.
  ### Investigation Steps
  - Review EDR logs to identify instances of `lsass.exe` that have created or modified any registry keys under the specified path to confirm the occurrence of suspicious activity.
  - Analyze the associated process tree for `lsass.exe` to determine if there are any other related processes that may indicate a compromised system or potential lateral movement.
  - Check for any alerts or entries in the AV or endpoint protection systems that could indicate previous known threats targeting hidden user accounts.
  - Correlate findings with logs from the SIEM to identify any anomalous login attempts or access to sensitive resources by any newly created user accounts.
