title: Enable Remote Connection Between Anonymous Computer - AllowAnonymousCallback
id: 4d431012-2ab5-4db7-a84e-b29809da2172
status: test
description: Detects enabling of the "AllowAnonymousCallback" registry value, which
  allows a remote connection between computers that do not have a trust relationship.
references:
- https://learn.microsoft.com/en-us/windows/win32/wmisdk/connecting-to-wmi-remotely-starting-with-vista
author: X__Junior (Nextron Systems)
date: 2023-11-03
tags:
- attack.defense-evasion
- attack.t1562.001
logsource:
  product: windows
  category: registry_set
detection:
  selection:
    TargetObject|contains: '\Microsoft\WBEM\CIMOM\AllowAnonymousCallback'
    Details: 'DWORD (0x00000001)'
  condition: selection
falsepositives:
- Administrative activity
level: medium
notes: |
  ### Technical Context
  The Sigma rule titled "Enable Remote Connection Between Anonymous Computer 
  - AllowAnonymousCallback" is designed to detect modifications to a specific Windows registry value that enables anonymous remote connections between computers lacking a trust relationship. Specifically, it monitors changes to the registry key located at `\Microsoft\WBEM\CIMOM\AllowAnonymousCallback`, with a focus on identifying instances where this key is set to `DWORD (0x00000001)`. An adjustment to this setting may facilitate unauthorized access or malicious activities by allowing connections from unauthenticated users, thereby posing a potential risk to the security posture of the organization.
  To effectively implement this detection, event data from Windows registry modifications is leveraged. Analysts should be vigilant for any legitimate administrative activities that might cause false positives, given that administrative tasks may also involve modifications to this key. Understanding this context is crucial for interpreting alerts generated by the rule and determining appropriate responses.
  ### Investigation Steps
  - Review process creation logs in the EDR to identify any recent executable processes that might have altered the registry key, focusing on timestamps and parent-child relationships. 
  - Use the SIEM to correlate the occurrence of the registry modification with other security events occurring around the same time to evaluate whether this change aligns with suspicious activities.
  - Check firewall logs on the NGFW to see if there have been any recent connections from or to unknown or unauthorized IP addresses that might indicate misuse of the newly allowed anonymous connections.
  - Investigate outbound traffic through the Proxy logs to find connections to external services that could suggest exploitation attempts or data exfiltration following the registry change.
