title: Suspicious Camera and Microphone Access
id: 62120148-6b7a-42be-8b91-271c04e281a3
status: test
description: Detects Processes accessing the camera and microphone from suspicious
  folder
references:
- https://medium.com/@7a616368/can-you-track-processes-accessing-the-camera-and-microphone-7e6885b37072
author: Den Iuzvyk
date: 2020-06-07
modified: 2022-10-09
tags:
- attack.collection
- attack.t1125
- attack.t1123
logsource:
  category: registry_event
  product: windows
detection:
  selection_1:
    TargetObject|contains|all:
    - '\Software\Microsoft\Windows\CurrentVersion\CapabilityAccessManager\ConsentStore\'
    - '\NonPackaged'
  selection_2:
    TargetObject|contains:
    - microphone
    - webcam
  selection_3:
    TargetObject|contains:
    - ':#Windows#Temp#'
    - ':#$Recycle.bin#'
    - ':#Temp#'
    - ':#Users#Public#'
    - ':#Users#Default#'
    - ':#Users#Desktop#'
  condition: all of selection_*
falsepositives:
- Unlikely, there could be conferencing software running from a Temp folder accessing
  the devices
level: high
notes: |
  ### Technical Context
  This detection rule identifies potentially malicious or suspicious activity involving camera and microphone access on Windows systems. It specifically monitors registry events for processes that attempt to access these devices from atypical directories known to be less secure, such as temporary folders or the recycle bin. The rule combines multiple selections that look for access patterns to critical object paths within the Windows registry, particularly focusing on Camera and Microphone access flags. If a process is found to be interacting with these sensitive capabilities from suspect locations like `Temp` or `Recycle.bin`, the rule triggers an alert. This monitoring is crucial as attackers may exploit legitimate device functionality for surveillance or data exfiltration purposes.
  ### Investigation Steps
  - Review the process creation logs within the EDR to identify any processes that accessed the camera or microphone around the time of the alert.
  - Cross-check the process paths against known good applications to differentiate between potentially legitimate applications (e.g., conferencing software) and suspicious activities.
  - Leverage the AV solution to scan the identified processes for known malware signatures or behaviors indicative of compromise.
  - Analyze any related network traffic logs from the Proxy or NDR to look for unusual data transmissions that might indicate an active data exfiltration attempt using the camera or microphone.
