title: New DLL Added to AppCertDlls Registry Key
id: 6aa1d992-5925-4e9f-a49b-845e51d1de01
status: test
description: |
  Dynamic-link libraries (DLLs) that are specified in the AppCertDLLs value in the Registry key can be abused to obtain persistence and privilege escalation
  by causing a malicious DLL to be loaded and run in the context of separate processes on the computer.
references:
- http://www.hexacorn.com/blog/2013/01/19/beyond-good-ol-run-key-part-3/
- https://eqllib.readthedocs.io/en/latest/analytics/14f90406-10a0-4d36-a672-31cabe149f2f.html
author: Ilyas Ochkov, oscd.community
date: 2019-10-25
modified: 2021-11-27
tags:
- attack.persistence
- attack.t1546.009
logsource:
  category: registry_event
  product: windows
detection:
  selection:
        # Sysmon gives us HKLM\SYSTEM\CurrentControlSet\.. if ControlSetXX is the selected one
  - TargetObject: 'HKLM\SYSTEM\CurrentControlSet\Control\Session Manager\AppCertDlls'
        # key rename
  - NewName: 'HKLM\SYSTEM\CurentControlSet\Control\Session Manager\AppCertDlls'
  condition: selection
fields:
- EventID
- Image
- TargetObject
- NewName
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  This Sigma rule monitors changes to the AppCertDlls registry key, specifically looking for newly added dynamic-link libraries (DLLs). Malicious actors can exploit this registry key to achieve persistence and privilege escalation by forcing the operating system to load their malicious DLLs during the initialization of certain processes. The detection employs registry event logs generated by Windows systems, particularly focusing on events that indicate modifications to the `HKLM\SYSTEM\CurrentControlSet\Control\Session Manager\AppCertDlls` key. By tracking these alterations, security teams can identify potentially harmful changes that might indicate the presence of malware or unauthorized changes within the system.
  ### Investigation Steps
  - Review the EDR logs to correlate the event with any abnormal process creation activities around the time the DLL was added to understand potential exploitation vectors.
  - Check the integrity and reputation of the newly added DLL against known trusted sources using your AV solution to identify if it’s recognized as malicious.
  - Examine the command-line parameters and process execution details in the EDR to assess whether the new DLL is associated with known malicious behavior or linked to any specific user actions.
  - Analyze the registry change within your SIEM to determine if there were other registry modifications or related events that may indicate a broader compromise or attack pattern.
