title: Disable Security Events Logging Adding Reg Key MiniNt
id: 919f2ef0-be2d-4a7a-b635-eb2b41fde044
status: test
description: Detects the addition of a key 'MiniNt' to the registry. Upon a reboot,
  Windows Event Log service will stopped write events.
references:
- https://twitter.com/0gtweet/status/1182516740955226112
author: Ilyas Ochkov, oscd.community
date: 2019-10-25
modified: 2021-11-27
tags:
- attack.defense-evasion
- attack.t1562.001
- attack.t1112
logsource:
  category: registry_event
  product: windows
detection:
  selection:
    # Sysmon gives us HKLM\SYSTEM\CurrentControlSet\.. if ControlSetXX is the selected one
  - TargetObject: 'HKLM\SYSTEM\CurrentControlSet\Control\MiniNt'
    EventType: 'CreateKey'          # we don't want deletekey
    # key rename
  - NewName: 'HKLM\SYSTEM\CurrentControlSet\Control\MiniNt'
  condition: selection
fields:
- EventID
- Image
- TargetObject
- NewName
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This Sigma rule focuses on detecting a potentially malicious modification to the Windows registry, specifically the addition of a registry key named 'MiniNt'. The creation of this key at the path `HKLM\SYSTEM\CurrentControlSet\Control` can signify an attempt to disable security event logging. Upon the next system reboot, doing so may prevent the Windows Event Log service from recording any events, which is a common tactic used by attackers to obscure their activities. The primary data sources utilized for this detection include Windows Registry Event logs, which capture changes made to the registry, and Sysmon logs to reveal key creation events and their contexts.
  By monitoring for the creation of this specific registry key, the detection rule helps identify potential evasion attempts that could facilitate further malicious activities within the environment. It’s critical for incident responders to be aware of such changes, as they may indicate active compromise or attempts to limit visibility into the attacker's actions.
  ### Investigation Steps
  - Review EDR logs to identify the process responsible for creating the 'MiniNt' key and correlate it with existing threat intelligence.
  - Examine additional registry events around the same timestamp to determine if there are other potentially malicious changes occurring in the system.
  - Utilize Windows Event Log data to check for signs of unusual reboot patterns, especially after the creation of the registry key.
  - Investigate any related network activity via NDR and Proxy logs that may correspond with the timeframe of the registry modification for further context on potential malicious behavior.
