title: CodeIntegrity - Blocked Image/Driver Load For Policy Violation
id: e4be5675-4a53-426a-8c81-a8bb2387e947
status: test
description: Detects blocked load events that did not meet the authenticode signing
  level requirements or violated the code integrity policy.
references:
- https://twitter.com/wdormann/status/1590434950335320065
- https://github.com/MicrosoftDocs/windows-itpro-docs/blob/40fe118976734578f83e5e839b9c63ae7a4af82d/windows/security/threat-protection/windows-defender-application-control/event-id-explanations.md#windows-codeintegrity-operational-log
- https://learn.microsoft.com/en-us/windows/security/application-security/application-control/windows-defender-application-control/operations/event-id-explanations
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-11-10
modified: 2023-06-07
tags:
- attack.privilege-escalation
- attack.t1543
logsource:
  product: windows
  service: codeintegrity-operational
detection:
  selection:
    EventID: 3077     # Code Integrity determined that a process (%4) attempted to load %2 that did not meet the %5 signing level requirements or violated code integrity policy (Policy ID:%XX).
  condition: selection
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This detection rule focuses on identifying potentially malicious activities related to code integrity violations in Windows operating systems. Specifically, it looks for events where an application or driver attempts to load but fails to meet the required Authenticode signing level or violates the established code integrity policy. The primary data source is the Code Integrity Operational log, particularly Event ID 3077, which provides details on the failed load attempt, including the name of the process and the specific policies it violated. By monitoring these events, incident responders can detect possible privilege escalation attempts or unauthorized code executions that could compromise system integrity.
  ### Investigation Steps
  - Review the Code Integrity Operational log for Event ID 3077 to gather specifics on the blocked process and the corresponding image or driver that was attempted to be loaded.
  - Utilize EDR tools to determine if the blocked process has previously been observed in your environment, and check for any suspicious activities associated with its execution history.
  - Cross-reference the process with threat intelligence feeds and vendor databases to assess whether it is known for malicious activity.
  - Examine supplemental logs from NGFW and AV solutions to identify any anomalous traffic or behavior linked to the process in question.
