title: CodeIntegrity - Unsigned Image Loaded
id: c92c24e7-f595-493f-9c98-53d5142f5c18
status: test
description: Detects loaded unsigned image on the system
references:
- https://learn.microsoft.com/en-us/windows/security/application-security/application-control/windows-defender-application-control/operations/event-id-explanations
- https://learn.microsoft.com/en-us/windows/security/application-security/application-control/windows-defender-application-control/operations/event-tag-explanations
- Internal Research
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023-06-06
tags:
- attack.privilege-escalation
logsource:
  product: windows
  service: codeintegrity-operational
detection:
  selection:
    EventID: 3037     # Code Integrity determined an unsigned image %2 is loaded into the system. Check with the publisher to see if a signed version of the image is available.
  condition: selection
falsepositives:
- Unlikely
level: high
notes: |
  ### Technical Context
  The Sigma rule "CodeIntegrity 
  - Unsigned Image Loaded" is designed to detect instances where an unsigned image has been loaded into a Windows system. Specifically, it focuses on Event ID 3037, which indicates that the Code Integrity subsystem has identified an unsigned image, raising concerns about potential security risks. This rule helps organizations maintain application security and mitigate threats by ensuring that only trusted and verified software can execute on their machines. The relevant data source for this detection includes Windows Code Integrity operational logs, which track changes and events related to the execution of applications and system images.
  ### Investigation Steps
  - Review the alert details, focusing on the specific unsigned image reported and its associated metadata such as file path and hash values.
  - Use EDR tools to trace the process lineage and understand how the unsigned image was executed, including any parent processes or suspicious command-line arguments.
  - Consult AV logs to check if the unsigned image has a known threat associated with it and whether it has been flagged or quarantined by security software.
  - Investigate any network activity related to this image using NDR or Proxy logs to identify potential connections to external command and control servers or data exfiltration attempts.
