title: CodeIntegrity - Blocked Driver Load With Revoked Certificate
id: 9b72b82d-f1c5-4632-b589-187159bc6ec1
status: test
description: Detects blocked load attempts of revoked drivers
references:
- https://learn.microsoft.com/en-us/windows/security/application-security/application-control/windows-defender-application-control/operations/event-id-explanations
- https://learn.microsoft.com/en-us/windows/security/application-security/application-control/windows-defender-application-control/operations/event-tag-explanations
- Internal Research
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023-06-06
tags:
- attack.privilege-escalation
- attack.t1543
logsource:
  product: windows
  service: codeintegrity-operational
detection:
  selection:
    EventID: 3023     # The driver %2 is blocked from loading as the driver has been revoked by Microsoft.
  condition: selection
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  The Sigma rule titled "CodeIntegrity 
  - Blocked Driver Load With Revoked Certificate" is designed to detect instances where Windows operating systems attempt to load drivers that have been revoked by Microsoft. Specifically, it focuses on events logged under Event ID 3023, which indicates that a driver blocked from loading due to its revoked status. This functionality is an integral part of Windows' security model, safeguarding the system against potentially harmful modifications by ensuring that only drivers with valid certificates are allowed to be executed. The primary data source for this rule is the Code Integrity operational log, which tracks events related to the integrity of system files and drivers.
  By monitoring these events, security teams can quickly identify attempts to use malicious or unauthorized drivers that may compromise system integrity, provide attackers with elevated privileges, or facilitate other malicious activities. The high-level alerts generated by this rule can serve as a starting point for in-depth investigations into potential privilege escalation attempts or other abnormal activities that could threaten system security.
  ### Investigation Steps
  - Review the specific Event ID 3023 logs using the EDR solution to gather contextual information about the blocked driver, including its name and the timestamp of the load attempt.
  - Check for any related process creation events around the same timeframe to identify any applications or services that may have attempted to load the revoked driver.
  - Utilize AV and threat intelligence to analyze the blocked driver, determining if it is associated with known malicious behavior or if it might be a legitimate, erroneously blocked driver.
  - Investigate user activities and access logs to uncover any signs of unauthorized access or usage patterns that could explain the attempt to load the revoked driver.
