title: SyncAppvPublishingServer Bypass Powershell Restriction - PS Module
id: fe5ce7eb-dad8-467c-84a9-31ec23bd644a
related:
- id: fde7929d-8beb-4a4c-b922-be9974671667
  type: derived
- id: 9f7aa113-9da6-4a8d-907c-5f1a4b908299
  type: derived
status: test
description: Detects SyncAppvPublishingServer process execution which usually utilized
  by adversaries to bypass PowerShell execution restrictions.
references:
- https://lolbas-project.github.io/lolbas/Binaries/Syncappvpublishingserver/
author: 'Ensar Şamil, @sblmsrsn, OSCD Community'
date: 2020-10-05
modified: 2022-12-02
tags:
- attack.defense-evasion
- attack.t1218
logsource:
  product: windows
  category: ps_module
  definition: 0ad03ef1-f21b-4a79-8ce8-e6900c54b65b
detection:
  selection:
    ContextInfo|contains: 'SyncAppvPublishingServer.exe'
  condition: selection
falsepositives:
- App-V clients
level: medium
notes: |
  ### Technical Context
  The detection rule for SyncAppvPublishingServer bypasses PowerShell execution restrictions by monitoring for the execution of the SyncAppvPublishingServer.exe process. This application is often leveraged by adversaries to evade security mechanisms that prevent unauthorized script execution. The main focus of the rule is to capture instances where this specific executable is initiated, typically indicating potential nefarious activity. The rule draws data from Windows PowerShell module logs where the context information contains the string "SyncAppvPublishingServer.exe." This allows security operations center (SOC) teams to identify and respond to potentially malicious behavior associated with the exploitation of legitimate tools and processes.
  ### Investigation Steps
  - Review EDR alerts to locate the execution path of the SyncAppvPublishingServer.exe process and examine any associated parent processes that may indicate malicious behavior.
  - Investigate process creation logs and correlate the timeline with other security events to determine if the execution aligns with known attack patterns or times of suspicious activity.
  - Search Proxy logs for any unusual outbound network connections made shortly after the execution of SyncAppvPublishingServer.exe, as this may indicate command and control (C2) activity.
  - Analyze Windows event logs for related events surrounding the execution, including user logins and other process activities, to gain a comprehensive view of the incident's context.
