title: AD Groups Or Users Enumeration Using PowerShell - PoshModule
id: 815bfc17-7fc6-4908-a55e-2f37b98cedb4
status: test
description: |
  Adversaries may attempt to find domain-level groups and permission settings.
  The knowledge of domain-level permission groups can help adversaries determine which groups exist and which users belong to a particular group.
  Adversaries may use this information to determine which users have elevated permissions, such as domain administrators.
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1069.002/T1069.002.md
author: frack113
date: 2021-12-15
modified: 2023-01-20
tags:
- attack.discovery
- attack.t1069.001
logsource:
  product: windows
  category: ps_module
  definition: 0ad03ef1-f21b-4a79-8ce8-e6900c54b65b
detection:
  selection_ad_principal:
  - Payload|contains: 'get-ADPrincipalGroupMembership'
  - ContextInfo|contains: 'get-ADPrincipalGroupMembership'
  selection_get_aduser:
  - Payload|contains|all:
    - get-aduser
    - '-f '
    - '-pr '
    - DoesNotRequirePreAuth
  - ContextInfo|contains|all:
    - get-aduser
    - '-f '
    - '-pr '
    - DoesNotRequirePreAuth
  condition: 1 of selection_*
falsepositives:
- Administrator script
level: low
notes: |
  ### Technical Context
  This detection rule targets the enumeration of Active Directory (AD) groups and users through PowerShell commands, specifically focusing on `get-ADPrincipalGroupMembership` and `get-aduser`. Adversaries frequently employ these commands to identify domain-level groups and the users associated with them, which can reveal critical information about user privileges and permissions within an enterprise environment. The rule analyzes process logs generated by PowerShell execution (especially those produced by the command line), looking for specific parameters and payloads that indicate enumeration activities. By monitoring for these patterns, incident responders can identify potential reconnaissance efforts by unauthorized actors aimed at gathering information for further exploitation.
  ### Investigation Steps
  - Use EDR tools to review the endpoint's PowerShell execution logs for the identified commands and their parameters to confirm if they were run in a context that indicates suspicious behavior.
  - Analyze user activity associated with these commands by checking the timeline of executed processes and correlating it with account privileges to determine if any unauthorized access attempts occurred.
  - Review network logs via NDR or Proxy to identify any unusual outbound traffic patterns that may suggest exfiltration of the gathered information following the enumeration.
  - Inspect authentication logs in the domain controller for any logins or activities from the user accounts that executed the PowerShell commands to assess if they had the appropriate authorization and to check for anomalies.
