title: Suspicious PowerShell Invocations - Specific - PowerShell Module
id: 8ff28fdd-e2fa-4dfa-aeda-ef3d61c62090
related:
- id: fce5f582-cc00-41e1-941a-c6fabf0fdb8c
  type: obsolete
- id: ae7fbf8e-f3cb-49fd-8db4-5f3bed522c71
  type: similar
- id: 536e2947-3729-478c-9903-745aaffe60d2
  type: similar
status: test
description: Detects suspicious PowerShell invocation command parameters
references:
- Internal Research
author: Florian Roth (Nextron Systems), Jonhnathan Ribeiro
date: 2017-03-05
modified: 2023-01-05
tags:
- attack.execution
- attack.t1059.001
logsource:
  product: windows
  category: ps_module
  definition: 0ad03ef1-f21b-4a79-8ce8-e6900c54b65b
detection:
  selection_convert_b64:
    ContextInfo|contains|all:
    - '-nop'
    - ' -w '
    - 'hidden'
    - ' -c '
    - '[Convert]::FromBase64String'
  selection_iex:
    ContextInfo|contains|all:
    - ' -w '
    - 'hidden'
    - '-noni'
    - '-nop'
    - ' -c '
    - 'iex'
    - 'New-Object'
  selection_enc:
    ContextInfo|contains|all:
    - ' -w '
    - 'hidden'
    - '-ep'
    - 'bypass'
    - '-Enc'
  selection_reg:
    ContextInfo|contains|all:
    - 'powershell'
    - 'reg'
    - 'add'
    - 'HKCU\software\microsoft\windows\currentversion\run'
  selection_webclient:
    ContextInfo|contains|all:
    - 'bypass'
    - '-noprofile'
    - '-windowstyle'
    - 'hidden'
    - 'new-object'
    - 'system.net.webclient'
    - '.download'
  selection_iex_webclient:
    ContextInfo|contains|all:
    - 'iex'
    - 'New-Object'
    - 'Net.WebClient'
    - '.Download'
  filter_chocolatey:
    ContextInfo|contains:
    - "(New-Object System.Net.WebClient).DownloadString('https://community.chocolatey.org/install.ps1"
    - 'Write-ChocolateyWarning'
  condition: 1 of selection_* and not 1 of filter_*
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This detection rule specifically targets suspicious PowerShell invocations that often indicate potential malicious activities. It analyzes PowerShell command parameters for patterns associated with obfuscation and execution tactics commonly utilized by attackers. Key indicators include the use of flags such as `-nop` (which disables PowerShell's profile), `-w` (for window style), `-Enc` (for encoded commands), and the presence of `iex` (Invoke-Expression) that can execute commands dynamically. The rule utilizes logs from Windows environments where the `ps_module` category is defined, focusing on the `ContextInfo` field to identify these command parameters.
  By monitoring for these suspicious invocations, security analysts can detect potential execution of payloads, remote code execution attempts, or other malicious PowerShell activity that seeks to evade security measures. This rule helps in identifying obfuscated scripts that leverage the PowerShell environment for unauthorized tasks, enabling early detection and response to potential threats.
  ### Investigation Steps
  - Utilize EDR tools to check for active PowerShell processes that match the suspicious command parameters identified. Analyze the parent-child relationship to determine where the execution originated.
  - Review the Windows Event Logs for PowerShell command execution details and correlate findings with the instance of suspicious invocations to capture the full context of the behavior.
  - Analyze network traffic logs from NGFW and Proxy solutions to identify any outbound connections initiated by the PowerShell commands, especially those reaching out to known malicious domains.
  - Investigate the system for persistence mechanisms, such as examining the registry for newly added startup entries that may have been configured using PowerShell commands flagged by this rule.
