title: Suspicious Computer Machine Password by PowerShell
id: e3818659-5016-4811-a73c-dde4679169d2
status: test
description: |
  The Reset-ComputerMachinePassword cmdlet changes the computer account password that the computers use to authenticate to the domain controllers in the domain.
  You can use it to reset the password of the local computer.
references:
- https://learn.microsoft.com/en-us/powershell/module/microsoft.powershell.management/reset-computermachinepassword?view=powershell-5.1
- https://thedfirreport.com/2022/02/21/qbot-and-zerologon-lead-to-full-domain-compromise/
author: frack113
date: 2022-02-21
tags:
- attack.initial-access
- attack.t1078
logsource:
  product: windows
  category: ps_module
  definition: 0ad03ef1-f21b-4a79-8ce8-e6900c54b65b
detection:
  selection:
    ContextInfo|contains: 'Reset-ComputerMachinePassword'
  condition: selection
falsepositives:
- Administrator PowerShell scripts
level: medium
notes: |
  ### Technical Context
  This detection rule identifies the use of the PowerShell cmdlet `Reset-ComputerMachinePassword`, which is typically employed to change the password of the computer account used for domain authentication. The cmdlet can be leveraged by both legitimate administrative tasks and by attackers who aim to bypass authentication controls, making its usage a point of concern. The rule analyzes logs generated from PowerShell activity, specifically monitoring for instances where `Reset-ComputerMachinePassword` is invoked. By capturing this PowerShell command along with contextual information, security teams can assess whether the action was part of normal administrative operations or indicative of potential malicious intent, especially when associated with other suspicious activities.
  ### Investigation Steps
  - Review PowerShell activity logs in the EDR to identify the invocation of the `Reset-ComputerMachinePassword` cmdlet and any related command-line parameters used during execution.
  - Examine the user account that executed the PowerShell command, and verify whether it aligns with known administrative users or manifests anomalous behavior.
  - Correlate the timing of this command with other events in the SIEM such as failed login attempts or unauthorized changes to accounts that may suggest a compromise.
  - Check network traffic via NDR solutions to detect any suspicious communications from the affected machine to domain controllers or other critical infrastructure following the command's execution.
