title: Suspicious PowerShell Download - PoshModule
id: de41232e-12e8-49fa-86bc-c05c7e722df9
related:
- id: 65531a81-a694-4e31-ae04-f8ba5bc33759
  type: derived
status: test
description: Detects suspicious PowerShell download command
references:
- https://learn.microsoft.com/en-us/dotnet/api/system.net.webclient.downloadfile?view=net-8.0
- https://learn.microsoft.com/en-us/dotnet/api/system.net.webclient.downloadstring?view=net-8.0
author: Florian Roth (Nextron Systems)
date: 2017-03-05
modified: 2023-01-20
tags:
- attack.execution
- attack.t1059.001
logsource:
  product: windows
  category: ps_module
  definition: 0ad03ef1-f21b-4a79-8ce8-e6900c54b65b
detection:
  selection_webclient_:
    ContextInfo|contains: 'System.Net.WebClient'
  selection_function:
    ContextInfo|contains:
    - '.DownloadFile('
    - '.DownloadString('
  condition: all of selection_*
falsepositives:
- PowerShell scripts that download content from the Internet
level: medium
notes: |
  ### Technical Context
  This detection rule identifies suspicious PowerShell commands that may indicate malicious activity, specifically those using the `System.Net.WebClient` class to download files or strings from the internet. It focuses on specific methods like `.DownloadFile()` and `.DownloadString()`, which could be exploited by attackers to retrieve malware or other harmful content remotely. By analyzing logs from PowerShell execution, the rule filters for these specific indicators, alerting security teams when potentially risky downloads occur. The primary data source involved in this detection is PowerShell execution logs, specifically targeting entries related to command execution involving the WebClient class.
  ### Investigation Steps
  - Review the timeline of the detected PowerShell command in the EDR to determine when it was executed and the context around the activity.
  - Inspect the command-line parameters within the affected process to verify the URL being accessed and evaluate its legitimacy.
  - Cross-reference with Proxy logs to identify any related outbound HTTP/HTTPS traffic to the same domain or IP as indicated in the PowerShell command.
  - Analyze endpoint or network traffic for any subsequent actions or lateral movement by the potentially compromised system following the detected download.
