title: Suspicious Get Information for SMB Share - PowerShell Module
id: 6942bd25-5970-40ab-af49-944247103358
status: test
description: |
  Adversaries may look for folders and drives shared on remote systems as a means of identifying sources of information to gather as a precursor for Collection and
  to identify potential systems of interest for Lateral Movement.
  Networks often contain shared network drives and folders that enable users to access file directories on various systems across a network.
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1069.002/T1069.002.md
author: frack113
date: 2021-12-15
modified: 2022-12-02
tags:
- attack.discovery
- attack.t1069.001
logsource:
  product: windows
  category: ps_module
  definition: 0ad03ef1-f21b-4a79-8ce8-e6900c54b65b
detection:
  selection:
  - Payload|contains: get-smbshare
  - ContextInfo|contains: get-smbshare
  condition: selection
falsepositives:
- Administrator script
level: low
notes: |
  ### Technical Context
  The detection rule titled "Suspicious Get Information for SMB Share 
  - PowerShell Module" focuses on identifying potentially malicious activities where adversaries leverage the PowerShell command `Get-SmbShare`. This command is often used to enumerate shared folders and drives on remote systems, enabling attackers to gather information that could facilitate further attacks, such as lateral movement within a network. The rule examines logs generated by Windows PowerShell modules, looking specifically for instances of the command itself appearing in either the payload or context information of executed scripts. By detecting this command’s usage, the SOC can monitor for unusual behaviors that may indicate an adversary is probing the network for sensitive shared resources.
  ### Investigation Steps
  - Review Windows PowerShell logs to identify the user or process that executed the `Get-SmbShare` command and determine the context of the request.
  - Cross-reference the execution times in the PowerShell logs with user access patterns and activity logs to identify any unusual or unauthorized behavior.
  - Utilize EDR tools to analyze the host system's state and running processes at the time of the suspicious command execution for potential indications of compromise.
  - Examine network traffic logs for any corresponding connections to SMB shares, especially from unexpected user accounts or machines, to uncover possible lateral movement actions.
