title: Access To Crypto Currency Wallets By Uncommon Applications
id: f41b0311-44f9-44f0-816d-dd45e39d4bc8
status: experimental
description: |
  Detects file access requests to crypto currency files by uncommon processes.
  Could indicate potential attempt of crypto currency wallet stealing.
references:
- Internal Research
author: X__Junior (Nextron Systems)
date: 2024-07-29
tags:
- attack.t1003
- attack.credential-access
logsource:
  category: file_access
  product: windows
  definition: 'Requirements: Microsoft-Windows-Kernel-File ETW provider'
detection:
  selection:
  - FileName|contains:
    - '\AppData\Roaming\Ethereum\keystore\'
    - '\AppData\Roaming\EthereumClassic\keystore\'
    - '\AppData\Roaming\monero\wallets\'
  - FileName|endswith:
    - '\AppData\Roaming\Bitcoin\wallet.dat'
    - '\AppData\Roaming\BitcoinABC\wallet.dat'
    - '\AppData\Roaming\BitcoinSV\wallet.dat'
    - '\AppData\Roaming\DashCore\wallet.dat'
    - '\AppData\Roaming\DogeCoin\wallet.dat'
    - '\AppData\Roaming\Litecoin\wallet.dat'
    - '\AppData\Roaming\Ripple\wallet.dat'
    - '\AppData\Roaming\Zcash\wallet.dat'
  filter_main_system:
    Image: System
  filter_main_generic:
        # This filter is added to avoid large amount of FP with 3rd party software. You should remove this in favour of specific filter per-application
    Image|startswith:
    - 'C:\Program Files (x86)\'
    - 'C:\Program Files\'
    - 'C:\Windows\system32\'
    - 'C:\Windows\SysWOW64\'
  filter_optional_defender:
    Image|startswith: 'C:\ProgramData\Microsoft\Windows Defender\'
    Image|endswith:
    - '\MpCopyAccelerator.exe'
    - '\MsMpEng.exe'
  condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
falsepositives:
- Antivirus, Anti-Spyware, Anti-Malware Software
- Backup software
- Legitimate software installed on partitions other than "C:\"
- Searching software such as "everything.exe"
level: medium
notes: |
  ### Technical Context
  This detection rule identifies unauthorized access to cryptocurrency wallet files by uncommon applications. It specifically looks for file access requests involving known wallet file paths, such as those for Ethereum, Bitcoin, and other cryptocurrencies. The key indicators are file paths associated with wallet keystone files residing in user directories such as `\AppData\Roaming\`, which is a common location for sensitive cryptocurrency data. By filtering out processes that originate from standard system directories and known security software, the rule helps minimize false positives and focuses on potentially malicious activity. The main data sources leveraged for this detection include Windows Kernel File access logs, which capture detailed information about file read/write operations and the processes initiating those actions.
  ### Investigation Steps
  - Utilize the EDR tool to identify the unusual process that attempted to access cryptocurrency wallet files. Look for details such as process hashes and command-line arguments to understand the context of the access request.
  - Review historical access logs from the file system to verify any previous interactions with the detected wallet files. This will help establish whether the access was a one-time event or part of a larger pattern.
  - Investigate the source of the uncommon application by checking the installation directory and validating whether it is a legitimate application or potentially malicious software.
  - Correlate the alert with other security events from the SIEM, such as network connections made by the triggering process, to identify any further suspicious behavior that may indicate a compromise.
