title: Access To Potentially Sensitive Sysvol Files By Uncommon Applications
id: d51694fe-484a-46ac-92d6-969e76d60d10
related:
- id: 8344c19f-a023-45ff-ad63-a01c5396aea0
  type: derived
status: experimental
description: Detects file access requests to potentially sensitive files hosted on
  the Windows Sysvol share.
references:
- https://github.com/vletoux/pingcastle
author: frack113
date: 2023-12-21
modified: 2024-07-29
tags:
- attack.credential-access
- attack.t1552.006
logsource:
  category: file_access
  product: windows
  definition: 'Requirements: Microsoft-Windows-Kernel-File ETW provider'
detection:
  selection:
    FileName|startswith: '\\'
    FileName|contains|all:
    - '\sysvol\'
    - '\Policies\'
    FileName|endswith:
    - 'audit.csv'
    - 'Files.xml'
    - 'GptTmpl.inf'
    - 'groups.xml'
    - 'Registry.pol'
    - 'Registry.xml'
    - 'scheduledtasks.xml'
    - 'scripts.ini'
    - 'services.xml'
  filter_main_generic:
    Image|startswith:
    - 'C:\Program Files (x86)\'
    - 'C:\Program Files\'
    - 'C:\Windows\system32\'
    - 'C:\Windows\SysWOW64\'
  filter_main_explorer:
    Image: 'C:\Windows\explorer.exe'
  condition: selection and not 1 of filter_main_*
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  This Sigma rule identifies access attempts to potentially sensitive files located on the Windows Sysvol share, which may include important group policy data. The rule specifically looks for file access requests made through uncommon applications, ensuring greater scrutiny of potential unauthorized access. It filters for specific file names associated with Sysvol, such as `audit.csv` and `Registry.pol`, while excluding common administrative tools like Explorer and standard software installed in default directories (e.g., `C:\Program Files`). By monitoring these parameters through Windows Kernel-File ETW provider logs, the rule helps detect anomalies that could indicate credential theft or unauthorized exploration of sensitive configurations, highlighting the need for proactive investigation into these events.
  ### Investigation Steps
  - Utilize EDR tools to investigate the process that accessed the Sysvol files, focusing on the associated command-line arguments and user context to determine legitimacy.
  - Check Windows event logs for additional file access records surrounding the alert time to identify patterns or repeated access attempts that could indicate malicious intent.
  - Review firewall and proxy logs to see if there were any suspicious external connections or data exfiltration efforts linked to the same source as the alert.
  - Cross-reference with cloud audit logs (if applicable) to corroborate the user’s activity and identify any abnormal login or access patterns that could highlight compromised credentials.
