title: Access To Windows Credential History File By Uncommon Applications
id: 7a2a22ea-a203-4cd3-9abf-20eb1c5c6cd2
status: experimental
description: |
  Detects file access requests to the Windows Credential History File by an uncommon application.
  This can be a sign of credential stealing. Example case would be usage of mimikatz "dpapi::credhist" function
references:
- https://tools.thehacker.recipes/mimikatz/modules/dpapi/credhist
- https://www.passcape.com/windows_password_recovery_dpapi_credhist
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-10-17
modified: 2024-07-29
tags:
- attack.credential-access
- attack.t1555.004
logsource:
  category: file_access
  product: windows
  definition: 'Requirements: Microsoft-Windows-Kernel-File ETW provider'
detection:
  selection:
    FileName|endswith: '\Microsoft\Protect\CREDHIST'
  filter_main_system_folders:
    Image|startswith:
    - 'C:\Program Files\'
    - 'C:\Program Files (x86)\'
    - 'C:\Windows\system32\'
    - 'C:\Windows\SysWOW64\'
  filter_main_explorer:
    Image: 'C:\Windows\explorer.exe'
  condition: selection and not 1 of filter_main_*
falsepositives:
- Unknown
# Increase level after false positives filters are good enough
level: medium
notes: |
  ### Technical Context
  This Sigma rule is designed to detect unauthorized access to the Windows Credential History File, typically located at `C:\Microsoft\Protect\CREDHIST`. It specifically looks for access attempts by applications that are not recognized as part of the standard Windows operating environment, such as those not located in the typical installation directories (like `C:\Program Files\`, `C:\Windows\system32\`, etc.). The detection hinges on file access logs generated by the Windows Kernel File Event Tracing for Windows (ETW) provider, identifying potential malicious activity related to credential theft, particularly by tools designed for this purpose, such as Mimikatz with its `dpapi::credhist` functionality. Alerting on these access attempts can help identify potential breaches where attackers may attempt to harvest sensitive credentials.
  ### Investigation Steps
  - Utilize the EDR tool to review the specific process and user account that triggered the alert. Investigate their activity history and any related anomalies.
  - Check access logs within the Windows environment to identify the full path of the requesting application and correlate this with known benign applications.
  - Review network traffic logs from the NDR solutions to determine if there are any unusual outbound requests from the flagged application that could indicate further malicious behavior.
  - Search for related or previous alerts in the SIEM, which may provide additional context about potential persistent threats or similar attempts to access sensitive credential files.
