title: Microsoft Teams Sensitive File Access By Uncommon Applications
id: 65744385-8541-44a6-8630-ffc824d7d4cc
status: experimental
description: |
  Detects file access attempts to sensitive Microsoft teams files (leveldb, cookies) by an uncommon process.
references:
- https://www.bleepingcomputer.com/news/security/microsoft-teams-stores-auth-tokens-as-cleartext-in-windows-linux-macs/
- https://www.vectra.ai/blog/undermining-microsoft-teams-security-by-mining-tokens
author: '@SerkinValery'
date: 2024-07-22
tags:
- attack.credential-access
- attack.t1528
logsource:
  product: windows
  category: file_access
  definition: 'Requirements: Microsoft-Windows-Kernel-File ETW provider'
detection:
  selection:
    FileName|contains:
    - '\Microsoft\Teams\Cookies'
    - '\Microsoft\Teams\Local Storage\leveldb'
  filter_main_legit_location:
        # Note: its best to filter the full path to avoid false negatives
    Image|endswith: '\Microsoft\Teams\current\Teams.exe'
  condition: selection and not 1 of filter_main_*
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  This Sigma rule aims to identify suspicious access attempts to sensitive Microsoft Teams files—specifically the "Cookies" file and "leveldb" storage—by processes that are not typically associated with Microsoft Teams. Microsoft Teams stores authentication tokens in these files in plain text, which makes them highly sensitive in regard to maintaining user security. The rule focuses on Windows file access logs, looking for file access events that coincide with the specific paths of these sensitive files while filtering out legitimate access from the Teams application itself. By detecting uncommon processes attempting to access these files, security teams can highlight potential credential theft or misuse scenarios.
  ### Investigation Steps
  - Utilize EDR tools to analyze the behavior of the uncommon processes and gather information about their origin, including the legitimacy and reputation of the process.
  - Review file access logs from Microsoft Teams to correlate the time of the suspicious activity with user actions or other security incidents.
  - Check the network traffic logs via the NGFW or NDR to investigate if any unusual external communications occurred around the same time as the file access attempt.
  - Conduct a review of user activity within Microsoft Teams to identify any unauthorized changes or access, focusing on users whose tokens may have been compromised.
