title: Unusual File Download From File Sharing Websites - File Stream
id: ae02ed70-11aa-4a22-b397-c0d0e8f6ea99
related:
- id: 52182dfb-afb7-41db-b4bc-5336cb29b464
  type: similar
status: experimental
description: Detects the download of suspicious file type from a well-known file and
  paste sharing domain
references:
- https://www.ultimatewindowssecurity.com/securitylog/encyclopedia/event.aspx?eventid=90015
- https://www.cisa.gov/uscert/ncas/alerts/aa22-321a
- https://www.microsoft.com/en-us/security/blog/2024/01/17/new-ttps-observed-in-mint-sandstorm-campaign-targeting-high-profile-individuals-at-universities-and-research-orgs/
author: Florian Roth (Nextron Systems)
date: 2022-08-24
modified: 2024-10-21
tags:
- attack.defense-evasion
- attack.s0139
- attack.t1564.004
logsource:
  product: windows
  category: create_stream_hash
detection:
  selection_domain:
    Contents|contains:
    - '.githubusercontent.com'               # Includes both gists and github repositories / Michael Haag (idea)
    - 'anonfiles.com'
    - 'cdn.discordapp.com'
    - 'ddns.net'
    - 'dl.dropboxusercontent.com'
    - 'ghostbin.co'
    - 'glitch.me'
    - 'gofile.io'
    - 'hastebin.com'
    - 'mediafire.com'
    - 'mega.nz'
    - 'onrender.com'
    - 'pages.dev'
    - 'paste.ee'
    - 'pastebin.com'
    - 'pastebin.pl'
    - 'pastetext.net'
    - 'pixeldrain.com'
    - 'privatlab.com'
    - 'privatlab.net'
    - 'send.exploit.in'
    - 'sendspace.com'
    - 'storage.googleapis.com'
    - 'storjshare.io'
    - 'supabase.co'
    - 'temp.sh'
    - 'transfer.sh'
    - 'trycloudflare.com'
    - 'ufile.io'
    - 'w3spaces.com'
    - 'workers.dev'
  selection_extension:
    TargetFilename|contains:
    - '.bat:Zone'
    - '.cmd:Zone'
    - '.ps1:Zone'
  condition: all of selection_*
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  This Sigma rule detects potentially suspicious file downloads from known file and paste sharing websites, focusing particularly on specific file types associated with scripting and command execution, such as `.bat`, `.cmd`, and `.ps1` files. By analyzing logs related to file stream creation on Windows systems, the rule identifies downloads originating from domains frequently used for sharing malicious content, including services like GitHub, Dropbox, and MediaFire. The detection works by looking for the presence of these domains in the event logs, as well as specific file extensions indicative of executable scripts, which are commonly abused in various attack scenarios. By aggregating this information, the rule helps to flag unusual behavior that may signify an attempted compromise or exploitation.
  ### Investigation Steps
  - Examine EDR logs to identify the process responsible for the file download and check for any prior suspicious behavior associated with that process.
  - Investigate the network traffic logs from the NGFW to see if there are connections to the associated domains, and verify the legitimacy of the user's browsing activity.
  - Cross-reference the downloaded file's hash against your organization's AV and threat intelligence databases to determine if it is recognized as malicious.
  - Review user activity logs related to the account accessing these file sharing sites for any signs of unauthorized access or abnormal user behavior.
