title: Unusual File Download from Direct IP Address
id: 025bd229-fd1f-4fdb-97ab-20006e1a5368
status: test
description: Detects the download of suspicious file type from URLs with IP
references:
- https://github.com/trustedsec/SysmonCommunityGuide/blob/adcdfee20999f422b974c8d4149bf4c361237db7/chapters/file-stream-creation-hash.md
- https://labs.withsecure.com/publications/detecting-onenote-abuse
author: Nasreddine Bencherchali (Nextron Systems), Florian Roth (Nextron Systems)
date: 2022-09-07
modified: 2023-02-10
tags:
- attack.defense-evasion
- attack.t1564.004
logsource:
  product: windows
  category: create_stream_hash
detection:
  selection:
    Contents|re: 'http[s]?://[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}'
    TargetFilename|contains:
    - '.ps1:Zone'
    - '.bat:Zone'
    - '.exe:Zone'
    - '.vbe:Zone'
    - '.vbs:Zone'
    - '.dll:Zone'
    - '.one:Zone'
    - '.cmd:Zone'
    - '.hta:Zone'
    - '.xll:Zone'
    - '.lnk:Zone'
  condition: selection
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This Sigma rule is designed to detect unusual file downloads originating from direct IP addresses, which can often signal potentially harmful or unauthorized activities. The rule specifically looks for file streams that are downloaded from URLs containing raw IP addresses, aiming to identify file types that are commonly associated with malicious behavior, such as scripts or executables. By analyzing relevant data sources, such as process creation logs and file stream hashes, the rule flags downloads of suspicious file types that are tagged with a Zone identifier, indicating that they may be coming from untrusted sources. The detection of these events can aid in early identification of malicious payloads used in attacks, including script-based launching or exploitation tactics.
  ### Investigation Steps
  - **Check EDR logs** for process creation events tied to the detected file download, focusing on any unusual parent processes that may indicate exploitation attempts or script execution.
  - **Review firewall logs** to identify any outbound traffic corresponding to the IP address from which the download occurred, assessing whether the connection aligns with typical network behavior.
  - **Examine antivirus alerts** generated by the downloaded file types, as they may indicate whether the file has been flagged as malicious or suspicious by automated defenses.
  - **Analyze proxy logs** for additional context around the web requests made to the suspicious IP, checking for patterns of access or similar downloads that could suggest broader malicious activity in the environment.
