title: Exports Registry Key To an Alternate Data Stream
id: 0d7a9363-af70-4e7b-a3b7-1a176b7fbe84
status: test
description: Exports the target Registry key and hides it in the specified alternate
  data stream.
references:
- https://lolbas-project.github.io/lolbas/Binaries/Regedit/
- https://gist.github.com/api0cradle/cdd2d0d0ec9abb686f0e89306e277b8f
author: Oddvar Moe, Sander Wiebing, oscd.community
date: 2020-10-07
modified: 2021-11-27
tags:
- attack.defense-evasion
- attack.t1564.004
logsource:
  product: windows
  category: create_stream_hash
detection:
  selection:
    Image|endswith: '\regedit.exe'
  condition: selection
fields:
- TargetFilename
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This detection rule identifies attempts to export a Windows Registry key and conceal it within an Alternate Data Stream (ADS) using the `regedit.exe` utility. The main goal of this technique is to evade detection by hiding malicious artifacts within ADS, which are not typically monitored by standard security solutions. The rule leverages log data from Windows, specifically focusing on events related to the creation of streams where the imaging process terminates with `regedit.exe`, indicating that a Registry export operation potentially targeting sensitive information is taking place. By monitoring for this process activity, security teams can detect potential defense evasion tactics aimed at obfuscating malicious activities.
  ### Investigation Steps
  - Review the process creation logs for any instances of `regedit.exe` that coincide with the alert, especially focusing on the command-line parameters used during execution.
  - Investigate the content of the targeted Alternate Data Streams by using tools that can enumerate ADS on the compromised endpoint to uncover hidden data.
  - Employ your EDR solution to check for any subsequent file modifications or unusual network activity that may follow the Registry export operation.
  - Analyze related logs in SIEM across the environment, including any logs from endpoint devices or servers that may provide context around the execution of `regedit.exe` and its outputs.
