title: Creation Of a Suspicious ADS File Outside a Browser Download
id: 573df571-a223-43bc-846e-3f98da481eca
status: test
description: Detects the creation of a suspicious ADS (Alternate Data Stream) file
  by software other than browsers
references:
- https://www.bleepingcomputer.com/news/security/exploited-windows-zero-day-lets-javascript-files-bypass-security-warnings/
author: frack113
date: 2022-10-22
modified: 2023-06-12
tags:
- attack.defense-evasion
logsource:
  product: windows
  category: create_stream_hash
detection:
  selection:
    Contents|startswith: '[ZoneTransfer]  ZoneId=3'
    TargetFilename|endswith: ':Zone.Identifier'
    TargetFilename|contains:
    - '.exe'
    - '.scr'
    - '.bat'
    - '.cmd'
    - '.docx'
    - '.hta'
    - '.jse'
    - '.lnk'
    - '.pptx'
    - '.ps'
    - '.reg'
    - '.sct'
    - '.vb'
    - '.wsc'
    - '.wsf'
    - '.xlsx'
  filter_optional_brave:
    Image|endswith: '\brave.exe'
  filter_optional_chrome:
    Image:
    - 'C:\Program Files\Google\Chrome\Application\chrome.exe'
    - 'C:\Program Files (x86)\Google\Chrome\Application\chrome.exe'
  filter_optional_firefox:
    Image:
    - 'C:\Program Files\Mozilla Firefox\firefox.exe'
    - 'C:\Program Files (x86)\Mozilla Firefox\firefox.exe'
  filter_optional_ie:
    Image:
    - 'C:\Program Files (x86)\Internet Explorer\iexplore.exe'
    - 'C:\Program Files\Internet Explorer\iexplore.exe'
  filter_optional_maxthon:
    Image|endswith: '\maxthon.exe'
  filter_optional_edge_1:
  - Image|startswith: 'C:\Program Files (x86)\Microsoft\EdgeWebView\Application\'
  - Image|endswith: '\WindowsApps\MicrosoftEdge.exe'
  - Image:
    - 'C:\Program Files (x86)\Microsoft\Edge\Application\msedge.exe'
    - 'C:\Program Files\Microsoft\Edge\Application\msedge.exe'
  filter_optional_edge_2:
    Image|startswith:
    - 'C:\Program Files (x86)\Microsoft\EdgeCore\'
    - 'C:\Program Files\Microsoft\EdgeCore\'
    Image|endswith:
    - '\msedge.exe'
    - '\msedgewebview2.exe'
  filter_optional_opera:
    Image|endswith: '\opera.exe'
  filter_optional_safari:
    Image|endswith: '\safari.exe'
  filter_optional_seamonkey:
    Image|endswith: '\seamonkey.exe'
  filter_optional_vivaldi:
    Image|endswith: '\vivaldi.exe'
  filter_optional_whale:
    Image|endswith: '\whale.exe'
  filter_optional_snipping_tool:
    Image|startswith: 'C:\Program Files\WindowsApps\Microsoft.ScreenSketch_'
    Image|endswith: '\SnippingTool\SnippingTool.exe'
    TargetFilename|startswith: 'C:\Users\'
    TargetFilename|contains|all:
    - '\AppData\Local\Packages\Microsoft.ScreenSketch_'
    - '\TempState\Screenshot '
    TargetFilename|endswith: '.png:Zone.Identifier'
  condition: selection and not 1 of filter_optional_*
falsepositives:
- Other legitimate browsers not currently included in the filter (please add them)
- Legitimate downloads via scripting or command-line tools (Investigate to determine
  if it's legitimate)
level: medium
notes: |
  ### Technical Context
  This detection rule is focused on identifying the creation of suspicious Alternate Data Stream (ADS) files outside of known browser activities. ADS is a feature of the NTFS file system that allows files to have multiple data streams, which can be exploited by attackers to conceal malicious files relating to common file types like executables, scripts, and documents. The rule specifically looks for files that are created with the stream name ":Zone.Identifier," which is indicative of content that was either downloaded from the internet or has been marked by the system for extra scrutiny, along with specific process types that are not recognized as legitimate browsers. The underlying technical data sources primarily involve process creation logs that capture details about the image/process responsible for creating these streams, along with the parameters of the created files. This is related to the MITRE ATT&CK technique for Defense Evasion (T1203).
  ### Investigation Steps
  - **Check Process Activity:** Review the process activity on the host using EDR tools to identify the exact process that created the ADS file and its parent process to understand the context of execution.
    
  - **Validate File Creation:** Use file integrity monitoring or endpoint tools to check the creation timestamp and the contents of the identified ADS file to assess for potential malicious indicators.
  - **Investigate Network Activity:** Analyze network logs (e.g., Proxy, NDR) for any suspicious outbound connections or downloads occurring around the same time the ADS file was created to identify potential C2 communications.
  - **Review User Activity:** Examine Windows Event Logs specifically for security events linked to the user account associated with the file creation and to check if any credentials were compromised during the timeframe of the alert.
  ### Prioritization
  This alert holds a medium severity level in an enterprise environment due to the abnormal creation of ADS files, which can indicate defensive evasion tactics by threats attempting to conceal their activities, thus warranting timely investigation.
  ### Blind Spots and Assumptions
  This rule may not trigger in scenarios where legitimate tools not included in the filter checks create ADS files. Furthermore, the rule assumes that scripts or command-line tools will not imitate browser processes, meaning that sophisticated attackers could use these methods to evade detection. Other potential blind spots include legitimate browsers not covered by this rule that might generate similar ADC files or a lack of monitoring on certain systems that do not log process creations comprehensively.
  > **Disclaimer:** This investigation guide was created using generative AI technology and has not been reviewed for its accuracy and relevance. While every effort has been made to ensure its quality, we recommend validating the content and adapting it to suit specific environment and operational needs. Please communicate any changes to the detection engineering team.
