title: Remote Access Tool - ScreenConnect Command Execution
id: 076ebe48-cc05-4d8f-9d41-89245cd93a14
related:
- id: b1f73849-6329-4069-bc8f-78a604bb8b23
  type: similar
status: test
description: Detects command execution via ScreenConnect RMM
references:
- https://www.huntandhackett.com/blog/revil-the-usage-of-legitimate-remote-admin-tooling
- https://github.com/SigmaHQ/sigma/pull/4467
author: Ali Alwashali
date: 2023-10-10
tags:
- attack.execution
- attack.t1059.003
logsource:
  service: application
  product: windows
detection:
  selection:
    Provider_Name: 'ScreenConnect'
    EventID: 200
    Data|contains: 'Executed command of length'
  condition: selection
falsepositives:
- Legitimate use of ScreenConnect
level: low
notes: |
  ### Technical Context
  This detection rule identifies potentially malicious command execution through the ScreenConnect remote access tool, often exploited by threat actors to gain unauthorized access to systems. The rule specifically monitors Windows events where the ScreenConnect application logs an 'Executed command of length' message, indicating that a command was run remotely. By leveraging Event ID 200 generated by ScreenConnect, the rule focuses on data attributes from application logs to distinguish legitimate administrative actions from suspicious activities. As a result, this helps the SOC to quickly identify and assess risks associated with the use of legitimate remote administration tools, which can often mask more nefarious intentions.
  ### Investigation Steps
  - Retrieve EDR logs for the affected endpoint to identify the timeline of the command execution, including any associated user accounts and processes being executed.
  - Check for additional Network Data Records (NDR) to analyze any inbound or outbound traffic patterns related to ScreenConnect during the time frame of the alert.
  - Review Proxy logs to pinpoint any unusual web activity or connections to known malicious IP addresses that coincide with the timing of the detected command execution.
  - Consult with the cloud platform logs (if applicable) to track any administrative activities or changes made to virtual machines that could correlate with the use of ScreenConnect for remote management.
