title: MSI Installation From Suspicious Locations
id: c7c8aa1c-5aff-408e-828b-998e3620b341
status: test
description: Detects MSI package installation from suspicious locations
references:
- https://www.trendmicro.com/en_us/research/22/h/ransomware-actor-abuses-genshin-impact-anti-cheat-driver-to-kill-antivirus.html
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-08-31
modified: 2023-10-23
tags:
- attack.execution
logsource:
  product: windows
  service: application
    # warning: The 'data' field used in the detection section is the container for the event data as a whole. You may have to adapt the rule for your backend accordingly
detection:
  selection:
    Provider_Name: 'MsiInstaller'
    EventID:
    - 1040
    - 1042
    Data|contains:
            # Add more suspicious paths
    - ':\Windows\TEMP\'
    - '\\\\'
    - '\Desktop\'
    - '\PerfLogs\'
    - '\Users\Public\'
            # - '\AppData\Local\Temp\'  # too many FPs
            # - '\Downloads\'  # too many FPs, typical legitimate staging directory
  filter_winget:
    Data|contains: '\AppData\Local\Temp\WinGet\'
  filter_updhealthtools:
    Data|contains: 'C:\Windows\TEMP\UpdHealthTools.msi'
  condition: selection and not 1 of filter_*
falsepositives:
- False positives may occur if you allow installation from folders such as the desktop,
  the public folder or remote shares. A baseline is required before production use.
level: medium
notes: |
  ### Technical Context
  This Sigma rule is designed to detect the installation of MSI packages from suspicious locations on Windows systems. It focuses on events logged by the MsiInstaller service, specifically Event IDs 1040 and 1042, which indicate when MSI installations occur. The rule aims to identify potentially harmful software installations taking place in directories often associated with non-standard or insecure practices, such as the Windows TEMP directory, the Desktop, Users' Public folder, and other similar locations. By monitoring these folders, the rule can flag installations that may represent a security risk, either from malicious software installation attempts or from compromised user behavior.
  To implement this detection, the rule evaluates the MSI installation events and checks if the source file's path matches predefined suspicious criteria. It incorporates filter conditions to rule out legitimate installations from known locations, such as the AppData\Local\Temp\WinGet directory and specific MSI files like UpdHealthTools.msi, increasing the accuracy of the alerts generated.
  ### Investigation Steps
  - Review the logs from the SIEM or EDR platform to identify the full context of the MSI installation event, including the process that initiated it and any other related events within the timeframe.
  - Analyze the command-line parameters and execution paths using EDR tools to determine if the installation was initiated by a legitimate user or a potentially malicious process.
  - Inspect network traffic logs via the NDR or proxy solutions to find any related suspicious behavior or downloads that occurred around the time of the installation.
  - Conduct a search in cloud logs (AWS, GCP, or Azure) for any anomalous user activity or unauthorized access patterns that could relate to the user account associated with the installation event.
