title: MSI Installation From Web
id: 5594e67a-7f92-4a04-b65d-1a42fd824a60
status: test
description: Detects installation of a remote msi file from web.
references:
- https://twitter.com/_st0pp3r_/status/1583922009842802689
author: Stamatis Chatzimangou
date: 2022-10-23
modified: 2022-10-23
tags:
- attack.defense-evasion
- attack.t1218
- attack.t1218.007
logsource:
  product: windows
  service: application
    # warning: The 'data' field used in the detection section is the container for the event data as a whole. You may have to adapt the rule for your backend accordingly
detection:
  selection:
    Provider_Name: 'MsiInstaller'
    EventID:
    - 1040
    - 1042
    Data|contains: '://'
  condition: selection
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  This detection rule focuses on identifying potentially malicious installations of remote Microsoft Installer (MSI) files from the web. It works by monitoring Windows application logs specifically for events generated by the MsiInstaller provider. The rule looks for Event IDs 1040 and 1042, which correspond with the initiation of MSI installations. Additionally, it scans for the presence of '://', indicating that the source of the MSI file is a URL, which is unusual for standard installations typically executed from local sources. By pinpointing these conditions, the rule helps to reveal instances of software being installed from unexpected or unauthorized web locations.
  ### Investigation Steps
  - Check EDR logs for additional details on the process that initiated the MSI installation. Look for any associated processes that could indicate malicious behavior.
  - Review application logs and the command-line parameters used to start the MSI installation. This can help establish whether the installation was expected or part of a broader attack.
  - Analyze network traffic logs using your NDR solution to identify any outbound connections made during the time of the installation. This can help detect if any additional data was exfiltrated or commands received.
  - Inspect proxy logs for any web requests made to external sources around the same time as the installation. This could provide context on the origin of the MSI file and potential connections to known malicious domains.
