title: Backup Catalog Deleted
id: 9703792d-fd9a-456d-a672-ff92efe4806a
status: test
description: Detects backup catalog deletions
references:
- https://technet.microsoft.com/en-us/library/cc742154(v=ws.11).aspx
- https://www.hybrid-analysis.com/sample/ed01ebfbc9eb5bbea545af4d01bf5f1071661840480439c6e5babe8e080e41aa?environmentId=100
author: Florian Roth (Nextron Systems), Tom U. @c_APT_ure (collection)
date: 2017-05-12
modified: 2022-12-25
tags:
- attack.defense-evasion
- attack.t1070.004
logsource:
  product: windows
  service: application
detection:
  selection:
    EventID: 524
    Provider_Name: Microsoft-Windows-Backup
  condition: selection
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  The "Backup Catalog Deleted" detection rule identifies instances where backup catalog data has been deleted in a Windows environment. This deletion is tracked through event logs, specifically looking for Event ID 524 generated by the Microsoft-Windows-Backup provider. An unexpected deletion of backup catalogs could indicate malicious activity, as adversaries may attempt to erase evidence of their actions or hinder recovery efforts. This rule captures events related to backup management, alerting security teams to potential defense evasion tactics employed by threat actors.
  This rule relies on Windows application logs populated by the backup service. Incident responders should pay close attention to the context surrounding these events, including the user initiating the deletion and the timing relative to other suspicious activities, to determine if the event warrants further investigation.
  ### Investigation Steps
  - Review the EDR logs for the user account that triggered the Event ID 524 to check for any prior suspicious activity linked to this user.
  - Analyze system audit logs for failed access attempts or unusual account behavior leading up to the backup catalog deletion.
  - Examine cloud backup logs if the environment utilizes cloud-based backup solutions to verify if the deletion corresponds with any activities in the cloud.
  - Conduct a network traffic analysis using your NDR tools to identify any anomalous communication patterns that occur around the time of the deletion event.
