title: Suspicious Digital Signature Of AppX Package
id: b5aa7d60-c17e-4538-97de-09029d6cd76b
status: test
description: Detects execution of AppX packages with known suspicious or malicious
  signature
references:
- Internal Research
- https://www.sentinelone.com/labs/inside-malicious-windows-apps-for-malware-deployment/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023-01-16
tags:
- attack.defense-evasion
- attack.execution
logsource:
  product: windows
  service: appxpackaging-om
detection:
  selection:
    EventID: 157
        # Add more known suspicious/malicious certificates used in different attacks
    subjectName: 'CN=Foresee Consulting Inc., O=Foresee Consulting Inc., L=North York,
      S=Ontario, C=CA, SERIALNUMBER=1004913-1, OID.1.3.6.1.4.1.311.60.2.1.3=CA, OID.2.5.4.15=Private
      Organization'
  condition: selection
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  This Sigma rule is designed to detect the execution of AppX packages that are signed with known suspicious or malicious digital signatures. Specifically, it monitors events generated by the AppX packaging service in the Windows operating system, focusing on Event ID 157, which indicates the installation or launching of an AppX application. The detection criteria include the presence of a specific digital certificate subject name known to be associated with malicious activities (in this case, a certificate linked to Foresee Consulting Inc.). By flagging such events, the rule assists security teams in identifying potential misuse of legitimate application packaging mechanisms that could facilitate malware deployment or other forms of attack.
  The primary data source for this detection rule consists of the Windows event logs pertaining to AppX packaging, which provide visibility into AppX installations and executions. Analysts can cross-reference these logs with antivirus or endpoint detection and response (EDR) systems to further investigate and validate potential threats posed by flagged AppX packages.
  ### Investigation Steps
  - Query the EDR for process creation logs related to the flagged AppX package to check for any unusual activities or patterns in execution.
  - Investigate the digital signature and certificate details using relevant logs to confirm if the certificate belongs to a known malicious entity.
  - Utilize the AV solution to scan the affected endpoint for any additional threats or malware associated with the suspicious AppX installation.
  - Review network traffic logs and proxy data for any outbound connections initiated by the AppX package that may indicate data exfiltration or command-and-control communication.
