title: Volume Shadow Copy Mount
id: f512acbf-e662-4903-843e-97ce4652b740
status: test
description: Detects volume shadow copy mount via Windows event log
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1003.002/T1003.002.md#atomic-test-3---esentutlexe-sam-copy
author: Roberto Rodriguez @Cyb3rWard0g, Open Threat Research (OTR)
date: 2020-10-20
modified: 2022-12-25
tags:
- attack.credential-access
- attack.t1003.002
logsource:
  product: windows
  service: system
detection:
  selection:
    Provider_Name: Microsoft-Windows-Ntfs
    EventID: 98
    DeviceName|contains: HarddiskVolumeShadowCopy
  condition: selection
falsepositives:
- Legitimate use of volume shadow copy mounts (backups maybe).
level: low
notes: |
  ### Technical Context
  The "Volume Shadow Copy Mount" detection rule identifies instances where a volume shadow copy is mounted on a Windows system, specifically by monitoring Event ID 98 from the Microsoft-Windows-Ntfs provider. This event is generated when a volume shadow copy is created or accessed, influencing how system backups are handled. The presence of the term "HarddiskVolumeShadowCopy" within the event data serves as a key indicator for detection. While volume shadow copies are often utilized for legitimate backup purposes, they can also be misused by attackers to access sensitive data or facilitate other malicious activities. Responders should consider the context of the environment to differentiate between legitimate and suspicious occurrences.
  ### Investigation Steps
  - Review EDR logs for any recent process activity related to `shadowcopy` or `diskshadow`, focusing on the context in which the volume shadow copy was mounted.
  - Analyze the command-line parameters associated with any processes that initiated Event ID 98 to determine if they match expected backup operations or show signs of exploitation.
  - Check for abnormal user account activity around the time of the event, ensuring that unauthorized accounts are not accessing sensitive data via mounted shadow copies.
  - Inspect backup and system logs in conjunction with the Windows event logs to track if the volume shadow copy was part of a scheduled task or if it appears suspicious based on timing and account activity.
