title: Potentially Suspicious Wuauclt Network Connection
id: c649a6c7-cd8c-4a78-9c04-000fc76df954
status: test
description: |
  Detects the use of the Windows Update Client binary (wuauclt.exe) to proxy execute code and making network connections.
  One could easily make the DLL spawn a new process and inject to it to proxy the network connection and bypass this rule.
references:
- https://dtm.uk/wuauclt/
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
date: 2020-10-12
modified: 2024-03-12
tags:
- attack.defense-evasion
- attack.t1218
logsource:
  category: network_connection
  product: windows
  definition: 'Requirements: The CommandLine field enrichment is required in order
    for this rule to be used.'
detection:
  selection:
    Image|contains: 'wuauclt'
    CommandLine|contains: ' /RunHandlerComServer'
    # "C:\WINDOWS\uus\AMD64\wuauclt.exe" /DeploymentHandlerFullPath \\?\C:\Windows\UUS\AMD64\UpdateDeploy.dll /ClassId aaa256e1-5b21-4993-9188-18f07ccb3b98 /RunHandlerComServer
  filter_main_ip:
    DestinationIp|cidr:     # Ranges excluded based on https://github.com/SigmaHQ/sigma/blob/0f176092326ab9d1e19384d30224e5f29f760d82/rules/windows/network_connection/net_connection_win_dllhost_net_connections.yml
    - '127.0.0.0/8'
    - '10.0.0.0/8'
    - '169.254.0.0/16'          # link-local address
    - '172.16.0.0/12'
    - '192.168.0.0/16'
    - '::1/128'          # IPv6 loopback
    - 'fe80::/10'          # IPv6 link-local addresses
    - 'fc00::/7'          # IPv6 private addresses
  filter_main_msrange:    # Sysmon
    DestinationIp|cidr:
    - '20.184.0.0/13'         # Microsoft Corporation
    - '20.192.0.0/10'         # Microsoft Corporation
    - '23.79.0.0/16'         # Microsoft Corporation
    - '51.10.0.0/15'
    - '51.103.0.0/16'         # Microsoft Corporation
    - '51.104.0.0/15'         # Microsoft Corporation
    - '52.224.0.0/11'         # Microsoft Corporation
  filter_main_uus:
    CommandLine|contains:
    - ':\Windows\UUS\Packages\Preview\amd64\updatedeploy.dll /ClassId'
    - ':\Windows\UUS\amd64\UpdateDeploy.dll /ClassId'
  filter_main_winsxs:
    CommandLine|contains|all:
    - ':\Windows\WinSxS\'
    - '\UpdateDeploy.dll /ClassId '
  filter_main_cli_null:
    CommandLine:
  filter_main_cli_empty:
    CommandLine: ''
  condition: selection and not 1 of filter_main_*
falsepositives:
- Unknown
level: medium
notes: |
  n
  ### Technical Context
  This Sigma rule identifies suspicious activities related to the Windows Update Client binary (`wuauclt.exe`) that might indicate malicious behavior, such as executing code or establishing network connections through proxy execution. It primarily monitors network connection logs and analyses the command-line parameters associated with the `wuauclt.exe` executable, focusing on those that contain specific flags indicating potential misuse. The rule requires enriching the CommandLine field to provide context around the executed commands, allowing SOC analysts to discern normal operations from potentially harmful activities. By excluding known safe IP ranges and specific Microsoft IP addresses, the rule reduces false positives and hones in on genuinely suspicious traffic.
  ### Investigation Steps
  - Use EDR tools to search for instances of `wuauclt.exe` execution along with the specified command-line parameters. This can help identify if the binary has been misused within the environment.
  - Analyze network connections in the SIEM to determine if `wuauclt.exe` is attempting to connect to external or suspicious IP addresses not included in the allowed filter ranges. 
  - Review logs from the firewall and proxy for any unusual outbound traffic originating from the endpoint where `wuauclt.exe` was detected. This could indicate a compromised system trying to exfiltrate data.
  - Inspect related processes and their command-line arguments in the context of the affected system via EDR, as attackers might inject code into `wuauclt.exe` or related processes to bypass detection.
