title: Uncommon Connection to Active Directory Web Services
id: b3ad3c0f-c949-47a1-a30e-b0491ccae876
status: test
description: |
  Detects uncommon network connections to the Active Directory Web Services (ADWS) from processes not typically associated with ADWS management.
references:
- https://medium.com/falconforce/soaphound-tool-to-collect-active-directory-data-via-adws-165aca78288c
- https://github.com/FalconForceTeam/FalconFriday/blob/master/Discovery/ADWS_Connection_from_Unexpected_Binary-Win.md
author: '@kostastsale'
date: 2024-01-26
tags:
- attack.discovery
- attack.t1087
logsource:
  category: network_connection
  product: windows
detection:
  selection:
    Initiated: true
    DestinationPort: 9389
  filter_main_dsac:
    Image: 'C:\Windows\system32\dsac.exe'
  filter_main_ms_monitoring_agent:
    Image: 'C:\Program Files\Microsoft Monitoring Agent\'
  filter_main_powershell:
    Image|startswith:
    - 'C:\Program Files\PowerShell\7\pwsh.exe'
    - 'C:\Program Files\PowerShell\7-preview\pwsh.ex'
    - 'C:\Windows\System32\WindowsPowerShell\'
    - 'C:\Windows\SysWOW64\WindowsPowerShell\'
  condition: selection and not 1 of filter_main_*
falsepositives:
- ADWS is used by a number of legitimate applications that need to interact with Active
  Directory. These applications should be added to the allow-listing to avoid false
  positives.
level: medium
notes: |
  ### Technical Context
  This Sigma rule detects uncommon network connections targeting Active Directory Web Services (ADWS), specifically monitoring for connections that are initiated from unexpected processes. It focuses on connections made to TCP port 9389, which is the default port used for ADWS. The detection captures network connection logs and filters out commonly recognized processes associated with ADWS management, such as `dsac.exe` and the Microsoft Monitoring Agent, as well as legitimate PowerShell instances. By identifying connections from processes that are not typically tied to ADWS activities, the rule aims to uncover potential reconnaissance or lateral movement activities by adversaries, which falls under the MITRE ATT&CK tactic of **Discovery** and technique **T1087: Account Discovery**. This proactive approach helps in maintaining the security posture of the enterprise environment.
  ### Investigation Steps
  - **Review Network Connection Logs:** Examine the network connection logs to identify the source process and the specific context in which it established a connection to port 9389. Look for any anomaly in the source host or process behavior.
    
  - **Utilize EDR for Process Examination:** Use your EDR tool to investigate the identified process. Check if it's a known legitimate application or if it's running with unexpected parameters that could indicate misuse.
  - **Analyze Forensic Artifacts:** Analyze relevant system logs such as Windows Security and System logs for any suspicious activity surrounding the identified process, including recent changes or failed authentication attempts.
  - **Correlate with Alert History:** Cross-reference the alert with prior incidents or alerts within your SIEM. Determine if there are patterns or consistency in the triggering of this rule, which may indicate a larger issue at play.
  ### Prioritization
  This alert is classified with a medium severity level due to the potential risk it poses; while unusual connections to ADWS can signify legitimate application behavior, they might also indicate advanced reconnaissance efforts by threat actors attempting to locate and exploit Active Directory environments.
  ### Blind Spots and Assumptions
  This rule assumes that all legitimate applications connecting to ADWS have been correctly identified and excluded from the filtering process. Adversaries may employ obfuscation techniques or use non-standard binaries to connect to ADWS, which may evade detection. Additionally, if legitimate applications or scripts leverage the ADWS but are unknown to the security team, it may lead to false positives that are unnecessarily flagged. Understanding the software landscape and regularly updating the allow-list is crucial for the rule's efficacy.
  > **Disclaimer:** This investigation guide was created using generative AI technology and has not been reviewed for its accuracy and relevance. While every effort has been made to ensure its quality, we recommend validating the content and adapting it to suit specific environment and operational needs. Please communicate any changes to the detection engineering team.
