title: Suspicious Non-Browser Network Communication With Google API
id: 7e9cf7b6-e827-11ed-a05b-0242ac120003
status: experimental
description: |
  Detects a non-browser process interacting with the Google API which could indicate the use of a covert C2 such as Google Sheet C2 (GC2-sheet)
references:
- https://github.com/looCiprian/GC2-sheet
- https://youtu.be/n2dFlSaBBKo
- https://services.google.com/fh/files/blogs/gcat_threathorizons_full_apr2023.pdf
- https://www.tanium.com/blog/apt41-deploys-google-gc2-for-attacks-cyber-threat-intelligence-roundup/
- https://www.bleepingcomputer.com/news/security/hackers-abuse-google-command-and-control-red-team-tool-in-attacks/
author: Gavin Knapp
date: 2023-05-01
modified: 2025-02-22
tags:
- attack.command-and-control
- attack.t1102
logsource:
  product: windows
  category: network_connection
detection:
  selection:
    DestinationHostname|contains:
            # Note: Please add additional google API related domains that might be abused.
    - 'drive.googleapis.com'
    - 'oauth2.googleapis.com'
    - 'sheets.googleapis.com'
    - 'www.googleapis.com'
  filter_optional_brave:
    Image|endswith: '\brave.exe'
  filter_optional_chrome:
    Image|endswith:
    - ':\Program Files\Google\Chrome\Application\chrome.exe'
    - ':\Program Files (x86)\Google\Chrome\Application\chrome.exe'
  filter_optional_google_drive:
    Image|contains: ':\Program Files\Google\Drive File Stream\'
    Image|endswith: '\GoogleDriveFS.exe'
  filter_optional_firefox:
    Image|endswith:
    - ':\Program Files\Mozilla Firefox\firefox.exe'
    - ':\Program Files (x86)\Mozilla Firefox\firefox.exe'
  filter_optional_ie:
    Image|endswith:
    - ':\Program Files (x86)\Internet Explorer\iexplore.exe'
    - ':\Program Files\Internet Explorer\iexplore.exe'
  filter_optional_maxthon:
    Image|endswith: '\maxthon.exe'
  filter_optional_edge_1:
  - Image|contains: ':\Program Files (x86)\Microsoft\EdgeWebView\Application\'
  - Image|endswith:
    - ':\Program Files (x86)\Microsoft\Edge\Application\msedge.exe'
    - ':\Program Files\Microsoft\Edge\Application\msedge.exe'
    - '\WindowsApps\MicrosoftEdge.exe'
  filter_optional_edge_2:
    Image|contains:
    - ':\Program Files (x86)\Microsoft\EdgeCore\'
    - ':\Program Files\Microsoft\EdgeCore\'
    Image|endswith:
    - '\msedge.exe'
    - '\msedgewebview2.exe'
  filter_optional_opera:
    Image|endswith: '\opera.exe'
  filter_optional_safari:
    Image|endswith: '\safari.exe'
  filter_optional_seamonkey:
    Image|endswith: '\seamonkey.exe'
  filter_optional_vivaldi:
    Image|endswith: '\vivaldi.exe'
  filter_optional_whale:
    Image|endswith: '\whale.exe'
  filter_optional_googleupdate:
    Image|endswith: '\GoogleUpdate.exe'
  filter_optional_outlook_exe:
    Image|endswith: '\outlook.exe'
  filter_main_null:
    Image:
  filter_main_empty:
    Image: ''
  condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
falsepositives:
- Legitimate applications communicating with the "googleapis.com" endpoints that are
  not already in the exclusion list. This is environmental dependent and requires
  further testing and tuning.
level: medium
notes: |
  ### Technical Context
  This Sigma rule aims to identify suspicious network communications between non-browser processes and Google API endpoints, which could indicate the use of covert command and control (C2) mechanisms, such as Google Sheet C2 (GC2-sheet). It looks for any executable (non-browser-related) that attempts to connect to specific Google API domains, including `drive.googleapis.com`, `oauth2.googleapis.com`, and `sheets.googleapis.com`. The detection leverages network connection logs from Windows, focusing on analysis of the process image names to distinguish between legitimate browser traffic and potentially malicious activities from other applications. 
  When a non-browser process is found communicates with the aforementioned Google API domains, this may warrant further investigation. Additionally, special filters are applied to ignore legitimate traffic from common web browsers like Chrome, Firefox, Edge, and other specified applications, to mitigate false positives.
  ### Investigation Steps
  - Use EDR tools to correlate the alert with process creation and network connection logs to identify which application initiated the connection to the Google API.
  - Verify the legitimacy of the process by checking its properties and behavior, including command-line parameters and associated network activity.
  - Review web proxy logs to determine if there were any previous connections made by the same application to the Google API, which may indicate potential malicious behavior.
  - Check for additional indicators of compromise (IOCs) or suspicious activities related to the IP address, domain, or associated user account in cloud logs from AWS, GCP, or Azure.
