title: Network Connection Initiated From Process Located In Potentially Suspicious
  Or Uncommon Location
id: 7b434893-c57d-4f41-908d-6a17bf1ae98f
status: test
description: |
  Detects a network connection initiated by programs or processes running from suspicious or uncommon files system locations.
references:
- https://docs.google.com/spreadsheets/d/17pSTDNpa0sf6pHeRhusvWG6rThciE8CsXTSlDUAZDyo
author: Florian Roth (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)
date: 2017-03-19
modified: 2024-08-22
tags:
- attack.command-and-control
- attack.t1105
logsource:
  category: network_connection
  product: windows
detection:
  selection:
    Initiated: 'true'
    Image|contains:
    - ':\$Recycle.bin'
    - ':\Perflogs\'
    - ':\Temp\'
    - ':\Users\Default\'
    - ':\Windows\Fonts\'
    - ':\Windows\IME\'
    - ':\Windows\System32\Tasks\'
    - ':\Windows\Tasks\'
    - '\config\systemprofile\'
    - '\Windows\addins\'
  filter_main_domains:
        # Note: We exclude these domains to avoid duplicate filtering from e0f8ab85-0ac9-423b-a73a-81b3c7b1aa97
    DestinationHostname|endswith:
    - '.githubusercontent.com'               # Includes both gists and github repositories / Michael Haag (idea)
    - 'anonfiles.com'
    - 'cdn.discordapp.com'
    - 'ddns.net'
    - 'dl.dropboxusercontent.com'
    - 'ghostbin.co'
    - 'glitch.me'
    - 'gofile.io'
    - 'hastebin.com'
    - 'mediafire.com'
    - 'mega.co.nz'
    - 'mega.nz'
    - 'onrender.com'
    - 'pages.dev'
    - 'paste.ee'
    - 'pastebin.com'
    - 'pastebin.pl'
    - 'pastetext.net'
    - 'portmap.io'          # https://pro.twitter.com/JaromirHorejsi/status/1795001037746761892/photo/2
    - 'privatlab.com'
    - 'privatlab.net'
    - 'send.exploit.in'
    - 'sendspace.com'
    - 'storage.googleapis.com'
    - 'storjshare.io'
    - 'supabase.co'
    - 'temp.sh'
    - 'transfer.sh'
    - 'trycloudflare.com'
    - 'ufile.io'
    - 'w3spaces.com'
    - 'workers.dev'
  condition: selection and not 1 of filter_main_*
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This Sigma rule aims to detect potentially malicious network connections initiated by processes that are executing from suspicious or uncommon file system locations. The primary focus is on network connection logs generated by Windows operating systems, specifically looking for connections where the originating processes reside in directories typically associated with temporary files, system configuration, or user defaults—such as `$Recycle.bin`, `\Temp\`, and `\Windows\Fonts\`. Additionally, the rule filters out known domains commonly used for legitimate services (like GitHub or Dropbox) to help reduce false positives. By identifying these connections, security analysts can be alerted to possible command and control (C2) communications that indicate malware or unauthorized activities within the environment.
  ### Investigation Steps
  - Utilize EDR tools to examine the specific process that initiated the network connection. Check the process's command line arguments and parent-child process relationships to understand its execution context.
  - Review the full details of the network connection, including source and destination IPs and hostnames, to establish the nature of the traffic and its legitimacy.
  - Analyze associated logs from the firewall or proxy to determine if any other significant communication events have been triggered from the same or related processes.
  - Check for additional indicators of compromise (IOCs) by searching for other suspicious file paths or processes that could indicate a broader infection or ongoing malicious activity.
