title: Network Connection Initiated To Mega.nz
id: fdeebdf0-9f3f-4d08-84a6-4c4d13e39fe4
status: test
description: |
  Detects a network connection initiated by a binary to "api.mega.co.nz".
  Attackers were seen abusing file sharing websites similar to "mega.nz" in order to upload/download additional payloads.
references:
- https://megatools.megous.com/
- https://www.mandiant.com/resources/russian-targeting-gov-business
author: Florian Roth (Nextron Systems)
date: 2021-12-06
modified: 2024-05-31
tags:
- attack.exfiltration
- attack.t1567.001
logsource:
  category: network_connection
  product: windows
detection:
  selection:
    Initiated: 'true'
    DestinationHostname|endswith:
    - 'mega.co.nz'
    - 'mega.nz'
  condition: selection
falsepositives:
- Legitimate MEGA installers and utilities are expected to communicate with this domain.
  Exclude hosts that are known to be allowed to use this tool.
level: low
notes: |
  ### Technical Context
  This Sigma rule is designed to detect unauthorized network connections initiated to the domain "api.mega.co.nz" or "mega.nz," which are associated with the MEGA file storage and sharing service. Attackers often misuse such services for exfiltrating data or transferring malicious payloads. The rule leverages network connection logs collected from Windows systems to pinpoint instances where a binary (executable) makes a connection to these specified domains. It focuses on whether the connection was successfully initiated, thereby indicating potential exfiltration activities. As such, this detection plays a crucial role in identifying possible malicious behavior by monitoring network traffic patterns that deviate from normal operations.
  ### Investigation Steps
  - Review endpoint logs using your EDR solution to identify the executable that initiated the connection to "api.mega.co.nz" or "mega.nz."
  - Investigate the process tree related to the detected connection to determine if the binary in question is legitimate or potentially malicious.
  - Check firewall logs on the NGFW for a history of outbound connections to the identified MEGA domains from the affected host, ensuring to assess any patterns or anomalies.
  - Query proxy logs to find any additional web traffic to MEGA services from the same host, as this may indicate ongoing or repeated interactions with the file-sharing domain.
