title: Outbound Network Connection Initiated By Cmstp.EXE
id: efafe0bf-4238-479e-af8f-797bd3490d2d
status: test
description: |
  Detects a network connection initiated by Cmstp.EXE
  Its uncommon for "cmstp.exe" to initiate an outbound network connection. Investigate the source of such requests to determine if they are malicious.
references:
- https://web.archive.org/web/20190720093911/http://www.endurant.io/cmstp/detecting-cmstp-enabled-code-execution-and-uac-bypass-with-sysmon/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-08-30
modified: 2024-05-31
tags:
- attack.defense-evasion
- attack.t1218.003
logsource:
  category: network_connection
  product: windows
detection:
  selection:
    Image|endswith: '\cmstp.exe'
    Initiated: 'true'
  filter_main_local_ranges:
    DestinationIp|cidr:
    - '127.0.0.0/8'
    - '10.0.0.0/8'
    - '172.16.0.0/12'
    - '192.168.0.0/16'
    - '169.254.0.0/16'
    - '::1/128'          # IPv6 loopback
    - 'fe80::/10'          # IPv6 link-local addresses
    - 'fc00::/7'          # IPv6 private addresses
  condition: selection and not 1 of filter_main_*
falsepositives:
- Unknown
# Note: Please report any false positive seen in the wild to help tune the rule.
level: high
notes: |
  ### Technical Context
  This detection rule focuses on identifying uncommon outbound network connections initiated by the `cmstp.exe` process, which is a Windows utility typically used for managing Connection Manager profiles. In normal operations, `cmstp.exe` is not expected to create outbound network connections, making its activity a potential indicator of malicious behavior. The rule leverages network connection logs that capture details about processes initiating network activity, specifically looking for entries where the image path ends with `\cmstp.exe` and indicates that a connection has been initiated. To reduce noise in the alerts, the rule also includes a filter that excludes internal IP address ranges, ensuring that only connections to external networks are flagged for investigation.
  ### Investigation Steps
  - Review the network connection logs within the EDR or SIEM to identify other ongoing or recent activities associated with `cmstp.exe`, which may provide context about the connection.
  - Examine the command-line arguments used by `cmstp.exe` during execution. This can reveal potentially malicious flags or scripts that indicate what the process was attempting to do.
  - Check the process lineage to determine the parent process that initiated `cmstp.exe`. Understanding how it was launched can help identify potential exploitation or lateral movement.
  - Query firewall logs and any associated AV alerts that may have triggered during the time of the outbound connection to gather additional evidence regarding the legitimacy of the activity.
