title: Process Initiated Network  Connection To Ngrok Domain
id: 18249279-932f-45e2-b37a-8925f2597670
related:
- id: 1d08ac94-400d-4469-a82f-daee9a908849
  type: similar
status: test
description: |
  Detects an executable initiating a network connection to "ngrok" domains.
  Attackers were seen using this "ngrok" in order to store their second stage payloads and malware.
  While communication with such domains can be legitimate, often times is a sign of either data exfiltration by malicious actors or additional download.
references:
- https://ngrok.com/
- https://ngrok.com/blog-post/new-ngrok-domains
- https://www.virustotal.com/gui/file/cca0c1182ac114b44dc52dd2058fcd38611c20bb6b5ad84710681d38212f835a/
- https://www.rnbo.gov.ua/files/2023_YEAR/CYBERCENTER/november/APT29%20attacks%20Embassies%20using%20CVE-2023-38831%20-%20report%20en.pdf
author: Florian Roth (Nextron Systems)
date: 2022-07-16
modified: 2023-11-17
tags:
- attack.exfiltration
- attack.t1567.001
logsource:
  category: network_connection
  product: windows
detection:
  selection:
    Initiated: 'true'
    DestinationHostname|endswith:
    - '.ngrok-free.app'
    - '.ngrok-free.dev'
    - '.ngrok.app'
    - '.ngrok.dev'
    - '.ngrok.io'
  condition: selection
falsepositives:
- Legitimate use of the ngrok service.
# Note: The level of this rule is related to your internal policy.
level: high
notes: |
  ### Technical Context
  This detection rule identifies instances where an executable on a Windows system initiates a network connection to domains associated with the "ngrok" service. Ngrok is often used by attackers to facilitate remote access to compromised systems or to exfiltrate data, as it provides a way to tunnel traffic through firewalls and NAT devices. The rule specifically looks for network connection logs that indicate traffic directed to any ngrok domain, including variations like ".ngrok.app" and ".ngrok.dev". By monitoring these connections, security teams can detect potentially malicious behavior that may be indicative of data leakage or the receipt of additional malicious payloads.
  The primary data sources for this rule are collected from network connection logs, capturing details such as process creation events and the associated destination hostnames. By correlating this data with known attack patterns, security analysts can effectively identify and respond to suspicious activity involving ngrok services.
  ### Investigation Steps
  - Review the network connection logs in the SIEM to identify which process initiated the connection to the ngrok domain. Pay special attention to the process name and its parent process.
  - Utilize the EDR tool to analyze the behavior of the identified process, looking for signs of malicious activity or deviations from normal operations.
  - Cross-reference the time of the connection with endpoint logs to see if there were any anomalous behaviors, such as file modifications or additional network connections made shortly before or after.
  - If available, investigate proxy logs to check for any outgoing requests to the ngrok domains, as this can provide further context or corroborate the findings from the initial investigation.
