title: RegAsm.EXE Initiating Network Connection To Public IP
id: 0531e43a-d77d-47c2-b89f-5fe50321c805
status: test
description: Detects "RegAsm.exe" initiating a network connection to public IP adresses
references:
- https://app.any.run/tasks/ec207948-4916-47eb-a0f4-4c6abb2e7668/
- https://research.splunk.com/endpoint/07921114-6db4-4e2e-ae58-3ea8a52ae93f/
- https://lolbas-project.github.io/lolbas/Binaries/Regasm/
author: frack113
date: 2024-04-25
tags:
- attack.defense-evasion
- attack.t1218.009
logsource:
  category: network_connection
  product: windows
detection:
  selection:
    Initiated: 'true'
    Image|endswith: '\regasm.exe'
  filter_main_local_ranges:
    DestinationIp|cidr:
    - '127.0.0.0/8'
    - '10.0.0.0/8'
    - '172.16.0.0/12'
    - '192.168.0.0/16'
    - '169.254.0.0/16'
    - '::1/128'          # IPv6 loopback
    - 'fe80::/10'          # IPv6 link-local addresses
    - 'fc00::/7'          # IPv6 private addresses
  condition: selection and not 1 of filter_main_*
falsepositives:
- Unknown
level: medium
notes: |
  n
  ### Technical Context
  This detection rule identifies instances where the `RegAsm.exe` application initiates a network connection to a public IP address. `RegAsm.exe` (Assembly Registration Tool) is typically used within the .NET framework to register assemblies in the Windows Global Assembly Cache (GAC). However, when this legitimate administrative tool makes outbound network connections, it may indicate a potential misconfiguration, malicious use, or a technique employed by attackers seeking to exfiltrate data or communicate with control servers. 
  The rule leverages Windows network connection logs to detect when `RegAsm.exe` initiates a connection, filtering out private and reserved IP address ranges to focus solely on public IP connectivity. This behavior is aligned with the MITRE ATT&CK tactic of Defense Evasion (Tactic ID: TA0005) and specifically relates to the technique T1218.009, which encompasses the use of system binaries in the evasion of detection.
  ### Investigation Steps
  - **Check EDR Investigation**: Review the endpoint detection and response (EDR) logs for the time of the alert to examine the process tree and command-line arguments associated with the `RegAsm.exe` process.
  - **Correlate with Network Logs**: Analyze network connection logs from the NGFW or NDR to identify the external public IP address being contacted and the volume of data transfer, if any, during the incident timeframe.
  - **Inspect Endpoint Activity**: Utilize the Sysmon logs to further investigate process creation events, especially focusing on any unusual command-line arguments utilized by `RegAsm.exe` that may indicate malicious intent.
  - **Consult Threat Intelligence**: Cross-reference the public IP address with threat intelligence sources to determine if it is known for hosting malicious activities or if it falls within dubious geolocations.
  ### Prioritization
  The severity level of medium is assigned to this alert due to the dual nature of `RegAsm.exe` as a legitimate administrative tool and its potential misuse for malicious activities, warranting further investigation to determine the context and intent of the network connection.
  ### Blind Spots and Assumptions
  This rule may not fire if `RegAsm.exe` is executed in a limited (privileged) environment where network traffic is not logged, or if the application is isolated from network access altogether. Furthermore, if an attacker replaces or injects code into legitimate processes to mask their activities, this rule might not detect such evasion. It is assumed that the network logs are consistently enabled and monitored, as a lack of telemetry can lead to missed detections.
  > **Disclaimer:** This investigation guide was created using generative AI technology and has not been reviewed for its accuracy and relevance. While every effort has been made to ensure its quality, we recommend validating the content and adapting it to suit specific environment and operational needs. Please communicate any changes to the detection engineering team.
