title: Communication To LocaltoNet Tunneling Service Initiated
id: 3ab65069-d82a-4d44-a759-466661a082d1
status: experimental
description: |
  Detects an executable initiating a network connection to "LocaltoNet" tunneling sub-domains.
  LocaltoNet is a reverse proxy that enables localhost services to be exposed to the Internet.
  Attackers have been seen to use this service for command-and-control activities to bypass MFA and perimeter controls.
references:
- https://localtonet.com/documents/supported-tunnels
- https://cloud.google.com/blog/topics/threat-intelligence/unc3944-targets-saas-applications
author: Andreas Braathen (mnemonic.io)
date: 2024-06-17
tags:
- attack.command-and-control
- attack.t1572
- attack.t1090
- attack.t1102
logsource:
  category: network_connection
  product: windows
detection:
  selection:
    DestinationHostname|endswith:
    - '.localto.net'
    - '.localtonet.com'
    Initiated: 'true'
  condition: selection
falsepositives:
- Legitimate use of the LocaltoNet service.
level: high
notes: |
  ### Technical Context
  This detection rule identifies attempts by executables to establish network connections to sub-domains associated with LocaltoNet, a service that acts as a reverse proxy for exposing local services to the internet. Attackers may utilize this tunneling service to bypass security measures, such as Multi-Factor Authentication (MFA) and perimeter defenses, to command and control their compromised endpoints. The rule focuses on monitoring network connection logs to detect any outgoing requests destined for LocaltoNet's domains. Relevant data sources involved include network connection logs that capture the initiated connections from Windows-based systems. Identifying such activities is essential for early detection of potential malicious behavior aimed at exploiting local services for nefarious purposes.
  ### Investigation Steps
  - Review endpoint logs in the EDR solution to identify the executable responsible for the connection to LocaltoNet, noting the process name and parameters used during execution.
  - Utilize the SIEM to search for any related events or anomalies occurring around the time of the detected connection, especially focusing on user account activity and authentication logs.
  - Check firewall logs in the NGFW for any unusual outbound activities correlating with the LocaltoNet connection to understand the nature and volume of traffic being transmitted.
  - Analyze DNS queries and Proxy logs to see if there were any prior attempts to access LocaltoNet services and identify other employees or devices that may have interacted with those domains.
