title: Outbound RDP Connections Over Non-Standard Tools
id: ed74fe75-7594-4b4b-ae38-e38e3fd2eb23
status: test
description: |
  Detects Non-Standard tools initiating a connection over port 3389 indicating possible lateral movement.
  An initial baseline is required before using this utility to exclude third party RDP tooling that you might use.
references:
- https://portal.msrc.microsoft.com/en-US/security-guidance/advisory/CVE-2019-0708
author: Markus Neis
date: 2019-05-15
modified: 2024-02-09
tags:
- attack.lateral-movement
- attack.t1021.001
- car.2013-07-002
logsource:
  category: network_connection
  product: windows
detection:
  selection:
    DestinationPort: 3389
    Initiated: 'true'
  filter_main_mstsc:
    Image:
    - 'C:\Windows\System32\mstsc.exe'
    - 'C:\Windows\SysWOW64\mstsc.exe'
  filter_optional_dns:
        # Note: https://github.com/SigmaHQ/sigma/pull/2249
    Image: 'C:\Windows\System32\dns.exe'
    SourcePort: 53
    Protocol: 'udp'
  filter_optional_avast:
    Image|endswith:
    - '\Avast Software\Avast\AvastSvc.exe'
    - '\Avast\AvastSvc.exe'
  filter_optional_sysinternals_rdcman:
    Image|endswith: '\RDCMan.exe'
  filter_optional_chrome:
    Image: 'C:\Program Files\Google\Chrome\Application\chrome.exe'
  filter_optional_third_party:
    Image|endswith:
    - '\FSAssessment.exe'
    - '\FSDiscovery.exe'
    - '\MobaRTE.exe'
    - '\mRemote.exe'
    - '\mRemoteNG.exe'
    - '\Passwordstate.exe'
    - '\RemoteDesktopManager.exe'
    - '\RemoteDesktopManager64.exe'
    - '\RemoteDesktopManagerFree.exe'
    - '\RSSensor.exe'
    - '\RTS2App.exe'
    - '\RTSApp.exe'
    - '\spiceworks-finder.exe'
    - '\Terminals.exe'
    - '\ws_TunnelService.exe'
  filter_optional_thor:
    Image|endswith:
    - '\thor.exe'
    - '\thor64.exe'
  filter_optional_splunk:
    Image|startswith: 'C:\Program Files\SplunkUniversalForwarder\bin\'
  filter_optional_sentinel_one:
    Image|endswith: '\Ranger\SentinelRanger.exe'
  filter_optional_firefox:
    Image: 'C:\Program Files\Mozilla Firefox\firefox.exe'
  filter_optional_tsplus:    # Some RAS
    Image:
    - 'C:\Program Files\TSplus\Java\bin\HTML5service.exe'
    - 'C:\Program Files (x86)\TSplus\Java\bin\HTML5service.exe'
  filter_optional_null:
    Image:
  filter_optional_empty:
    Image: ''
  filter_optional_unknown:
    Image: '<unknown process>'
  condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
falsepositives:
- Third party RDP tools
level: high
notes: |
  ### Technical Context
  This Sigma rule is designed to detect potentially unauthorized outbound Remote Desktop Protocol (RDP) connections made through non-standard tools, which could indicate lateral movement within an enterprise network. The primary focus lies on network connection logs, specifically those involving outbound connections to port 3389 (used by RDP). The rule distinguishes between legitimate RDP connections initiated by the standard Microsoft Terminal Services Client (mstsc.exe) and potential threats posed by alternative applications. To ensure accuracy, responders are encouraged to establish a baseline of legitimate tool usage to filter out known third-party RDP solutions which may also utilize this port.
  The detection leverages several fields within the network connection logs, including the destination port, the initiation status, and the process image names executing the outbound connections. By filtering out known safe applications through a comprehensive list, the rule enhances its reliability and focuses on identifying potentially malicious or non-standard RDP activity.
  ### Investigation Steps
  - Review the EDR logs for detailed process activity on affected endpoints to identify any unexpected processes associated with outbound RDP connections.
  - Check firewall logs to correlate the detected outbound RDP attempts with any recorded events for that destination IP, providing context for the nature of the connection.
  - Analyze command-line parameters and any other available metadata about the applications initiating the connections to uncover any anomalies or misconfigurations.
  - Utilize the SIEM platform to correlate the alerts with user activity logs, examining user behavior leading up to the alert to identify potentially malicious lateral movement patterns.
