title: Outbound RDP Connections Over Non-Standard Tools
id: ed74fe75-7594-4b4b-ae38-e38e3fd2eb23
status: test
description: |
  Detects Non-Standard tools initiating a connection over port 3389 indicating possible lateral movement.
  An initial baseline is required before using this utility to exclude third party RDP tooling that you might use.
references:
- https://portal.msrc.microsoft.com/en-US/security-guidance/advisory/CVE-2019-0708
author: Markus Neis
date: 2019-05-15
modified: 2024-02-09
tags:
- attack.lateral-movement
- attack.t1021.001
- car.2013-07-002
logsource:
  category: network_connection
  product: windows
detection:
  selection:
    DestinationPort: 3389
    Initiated: 'true'
  filter_main_mstsc:
    Image:
    - 'C:\Windows\System32\mstsc.exe'
    - 'C:\Windows\SysWOW64\mstsc.exe'
  filter_optional_dns:
        # Note: https://github.com/SigmaHQ/sigma/pull/2249
    Image: 'C:\Windows\System32\dns.exe'
    SourcePort: 53
    Protocol: 'udp'
  filter_optional_avast:
    Image|endswith:
    - '\Avast Software\Avast\AvastSvc.exe'
    - '\Avast\AvastSvc.exe'
  filter_optional_sysinternals_rdcman:
    Image|endswith: '\RDCMan.exe'
  filter_optional_chrome:
    Image: 'C:\Program Files\Google\Chrome\Application\chrome.exe'
  filter_optional_third_party:
    Image|endswith:
    - '\FSAssessment.exe'
    - '\FSDiscovery.exe'
    - '\MobaRTE.exe'
    - '\mRemote.exe'
    - '\mRemoteNG.exe'
    - '\Passwordstate.exe'
    - '\RemoteDesktopManager.exe'
    - '\RemoteDesktopManager64.exe'
    - '\RemoteDesktopManagerFree.exe'
    - '\RSSensor.exe'
    - '\RTS2App.exe'
    - '\RTSApp.exe'
    - '\spiceworks-finder.exe'
    - '\Terminals.exe'
    - '\ws_TunnelService.exe'
  filter_optional_thor:
    Image|endswith:
    - '\thor.exe'
    - '\thor64.exe'
  filter_optional_splunk:
    Image|startswith: 'C:\Program Files\SplunkUniversalForwarder\bin\'
  filter_optional_sentinel_one:
    Image|endswith: '\Ranger\SentinelRanger.exe'
  filter_optional_firefox:
    Image: 'C:\Program Files\Mozilla Firefox\firefox.exe'
  filter_optional_tsplus:    # Some RAS
    Image:
    - 'C:\Program Files\TSplus\Java\bin\HTML5service.exe'
    - 'C:\Program Files (x86)\TSplus\Java\bin\HTML5service.exe'
  filter_optional_null:
    Image:
  filter_optional_empty:
    Image: ''
  filter_optional_unknown:
    Image: '<unknown process>'
  condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
falsepositives:
- Third party RDP tools
level: high
notes: |
  ### Technical Context
  This Sigma rule is designed to detect outbound Remote Desktop Protocol (RDP) connections initiated via non-standard tools, specifically targeting communications over port 3389. The detection mechanism leverages network connection logs, focusing on processes that typically do not include legitimate native RDP clients such as `mstsc.exe`, which is the default Microsoft Remote Desktop Connection application. By filtering out known legitimate instances and third-party Remote Desktop tools, the rule is aimed at unearthing potential lateral movement attempts within an enterprise environment, as flagged under the MITRE ATT&CK technique T1021.001 (Remote Services: Remote Desktop Protocol). This is particularly crucial as adversaries often exploit internal RDP connections to move laterally across a network after gaining initial access.
  The rule recognizes connections initiated from various potential non-standard services and applications. Through process identification and filtering, it distinguishes between legitimate users leveraging known RDP tools and potential threats utilizing unauthorized software to establish remote connections. The correlation between outbound traffic, specified process images, and port usage enables proactive monitoring for suspicious activities that indicate lateral movement, enhancing the security posture of the organization.
  ### Investigation Steps
  - **Review Connection Logs:** Check network connection logs using the EDR to identify the specific source and destination IP addresses, timestamps, and associated user accounts for outbound connections on port 3389.
  - **Analyze Process Details:** Investigate the process details of any matching connections. Use the Sysmon logs to inspect process creation and command-line arguments to establish context around the application initiating the connection.
  - **Cross-reference Tool Usage:** Consult application logs and the organization's baseline for RDP tool usage to confirm if the identified processes are permitted and valid. Determine whether the connections align with normal business activity or represent anomalous behavior.
  - **Engage with Threat Intelligence:** Assess the reported activity against internal threat intelligence to identify if any utilization of the flagged tools has been associated with previous incidents or external threat actor tactics.
  ### Prioritization
  The alert is assigned a high severity level due to the potential implications of unauthorized RDP access, which can facilitate lateral movement within the network and lead to broader compromise if not addressed swiftly.
  ### Blind Spots and Assumptions
  This rule operates under the assumption that known or legitimate third-party RDP tools have been correctly baseline-established and thus won't trigger alerts. There may be instances where newly deployed tools or software not included in the filters are being used for RDP without prior approval or monitoring, resulting in undetected lateral movements. Additionally, sophisticated adversaries may employ methods to spoof process names or leverage legitimate applications to obscure RDP activities, potentially evading detection through this rule.
  > **Disclaimer:** This investigation guide was created using generative AI technology and has not been reviewed for its accuracy and relevance. While every effort has been made to ensure its quality, we recommend validating the content and adapting it to suit specific environment and operational needs. Please communicate any changes to the detection engineering team.
