title: Communication To Ngrok Tunneling Service Initiated
id: 1d08ac94-400d-4469-a82f-daee9a908849
related:
- id: 18249279-932f-45e2-b37a-8925f2597670
  type: similar
status: test
description: |
  Detects an executable initiating a network connection to "ngrok" tunneling domains.
  Attackers were seen using this "ngrok" in order to store their second stage payloads and malware.
  While communication with such domains can be legitimate, often times is a sign of either data exfiltration by malicious actors or additional download.
references:
- https://twitter.com/hakluke/status/1587733971814977537/photo/1
- https://ngrok.com/docs/secure-tunnels/tunnels/ssh-reverse-tunnel-agent
author: Florian Roth (Nextron Systems)
date: 2022-11-03
modified: 2024-02-02
tags:
- attack.exfiltration
- attack.command-and-control
- attack.t1567
- attack.t1568.002
- attack.t1572
- attack.t1090
- attack.t1102
- attack.s0508
logsource:
  category: network_connection
  product: windows
detection:
  selection:
    DestinationHostname|contains:
    - 'tunnel.us.ngrok.com'
    - 'tunnel.eu.ngrok.com'
    - 'tunnel.ap.ngrok.com'
    - 'tunnel.au.ngrok.com'
    - 'tunnel.sa.ngrok.com'
    - 'tunnel.jp.ngrok.com'
    - 'tunnel.in.ngrok.com'
  condition: selection
falsepositives:
- Legitimate use of the ngrok service.
level: high
notes: |
  ### Technical Context
  This detection rule identifies potentially malicious activity involving the Ngrok tunneling service by monitoring network connections initiated by executables to specific Ngrok domains. Ngrok is often used by attackers to facilitate command-and-control communication and data exfiltration due to its ability to establish secure tunnels through network barriers. The rule analyzes network connection logs originating from Windows environments, focusing on the destination hostnames associated with Ngrok tunneling services. While there are legitimate uses for Ngrok, recognizing communication with its domains—especially in patterns characteristic of malicious behavior—serves as a critical alert for SOC analysts to investigate potential security incidents.
  ### Investigation Steps
  - Check EDR logs for the process that initiated the network connection to Ngrok to identify any unusual or unauthorized activity.
  - Review command-line arguments associated with the executable to determine if there are signs of malicious intent, such as obfuscation or suspicious parameters.
  - Utilize the SIEM to query for historical connections to Ngrok domains from affected endpoints to identify potential data exfiltration attempts.
  - Analyze firewall and proxy logs for additional context on traffic patterns that may indicate lateral movement or communication with other known malicious infrastructure.
