title: Suspicious Dropbox API Usage
id: 25eabf56-22f0-4915-a1ed-056b8dae0a68
status: test
description: Detects an executable that isn't dropbox but communicates with the Dropbox
  API
references:
- https://app.any.run/tasks/7e906adc-9d11-447f-8641-5f40375ecebb
- https://www.zscaler.com/blogs/security-research/new-espionage-attack-molerats-apt-targeting-users-middle-east
author: Florian Roth (Nextron Systems)
date: 2022-04-20
tags:
- attack.command-and-control
- attack.t1105
logsource:
  category: network_connection
  product: windows
detection:
  selection:
    Initiated: 'true'
    DestinationHostname|endswith:
    - 'api.dropboxapi.com'
    - 'content.dropboxapi.com'
  filter_main_legit_dropbox:
        # Note: It's better to add a specific path to the exact location(s) where dropbox is installed
    Image|contains: '\Dropbox'
  condition: selection and not 1 of filter_main_*
falsepositives:
- Legitimate use of the API with a tool that the author wasn't aware of
level: high
notes: |
  ### Technical Context
  This detection rule aims to identify potential misuse of the Dropbox API by executables that are not part of the legitimate Dropbox application. It specifically looks for network connections initiated by processes that attempt to communicate with Dropbox API endpoints, such as `api.dropboxapi.com` and `content.dropboxapi.com`. The rule filters these connections to exclude those coming from the legitimate Dropbox application, typically located in the system's `\Dropbox` directory. By analyzing network connection logs, particularly those from Windows environments, the rule can help uncover potentially malicious activity where unauthorized applications might be trying to exfiltrate data or establish command-and-control communications through the Dropbox service.
  ### Investigation Steps
  - Review the EDR logs to identify the initiating processes that triggered the alert and examine their command-line parameters for any suspicious arguments.
  - Check the network connection logs in the SIEM to analyze the timing and frequency of the connections made to the Dropbox API endpoints.
  - Search for any anomalies in the proxy logs for the same period, looking for unusual usage patterns or connections from unexpected hosts.
  - Investigate user accounts associated with the suspicious processes to determine if there is any relation to known incidents or if unusual behavior can be linked to compromised credentials.
