title: Network Connection Initiated From Process Located In Potentially Suspicious
  Or Uncommon Location
id: 7b434893-c57d-4f41-908d-6a17bf1ae98f
status: test
description: |
  Detects a network connection initiated by programs or processes running from suspicious or uncommon files system locations.
references:
- https://docs.google.com/spreadsheets/d/17pSTDNpa0sf6pHeRhusvWG6rThciE8CsXTSlDUAZDyo
author: Florian Roth (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)
date: 2017-03-19
modified: 2024-08-22
tags:
- attack.command-and-control
- attack.t1105
logsource:
  category: network_connection
  product: windows
detection:
  selection:
    Initiated: 'true'
    Image|contains:
    - ':\$Recycle.bin'
    - ':\Perflogs\'
    - ':\Temp\'
    - ':\Users\Default\'
    - ':\Windows\Fonts\'
    - ':\Windows\IME\'
    - ':\Windows\System32\Tasks\'
    - ':\Windows\Tasks\'
    - '\config\systemprofile\'
    - '\Windows\addins\'
  filter_main_domains:
        # Note: We exclude these domains to avoid duplicate filtering from e0f8ab85-0ac9-423b-a73a-81b3c7b1aa97
    DestinationHostname|endswith:
    - '.githubusercontent.com'               # Includes both gists and github repositories / Michael Haag (idea)
    - 'anonfiles.com'
    - 'cdn.discordapp.com'
    - 'ddns.net'
    - 'dl.dropboxusercontent.com'
    - 'ghostbin.co'
    - 'glitch.me'
    - 'gofile.io'
    - 'hastebin.com'
    - 'mediafire.com'
    - 'mega.co.nz'
    - 'mega.nz'
    - 'onrender.com'
    - 'pages.dev'
    - 'paste.ee'
    - 'pastebin.com'
    - 'pastebin.pl'
    - 'pastetext.net'
    - 'portmap.io'          # https://pro.twitter.com/JaromirHorejsi/status/1795001037746761892/photo/2
    - 'privatlab.com'
    - 'privatlab.net'
    - 'send.exploit.in'
    - 'sendspace.com'
    - 'storage.googleapis.com'
    - 'storjshare.io'
    - 'supabase.co'
    - 'temp.sh'
    - 'transfer.sh'
    - 'trycloudflare.com'
    - 'ufile.io'
    - 'w3spaces.com'
    - 'workers.dev'
  condition: selection and not 1 of filter_main_*
falsepositives:
- Unknown
level: high
notes: |
  n
  ### Technical Context
  This Sigma rule detects network connections initiated by processes running from suspicious or uncommon filesystem locations within a Windows environment. Common directories like `\$Recycle.bin`, `\Temp\`, and `\Windows\Fonts\` are included as focal points, as malware often resides in these less monitored areas to evade detection. The rule leverages network connection logs, focusing on the `Initiated` event, which indicates that a process is trying to establish communication over the network. The rule specifically targets potential command and control (C2) activities by filtering out connections to known safe domains (e.g., GitHub Content Delivery Network, Dropbox, etc.) that might otherwise trigger false positives. This aligns with the MITRE ATT&CK tactic of Command and Control (T1105).
  ### Investigation Steps
  - **Check Process Details:** Use your EDR tool to retrieve details about the process and its command-line parameters, focusing on process creation logs to verify the legitimacy of the initiating process.
  - **Analyze Network Traffic:** Review network logs for the specific network connections made by the flagged process. Cross-reference the destination hostnames against known indicators of compromise to determine if they pose a threat.
  - **Examine File Locations:** Conduct a file system audit in the reported suspicious locations. Validate the presence and legitimacy of the files associated with the identified process, checking for any unauthorized or unexpected executables.
  - **Monitor Historical Context:** Utilize Windows Event Logs and Sysmon for any prior alerts related to the same source process or similar network activity. Investigate previous connections made by the process for patterns or irregularities.
  ### Prioritization
  The alert is classified as high severity because network connections from uncommon paths often suggest the presence of malware attempting to communicate with external servers, potentially indicating an active compromise that necessitates immediate investigation.
  ### Blind Spots and Assumptions
  There are several factors that may limit the effectiveness of this rule. First, legitimate applications may occasionally run from these uncommon directories, leading to false positives. Furthermore, advanced attackers may employ techniques like masquerading, where malicious software is disguised in legitimate locations or exfiltrates data over allowed domains. Additionally, if the logging level is insufficient or not properly configured, the rule may miss relevant network connection events altogether. It is also assumed that the monitoring environment has proper detection capabilities in place; otherwise, the rule may fail to trigger.
  > **Disclaimer:** This investigation guide was created using generative AI technology and has not been reviewed for its accuracy and relevance. While every effort has been made to ensure its quality, we recommend validating the content and adapting it to suit specific environment and operational needs. Please communicate any changes to the detection engineering team.
