title: Uncommon Connection to Active Directory Web Services
id: b3ad3c0f-c949-47a1-a30e-b0491ccae876
status: test
description: |
  Detects uncommon network connections to the Active Directory Web Services (ADWS) from processes not typically associated with ADWS management.
references:
- https://medium.com/falconforce/soaphound-tool-to-collect-active-directory-data-via-adws-165aca78288c
- https://github.com/FalconForceTeam/FalconFriday/blob/master/Discovery/ADWS_Connection_from_Unexpected_Binary-Win.md
author: '@kostastsale'
date: 2024-01-26
tags:
- attack.discovery
- attack.t1087
logsource:
  category: network_connection
  product: windows
detection:
  selection:
    Initiated: true
    DestinationPort: 9389
  filter_main_dsac:
    Image: 'C:\Windows\system32\dsac.exe'
  filter_main_ms_monitoring_agent:
    Image: 'C:\Program Files\Microsoft Monitoring Agent\'
  filter_main_powershell:
    Image|startswith:
    - 'C:\Program Files\PowerShell\7\pwsh.exe'
    - 'C:\Program Files\PowerShell\7-preview\pwsh.ex'
    - 'C:\Windows\System32\WindowsPowerShell\'
    - 'C:\Windows\SysWOW64\WindowsPowerShell\'
  condition: selection and not 1 of filter_main_*
falsepositives:
- ADWS is used by a number of legitimate applications that need to interact with Active
  Directory. These applications should be added to the allow-listing to avoid false
  positives.
level: medium
notes: |
  ### Technical Context
  The Sigma rule "Uncommon Connection to Active Directory Web Services" is designed to identify anomalous network connections to Active Directory Web Services (ADWS) that originate from processes that are not typically associated with ADWS management. ADWS communicates over port 9389, which is specifically monitored by this rule. The detection mechanism looks for processes initiating connections to this port, but it excludes well-known binaries such as `dsac.exe`, `Microsoft Monitoring Agent`, and common PowerShell executables. This helps to filter out legitimate traffic that might otherwise trigger alerts. By focusing on connections from unexpected processes, incident responders can hone in on potentially malicious activity that may signify reconnaissance or exploitation attempts against the Active Directory environment.
  ### Investigation Steps
  - Utilize the EDR tool to investigate the process that initiated the connection to ADWS on port 9389. Look for any related artifacts or behaviors indicative of malicious activity.
  - Check the command-line arguments logged by the EDR to determine the context of the execution and whether standard operating procedures were followed.
  - Review network logs from the NGFW and NDR tools to trace the source and destination of the connection, paying attention to any unusual patterns or known attacker IP addresses.
  - Cross-reference with Active Directory logs to assess whether there were any suspicious actions or account changes made during the same timeframe as the detected connection.
