title: Potentially Suspicious Network Connection To Notion API
id: 7e9cf7b6-e827-11ed-a05b-15959c120003
status: test
description: Detects a non-browser process communicating with the Notion API. This
  could indicate potential use of a covert C2 channel such as "OffensiveNotion C2"
references:
- https://github.com/mttaggart/OffensiveNotion
- https://medium.com/@huskyhacks.mk/we-put-a-c2-in-your-notetaking-app-offensivenotion-3e933bace332
author: Gavin Knapp
date: 2023-05-03
tags:
- attack.command-and-control
- attack.t1102
logsource:
  product: windows
  category: network_connection
detection:
  selection:
    DestinationHostname|contains: 'api.notion.com'
  filter_main_notion:
    Image|endswith: '\AppData\Local\Programs\Notion\Notion.exe'
  filter_main_brave:
    Image|endswith: '\brave.exe'
  filter_main_chrome:
    Image:
    - 'C:\Program Files\Google\Chrome\Application\chrome.exe'
    - 'C:\Program Files (x86)\Google\Chrome\Application\chrome.exe'
  filter_main_firefox:
    Image:
    - 'C:\Program Files\Mozilla Firefox\firefox.exe'
    - 'C:\Program Files (x86)\Mozilla Firefox\firefox.exe'
  filter_main_ie:
    Image:
    - 'C:\Program Files (x86)\Internet Explorer\iexplore.exe'
    - 'C:\Program Files\Internet Explorer\iexplore.exe'
  filter_main_maxthon:
    Image|endswith: '\maxthon.exe'
  filter_main_edge_1:
  - Image|startswith: 'C:\Program Files (x86)\Microsoft\EdgeWebView\Application\'
  - Image|endswith: '\WindowsApps\MicrosoftEdge.exe'
  - Image:
    - 'C:\Program Files (x86)\Microsoft\Edge\Application\msedge.exe'
    - 'C:\Program Files\Microsoft\Edge\Application\msedge.exe'
  filter_main_edge_2:
    Image|startswith:
    - 'C:\Program Files (x86)\Microsoft\EdgeCore\'
    - 'C:\Program Files\Microsoft\EdgeCore\'
    Image|endswith:
    - '\msedge.exe'
    - '\msedgewebview2.exe'
  filter_main_opera:
    Image|endswith: '\opera.exe'
  filter_main_safari:
    Image|endswith: '\safari.exe'
  filter_main_seamonkey:
    Image|endswith: '\seamonkey.exe'
  filter_main_vivaldi:
    Image|endswith: '\vivaldi.exe'
  filter_main_whale:
    Image|endswith: '\whale.exe'
  condition: selection and not 1 of filter_main_*
falsepositives:
- Legitimate applications communicating with the "api.notion.com" endpoint that are
  not already in the exclusion list. The desktop and browser applications do not appear
  to be using the API by default unless integrations are configured.
level: low
notes: |
  ### Technical Context
  This detection rule is designed to identify suspicious network connections from non-browser processes to the Notion API endpoint (api.notion.com). It focuses on processes that are not typically associated with web browsing, such as the Notion application itself, and checks if these process connections are made to the specified API. The rule utilizes network connection logs collected from Windows operating systems, primarily looking at the destination hostnames in relation to known web browsers and commonly used software that may indicate legitimate usage of the Notion API. If a process outside the acceptable criteria makes a connection, it could suggest the existence of covert command-and-control (C2) activity, particularly indicative of tools like "OffensiveNotion."
  ### Investigation Steps
  - Review the endpoint's EDR logs to identify the process initiating connections to the Notion API, checking for anomalies in process behavior and command-line parameters.
  - Examine the network logs via your SIEM for recent connections to api.notion.com, corroborating the source IP and process to establish if it aligns with known base usages or legitimate deployment.
  - Verify any relevant Proxy logs to confirm the nature of the traffic directed towards the Notion API, which may help establish usage context or indicate potential misconfigurations.
  - Assess the context of the alerts against known legitimate applications; if the process is excluded or belongs to a browser, consider the alert as a low priority and review company-specific app configurations for potential integrations.
