title: BITS Transfer Job Download To Potential Suspicious Folder
id: f8a56cb7-a363-44ed-a82f-5926bb44cd05
status: test
description: Detects new BITS transfer job where the LocalName/Saved file is stored
  in a potentially suspicious location
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1197/T1197.md
author: Florian Roth (Nextron Systems)
date: 2022-06-28
modified: 2023-03-27
tags:
- attack.defense-evasion
- attack.persistence
- attack.t1197
logsource:
  product: windows
  service: bits-client
detection:
  selection:
    EventID: 16403
    LocalName|contains:
            # TODO: Add more interesting suspicious paths
    - '\Desktop\'
    - 'C:\Users\Public\'
    - 'C:\PerfLogs\'
  condition: selection
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This Sigma rule is designed to detect the creation of Background Intelligent Transfer Service (BITS) transfer jobs in Windows that involve downloading files to potentially suspicious locations. BITS is often used by both benign applications for legitimate updates and by attackers to covertly download payloads. The rule specifically looks for Event ID 16403, which indicates a new BITS job has been created, and checks if the file's save location matches known suspicious paths such as the user’s Desktop or Public directories. By filtering for these paths, the rule helps identify potentially malicious activities that could signal an initial compromise or lateral movement within the network.
  The data sources involved in this detection include Windows event logs generated by the BITS client, which provide insight into the newly created transfer jobs. As such, when this rule triggers, it warrants further investigation to determine the legitimacy of the transfer and whether it constitutes a potential threat to the organization's security posture.
  ### Investigation Steps
  - Review the BITS-related logs in your EDR solution to get detailed information about the transfer job, including the source URL, job status, and the user context under which the job was created.
  - Assess the command-line parameters of the process that triggered the BITS event to identify any abnormal flags or unusual paths that may indicate malicious intent.
  - Investigate the network traffic through your NGFW or NDR systems to determine if the source URL of the downloaded file is associated with known bad actors or suspicious domains.
  - Check for any recent user activity or account anomalies in your identity and access management system to see if there are indicators of unauthorized access or account compromise.
