title: BITS Transfer Job With Uncommon Or Suspicious Remote TLD
id: 6d44fb93-e7d2-475c-9d3d-54c9c1e33427
status: test
description: Detects a suspicious download using the BITS client from a FQDN that
  is unusual. Adversaries may abuse BITS jobs to persistently execute or clean up
  after malicious payloads.
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1197/T1197.md
- https://twitter.com/malmoeb/status/1535142803075960832
author: Florian Roth (Nextron Systems)
date: 2022-06-10
modified: 2024-12-25
tags:
- attack.defense-evasion
- attack.persistence
- attack.t1197
logsource:
  product: windows
  service: bits-client
detection:
  selection:
    EventID: 16403
  filter_main_generic:
    RemoteName|contains:
    - '.azureedge.net/'
    - '.com/'
    - '.sfx.ms/'
    - 'download.mozilla.org/'         # https://download.mozilla.org/?product=firefox-101.0.1-partial-101.0&amp;os=win64&amp;lang=en-US
    - 'cdn.onenote.net/'
    - 'cdn.office.net/'
  condition: selection and not 1 of filter_main_*
falsepositives:
- This rule doesn't exclude other known TLDs such as ".org" or ".net". It's recommended
  to apply additional filters for software and scripts that leverage the BITS service
level: medium
notes: |
  ### Technical Context
  This detection rule identifies suspicious downloads initiated by the Background Intelligent Transfer Service (BITS) on Windows systems. BITS is a Microsoft service that facilitates the transfer of files in the background, commonly used for software updates and other legitimate activities. However, adversaries may exploit this service to persistently execute malicious payloads or to remove traces of their actions. The rule focuses on monitoring EventID 16403, which indicates a BITS transfer job creation. It further filters out common known safe remote domains (like Microsoft and Mozilla domains) to highlight those that are unusual or uncommon. This filtering helps in detecting potential misuse of the BITS service by focusing on transfers from rare top-level domains (TLDs) that may indicate nefarious activity.
  ### Investigation Steps
  - Review the BITS transfer job details in the Event Viewer to gather context about the suspicious download, including the source and target paths of the files.
  - Utilize the EDR tool to analyze the associated process creation logs, command-line parameters, and parent-child process relationships to determine if the BITS job is linked to any malicious activity.
  - Examine network traffic logs from the NGFW or NDR to check for connections to the identified suspicious remote TLDs during the timeframe of the alert.
  - Cross-reference the cloud platform logs (if applicable) to assess any related activities or configurations that may suggest unauthorized access or data exfiltration attempts.
