title: BITS Transfer Job Download From Direct IP
id: 90f138c1-f578-4ac3-8c49-eecfd847c8b7
related:
- id: 99c840f2-2012-46fd-9141-c761987550ef
  type: similar
status: test
description: Detects a BITS transfer job downloading file(s) from a direct IP address.
references:
- https://blog.netspi.com/15-ways-to-download-a-file/#bitsadmin
- https://isc.sans.edu/diary/22264
- https://lolbas-project.github.io/lolbas/Binaries/Bitsadmin/
- https://blog.talosintelligence.com/breaking-the-silence-recent-truebot-activity/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023-01-11
modified: 2023-03-27
tags:
- attack.defense-evasion
- attack.persistence
- attack.t1197
logsource:
  product: windows
  service: bits-client
detection:
  selection:
    EventID: 16403
    RemoteName|contains:
    - 'http://1'
    - 'http://2'
    - 'http://3'
    - 'http://4'
    - 'http://5'
    - 'http://6'
    - 'http://7'
    - 'http://8'
    - 'http://9'
    - 'https://1'
    - 'https://2'
    - 'https://3'
    - 'https://4'
    - 'https://5'
    - 'https://6'
    - 'https://7'
    - 'https://8'
    - 'https://9'
  filter_optional_local_networks:
    RemoteName|contains:
    - '://10.'         # 10.0.0.0/8
    - '://192.168.'         # 192.168.0.0/16
    - '://172.16.'         # 172.16.0.0/12
    - '://172.17.'
    - '://172.18.'
    - '://172.19.'
    - '://172.20.'
    - '://172.21.'
    - '://172.22.'
    - '://172.23.'
    - '://172.24.'
    - '://172.25.'
    - '://172.26.'
    - '://172.27.'
    - '://172.28.'
    - '://172.29.'
    - '://172.30.'
    - '://172.31.'
    - '://127.'         # 127.0.0.0/8
    - '://169.254.'         # 169.254.0.0/16
  filter_optional_seven_zip:
    RemoteName|contains:
            # For https://7-zip.org/
    - 'https://7-'
    - 'http://7-'
  condition: selection and not 1 of filter_optional_*
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This Sigma rule identifies the use of Background Intelligent Transfer Service (BITS) to download files from direct IP addresses. BITS is commonly exploited by threat actors to evade detection while transferring malicious files, as it operates in the background and can utilize HTTP or HTTPS protocols. The rule looks for Event ID 16403, which indicates a completed BITS transfer job. The detection is focused on remote URLs that contain specific patterns leading with 'http://' or 'https://' and checking to ensure these requests are not routed through common local IP ranges. Additionally, to further minimize false positives, the rule filters out requests made to known 7-Zip-related domains. This makes it vital to investigate any occurrences flagged by this rule, as they may signify potentially harmful activity.
  ### Investigation Steps
  - Utilize EDR tools to review the process tree and determine if the detected BITS transfer was initiated by a legitimate application or a suspicious process.
  - Analyze the associated network traffic logs to verify the destination IP addresses and whether they exhibit any known malicious behavior or reputation issues.
  - Examine the system's command-line parameters during the event time to capture any additional context regarding how the BITS transfer was initiated.
  - Query firewall and proxy logs for any outbound connections made to the identified IP addresses to assess if subsequent malicious activity occurred.
