title: BITS Transfer Job Downloading File Potential Suspicious Extension
id: b85e5894-9b19-4d86-8c87-a2f3b81f0521
status: test
description: Detects new BITS transfer job saving local files with potential suspicious
  extensions
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1197/T1197.md
author: frack113
date: 2022-03-01
modified: 2023-03-27
tags:
- attack.defense-evasion
- attack.persistence
- attack.t1197
logsource:
  product: windows
  service: bits-client
detection:
  selection:
    EventID: 16403
    LocalName|endswith:
            # TODO: Extend this list with more interesting file extensions
    - '.bat'
    - '.dll'
    - '.exe'         # TODO: Might wanna comment this if it generates tons of FPs
    - '.hta'
    - '.ps1'
    - '.psd1'
    - '.sh'
    - '.vbe'
    - '.vbs'
  filter_optional_generic:
        # Typical updates: Chrome, Dropbox etc.
    LocalName|contains: '\AppData\'
    RemoteName|contains: '.com'
  condition: selection and not 1 of filter_optional_*
falsepositives:
- While the file extensions in question can be suspicious at times. It's best to add
  filters according to your environment to avoid large amount false positives
level: medium
notes: |
  ### Technical Context
  This Sigma rule detects potentially suspicious BITS (Background Intelligent Transfer Service) transfer jobs on Windows systems that are saving local files with specific extensions that may indicate malicious activity, such as `.bat`, `.dll`, `.exe`, `.hta`, `.ps1`, `.psd1`, `.sh`, `.vbe`, and `.vbs`. The rule focuses on Event ID 16403, which logs the initiation of a BITS transfer that saves a file to a local path that typically resides in the user’s AppData directory, suggesting that it could be a covert operation. Additionally, the rule incorporates generic filters to exclude legitimate transfer activities, notably those involving common applications such as Chrome and Dropbox, by emphasizing remote file names containing '.com'. By monitoring these events, the SOC can identify potential file downloads that deviate from normal operations and warrant further investigation.
  ### Investigation Steps
  - Review the details of the detected BITS transfer job in the EDR console, focusing on the process involved, user account, and time of the event to determine its legitimacy. 
  - Check the application logs for any associated processes that initiated the BITS transfer, ensuring to look for any unusual application behavior or known malicious signatures.
  - Analyze the file characteristics of the downloaded files, including both file path and hash values, by querying the antivirus solution to see if any of them are flagged as malicious.
  - Investigate proxy logs for any related outbound connections to determine if the remote server or domain associated with the BITS job is linked to known threats or anomalies.
