title: New BITS Job Created Via PowerShell
id: fe3a2d49-f255-4d10-935c-bda7391108eb
status: test
description: Detects the creation of a new bits job by PowerShell
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1197/T1197.md
author: frack113
date: 2022-03-01
modified: 2023-03-27
tags:
- attack.defense-evasion
- attack.persistence
- attack.t1197
logsource:
  product: windows
  service: bits-client
detection:
  selection:
    EventID: 3
    processPath|endswith:
    - '\powershell.exe'
    - '\pwsh.exe'
  condition: selection
falsepositives:
- Administrator PowerShell scripts
level: low
notes: |
  ### Technical Context
  This detection rule identifies the creation of a new Background Intelligent Transfer Service (BITS) job through PowerShell commands. BITS is often exploited by adversaries for stealthy data exfiltration or lateral movement within a network. The rule specifically looks for Windows Event ID 3, which indicates that a new BITS job has been created. It also monitors commands executed via PowerShell (either `powershell.exe` or the cross-platform `pwsh.exe`) to catch potentially malicious activities. PowerShell is a common tool in the attacker’s arsenal due to its powerful scripting capabilities, which can be easily leveraged for malicious purposes if not monitored carefully. 
  ### Investigation Steps
  - Review the EDR logs for any recent PowerShell command executions that correspond to Event ID 3, focusing on the command-line parameters used to create BITS jobs.
  - Investigate the user account associated with the PowerShell execution to determine if it is a standard user or an administrative account and check its recent activities for signs of compromise.
  - Correlate the timestamps of the BITS job creation with any logs from the SIEM related to network traffic, examining for any unusual outbound connections or data transfers.
  - Check the AV logs for any alerts triggered during the time frame of the suspicious PowerShell execution to see if any associated malicious activity has been detected.
