title: BITS Transfer Job Download From File Sharing Domains
id: d635249d-86b5-4dad-a8c7-d7272b788586
status: experimental
description: Detects BITS transfer job downloading files from a file sharing domain.
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1197/T1197.md
- https://twitter.com/malmoeb/status/1535142803075960832
- https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/ransomware-hive-conti-avoslocker
- https://www.microsoft.com/en-us/security/blog/2024/01/17/new-ttps-observed-in-mint-sandstorm-campaign-targeting-high-profile-individuals-at-universities-and-research-orgs/
author: Florian Roth (Nextron Systems)
date: 2022-06-28
modified: 2024-10-21
tags:
- attack.defense-evasion
- attack.persistence
- attack.t1197
logsource:
  product: windows
  service: bits-client
detection:
  selection:
    EventID: 16403
    RemoteName|contains:
    - '.githubusercontent.com'               # Includes both gists and github repositories / Michael Haag (idea)
    - 'anonfiles.com'
    - 'cdn.discordapp.com'
    - 'ddns.net'
    - 'dl.dropboxusercontent.com'
    - 'ghostbin.co'
    - 'glitch.me'
    - 'gofile.io'
    - 'hastebin.com'
    - 'mediafire.com'
    - 'mega.nz'
    - 'onrender.com'
    - 'pages.dev'
    - 'paste.ee'
    - 'pastebin.com'
    - 'pastebin.pl'
    - 'pastetext.net'
    - 'pixeldrain.com'
    - 'privatlab.com'
    - 'privatlab.net'
    - 'send.exploit.in'
    - 'sendspace.com'
    - 'storage.googleapis.com'
    - 'storjshare.io'
    - 'supabase.co'
    - 'temp.sh'
    - 'transfer.sh'
    - 'trycloudflare.com'
    - 'ufile.io'
    - 'w3spaces.com'
    - 'workers.dev'
  condition: selection
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This detection rule targets the use of Background Intelligent Transfer Service (BITS) on Windows systems to identify potentially malicious downloads originating from file sharing domains. BITS typically facilitates the transfer of files in the background while minimizing network impact. However, threat actors may misuse this service to download malicious payloads from publicly accessible or suspicious domains. The rule specifically looks for Event ID 16403, which indicates that a BITS transfer job is downloading from designated domains known for file sharing. Analyzing RemoteName values in these events can help identify harmful activities related to file downloading that may be part of a broader attack strategy.
  The rule relies on detailed logs generated by the BITS client, which capture specific transfer activities. Anomalous downloads from domains recognized for hosting file sharing services can signify an ongoing compromise or an attempt to exfiltrate sensitive information. By monitoring these activities, SOC analysts can proactively investigate and respond to potentially harmful behaviors in the enterprise environment.
  ### Investigation Steps
  - Analyze the specific BITS transfer job by querying the endpoint's BITS client logs to identify the downloaded file's origin and the timestamp of the download.
  - Use EDR tools to check for any associated processes that ran during the download event, looking for signs of malware execution or suspicious behavior.
  - Review network logs from the NGFW or NDR to trace the connections made to file sharing domains, identifying any additional malicious activity linked to those domains.
  - Investigate endpoint security alerts and incidents in the AV solution to determine if the downloaded file has been flagged as malicious based on its behavior or characteristics.
