title: Active Directory Certificate Services Denied Certificate Enrollment Request
id: 994bfd6d-0a2e-481e-a861-934069fcf5f5
status: test
description: |
  Detects denied requests by Active Directory Certificate Services.
  Example of these requests denial include issues with permissions on the certificate template or invalid signatures.
references:
- https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2008-R2-and-2008/dd299871(v=ws.10)
- https://www.gradenegger.eu/en/details-of-the-event-with-id-53-of-the-source-microsoft-windows-certificationauthority/
author: '@SerkinValery'
date: 2024-03-07
tags:
- attack.credential-access
- attack.t1553.004
logsource:
  product: windows
  service: system
detection:
  selection:
    Provider_Name: 'Microsoft-Windows-CertificationAuthority'
    EventID: 53
  condition: selection
falsepositives:
- Unknown
level: low
notes: |
  ### Technical Context
  This detection rule targets events logged by Active Directory Certificate Services (AD CS), specifically looking for Event ID 53, which indicates denied certificate enrollment requests. Such denials can occur due to permission issues related to the certificate template or invalid signature requests. The underlying data sources for this detection are system logs from Windows servers where AD CS operates, focusing on the events generated by the Certification Authority service. Analysts should be aware that a legitimate certificate request denial might occur during standard operations, but repeated patterns could indicate underlying issues that may require further investigation.
  ### Investigation Steps
  - Review the specific event logs for Event ID 53 within the Windows Event Viewer on the server hosting Active Directory Certificate Services to gather context around the denied requests.
  - Analyze the permissions associated with the certificate template in question to ensure that appropriate access controls are configured and verify whether the requester has the required privileges.
  - Check for any related alerts or anomalies in EDR systems that might indicate a broader security issue, such as unauthorized attempts to enroll certificates.
  - Conduct a review of user activity logs in your SIEM to identify the user or system making the denied request to assess potential misuse or misconfiguration.
