title: Mimikatz Use
id: 06d71506-7beb-4f22-8888-e2e5e2ca7fd8
status: test
description: This method detects mimikatz keywords in different Eventlogs (some of
  them only appear in older Mimikatz version that are however still used by different
  threat groups)
references:
- https://tools.thehacker.recipes/mimikatz/modules
author: Florian Roth (Nextron Systems), David ANDRE (additional keywords)
date: 2017-01-10
modified: 2022-01-05
tags:
- attack.s0002
- attack.lateral-movement
- attack.credential-access
- car.2013-07-001
- car.2019-04-004
- attack.t1003.002
- attack.t1003.004
- attack.t1003.001
- attack.t1003.006
logsource:
  product: windows
detection:
  keywords:
  - 'dpapi::masterkey'
  - 'eo.oe.kiwi'
  - 'event::clear'
  - 'event::drop'
  - 'gentilkiwi.com'
  - 'kerberos::golden'
  - 'kerberos::ptc'
  - 'kerberos::ptt'
  - 'kerberos::tgt'
  - 'Kiwi Legit Printer'
  - 'lsadump::'
  - 'mimidrv.sys'
  - '\mimilib.dll'
  - 'misc::printnightmare'
  - 'misc::shadowcopies'
  - 'misc::skeleton'
  - 'privilege::backup'
  - 'privilege::debug'
  - 'privilege::driver'
  - 'sekurlsa::'
  filter:
    EventID: 15      # Sysmon's FileStream Events (could cause false positives when Sigma rules get copied on/to a system)
  condition: keywords and not filter
falsepositives:
- Naughty administrators
- AV Signature updates
- Files with Mimikatz in their filename
level: high
notes: |
  ### Technical Context
  This detection rule focuses on identifying the use of Mimikatz, a well-known credential dumping tool frequently employed by attackers to steal sensitive authentication information such as passwords and Kerberos tickets. The rule scans Windows Event Logs for specific keywords associated with Mimikatz operations and its components, including command-line parameters that may indicate malicious activities. Key indicators such as `dpapi::masterkey`, `sekurlsa::`, and other terms tied to privilege escalation and credential access are monitored. The rule also integrates a filter to exclude less relevant events, specifically Sysmon's FileStream Events (EventID 15), which helps minimize false positives. This comprehensive detection aims to highlight potential lateral movement and credential theft activities occurring within the enterprise environment.
  ### Investigation Steps
  - Use EDR to search for any processes executing Mimikatz binaries or commands related to the detected keywords, focusing on their parent processes.
  - Correlate any suspicious activity with user account logs in Active Directory to determine if there were unauthorized access attempts or lateral movements.
  - Analyze network traffic using NDR tools for unusual outbound connections from affected endpoints that may indicate data exfiltration or command and control communication.
  - Review relevant logs from the SIEM, including Proxy and VPN logs, to identify any anomalous access patterns or unusual login locations associated with the user accounts in question.
