title: Potential DLL Injection Via AccCheckConsole
id: 0f6da907-5854-4be6-859a-e9958747b0aa
status: test
description: |
  Detects the execution "AccCheckConsole" a command-line tool for verifying the accessibility implementation of an application's UI.
  One of the tests that this checker can run are called "verification routine", which tests for things like Consistency, Navigation, etc.
  The tool allows a user to provide a DLL that can contain a custom "verification routine". An attacker can build such DLLs and pass it via the CLI, which would then be loaded in the context of the "AccCheckConsole" utility.
references:
- https://gist.github.com/bohops/2444129419c8acf837aedda5f0e7f340
- https://twitter.com/bohops/status/1477717351017680899?s=12
- https://lolbas-project.github.io/lolbas/OtherMSBinaries/AccCheckConsole/
author: Florian Roth (Nextron Systems)
date: 2022-01-06
modified: 2024-08-29
tags:
- attack.execution
- detection.threat-hunting
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: '\AccCheckConsole.exe'
  - OriginalFileName: 'AccCheckConsole.exe'
  selection_cli:
    CommandLine|contains:
    - ' -hwnd'
    - ' -process '
    - ' -window '
  condition: all of selection_*
falsepositives:
- Legitimate use of the UI Accessibility Checker
level: medium
notes: |
  ### Technical Context
  This Sigma rule is designed to detect potentially malicious behavior initiated via the "AccCheckConsole.exe" utility, a command-line tool used for validating the accessibility features of applications. It operates by allowing users to execute custom verification routines through dynamically loaded DLLs, which can be leveraged by attackers to inject malicious code. The rule specifically looks for process creation events where "AccCheckConsole.exe" is invoked with certain command-line arguments, indicating potential misuse of this tool. The technical data sources involved include process creation logs and command-line parameters, particularly focusing on the presence of arguments such as `-hwnd`, `-process`, and `-window` that suggest the execution of a verification routine which may be used maliciously.
  ### Investigation Steps
  - Review the alerts triggered by the detection rule in your SIEM for instances of "AccCheckConsole.exe" execution, noting the associated command-line parameters. 
  - Use your EDR tool to investigate the context of the process execution, including parent-child process relationships, user accounts involved, and any associated network activity.
  - Check the process creation logs to identify any unusual patterns or similar executions that may indicate an ongoing attack or subsequent malicious activity.
  - Cross-reference the DLLs loaded during the "AccCheckConsole.exe" execution with your organization's known good software inventory to determine if any unauthorized or suspicious DLLs were injected.
