title: Compress Data and Lock With Password for Exfiltration With 7-ZIP
id: 9fbf5927-5261-4284-a71d-f681029ea574
status: test
description: An adversary may compress or encrypt data that is collected prior to
  exfiltration using 3rd party utilities
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1560.001/T1560.001.md
author: frack113
date: 2021-07-27
modified: 2023-03-13
tags:
- attack.collection
- attack.t1560.001
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Description|contains: '7-Zip'
  - Image|endswith:
    - '\7z.exe'
    - '\7zr.exe'
    - '\7za.exe'
  - OriginalFileName:
    - '7z.exe'
    - '7za.exe'
  selection_password:
    CommandLine|contains: ' -p'
  selection_action:
    CommandLine|contains:
    - ' a '
    - ' u '
  condition: all of selection_*
falsepositives:
- Legitimate activity is expected since compressing files with a password is common.
level: medium
notes: |
  ### Technical Context
  This Sigma rule detects potential data exfiltration activities that involve compressing and encrypting files using 7-Zip, a third-party file utility. Adversaries may leverage such tools to compress sensitive data into encrypted archives prior to transferring it outside the organization’s network. The rule specifically looks for process creation events that involve the execution of 7-Zip-related binaries (i.e., `7z.exe`, `7zr.exe`, and `7za.exe`) along with specific command-line parameters. Key indicators for the detection include the presence of the '-p' flag, which signifies a password is being used, as well as commands like 'a' (add) or 'u' (update), indicating an archive operation.
  ### Investigation Steps
  - Review relevant EDR logs to identify any instances of 7-Zip process execution, focusing on the timestamps, user accounts, and machine names to understand the context of the activity.
  - Check command-line parameters associated with the detected processes to confirm whether password protection and archiving operations were performed on sensitive directories or file types, especially those containing confidential data.
  - Analyze network traffic with the NDR tool to look for unusual outbound connections that may correlate with the timing of the 7-Zip usage, particularly to external IP addresses or cloud storage services.
  - Examine logs from cloud platforms (AWS, GCP, Azure) to verify if there were any imports or uploads of the compressed files, indicating potential exfiltration attempts following the identified compression activity.
