title: Vulnerable Netlogon Secure Channel Connection Allowed
id: a0cb7110-edf0-47a4-9177-541a4083128a
status: test
description: Detects that a vulnerable Netlogon secure channel connection was allowed,
  which could be an indicator of CVE-2020-1472.
references:
- https://support.microsoft.com/en-us/help/4557222/how-to-manage-the-changes-in-netlogon-secure-channel-connections-assoc
author: NVISO
date: 2020-09-15
modified: 2022-12-25
tags:
- attack.privilege-escalation
- attack.t1548
logsource:
  product: windows
  service: system
detection:
  selection:
    Provider_Name: NetLogon      # Active Directory: NetLogon ETW GUID {F33959B4-DBEC-11D2-895B-00C04F79AB69}
    EventID: 5829
  condition: selection
falsepositives:
- Unknown
fields:
- SAMAccountName
level: high
notes: |
  ### Technical Context
  This detection rule aims to identify potentially vulnerable connections related to the Netlogon secure channel protocol, specifically targeting vulnerability CVE-2020-1472. The rule detects when a Netlogon secure channel connection is established and logs events meeting certain criteria, namely, Event ID 5829 from Windows systems. This event indicates that a connection was allowed despite it being recognized as insecure. By monitoring these events, incident responders can ascertain whether unauthorized activities leveraging the vulnerability may be occurring within the Active Directory environment. The primary data sources utilized for this rule are Windows Event logs, particularly focusing on NetLogon events, allowing for real-time monitoring and proactive defense against privilege escalation attacks.
  ### Investigation Steps
  - Utilize the EDR tool to review the process history of systems generating Event ID 5829, focusing on abnormal patterns or unauthorized access attempts.
  - Check the Windows Event Logs for additional security-related events leading up to the occurrence of the detected Event ID, which may reveal the context of the connection.
  - Analyze network logs from the NGFW or NDR to identify any unusual traffic patterns or communications from the identified systems around the time of the event.
  - Cross-reference the SAMAccountName field in the event logs with user account status and privilege levels to determine if any compromised accounts are involved in the detected connections.
