title: Deployment AppX Package Was Blocked By AppLocker
id: 6ae53108-c3a0-4bee-8f45-c7591a2c337f
status: test
description: Detects an appx package deployment that was blocked by AppLocker policy
references:
- https://learn.microsoft.com/en-us/windows/win32/appxpkg/troubleshooting
- https://github.com/nasbench/EVTX-ETW-Resources/blob/7a806a148b3d9d381193d4a80356016e6e8b1ee8/ETWEventsList/CSV/Windows11/22H2/W11_22H2_Pro_20220920_22621.382/Providers/Microsoft-Windows-AppXDeployment-Server.csv
author: frack113
date: 2023-01-11
tags:
- attack.defense-evasion
logsource:
  product: windows
  service: appxdeployment-server
detection:
  selection:
    EventID: 412
  condition: selection
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  This Sigma rule is designed to detect instances where an AppX package deployment was blocked by AppLocker policies on Windows systems. AppLocker is a feature that restricts which applications and files users can run, based on file attributes, and when an AppX deployment attempt fails due to non-compliance with these policies, an Event ID 412 is generated. The rule specifically monitors logs coming from the AppX Deployment Server, which provides detailed information regarding application package installations and any barriers encountered in their deployment. By analyzing these events, security teams can uncover potential unauthorized attempts to execute or deploy applications that could undermine system integrity or security.
  ### Investigation Steps
  - Review the EDR logs for related Event ID 412 to gather specific details on the blocked AppX package deployment attempt, including user context and timestamp.
  - Cross-reference the blocked package's name and hash with known threat intelligence sources to identify whether it has been flagged as malicious.
  - Investigate the associated user account in your IAM logs to determine if there have been other unusual activities or policy violations that could indicate account compromise.
  - Check the AppLocker policy configuration to ensure it aligns with organizational security standards, updating or refining rules as necessary based on the findings of the investigation.
