title: Scheduled Task Executed From A Suspicious Location
id: 424273ea-7cf8-43a6-b712-375f925e481f
status: test
description: Detects the execution of Scheduled Tasks where the Program being run
  is located in a suspicious location or it's an unusale program to be run from a
  Scheduled Task
references:
- Internal Research
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-12-05
modified: 2023-02-07
tags:
- attack.persistence
- attack.t1053.005
logsource:
  product: windows
  service: taskscheduler
  definition: 'Requirements: The "Microsoft-Windows-TaskScheduler/Operational" is
    disabled by default and needs to be enabled in order for this detection to trigger'
detection:
  selection:
    EventID: 129     # Created Task Process
    Path|contains:
    - 'C:\Windows\Temp\'
    - '\AppData\Local\Temp\'
    - '\Desktop\'
    - '\Downloads\'
    - '\Users\Public\'
    - 'C:\Temp\'
    # If you experience FP. Uncomment the filter below and add the specific TaskName with the Program to it
    # filter:
    #     TaskName: '\Exact\Task\Name'
    #     Path: 'Exact\Path'
  condition: selection
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  This detection rule is designed to identify potentially malicious activity involving scheduled tasks in Windows environments. It specifically looks for processes created through the Windows Task Scheduler that originate from suspicious locations, such as temporary folders, the Desktop, or shared user directories—directories that are often exploited by attackers. These locations are not typical for legitimate scheduled tasks, thus raising suspicion about the program being executed. The rule relies on logs generated by the Task Scheduler, particularly Event ID 129, which documents the creation of tasks. To be effective, the "Microsoft-Windows-TaskScheduler/Operational" log must be enabled, as it captures the necessary event data to trigger this detection.
  ### Investigation Steps
  - Review EDR logs for the specific Task Scheduler Event ID 129 to identify the details of the scheduled task, including its execution time and associated user account.
  - Examine the command-line parameters and execution path of the scheduled task using the EDR console to determine if the location or program name raises any flags.
  - Check endpoint AV and malware logs to see if the program being executed has been previously flagged as suspicious or malicious.
  - Analyze network traffic through NDR or Proxy logs to determine if the task correlates with any external communications that could indicate further compromise or data exfiltration.
