title: Scheduled Task Executed Uncommon LOLBIN
id: f0767f15-0fb3-44b9-851e-e8d9a6d0005d
status: test
description: Detects the execution of Scheduled Tasks where the program being run
  is located in a suspicious location or where it is an unusual program to be run
  from a Scheduled Task
references:
- Internal Research
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-12-05
modified: 2023-02-07
tags:
- attack.persistence
- attack.t1053.005
logsource:
  product: windows
  service: taskscheduler
  definition: 'Requirements: The "Microsoft-Windows-TaskScheduler/Operational" is
    disabled by default and needs to be enabled in order for this detection to trigger'
detection:
  selection:
    EventID: 129     # Created Task Process
    Path|endswith:
    - '\calc.exe'
    - '\cscript.exe'
    - '\mshta.exe'
    - '\mspaint.exe'
    - '\notepad.exe'
    - '\regsvr32.exe'
            # - '\rundll32.exe'
    - '\wscript.exe'
    # filter_system:
    #     Path|endswith: '\rundll32.exe'
    #     TaskName|startswith: '\Microsoft\Windows\'
    # condition: selection and not 1 of filter_*
  condition: selection
falsepositives:
- False positives may occur with some of the selected binaries if you have tasks using
  them (which could be very common in your environment). Exclude all the specific
  trusted tasks before using this rule
level: medium
notes: |
  ### Technical Context
  This detection rule identifies unusual executions of scheduled tasks in a Windows environment, specifically targeting instances where these tasks run binaries that are often used as living-off-the-land (LOLBIN) techniques by attackers. The rule is designed to log instances when certain executables, such as `calc.exe`, `notepad.exe`, or `mshta.exe`, are executed through the Task Scheduler from non-standard or suspicious paths. The data sources leveraged for this rule are the Task Scheduler event logs, particularly focusing on Event ID 129, which indicates a task creation or modification. To utilize this rule effectively, users must ensure that the "Microsoft-Windows-TaskScheduler/Operational" log is enabled, as it is disabled by default in Windows systems.
  ### Investigation Steps
  - Start by reviewing the Task Scheduler logs within the EDR tool to identify the specific tasks that triggered the alert, paying close attention to their names and execution paths.
  - Verify the paths from which the binaries were executed to determine if they are considered suspicious, and cross-reference these paths with known good locations in your environment.
  - Investigate the context of the scheduled tasks by checking creation dates and associated user accounts to identify any anomalies or unauthorized changes.
  - Check for any outgoing connection attempts or unusual behaviors associated with the identified binaries using network logs from the NDR or firewall, particularly for signs of data exfiltration or lateral movement.
