title: Potential RDP Exploit CVE-2019-0708
id: aaa5b30d-f418-420b-83a0-299cb6024885
status: test
description: Detect suspicious error on protocol RDP, potential CVE-2019-0708
references:
- https://web.archive.org/web/20190710034152/https://github.com/zerosum0x0/CVE-2019-0708
- https://github.com/Ekultek/BlueKeep
author: 'Lionel PRAT, Christophe BROCAS, @atc_project (improvements)'
date: 2019-05-24
modified: 2022-12-25
tags:
- attack.lateral-movement
- attack.t1210
- car.2013-07-002
logsource:
  product: windows
  service: system
detection:
  selection:
    EventID:
    - 56
    - 50
    Provider_Name: TermDD
  condition: selection
falsepositives:
- Bad connections or network interruptions
# too many false positives
level: medium
notes: |
  ### Technical Context
  This Sigma rule is designed to detect potential exploitation attempts of the CVE-2019-0708 vulnerability, also known as BlueKeep. The vulnerability allows for unauthenticated remote code execution via the Remote Desktop Protocol (RDP) on specific versions of Windows. The rule focuses on Windows system event logs, particularly Event IDs 56 and 50 from the "TermDD" event provider. Event ID 56 indicates a successful connection to the RDP service, while Event ID 50 may reveal problematic session terminations, which can imply exploitation attempts. By identifying these events, the rule assists in highlighting suspicious activities that may indicate lateral movement within the network using this critical vulnerability.
  ### Investigation Steps
  - Analyze the detected Event ID 56 and 50 logs in your EDR for any unusual connection patterns or session terminations that lack a valid user context.
  - Cross-reference the IP addresses associated with the RDP connections using your proxy logs to determine if the connections originated from internal sources.
  - Review related network traffic with your NDR tool to identify any anomalies, such as unusual port scanning or excessive connection attempts to RDP ports (TCP 3389).
  - Check the status of Windows updates on affected systems to ensure that they are patched against CVE-2019-0708, and conduct a review of recent security alerts or incidents related to RDP usage.
