title: F5 BIG-IP iControl Rest API Command Execution - Proxy
id: b59c98c6-95e8-4d65-93ee-f594dfb96b17
related:
- id: 85254a62-22be-4239-b79c-2ec17e566c37
  type: similar
status: test
description: Detects POST requests to the F5 BIG-IP iControl Rest API "bash" endpoint,
  which allows the execution of commands on the BIG-IP
references:
- https://f5-sdk.readthedocs.io/en/latest/apidoc/f5.bigip.tm.util.html#module-f5.bigip.tm.util.bash
- https://community.f5.com/t5/technical-forum/icontrolrest-11-5-execute-bash-command/td-p/203029
- https://community.f5.com/t5/technical-forum/running-bash-commands-via-rest-api/td-p/272516
author: Nasreddine Bencherchali (Nextron Systems), Thurein Oo
date: 2023-11-08
tags:
- attack.initial-access
- attack.t1190
logsource:
  category: proxy
detection:
  selection:
    cs-method: 'POST'
    c-uri|endswith: '/mgmt/tm/util/bash'
  condition: selection
falsepositives:
- Legitimate usage of the BIG IP REST API to execute command for administration purposes
level: medium
notes: |
  ### Technical Context
  This detection rule targets potentially malicious usage of the F5 BIG-IP iControl REST API by monitoring for POST requests directed at the "/mgmt/tm/util/bash" endpoint. This specific API endpoint allows command execution on the BIG-IP device, which could indicate unauthorized or malicious activity if accessed by an attacker. The rule operates by analyzing logs from the proxy, focusing on HTTP methods and URLs. By detecting POST requests to this endpoint, the system can identify attempts to execute arbitrary commands, which might pose a significant security risk if exploited.
  Responders should be aware that while the detection is aimed at unapproved access, there may be legitimate administrative uses of this API for operational purposes. Therefore, distinguishing between malicious and acceptable use is vital during the investigation process.
  ### Investigation Steps
  - Review the proxy logs to identify the source IP addresses making requests to the "/mgmt/tm/util/bash" endpoint, noting any unusual patterns or geographic anomalies.
  - Analyze the payloads of the detected POST requests to determine the commands being executed, which may help to identify potential malicious intent based on the type of command.
  - Examine related EDR logs to correlate the source host's activity with other system events, such as process creation or file modifications, which may indicate lateral movement or further compromise.
  - Check for alerts or reports in the SIEM regarding other suspicious activity associated with the same entity, ensuring comprehensive context around the possible incident.
