title: PwnDrp Access
id: 2b1ee7e4-89b6-4739-b7bb-b811b6607e5e
status: test
description: Detects downloads from PwnDrp web servers developed for red team testing
  and most likely also used for criminal activity
references:
- https://breakdev.org/pwndrop/
author: Florian Roth (Nextron Systems)
date: 2020-04-15
modified: 2021-11-27
tags:
- attack.command-and-control
- attack.t1071.001
- attack.t1102.001
- attack.t1102.003
logsource:
  category: proxy
detection:
  selection:
    c-uri|contains: '/pwndrop/'
  condition: selection
fields:
- ClientIP
- c-uri
- c-useragent
falsepositives:
- Unknown
level: critical
notes: |
  ### Technical Context
  The "PwnDrp Access" detection rule is designed to identify the downloading of malware or payloads from the PwnDrp web servers, which are often used for red teaming and potentially for criminal activities. This rule monitors proxy logs, specifically focusing on any Uniform Resource Identifier (URI) requests that contain the string '/pwndrop/'. Such requests may indicate an attempt to access malicious content that could compromise enterprise systems. Analysts should be aware that while this rule targets a specific threat vector, the PwnDrp toolkit is also commonly leveraged in penetration tests, thus requiring careful interpretation of alerts to avoid false positives.
  ### Investigation Steps
  - Review the proxy logs to identify the specific client IP addresses that initiated requests containing '/pwndrop/'. Correlate this information with known malicious IP addresses for further context.
  - Utilize the EDR tool to analyze the behavior of endpoints associated with the flagged client IPs. Check for any suspicious processes or file downloads that coincide with the proxy log entries.
  - Cross-reference user activity and system events from the involved endpoints. Look for any unusual command-line parameters or execution patterns that could indicate exploitation or lateral movement.
  - Investigate cloud logs (e.g., from AWS or GCP) for any related network activity that may indicate compromised instances or data exfiltration following the access event. This can help understand the scope of potential threats.
