title: PUA - Advanced IP/Port Scanner Update Check
id: 1a9bb21a-1bb5-42d7-aa05-3219c7c8f47d
status: test
description: Detect the update check performed by Advanced IP/Port Scanner utilities.
references:
- https://www.advanced-ip-scanner.com/
- https://www.advanced-port-scanner.com/
author: Axel Olsson
date: 2022-08-14
modified: 2024-02-15
tags:
- attack.discovery
- attack.t1590
logsource:
  category: proxy
detection:
  selection:
      # Example request: http://www.advanced-port-scanner.com/checkupdate.php?lng=en&ver=2-5-3680&beta=n&type=upd&rmode=p&product=aps
      # Example request2: http://www.advanced-ip-scanner.com/checkupdate.php?lng=en&ver=2-5-3499&beta=n&type=upd&rmode=p&product=aips
    c-uri|contains: '/checkupdate.php'
    c-uri-query|contains|all:
    - 'lng='
    - 'ver='
    - 'beta='
    - 'type='
    - 'rmode='
    - 'product='
  condition: selection
falsepositives:
- Expected if you legitimately use the Advanced IP or Port Scanner utilities in your
  environement.
level: medium
notes: |
  ### Technical Context
  This Sigma rule is designed to detect update check requests made by the Advanced IP/Port Scanner utilities. It specifically monitors proxy logs for HTTP requests that include the endpoint `/checkupdate.php`, which is indicative of these applications checking for available updates. The rule looks for specific query parameters within the URI, such as `lng`, `ver`, `beta`, `type`, `rmode`, and `product`, to confirm that the request is indeed related to the update check from these scanning tools. The data sources involved primarily include proxy logs, which capture web traffic and can be indicative of potentially unwanted applications (PUAs) performing actions that could be malicious or benign depending on the context.
  ### Investigation Steps
  - Review the proxy logs to identify instances of requests containing `/checkupdate.php` to confirm if any systems made update checks for the Advanced IP or Port Scanner utilities. 
  - Utilize the EDR tool to examine the processes running on endpoints that generated the alert, looking for any associated processes of Advanced IP/Port Scanner utilities and validating their normal operation.
  - Check for other relevant network traffic patterns to determine if the IP or Port Scanner was used for legitimate administrative purposes, correlating activity with known asset usage in your environment.
  - Communicate with the end-users or IT personnel who may have installed the Advanced IP/Port Scanner utilities to ascertain their intent, ensuring the activity aligns with organizational policies.
