title: Crypto Miner User Agent
id: fa935401-513b-467b-81f4-f9e77aa0dd78
status: test
description: Detects suspicious user agent strings used by crypto miners in proxy
  logs
references:
- https://github.com/xmrig/xmrig/blob/da22b3e6c45825f3ac1f208255126cb8585cd4fc/src/base/kernel/Platform_win.cpp#L65
- https://github.com/xmrig/xmrig/blob/427b6516e0550200c17ca28675118f0fffcc323f/src/version.h
author: Florian Roth (Nextron Systems)
date: 2019-10-21
modified: 2021-11-27
tags:
- attack.command-and-control
- attack.t1071.001
logsource:
  category: proxy
detection:
  selection:
    c-useragent|startswith:
        # XMRig
    - 'XMRig '
        # CCMiner
    - 'ccminer'
  condition: selection
fields:
- ClientIP
- c-uri
- c-useragent
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  The "Crypto Miner User Agent" detection rule identifies malicious user-agent strings commonly associated with crypto mining software used in proxy logs. The rule specifically looks for user agents that begin with known identifiers such as "XMRig" and "ccminer," which are associated with popular cryptocurrency mining tools. By monitoring proxies, the rule leverages data sources such as user-agent strings and client IP addresses to flag potential unauthorized mining activity that could indicate a hidden crypto mining operation within the network. This detection serves as a critical indicator that could be tied to broader command-and-control injection strategies often used by threat actors to exploit system resources.
  ### Investigation Steps
  - Review current proxy logs to identify connections from client IPs associated with flagged user-agent strings and analyze the activity patterns for unusual spikes in traffic.
  - Utilize EDR tools to inspect the endpoints corresponding to the flagged client IPs, looking for any running processes or services related to crypto mining software. 
  - Conduct a review of system resource utilization metrics on affected endpoints to detect any unexpected consumption that may suggest active crypto mining processes.
  - Check for external communications or additional command-and-control behaviors linked to the mining activities, correlating findings with other security data such as firewall logs and AV alerts.
