title: Rclone Activity via Proxy
id: 2c03648b-e081-41a5-b9fb-7d854a915091
status: test
description: Detects the use of rclone, a command-line program to manage files on
  cloud storage, via its default user-agent string
references:
- https://rclone.org/
- https://www.kroll.com/en/insights/publications/cyber/new-m365-business-email-compromise-attacks-with-rclone
author: Janantha Marasinghe
date: 2022-10-18
tags:
- attack.exfiltration
- attack.t1567.002
logsource:
  category: proxy
detection:
  selection:
    c-useragent|startswith: 'rclone/v'
  condition: selection
fields:
- c-ip
falsepositives:
- Valid requests with this exact user agent to that is used by legitimate scripts
  or sysadmin operations
level: medium
notes: |
  ### Technical Context
  This Sigma rule detects the use of Rclone—a command-line utility designed for managing files on cloud storage—when it accesses services through a proxy. The rule specifically looks for traffic where the user-agent string begins with "rclone/v," which is a characteristic indicator of Rclone's requests. By monitoring proxy logs for such user-agent patterns, the rule aims to identify potential unauthorized data exfiltration attempts or misuse of the tool within the enterprise environment. Investigators should focus on the context of this activity, considering whether the detected requests align with legitimate operational use cases or indicate potential malicious behavior.
  ### Investigation Steps
  - Review the proxy logs for instances of Rclone user-agent strings and correlate timestamps with known legitimate activities.
  - Utilize EDR tools to identify any associated processes or executables that may have invoked Rclone, including command-line arguments that may indicate unusual behavior.
  - Analyze network traffic patterns to determine if the connections made by Rclone are targeting unusual or unauthorized endpoints.
  - Investigate user accounts and roles involved in the detected activity to ascertain whether the actions align with typical user behavior or business functions.
