title: Raw Paste Service Access
id: 5468045b-4fcc-4d1a-973c-c9c9578edacb
status: test
description: Detects direct access to raw pastes in different paste services often
  used by malware in their second stages to download malicious code in encrypted or
  encoded form
references:
- https://www.virustotal.com/gui/domain/paste.ee/relations
author: Florian Roth (Nextron Systems)
date: 2019-12-05
modified: 2023-01-19
tags:
- attack.command-and-control
- attack.t1071.001
- attack.t1102.001
- attack.t1102.003
- attack.defense-evasion
logsource:
  category: proxy
detection:
  selection:
    c-uri|contains:
    - '.paste.ee/r/'
    - '.pastebin.com/raw/'
    - '.hastebin.com/raw/'
    - '.ghostbin.co/paste/*/raw/'
    - 'pastetext.net/'
    - 'pastebin.pl/'
    - 'paste.ee/'
  condition: selection
falsepositives:
- User activity (e.g. developer that shared and copied code snippets and used the
  raw link instead of just copy & paste)
level: high
notes: |
  ### Technical Context
  The "Raw Paste Service Access" detection rule is designed to identify direct accesses to raw paste services, often exploited by malicious actors during the second stage of an attack to retrieve encoded or encrypted payloads. The rule analyzes logs from proxy services, focusing on URLs that contain specific endpoints associated with popular paste services such as Pastebin, Hastebin, and others. When a user accesses these endpoints directly, it may indicate an attempt to download potentially malicious content, suggesting command-and-control activity or data exfiltration. By monitoring for these behaviors, the rule helps to protect the organization from code injection and other malware activities that leverage these services to bypass conventional defenses.
  ### Investigation Steps
  - Review proxy logs for any entries matching the identified paste service URLs to confirm user access patterns.
  - Cross-reference EDR alerts to identify any processes that initiated connections to these paste services, concentrating on command-line parameters and execution histories.
  - Investigate associated malware signatures in antivirus logs by checking if any alerts correlate with the detected paste service access.
  - Consult cloud logs (e.g., AWS CloudTrail or Azure Monitor) for any actions taken by cloud resources that may involve accessing these paste services, particularly during suspicious time frames.
