title: HTTP Request With Empty User Agent
id: 21e44d78-95e7-421b-a464-ffd8395659c4
status: test
description: |
  Detects a potentially suspicious empty user agent strings in proxy log.
  Could potentially indicate an uncommon request method.
references:
- https://twitter.com/Carlos_Perez/status/883455096645931008
author: Florian Roth (Nextron Systems)
date: 2017-07-08
modified: 2021-11-27
tags:
- attack.defense-evasion
- attack.command-and-control
- attack.t1071.001
logsource:
  category: proxy
detection:
  selection:
      # Empty string - as used by Powershell's (New-Object Net.WebClient).DownloadString
    c-useragent: ''
  condition: selection
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  This Sigma rule is designed to detect HTTP requests that contain an empty User-Agent string in proxy logs. A User-Agent string typically provides information about the browser, operating system, and software making the request. When this string is empty, it may indicate anomalous behavior, as legitimate web clients usually populate this field. Empty User-Agent strings can be associated with certain tools and scripts, particularly those used in penetration testing or malicious actors attempting to evade detection, such as PowerShell scripts using the `New-Object Net.WebClient` class to download data. By monitoring proxy logs for these unusual patterns, security teams can proactively investigate potential command-and-control communications or unauthorized access attempts.
  ### Investigation Steps
  - Review the proxy logs for IP addresses generating empty User-Agent requests to identify potentially suspicious behavior.
  - Utilize EDR tools to examine the process activity on endpoints that initiated requests with empty User-Agent strings for any abnormal processes or command-line arguments.
  - Correlate findings with Threat Intelligence feeds to check if the originating IPs have been reported for malicious activities.
  - Check network traffic logs for any abnormal data exfiltration or connections to known malicious domains from the identified endpoints.
