title: Download From Suspicious TLD - Whitelist
id: b5de2919-b74a-4805-91a7-5049accbaefe
related:
- id: 00d0b5ab-1f55-4120-8e83-487c0a7baf19
  type: similar
status: test
description: Detects executable downloads from suspicious remote systems
references:
- Internal Research
author: Florian Roth (Nextron Systems)
date: 2017-03-13
modified: 2023-05-18
tags:
- attack.initial-access
- attack.t1566
- attack.execution
- attack.t1203
- attack.t1204.002
logsource:
  category: proxy
detection:
  selection:
    c-uri-extension:
    - 'exe'
    - 'vbs'
    - 'bat'
    - 'rar'
    - 'ps1'
    - 'doc'
    - 'docm'
    - 'xls'
    - 'xlsm'
    - 'pptm'
    - 'rtf'
    - 'hta'
    - 'dll'
    - 'ws'
    - 'wsf'
    - 'sct'
    - 'zip'
            # If you want to add more extensions - see https://docs.google.com/spreadsheets/d/1TWS238xacAto-fLKh1n5uTsdijWdCEsGIM0Y0Hvmc5g/
  filter:
    cs-host|endswith:
    - '.com'
    - '.org'
    - '.net'
    - '.edu'
    - '.gov'
    - '.uk'
    - '.ca'
    - '.de'
    - '.jp'
    - '.fr'
    - '.au'
    - '.us'
    - '.ch'
    - '.it'
    - '.nl'
    - '.se'
    - '.no'
    - '.es'
            # Extend this list as needed
  condition: selection and not filter
fields:
- ClientIP
- c-uri
falsepositives:
- All kind of software downloads
level: low
notes: |
  ### Technical Context
  The Sigma rule titled "Download From Suspicious TLD 
  - Whitelist" is designed to identify potentially malicious executable downloads originating from remote systems that do not fall under a predefined list of trusted Top-Level Domains (TLDs). The rule specifically focuses on a variety of file extensions commonly associated with executable and script files—such as '.exe', '.vbs', and '.ps1'—to detect suspicious activity. It relies on proxy log data, examining both the requested URI and the host domain to differentiate between trusted and untrusted sources. Downloads are flagged if the file extensions match the specified list but originate from domains outside of the established whitelist, which includes various TLDs like '.com', '.org', and '.edu'.
  ### Investigation Steps
  - Use your EDR tool to examine any recent process creation events associated with the ClientIP identified in the alert. Check for unexpected or unauthorized executable files launched within the same timeframe. 
  - Investigate the specific URI path from the proxy logs that triggered the alert. Determine if the identified file was accessed or downloaded by legitimate users or processes.
  - Review network activity logs from the firewall or NDR solutions to identify any outbound connections to the suspicious domain. This could help indicate if a successful download took place.
  - Cross-reference with AV or endpoint protection logs to check if the detected file has been flagged or quarantined as malicious. This can provide additional context for the risk associated with the alert.
