title: Bitsadmin to Uncommon IP Server Address
id: 8ccd35a2-1c7c-468b-b568-ac6cdf80eec3
status: test
description: Detects Bitsadmin connections to IP addresses instead of FQDN names
references:
- https://isc.sans.edu/diary/Microsoft+BITS+Used+to+Download+Payloads/21027
author: Florian Roth (Nextron Systems)
date: 2022-06-10
modified: 2022-08-24
tags:
- attack.command-and-control
- attack.t1071.001
- attack.defense-evasion
- attack.persistence
- attack.t1197
- attack.s0190
logsource:
  category: proxy
detection:
  selection:
    c-useragent|startswith: 'Microsoft BITS/'
    cs-host|endswith:
    - '1'
    - '2'
    - '3'
    - '4'
    - '5'
    - '6'
    - '7'
    - '8'
    - '9'
  condition: selection
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  The detection rule titled "Bitsadmin to Uncommon IP Server Address" monitors the use of Microsoft Background Intelligent Transfer Service (BITS), specifically focusing on its connections made directly to numeric IP addresses rather than fully qualified domain names (FQDN). This behavior can indicate malicious activities or compromise, as legitimate BITS usage typically involves connections to known domain names. The rule analyzes logs from a proxy server, filtering for user agents that start with 'Microsoft BITS/' and checking whether the host connections are numeric IPs that end with a digit from 1 to 9. By detecting these types of connections, the rule aims to help security teams identify potential command-and-control (C2) traffic that may signify malware or other unauthorized software operating within the network.
  ### Investigation Steps
  - Review proxy logs for any connections detected by the rule to further assess the context and origin of these requests.
  - Use EDR tools to analyze the involved endpoints for any signs of BITS activity, such as process execution logs or command-line executions associated with the detections.
  - Cross-reference detected IP addresses with threat intelligence databases to determine if they are associated with known malicious activity.
  - Investigate further into any related logs from other sources (e.g., VPN or cloud logs) to identify potential lateral movements or additional indicators of compromise.
