title: HackTool - Empire UserAgent URI Combo
id: b923f7d6-ac89-4a50-a71a-89fb846b4aa8
status: test
description: Detects user agent and URI paths used by empire agents
references:
- https://github.com/BC-SECURITY/Empire
author: Florian Roth (Nextron Systems)
date: 2020-07-13
modified: 2024-02-26
tags:
- attack.defense-evasion
- attack.command-and-control
- attack.t1071.001
logsource:
  category: proxy
detection:
  selection:
    c-useragent: 'Mozilla/5.0 (Windows NT 6.1; WOW64; Trident/7.0; rv:11.0) like Gecko'
    cs-uri:
    - '/admin/get.php'
    - '/news.php'
    - '/login/process.php'
    cs-method: 'POST'
  condition: selection
falsepositives:
- Valid requests with this exact user agent to server scripts of the defined names
level: high
notes: |
  ### Technical Context
  The "HackTool 
  - Empire UserAgent URI Combo" Sigma rule is designed to detect potential command-and-control (C2) activity generated by the Empire framework, an open-source tool commonly used by attackers for post-exploitation tasks. This rule specifically looks for web traffic that originates from a particular user agent string associated with Empire agents, as well as predetermined URI paths that are often exploited in malicious activities. By monitoring proxy logs for requests that utilize the user agent "Mozilla/5.0 (Windows NT 6.1; WOW64; Trident/7.0; rv:11.0) like Gecko" and are directed towards URIs such as "/admin/get.php," "/news.php," or "/login/process.php", the rule helps to identify potentially malicious intent, especially when the HTTP method used is POST. The technical data source involved in this detection is the proxy logs, where outgoing requests and their attributes are logged for analysis.
  ### Investigation Steps
  - Review the proxy logs to identify the source IP address associated with the flagged requests, including the timestamps and user identifiers if available. 
  - Correlate the detected user agent and URI paths with endpoint data from the EDR to determine if there are any related processes or behaviors indicating compromise.
  - Check for any recent changes or anomalies in the target web applications that correspond with the detected activity, paying particular attention to successful logins or access patterns.
  - Utilize your AV and NDR tools to scan the host and network for further signs of the Empire framework or other malicious indicators that could signify a more extensive attack.
