title: Bitsadmin to Uncommon TLD
id: 9eb68894-7476-4cd6-8752-23b51f5883a7
status: test
description: Detects Bitsadmin connections to domains with uncommon TLDs
references:
- https://twitter.com/jhencinski/status/1102695118455349248
- https://isc.sans.edu/forums/diary/Investigating+Microsoft+BITS+Activity/23281/
author: Florian Roth (Nextron Systems), Tim Shelton
date: 2019-03-07
modified: 2023-05-17
tags:
- attack.command-and-control
- attack.t1071.001
- attack.defense-evasion
- attack.persistence
- attack.t1197
- attack.s0190
logsource:
  category: proxy
detection:
  selection:
    c-useragent|startswith: 'Microsoft BITS/'
  falsepositives:
    cs-host|endswith:
    - '.com'
    - '.net'
    - '.org'
    - '.scdn.co'         # spotify streaming
    - '.sfx.ms'         # Microsoft domain, example request: https://oneclient.sfx.ms/PreSignInSettings/Prod/2022-08-15-21-xx-xx/PreSignInSettingsConfig.json
  condition: selection and not falsepositives
fields:
- ClientIP
- c-uri
- c-useragent
falsepositives:
- Rare programs that use Bitsadmin and update from regional TLDs e.g. .uk or .ca
level: high
notes: |
  ### Technical Context
  This Sigma rule detects potentially malicious activity involving the Bitsadmin tool, specifically focusing on its connections to domains with uncommon top-level domains (TLDs). Bitsadmin is a command-line tool used by Microsoft for downloading files and managing BITS (Background Intelligent Transfer Service) jobs. The rule is designed to trigger alerts when the User-Agent string indicates that a connection is established via Bitsadmin and the requested URLs are not ending with commonly seen TLDs like `.com`, `.net`, or `.org`. By monitoring web proxy logs for this specific behavior, the rule helps identify potential command-and-control (C2) communications which may take advantage of Bitsadmin for stealthy data exfiltration or downloading malicious payloads.
  The main data source for this detection rule is proxy logs that capture web traffic and the associated user agents. Key indicators in the logs include the presence of the 'Microsoft BITS/' User-Agent string and the requested URI's TLD. By focusing on these patterns, security operations can better detect unusual or suspicious activity that may align with known adversary tactics.
  ### Investigation Steps
  - Review the proxy logs to identify any connections associated with the detected ClientIP and the specific c-uri that was accessed using Bitsadmin. 
  - Confirm the legitimacy of the detected TLD by cross-referencing it with known benign domains to determine if it poses a heightened risk.
  - Utilize endpoint detection tools to investigate any instances of Bitsadmin on the affected host, assessing the context of its usage and any related processes or network activity.
  - Leverage threat intelligence feeds to correlate the uncommon TLDs with any reported malicious campaigns or known indicators of compromise (IOCs).
