title: Flash Player Update from Suspicious Location
id: 4922a5dd-6743-4fc2-8e81-144374280997
status: test
description: Detects a flashplayer update from an unofficial location
references:
- https://gist.github.com/roycewilliams/a723aaf8a6ac3ba4f817847610935cfb
author: Florian Roth (Nextron Systems)
date: 2017-10-25
modified: 2022-08-08
tags:
- attack.initial-access
- attack.t1189
- attack.execution
- attack.t1204.002
- attack.defense-evasion
- attack.t1036.005
logsource:
  category: proxy
detection:
  selection:
  - c-uri|contains: '/flash_install.php'
  - c-uri|endswith: '/install_flash_player.exe'
  filter:
    cs-host|endswith: '.adobe.com'
  condition: selection and not filter
falsepositives:
- Unknown flash download locations
level: high
notes: |
  ### Technical Context
  The Sigma rule "Flash Player Update from Suspicious Location" is designed to identify potentially malicious attempts to update Adobe Flash Player from unauthorized sources. The detection is centered on traffic captured by proxy logs, specifically looking for requests that contain the URI path `/flash_install.php` or end with `/install_flash_player.exe`. The rule also includes a filter to ensure that requests to legitimate Adobe servers (ending with `.adobe.com`) are excluded from the results. By monitoring these indicators, the rule aims to flag activities that could signify a compromise or an initial access tactic used by attackers to deliver malware through fake software updates.
  ### Investigation Steps
  - Utilize the EDR tool to examine the endpoint associated with the detected proxy log entry, focusing on recent file creations or modifications to identify unauthorized installations.
  - Query your AV solution to check for any detected threats or warnings related to the downloaded file, particularly focusing on the `install_flash_player.exe`.
  - Review proxy logs for additional context around the user's web activity leading up to the alert, looking for patterns associated with phishing or other suspicious downloads.
  - Investigate firewall logs for any outbound connections initiated by the endpoint to known malicious domains or IP addresses associated with unofficial software distributions.
