title: Failed DNS Zone Transfer
id: 6d444368-6da1-43fe-b2fc-44202430480e
status: test
description: Detects when a DNS zone transfer failed.
references:
- https://kb.eventtracker.com/evtpass/evtpages/EventId_6004_Microsoft-Windows-DNS-Server-Service_65410.asp
author: Zach Mathis
date: 2023-05-24
tags:
- attack.reconnaissance
- attack.t1590.002
logsource:
  product: windows
  service: dns-server
detection:
  selection:
    EventID: 6004     # The DNS server received a zone transfer request from %1 for a non-existent or non-authoritative zone %2.
  condition: selection
falsepositives:
- Unlikely
level: medium
notes: |
  ### Technical Context
  The "Failed DNS Zone Transfer" detection rule is designed to identify instances where a DNS server receives a zone transfer request that fails due to non-existence or lack of authority for the requested zone. In this rule, the focus is on Event ID 6004, which is logged by Windows DNS servers when a request for a zone transfer is made from an external entity but does not receive approval for a valid zone. This behavior may indicate reconnaissance efforts by attackers who are attempting to gather information about domain structures and resource records within the network. By monitoring these events, security teams can be alerted to potentially malicious activities that necessitate investigation.
  To effectively utilize this rule, the relevant data source is the Windows DNS server logs, specifically targeting the events that capture zone transfer attempts. Responders should be vigilant about correlating this activity with other logs to determine if it is part of a larger intrusion or reconnaissance campaign.
  ### Investigation Steps
  - Review the DNS server logs for Event ID 6004 to identify the source IP addresses that initiated the zone transfer requests. This data can help determine if the requests are coming from known or trusted entities.
  - Correlate the source IP addresses with firewall and proxy logs to identify any unusual traffic patterns or additional reconnaissance efforts from the same hosts.
  - Analyze the behavior of the entities making the failed requests using EDR tools to check for any prior indicators of compromise or malicious activity linked to those endpoints.
  - Check for similar alerts in the SIEM over a specified time frame to assess whether there is a pattern of failed zone transfer attempts which may indicate a targeted attack.
