title: File With Uncommon Extension Created By An Office Application
id: c7a74c80-ba5a-486e-9974-ab9e682bc5e4
status: test
description: Detects the creation of files with an executable or script extension
  by an Office application.
references:
- https://thedfirreport.com/2021/03/29/sodinokibi-aka-revil-ransomware/
- https://github.com/vadim-hunter/Detection-Ideas-Rules/blob/02bcbfc2bfb8b4da601bb30de0344ae453aa1afe/Threat%20Intelligence/The%20DFIR%20Report/20210329_Sodinokibi_(aka_REvil)_Ransomware.yaml
author: Vadim Khrykov (ThreatIntel), Cyb3rEng (Rule), Nasreddine Bencherchali (Nextron
  Systems)
date: 2021-08-23
modified: 2023-06-22
tags:
- attack.t1204.002
- attack.execution
logsource:
  product: windows
  category: file_event
detection:
    # Note: Please add more file extensions to the logic of your choice.
  selection1:
    Image|endswith:
    - '\excel.exe'
    - '\msaccess.exe'
    - '\mspub.exe'
    - '\powerpnt.exe'
    - '\visio.exe'
    - '\winword.exe'
  selection2:
    TargetFilename|endswith:
    - '.bat'
    - '.cmd'
    - '.com'
    - '.dll'
    - '.exe'
    - '.hta'
    - '.ocx'
    - '.proj'
    - '.ps1'
    - '.scf'
    - '.scr'
    - '.sys'
    - '.vbe'
    - '.vbs'
    - '.wsf'
    - '.wsh'
  filter_optional_webservicecache:   # matches e.g. directory with name *.microsoft.com
    TargetFilename|contains|all:
    - 'C:\Users\'
    - '\AppData\Local\Microsoft\Office\'
    - '\WebServiceCache\AllUsers'
    TargetFilename|endswith: '.com'
  filter_optional_webex:
    Image|endswith: '\winword.exe'
    TargetFilename|contains: '\AppData\Local\Temp\webexdelta\'
    TargetFilename|endswith:
    - '.dll'
    - '.exe'
  filter_main_localassembly:
    TargetFilename|contains: '\AppData\Local\assembly\tmp\'
    TargetFilename|endswith: '.dll'
  condition: all of selection* and not 1 of filter_main_* and not 1 of filter_optional_*
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This Sigma rule is designed to detect the creation of files with uncommon executable or script extensions by Microsoft Office applications such as Word, Excel, or PowerPoint. Under normal circumstances, these applications should not generate files with extensions typically associated with executable code (like '.exe' or '.bat'), which are often associated with malicious activity, including ransomware attacks such as Sodinokibi (REvil). The rule examines logs from Windows environments, focusing on file creation events where the target filename ends with specified executable or script extensions, while also ensuring the source process is one of the identified Office applications. By doing so, the rule aims to highlight potential security incidents where Office applications are misused to create potentially harmful files.
  ### Investigation Steps
  - Review the associated endpoint logs in the EDR to identify the specific Office application that triggered the file creation and the context of its execution.
  - Check the command-line parameters associated with the Office application processes in the EDR logs to uncover any suspicious behavior or automation that could indicate malicious intent.
  - Use AV and NDR tools to analyze the created files' hashes against known malware signatures or suspicious behavior.
  - Query window event logs or User Activity logs in relevant cloud platforms (Azure, GCP) to trace related activities and identify compromised accounts or lateral movement within the organization.
