title: Files With System DLL Name In Unsuspected Locations
id: 13c02350-4177-4e45-ac17-cf7ca628ff5e
status: test
description: |
  Detects the creation of a file with the ".dll" extension that has the name of a System DLL in uncommon or unsuspected locations. (Outisde of "System32", "SysWOW64", etc.).
  It is highly recommended to perform an initial baseline before using this rule in production.
references:
- Internal Research
author: Nasreddine Bencherchali (Nextron Systems)
date: 2024-06-24
tags:
- attack.defense-evasion
- attack.t1036.005
logsource:
  category: file_event
  product: windows
detection:
  selection:
    TargetFilename|endswith:
            # Note: Add more System DLL that can be abused for DLL sideloading to increase coverage
    - '\secur32.dll'
    - '\tdh.dll'
  filter_main_generic:
        # Note: It is recommended to use a more robust filter instead of this generic one, to avoid false negatives.
    TargetFilename|contains:
            # - '\SystemRoot\System32\'
    - 'C:\$WINDOWS.~BT\'
    - 'C:\$WinREAgent\'
    - 'C:\Windows\SoftwareDistribution\'
    - 'C:\Windows\System32\'
    - 'C:\Windows\SysWOW64\'
    - 'C:\Windows\WinSxS\'
    - 'C:\Windows\uus\'
  condition: selection and not 1 of filter_main_*
falsepositives:
- Third party software might bundle specific versions of system DLLs.
# Note: Upgrade to high after an initial baseline to your environement.
level: medium
notes: |
  ### Technical Context
  This detection rule focuses on identifying the creation of DLL files that replicate the names of legitimate system DLLs, such as `secur32.dll` and `tdh.dll`, but are located in unusual directories. Legitimate system DLLs are typically found in directories like "C:\Windows\System32" or "C:\Windows\SysWOW64". By monitoring file events for DLL creations in non-standard locations, the rule aims to detect potential DLL sideloading attacks, where malicious actors may place rogue DLLs to exploit vulnerabilities in legitimate applications. The rule leverages file event logs from Windows systems, particularly targeting the creation of files with a `.dll` extension while ensuring that the event source is limited to paths typically associated with system files, thus reducing the risk of false positives.
  ### Investigation Steps
  - Use EDR to track process creation events around the time the suspicious DLL file was created to establish any correlation with potentially malicious activities.
  - Review application and system logs from your SIEM to identify any unusual software installations or updates that coincide with the creation of the DLL in question.
  - Query file integrity monitoring tools or antivirus logs to check for any detections related to the newly created DLL file and confirm if it was flagged as malicious.
  - Check network logs via your Proxy or NDR tools for any outbound connections that may indicate data exfiltration attempts following the creation of the suspicious DLL file.
