title: Office Macro File Creation
id: 91174a41-dc8f-401b-be89-7bfc140612a0
related:
- id: 0e29e3a7-1ad8-40aa-b691-9f82ecd33d66
  type: similar
status: test
description: Detects the creation of a new office macro files on the systems
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1566.001/T1566.001.md
- https://learn.microsoft.com/en-us/deployoffice/compat/office-file-format-reference
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-01-23
tags:
- attack.initial-access
- attack.t1566.001
logsource:
  category: file_event
  product: windows
detection:
  selection:
    TargetFilename|endswith:
    - '.docm'
    - '.dotm'
    - '.xlsm'
    - '.xltm'
    - '.potm'
    - '.pptm'
  condition: selection
falsepositives:
- Very common in environments that rely heavily on macro documents
level: low
notes: |
  ### Technical Context
  This detection rule identifies the creation of Office macro files, which are commonly used in documents, spreadsheets, and presentations to enable automation and enhanced functionality. Specifically, it targets file formats such as `.docm`, `.dotm`, `.xlsm`, `.xltm`, `.potm`, and `.pptm`. The rule monitors file events generated on Windows systems, focusing on the filenames to detect any new instances of these macro-enabled files. The presence of such files can indicate potential malicious activities, such as phishing attacks, where users are tricked into enabling macros that execute harmful scripts. This rule’s ability to track file creation events is essential for preventing initial access vectors leveraged by attackers.
  ### Investigation Steps
  - Review EDR logs to identify the process that created the macro files, including any executed commands or scripts that may indicate malicious intent.
  - Analyze proxy logs related to the user to see if there was any suspicious download activity related to the macro files, especially from unknown or untrusted sources.
  - Check Windows event logs for any abnormal access patterns or file manipulations in the directories where the macro files were created.
  - Investigate related user activities in the cloud environment (if applicable) to determine if the user is accessing files stored on platforms like OneDrive or SharePoint that might contain these macro files.
