title: VHD Image Download Via Browser
id: 8468111a-ef07-4654-903b-b863a80bbc95
status: test
description: |
  Detects creation of ".vhd"/".vhdx" files by browser processes.
  Malware can use mountable Virtual Hard Disk ".vhd" files to encapsulate payloads and evade security controls.
references:
- https://redcanary.com/blog/intelligence-insights-october-2021/
- https://www.kaspersky.com/blog/lazarus-vhd-ransomware/36559/
- https://securelist.com/lazarus-on-the-hunt-for-big-game/97757/
author: frack113, Christopher Peacock '@securepeacock', SCYTHE '@scythe_io'
date: 2021-10-25
modified: 2023-05-05
tags:
- attack.resource-development
- attack.t1587.001
logsource:
  category: file_event
  product: windows
detection:
  selection:
    Image|endswith:
    - '\brave.exe'
    - '\chrome.exe'
    - '\firefox.exe'
    - '\iexplore.exe'
    - '\maxthon.exe'
    - '\MicrosoftEdge.exe'
    - '\msedge.exe'
    - '\msedgewebview2.exe'
    - '\opera.exe'
    - '\safari.exe'
    - '\seamonkey.exe'
    - '\vivaldi.exe'
    - '\whale.exe'
        # We don't use "endswith" to also match with ADS logs and ".vhdx". Example: "TargetFilename: C:\Users\xxx\Downloads\windows.vhd:Zone.Identifier"
    TargetFilename|contains: '.vhd'
  condition: selection
falsepositives:
- Legitimate downloads of ".vhd" files would also trigger this
level: medium
notes: |
  ### Technical Context
  This Sigma rule is designed to detect the creation of Virtual Hard Disk (VHD) files, which can be used by malicious actors to package and hide payloads, enabling them to evade security mechanisms. It focuses specifically on user-initiated downloads from web browser processes, where these files might be delivered. The rule analyzes file event logs with a specific focus on the filenames ending with `.vhd` or containing the `.vhd` extension. Key data sources used in this detection include process and file creation logs that indicate activity from various web browsers, enabling the identification of potential threats associated with malware that employs these files for persistence or execution. The identified tactic is associated with the MITRE ATT&CK framework under the resource development techniques (T1587.001).
  ### Investigation Steps
  - **Correlate with Process Creation Events:** Review process creation logs from EDR to determine whether suspicious browser processes initiated the VHD file download. Correlate the timestamps of the file creation with active browser sessions.
  - **Examine Network Activity:** Utilize the network logs to identify any related downloads or connections from the specific browser processes, focusing on requests involving VHD files or connections to known malicious hosts.
  - **Check File Integrity and Origin:** Investigate the file properties of the downloaded VHD files, such as digital signatures and creation timestamps, to assess their legitimacy and trace their origin.
  - **Analyze User Behavior:** Look into user accounts that interacted with the web browsers at the time of the download. Determine whether the access aligns with normal user activity or exhibits indicators of compromise.
  ### Prioritization
  The severity level is categorized as medium due to the potential risks that VHD files pose in the context of malware deployment. While not every alert indicates malicious activity, the nature of VHD files as concealment mechanisms warrants further investigation to prevent potential breaches.
  ### Blind spots and Assumptions
  It is possible that legitimate downloads of VHD files may trigger this rule, resulting in false positives. Additionally, the rule may not capture cases where an attacker uses a file extension obfuscation technique or downloads through less common browsers that are not included in the detection criteria. Furthermore, if security controls or software do not monitor file events comprehensively, detections may be missed altogether.
  > **Disclaimer:** This investigation guide was created using generative AI technology and has not been reviewed for its accuracy and relevance. While every effort has been made to ensure its quality, we recommend validating the content and adapting it to suit specific environment and operational needs. Please communicate any changes to the detection engineering team.
