title: Office Macro File Creation From Suspicious Process
id: b1c50487-1967-4315-a026-6491686d860e
status: test
description: Detects the creation of a office macro file from a a suspicious process
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1566.001/T1566.001.md
- https://learn.microsoft.com/en-us/deployoffice/compat/office-file-format-reference
author: frack113, Nasreddine Bencherchali (Nextron Systems)
date: 2022-01-23
modified: 2023-02-22
tags:
- attack.initial-access
- attack.t1566.001
logsource:
  category: file_event
  product: windows
  definition: 'Requirements: The "ParentImage" field is not available by default on
    EID 11 of Sysmon logs. To be able to use this rule to the full extent you need
    to enriche the log with additional ParentImage data'
detection:
  selection_cmd:
  - Image|endswith:
    - '\cscript.exe'
    - '\mshta.exe'
    - '\regsvr32.exe'
    - '\rundll32.exe'
    - '\wscript.exe'
        # Note: ParentImage is a custom field and is not available by default on Sysmon EID 11
  - ParentImage|endswith:
    - '\cscript.exe'
    - '\mshta.exe'
    - '\regsvr32.exe'
    - '\rundll32.exe'
    - '\wscript.exe'
  selection_ext:
    TargetFilename|endswith:
    - '.docm'
    - '.dotm'
    - '.xlsm'
    - '.xltm'
    - '.potm'
    - '.pptm'
  condition: all of selection_*
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This Sigma rule is designed to detect the creation of Office macro files from suspicious processes known for executing malicious scripts. Specifically, it identifies instances where processes like `cscript.exe`, `mshta.exe`, `regsvr32.exe`, `rundll32.exe`, and `wscript.exe` have been used as a parent image to spawn processes that create Office files with macro extensions (e.g., `.docm`, `.xlsm`). The key to this detection lies in correlating process creation logs that include the `ParentImage` field, which requires enrichment since it is not native to Sysmon Event ID 11. When a suspicious parent process generates a macro-enabled document, it could signify potential malicious activity such as phishing or exploitation attempts, making it crucial for SOC analysts to investigate these occurrences promptly.
  ### Investigation Steps
  - Examine EDR logs for the identified suspicious processes and trace their activity. Look for any unusual command-line parameters that could indicate malicious intent.
  - Check file event logs for the creation of Office macro files with the `.docm`, `.xlsm`, or other relevant extensions. Confirm if these files were created within an atypical context or environment.
  - Review the context surrounding the parent processes, including user activity and other recent file creations, to determine if the actions align with typical user behaviors.
  - Utilize threat intelligence to assess if the parent processes or any associated files are known indicators of compromise, and correlate findings with external data sources.
