title: Suspicious Binaries and Scripts in Public Folder
id: b447f7de-1e53-4cbf-bfb4-f1f6d0b04e4e
status: experimental
description: Detects the creation of a file with a suspicious extension in the public
  folder, which could indicate potential malicious activity.
references:
- https://intel.thedfirreport.com/events/view/30032     # Private Report
- https://intel.thedfirreport.com/eventReports/view/70     # Private Report
- https://thedfirreport.com/2025/01/27/cobalt-strike-and-a-pair-of-socks-lead-to-lockbit-ransomware/
author: 'The DFIR Report'
date: 2025-01-23
tags:
- attack.execution
- attack.t1204
logsource:
  category: file_event
  product: windows
detection:
  selection:
    TargetFilename|contains: ':\Users\Public\'
    TargetFilename|endswith:
    - '.bat'
    - '.dll'
    - '.exe'
    - '.hta'
    - '.js'
    - '.ps1'
    - '.vbe'
    - '.vbs'
  condition: selection
falsepositives:
- Administrators deploying legitimate binaries to public folders.
level: high
notes: |
  ### Technical Context
  This detection rule focuses on identifying the creation of potentially malicious files in the Windows Public folder, specifically targeting suspicious file extensions often associated with malicious scripts and binaries. The rule detects any file creation events where the target filename contains the path `C:\Users\Public\` and ends with extensions such as `.bat`, `.dll`, `.exe`, `.hta`, `.js`, `.ps1`, `.vbe`, or `.vbs`. The rule leverages file event logs from Windows systems, which capture details about file creation actions. This kind of monitoring is crucial as attackers may use the Public folder to stage malware or exploit kits due to its shared accessibility, aiming to blend in with legitimate usage patterns.
  ### Investigation Steps
  - Review recent file creation events in the Windows Event Logs for any entries that match the identified suspicious extensions in the Public folder.
  - Use EDR tools to investigate the processes that created the identified binaries or scripts, focusing on their parent processes and the command-line parameters used during execution.
  - Query antivirus logs to determine if any of the created files triggered alerts or were flagged as malicious by the AV solutions deployed within the environment.
  - Analyze network traffic from NDR tools to identify any outbound connections that may have been initiated by these suspicious binaries, which might indicate further malicious intent or command-and-control activity.
