title: Suspicious PFX File Creation
id: dca1b3e8-e043-4ec8-85d7-867f334b5724
status: test
description: A general detection for processes creating PFX files. This could be an
  indicator of an adversary exporting a local certificate to a PFX file.
references:
- https://github.com/OTRF/detection-hackathon-apt29/issues/14
- https://github.com/OTRF/ThreatHunter-Playbook/blob/2d4257f630f4c9770f78d0c1df059f891ffc3fec/docs/evals/apt29/detections/6.B.1_6392C9F1-D975-4F75-8A70-433DEDD7F622.md
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
date: 2020-05-02
modified: 2022-07-07
tags:
- attack.credential-access
- attack.t1552.004
logsource:
  product: windows
  category: file_event
detection:
  selection:
    TargetFilename|endswith: '.pfx'
  filter_main_windows_tmp_key:
    TargetFilename|contains|all:
    - '\Templates\Windows\Windows_TemporaryKey.pfx'
    - '\CMake\'
  condition: selection and not 1 of filter_main_*
falsepositives:
- System administrators managing certificates.
level: medium
notes: |
  ### Technical Context
  This Sigma rule is designed to detect suspicious activity related to the creation of PFX (Personal Exchange Format) files on Windows systems. PFX files are often used for storing cryptographic information, such as certificates and private keys. The rule specifically monitors for new files with the `.pfx` extension being created, utilizing file event logs as the primary data source. Additionally, it includes a filter to exclude natural administrative actions, such as legitimate certificate management activities, by checking if the file creation occurs within certain known administrative directories like `\Templates\Windows\Windows_TemporaryKey.pfx` and `\CMake\`. If an endpoint process creates a PFX file outside of these exceptions, this is flagged as potentially suspicious and warrants further investigation.
  ### Investigation Steps
  - Examine process creation logs in your EDR solution to identify which processes triggered the creation of the `.pfx` file and verify their legitimacy.
  - Review the command-line parameters of the processes involved to look for unusual arguments or flags that could indicate malicious intent.
  - Use your SIEM to correlate the time of the event with other relevant logs (e.g., user logins or network activity) to assess if the activity aligns with typical user behavior patterns.
  - Investigate the affected endpoint using AV and NDR tools to scan for any additional signs of compromise, such as unusual network connections or other suspicious file creations.
