title: Potential Persistence Attempt Via ErrorHandler.Cmd
id: 15904280-565c-4b73-9303-3291f964e7f9
status: test
description: |
  Detects creation of a file named "ErrorHandler.cmd" in the "C:\WINDOWS\Setup\Scripts\" directory which could be used as a method of persistence
  The content of C:\WINDOWS\Setup\Scripts\ErrorHandler.cmd is read whenever some tools under C:\WINDOWS\System32\oobe\ (e.g. Setup.exe) fail to run for any reason.
references:
- https://www.hexacorn.com/blog/2022/01/16/beyond-good-ol-run-key-part-135/
- https://github.com/last-byte/PersistenceSniper
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-08-09
modified: 2022-12-19
tags:
- attack.persistence
logsource:
  category: file_event
  product: windows
detection:
  selection:
    TargetFilename|endswith: '\WINDOWS\Setup\Scripts\ErrorHandler.cmd'
  condition: selection
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  This Sigma rule is designed to detect potential persistence attempts through the creation of a file named "ErrorHandler.cmd" in the "C:\WINDOWS\Setup\Scripts\" directory on Windows systems. The presence of this file can indicate malicious intent, as it is executed by certain tools (like Setup.exe) under the "C:\WINDOWS\System32\oobe\" directory whenever those tools encounter an error. Attackers may leverage this method to maintain persistence on a system, allowing them to execute arbitrary commands or scripts when the operating system encounters failures. The primary data source involved in this detection is file event logging, which captures file creation and modification activities.
  ### Investigation Steps
  - Investigate file event logs for the creation of "C:\WINDOWS\Setup\Scripts\ErrorHandler.cmd" to ascertain the timestamp and user account associated with this event.
  - Review EDR logs for any related process execution, particularly those originating from "C:\WINDOWS\System32\oobe\", to identify any suspicious activity around the time the file was created.
  - Utilize AV solutions to scan the "ErrorHandler.cmd" file and its contents for any known malicious signatures or suspicious behaviors.
  - Check Windows event logs to examine any recent failures or errors logged by tools in the oobe directory, which may help correlate the creation of "ErrorHandler.cmd" with potential exploit attempts.
