title: Self Extraction Directive File Created In Potentially Suspicious Location
id: 760e75d8-c3b5-409b-a9bf-6130b4c4603f
related:
- id: ab90dab8-c7da-4010-9193-563528cfa347
  type: derived
status: test
description: |
  Detects the creation of Self Extraction Directive files (.sed) in a potentially suspicious location.
  These files are used by the "iexpress.exe" utility in order to create self extracting packages.
  Attackers were seen abusing this utility and creating PE files with embedded ".sed" entries.
references:
- https://strontic.github.io/xcyclopedia/library/iexpress.exe-D594B2A33EFAFD0EABF09E3FDC05FCEA.html
- https://en.wikipedia.org/wiki/IExpress
- https://www.virustotal.com/gui/file/602f4ae507fa8de57ada079adff25a6c2a899bd25cd092d0af7e62cdb619c93c/behavior
author: Joseliyo Sanchez, @Joseliyo_Jstnk
date: 2024-02-05
tags:
- attack.defense-evasion
- attack.t1218
logsource:
  category: file_event
  product: windows
detection:
  selection:
    TargetFilename|contains:
    - ':\ProgramData\'
    - ':\Temp\'
    - ':\Windows\System32\Tasks\'
    - ':\Windows\Tasks\'
    - ':\Windows\Temp\'
    - '\AppData\Local\Temp\'
    TargetFilename|endswith: '.sed'
  condition: selection
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  This detection rule aims to identify the creation of Self Extraction Directive files (with a `.sed` extension) in locations typically associated with malicious activities, such as ProgramData, Temp folders, and System32. The rule leverages file event logs to detect instances where an `.sed` file is created in these potentially suspicious directories. Attackers often misuse the `iexpress.exe` utility to package malicious payloads into self-extracting archives, and since `.sed` files are associated with this utility, their creation in inappropriate locations serves as a strong indicator of possible nefarious intent. By focusing on specific file paths and extensions, this rule can effectively surface attempts to evade detection during malicious software deployment.
  ### Investigation Steps
  - Examine recent file creation events in the specified directories on affected systems, filtering for `.sed` file types using EDR tools.
  - Verify the context of the `iexpress.exe` execution by reviewing process creation logs that may indicate suspicious parameters or parent-child relationships.
  - Assess any associated network activities by checking proxy logs for unusual outbound traffic patterns linked to the specified time frame of the file creation.
  - Cross-reference the findings with threat intelligence sources to determine if the observed behavior aligns with known attack signatures or vulnerabilities.
