title: Files With System Process Name In Unsuspected Locations
id: d5866ddf-ce8f-4aea-b28e-d96485a20d3d
status: test
description: |
  Detects the creation of an executable with a system process name in folders other than the system ones (System32, SysWOW64, etc.).
  It is highly recommended to perform an initial baseline before using this rule in production.
references:
- Internal Research
author: Sander Wiebing, Tim Shelton, Nasreddine Bencherchali (Nextron Systems)
date: 2020-05-26
modified: 2024-06-24
tags:
- attack.defense-evasion
- attack.t1036.005
logsource:
  category: file_event
  product: windows
detection:
  selection:
    TargetFilename|endswith:
    - '\AtBroker.exe'
    - '\audiodg.exe'
    - '\backgroundTaskHost.exe'
    - '\bcdedit.exe'
    - '\bitsadmin.exe'
    - '\cmdl32.exe'
    - '\cmstp.exe'
    - '\conhost.exe'
    - '\csrss.exe'
    - '\dasHost.exe'
    - '\dfrgui.exe'
    - '\dllhost.exe'
    - '\dwm.exe'
    - '\eventcreate.exe'
    - '\eventvwr.exe'
    - '\explorer.exe'
    - '\extrac32.exe'
    - '\fontdrvhost.exe'
    - '\ipconfig.exe'
    - '\iscsicli.exe'
    - '\iscsicpl.exe'
    - '\logman.exe'
    - '\LogonUI.exe'
    - '\LsaIso.exe'
    - '\lsass.exe'
    - '\lsm.exe'
    - '\msiexec.exe'
    - '\msinfo32.exe'
    - '\mstsc.exe'
    - '\nbtstat.exe'
    - '\odbcconf.exe'
    - '\powershell.exe'
    - '\pwsh.exe'
    - '\regini.exe'
    - '\regsvr32.exe'
    - '\rundll32.exe'
    - '\RuntimeBroker.exe'
    - '\schtasks.exe'
    - '\SearchFilterHost.exe'
    - '\SearchIndexer.exe'
    - '\SearchProtocolHost.exe'
    - '\SecurityHealthService.exe'
    - '\SecurityHealthSystray.exe'
    - '\services.exe'
    - '\ShellAppRuntime.exe'
    - '\sihost.exe'
    - '\smartscreen.exe'
    - '\smss.exe'
    - '\spoolsv.exe'
    - '\svchost.exe'
    - '\SystemSettingsBroker.exe'
    - '\taskhost.exe'
    - '\taskhostw.exe'
    - '\Taskmgr.exe'
    - '\TiWorker.exe'
    - '\vssadmin.exe'
    - '\w32tm.exe'
    - '\WerFault.exe'
    - '\WerFaultSecure.exe'
    - '\wermgr.exe'
    - '\wevtutil.exe'
    - '\wininit.exe'
    - '\winlogon.exe'
    - '\winrshost.exe'
    - '\WinRTNetMUAHostServer.exe'
    - '\wlanext.exe'
    - '\wlrmdr.exe'
    - '\WmiPrvSE.exe'
    - '\wslhost.exe'
    - '\WSReset.exe'
    - '\WUDFHost.exe'
    - '\WWAHost.exe'
  filter_main_generic:
        # Note: It is recommended to use a more robust filter instead of this generic one, to avoid false negatives.
    TargetFilename|contains:
            # - '\SystemRoot\System32\'
    - 'C:\$WINDOWS.~BT\'
    - 'C:\$WinREAgent\'
    - 'C:\Windows\SoftwareDistribution\'
    - 'C:\Windows\System32\'
    - 'C:\Windows\SysWOW64\'
    - 'C:\Windows\WinSxS\'
    - 'C:\Windows\uus\'
  filter_main_svchost:
    Image|endswith: 'C:\Windows\system32\svchost.exe'
    TargetFilename|contains: 'C:\Program Files\WindowsApps\'
  filter_main_wuauclt:
    Image|endswith: 'C:\Windows\System32\wuauclt.exe'
  filter_main_explorer:
    TargetFilename|endswith: 'C:\Windows\explorer.exe'
  filter_main_msiexec:
        # This filter handles system processes who are updated/installed using misexec.
    Image|endswith: 'C:\WINDOWS\system32\msiexec.exe'
        # Add more processes if you find them or simply filter msiexec on its own. If the list grows big
    TargetFilename|endswith:
    - 'C:\Program Files\PowerShell\7\pwsh.exe'
    - 'C:\Program Files\PowerShell\7-preview\pwsh.exe'
  filter_main_healtray:
    TargetFilename|contains: 'C:\Windows\System32\SecurityHealth\'
    TargetFilename|endswith: '\SecurityHealthSystray.exe'
    Image|endswith: '\SecurityHealthSetup.exe'
  condition: selection and not 1 of filter_main_*
falsepositives:
- System processes copied outside their default folders for testing purposes
- Third party software naming their software with the same names as the processes
  mentioned here
# Note: Upgrade to high after an initial baseline to your environement.
level: medium
notes: |
  ### Technical Context
  The Sigma rule "Files With System Process Name In Unsuspected Locations" aims to detect the creation of executable files bearing the names of legitimate system processes, found in non-standard directories, such as user folders or temporary directories. Common system processes can include, but are not limited to, `powershell.exe`, `svchost.exe`, and `cmdl32.exe`. By monitoring file events specifically for these named executables but disregarding their standard paths like `System32` or `SysWOW64`, the rule seeks to identify potential instances of malware or rogue applications masquerading as legitimate processes, which is a common tactic used for defense evasion, specifically referenced in the MITRE ATT&CK framework under tactic `Defense Evasion` and technique `T1036.005` (Masquerading: Rename System Utilities).
  The detection leverages telemetry from Windows file event logs, looking for file creation actions where the target executable's name matches a predefined list of system process names typically found on a Windows machine. This approach helps in flagging suspicious behavior indicative of an attacker’s attempt to establish a foothold on a system against the backdrop of a baseline of normal activity.
  ### Investigation Steps
  - **Review File Creation Events**: Utilize EDR tools to access the associated file creation events, focusing on the timestamp, user account, and source process that triggered the creation of the executable.
  - **Check for Parent Process**: Investigate the parent process of the suspicious executable using Sysmon logs to determine whether it was spawned from a legitimate process, or if it indicates potentially malevolent behavior.
  - **Assess File Location**: Examine the directory where the file was created. Certain directories (e.g., user profile folders, temporary folders) are less typical for system processes and warrant further investigation.
  - **Correlate with Other Security Tools**: Cross-reference the alert with logs from the AV, Proxy, and other security devices to check for any prior alerts or anomalies linked to the same user or endpoint.
  ### Prioritization
  This detection rule bears a medium severity due to the potentially deceptive nature of executables masquerading as legitimate system processes. While not all cases are indicative of compromise, instances where such files are detected in unusual locations warrant prompt review and may signify ongoing malicious activity.
  ### Blind Spots and Assumptions
  The rule could produce false positives for system processes that are copied outside of their default directories for legitimate purposes, such as testing or portable applications. It also assumes that malware does not rename its executables to obscure their identity. If a malicious actor uses names not included on the list or employs obfuscation techniques, the rule may not fire. Furthermore, the rule’s efficacy may be reduced in environments where system processes are frequently moved or where user permissions allow for unmonitored file creation.
  > **Disclaimer:** This investigation guide was created using generative AI technology and has not been reviewed for its accuracy and relevance. While every effort has been made to ensure its quality, we recommend validating the content and adapting it to suit specific environment and operational needs. Please communicate any changes to the detection engineering team.
