title: PCRE.NET Package Temp Files
id: 6e90ae7a-7cd3-473f-a035-4ebb72d961da
status: test
description: Detects processes creating temp files related to PCRE.NET package
references:
- https://twitter.com/rbmaslen/status/1321859647091970051
- https://twitter.com/tifkin_/status/1321916444557365248
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
date: 2020-10-29
modified: 2022-10-09
tags:
- attack.execution
- attack.t1059
logsource:
  category: file_event
  product: windows
detection:
  selection:
    TargetFilename|contains: \AppData\Local\Temp\ba9ea7344a4a5f591d6e5dc32a13494b\
  condition: selection
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  The "PCRE.NET Package Temp Files" Sigma rule is designed to detect potentially malicious activities associated with the creation of temporary files generated by the PCRE.NET package on Windows systems. Specifically, the rule looks for file events that indicate the presence of a target filename containing a specific pattern within the AppData\Local\Temp directory. This can be indicative of some automation or exploitation techniques where malicious files are created in the user's temporary file space, often as a precursor to running unauthorized programs or scripts. The primary data source leveraged for this detection is Windows file event logs, which record file creation and modification activities, providing visibility into suspicious behavior related to known package structures.
  ### Investigation Steps
  - Review Windows EDR logs to identify any processes that created temp files matching the specified pattern, observing associated parent processes for context.
  - Check for unusual command-line parameters associated with the detected process to identify any signs of execution of potentially harmful scripts or commands.
  - Analyze the affected system’s Application and Security event logs for any events that correlate with the time and nature of the file creation detected by the rule.
  - Cross-reference user activity logs to determine if the user account associated with the event has a history of anomalous behavior or has been flagged for any previous incidents.
