title: Suspicious LNK Double Extension File Created
id: 3215aa19-f060-4332-86d5-5602511f3ca8
related:
- id: b4926b47-a9d7-434c-b3a0-adc3fa0bd13e
  type: derived
status: test
description: |
  Detects the creation of files with an "LNK" as a second extension. This is sometimes used by malware as a method to abuse the fact that Windows hides the "LNK" extension by default.
references:
- https://www.crowdstrike.com/blog/meet-crowdstrikes-adversary-of-the-month-for-june-mustang-panda/
- https://www.anomali.com/blog/china-based-apt-mustang-panda-targets-minority-groups-public-and-private-sector-organizations
- https://www.cybereason.com/blog/research/a-bazar-of-tricks-following-team9s-development-cycles
- https://twitter.com/malwrhunterteam/status/1235135745611960321
- https://twitter.com/luc4m/status/1073181154126254080
author: Nasreddine Bencherchali (Nextron Systems), frack113
date: 2022-11-07
modified: 2023-10-18
tags:
- attack.defense-evasion
- attack.t1036.007
logsource:
  category: file_event
  product: windows
detection:
  selection:
    TargetFilename|endswith: '.lnk'
    TargetFilename|contains:
    - '.doc.'
    - '.docx.'
    - '.jpg.'
    - '.pdf.'
    - '.ppt.'
    - '.pptx.'
    - '.xls.'
    - '.xlsx.'
  filter_main_recent:
    TargetFilename|contains: '\AppData\Roaming\Microsoft\Windows\Recent\'
  filter_optional_office_recent:
    Image|endswith:
            # Note: Some additional office application might need to be added
    - '\excel.exe'
    - '\powerpnt.exe'
    - '\winword.exe'
    TargetFilename|contains: '\AppData\Roaming\Microsoft\Office\Recent\'
  filter_optional_office_excel:
    Image|endswith: '\excel.exe'
    TargetFilename|contains: '\AppData\Roaming\Microsoft\Excel'
  filter_optional_office_powerpoint:
    Image|endswith: '\powerpnt.exe'
    TargetFilename|contains: '\AppData\Roaming\Microsoft\PowerPoint'
  filter_optional_office_word:
    Image|endswith: '\winword.exe'
    TargetFilename|contains: '\AppData\Roaming\Microsoft\Word'
  condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
falsepositives:
- Some tuning is required for other general purpose directories of third party apps
level: medium
notes: |
  ### Technical Context
  This Sigma rule identifies the suspicious creation of files that have double extensions ending with ".lnk", which is commonly used by threat actors to conceal malicious files. The primary data sources for this detection come from Windows File Event logs, specifically monitoring the "TargetFilename" for anomalies where the second extension is ".lnk". Attackers may exploit the fact that Windows often hides file extensions, making these files appear benign to users. The detection is particularly focused on files created within the user’s Recent Files directory and also includes specific checks for file creation events associated with Microsoft Office applications. This behavior aligns with MITRE ATT&CK technique T1036.007 (Masquerading: Match Legitimate Name or Location) under the tactic of Defense Evasion.
  ### Investigation Steps
  - **Verify the Creation Event:** Use EDR tools to examine the process that created the suspicious LNK file. Look for the parent process and any command-line arguments that may indicate malicious intent.
    
  - **Assess Recent Activity:** Check Windows Event Logs, specifically the System and Security logs, to identify any recent user activity leading to the creation of the file. Look for any unusual user logins or other file creations around the same time.
    
  - **Analyze the LNK File:** If possible, analyze the contents of the LNK file. Use tools to confirm whether the file points to suspicious or unexpected targets, such as executable files, scripts, or other questionable resources.
    
  - **Review User and Network Activity:** Check Proxy and VPN logs for any unusual network connections made by the user around the time the file was created. Analyze traffic patterns to identify any connections to known malicious IP addresses or domains.
  ### Prioritization
  This alert is classified as medium severity because the presence of LNK files with suspicious double extensions often indicates an attempt to evade detection and could signify a precursor to further malicious activity, warranting immediate investigation.
  ### Blind Spots and Assumptions
  There are certain limitations to this rule. For instance, it may not trigger if the malicious actor uses non-standard directories or if they delete the LNK files quickly after creation. Additionally, if users regularly create files with legitimate double extensions or if third-party applications manipulate files in a manner similar to the criteria set in this detection, then false positives may occur. Engineers should consider these scenarios and adjust the detection parameters as necessary to minimize noise while ensuring security.
  > **Disclaimer:** This investigation guide was created using generative AI technology and has not been reviewed for its accuracy and relevance. While every effort has been made to ensure its quality, we recommend validating the content and adapting it to suit specific environment and operational needs. Please communicate any changes to the detection engineering team.
