title: HackTool - QuarksPwDump Dump File
id: 847def9e-924d-4e90-b7c4-5f581395a2b4
status: test
description: Detects a dump file written by QuarksPwDump password dumper
references:
- https://jpcertcc.github.io/ToolAnalysisResultSheet/details/QuarksPWDump.htm
author: Florian Roth (Nextron Systems)
date: 2018-02-10
modified: 2024-06-27
tags:
- attack.credential-access
- attack.t1003.002
logsource:
  category: file_event
  product: windows
detection:
  selection:
    TargetFilename|contains|all:
    - '\AppData\Local\Temp\SAM-'
    - '.dmp'
  condition: selection
falsepositives:
- Unknown
level: critical
notes: |
  ### Technical Context
  This Sigma rule is designed to detect the creation of a specific type of dump file generated by the QuarksPwDump tool, which is known for harvesting password hashes from memory on Windows systems. The rule focuses on file events, particularly targeting filenames that contain the path `\AppData\Local\Temp\SAM-` and end with the `.dmp` extension. When a file matching this criteria is detected, it indicates a possible attempt to capture sensitive credentials, thus raising alerts for further investigation. The primary data source used for this detection is Windows file event logs, which capture the creation and modification of files on the system.
  ### Investigation Steps
  Review the generated alert in the SIEM to gather details about the file creation event, including the timestamp and user account associated with the activity.
    
  Examine the Windows EDR tool to identify any suspicious processes that were active around the time the dump file was created, particularly looking for instances of QuarksPwDump or related tools.
    
  Utilize antivirus logs to determine if the detected dump file has been flagged or quarantined, which may indicate a prior detection or response to the malicious activity.
    
  Check user activity logs and proxy logs to understand the context of the account involved, including any unusual logins or access patterns that may correlate with the timeframe of the alert.
