title: Remote Access Tool - ScreenConnect Temporary File
id: 0afecb6e-6223-4a82-99fb-bf5b981e92a5
related:
- id: b1f73849-6329-4069-bc8f-78a604bb8b23
  type: similar
status: test
description: |
  Detects the creation of files in a specific location by ScreenConnect RMM.
  ScreenConnect has feature to remotely execute binaries on a target machine. These binaries will be dropped to ":\Users\<username>\Documents\ConnectWiseControl\Temp\" before execution.
references:
- https://github.com/SigmaHQ/sigma/pull/4467
author: Ali Alwashali
date: 2023-10-10
tags:
- attack.execution
- attack.t1059.003
logsource:
  category: file_event
  product: windows
detection:
  selection:
    Image|endswith: '\ScreenConnect.WindowsClient.exe'
    TargetFilename|contains: '\Documents\ConnectWiseControl\Temp\'
  condition: selection
falsepositives:
- Legitimate use of ScreenConnect
# Note: Incase the level if ScreenConnect is not used
level: low
notes: |
  ### Technical Context
  This detection rule monitors for the creation of temporary files associated with the ScreenConnect Remote Management Tool (RMM), a legitimate software often used for remote system management and support. The rule specifically looks for file creation events in the path `C:\Users\<username>\Documents\ConnectWiseControl\Temp\`, indicating that binaries executed by ScreenConnect may have been dropped in this temporary directory prior to execution. The detection is based on the process image name ending with `ScreenConnect.WindowsClient.exe`, which triggers an alert when combined with the target filename condition. This behavior aligns with the MITRE ATT&CK framework tactic of Execution (T1059.003 
  - Command and Scripting Interpreter: Windows PowerShell). Understanding this process is crucial for identifying potential misuse of the application by threat actors, as it can often be exploited for malicious activities.
  ### Investigation Steps
  - **Verify the Execution Context:** Check the EDR logs to confirm whether the `ScreenConnect.WindowsClient.exe` process was legitimately initiated within the expected user session and context.
  - **Analyze Temporary File Contents:** Investigate the contents of files created in the `Temp` directory to ascertain if any malicious payloads were delivered alongside legitimate operations.
  - **Review Network Connections:** Utilize network monitoring tools to examine any outgoing connections from the ScreenConnect application to identify any suspicious remote communication patterns.
  - **Assess User Activity Logs:** Review Windows Event Logs for any unusual user activity or logins around the time the ScreenConnect  temporary file was created, which could indicate unauthorized access.
  ### Prioritization
  Although the rule is categorized as low severity, alerts should not be dismissed lightly as they can indicate potential misuse of a legitimate tool. It's crucial to investigate the context surrounding each occurrence to eliminate false positives stemming from legitimate ScreenConnect usage.
  ### Blind Spots and Assumptions
  There are potential blind spots in this detection rule depending on the environments where ScreenConnect is not deployed or utilized legitimately. Additionally, if the threat actor utilizes a different method for file transfer or renames the executable, the rule may not trigger. Furthermore, legitimate administrative activities could create similar file patterns that could lead to false positives, necessitating careful contextual investigation by analysts.
  > **Disclaimer:** This investigation guide was created using generative AI technology and has not been reviewed for its accuracy and relevance. While every effort has been made to ensure its quality, we recommend validating the content and adapting it to suit specific environment and operational needs. Please communicate any changes to the detection engineering team.
