title: Startup Folder File Write
id: 2aa0a6b4-a865-495b-ab51-c28249537b75
related:
- id: 28208707-fe31-437f-9a7f-4b1108b94d2e
  type: similar
status: test
description: A General detection for files being created in the Windows startup directory.
  This could be an indicator of persistence.
references:
- https://github.com/OTRF/detection-hackathon-apt29/issues/12
- https://github.com/OTRF/ThreatHunter-Playbook/blob/2d4257f630f4c9770f78d0c1df059f891ffc3fec/docs/evals/apt29/detections/5.B.1_611FCA99-97D0-4873-9E51-1C1BA2DBB40D.md
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
date: 2020-05-02
modified: 2022-10-07
tags:
- attack.persistence
- attack.t1547.001
logsource:
  product: windows
  category: file_event
detection:
  selection:
    TargetFilename|contains: '\Microsoft\Windows\Start Menu\Programs\StartUp'
  filter_update:
  - Image: 'C:\Windows\System32\wuauclt.exe'
  - TargetFilename|startswith: 'C:\$WINDOWS.~BT\NewOS\'
  condition: selection and not filter_update
falsepositives:
- FP could be caused by legitimate application writing shortcuts for example. This
  folder should always be inspected to make sure that all the files in there are legitimate
level: medium
notes: |
  ### Technical Context
  This detection rule monitors for the creation of files in the Windows startup directory, specifically looking for any abnormal file activity that could indicate potential persistence mechanisms being employed by malware or unauthorized applications. The startup directory is a common target for attackers seeking to maintain a foothold in a system, as files placed within this directory are executed automatically when the user logs in. The rule deploys a simple selection criteria focusing on file events where the target filename contains the path to the startup folder (e.g., `C:\Users\<Username>\AppData\Roaming\Microsoft\Windows\Start Menu\Programs\Startup`). Additionally, it applies a filter to exclude certain system processes, such as `wuauclt.exe`, and paths that start with `C:\$WINDOWS.~BT\NewOS\`, which may be associated with legitimate system operations.
  ### Investigation Steps
  - Utilize EDR tools to correlate the alert with recent process activity and verify whether the file creation was initiated by a legitimate user application or process.
  - Check the properties and content of the created files in the startup folder by examining file hashes and signatures to determine if they are associated with known malware.
  - Review the command-line parameters and parent-child process relationships using the process creation logs to identify any suspicious behavior linked to the file creation.
  - Analyze network traffic logs from your NGFW or NDR tools to see if there were any outbound connections from the system that correlate with the time frame of the file creation, which may suggest malicious intent.
