title: NTDS Exfiltration Filename Patterns
id: 3a8da4e0-36c1-40d2-8b29-b3e890d5172a
status: test
description: Detects creation of files with specific name patterns seen used in various
  tools that export the NTDS.DIT for exfiltration.
references:
- https://github.com/rapid7/metasploit-framework/blob/eb6535009f5fdafa954525687f09294918b5398d/modules/post/windows/gather/ntds_grabber.rb
- https://github.com/rapid7/metasploit-framework/blob/eb6535009f5fdafa954525687f09294918b5398d/data/post/powershell/NTDSgrab.ps1
- https://github.com/SecureAuthCorp/impacket/blob/7d2991d78836b376452ca58b3d14daa61b67cb40/impacket/examples/secretsdump.py#L2405
author: Florian Roth (Nextron Systems)
date: 2022-03-11
modified: 2023-05-05
tags:
- attack.credential-access
- attack.t1003.003
logsource:
  product: windows
  category: file_event
detection:
  selection:
    TargetFilename|endswith:
    - '\All.cab'         # https://github.com/rapid7/metasploit-framework/blob/eb6535009f5fdafa954525687f09294918b5398d/data/post/powershell/NTDSgrab.ps1
    - '.ntds.cleartext'         # https://github.com/SecureAuthCorp/impacket/blob/7d2991d78836b376452ca58b3d14daa61b67cb40/impacket/examples/secretsdump.py#L2405
  condition: selection
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  The "NTDS Exfiltration Filename Patterns" detection rule is designed to identify potentially malicious activity related to the exfiltration of sensitive information from the NTDS.DIT database on Windows systems. This rule specifically looks for the creation of files with names that match particular patterns, such as `All.cab` and `.ntds.cleartext`, which are commonly associated with tools that export NTDS.DIT data. By monitoring file creation events through Windows file event logs, this rule helps SOC analysts detect anomalies that may indicate credential theft or insider threats, linking potential exfiltration efforts to known tactics and techniques in the MITRE ATT&CK framework.
  The primary data sources utilized in this detection are file creation logs that capture the target filenames being generated on endpoints. When a file with a suspicious naming pattern is created, the rule triggers an alert, allowing incident responders to investigate further into the corresponding user activities and potential compromise scenarios.
  ### Investigation Steps
  - Review endpoint data in the EDR for recent processes associated with file creation, focusing on the time frame around the alert to identify any potentially malicious execution.
  - Check antivirus logs to determine if any alerts or blocks occurred related to the identified file patterns or associated processes.
  - Analyze proxy logs for unusual outbound connections or data transfers that may coincide with the alert, potentially indicating exfiltration attempts.
  - Examine any relevant cloud service logs (AWS, GCP, Azure) for signs of unauthorized access or data movement related to the affected user account or system.
