title: Advanced IP Scanner - File Event
id: fed85bf9-e075-4280-9159-fbe8a023d6fa
related:
- id: bef37fa2-f205-4a7b-b484-0759bfd5f86f
  type: derived
status: test
description: Detects the use of Advanced IP Scanner. Seems to be a popular tool for
  ransomware groups.
references:
- https://news.sophos.com/en-us/2019/12/09/snatch-ransomware-reboots-pcs-into-safe-mode-to-bypass-protection/
- https://www.fireeye.com/blog/threat-research/2020/05/tactics-techniques-procedures-associated-with-maze-ransomware-incidents.html
- https://labs.f-secure.com/blog/prelude-to-ransomware-systembc
- https://assets.documentcloud.org/documents/20444693/fbi-pin-egregor-ransomware-bc-01062021.pdf
- https://thedfirreport.com/2021/01/18/all-that-for-a-coinminer
author: '@ROxPinTeddy'
date: 2020-05-12
modified: 2022-11-29
tags:
- attack.discovery
- attack.t1046
logsource:
  category: file_event
  product: windows
detection:
  selection:
    TargetFilename|contains: '\AppData\Local\Temp\Advanced IP Scanner 2'
  condition: selection
falsepositives:
- Legitimate administrative use
level: medium
notes: |
  ### Technical Context
  This Sigma rule is designed to detect the use of the "Advanced IP Scanner" tool, which is commonly associated with cyber adversaries, particularly ransomware groups. The focus of the rule is on file events occurring within the Windows operating system that indicate the execution or presence of the Advanced IP Scanner application. Specifically, it monitors for file events that include the target filename path referencing the application's temporary directory, `\AppData\Local\Temp\Advanced IP Scanner 2`. The detection relies on logs generated from Windows file events, which record activities related to file creations, modifications, and deletions.
  Responding to alerts generated by this rule is critical as the Advanced IP Scanner can be leveraged by malicious actors to map out networked devices, making it a potential precursor to further intrusive activities. Understanding the context and proper utilization of this detection can help SOC analysts identify unauthorized usage quickly.
  ### Investigation Steps
  - Review endpoint EDR logs to identify any recent instances of the Advanced IP Scanner execution, paying particular attention to the timestamp and user account involved.
  - Analyze the process tree from the EDR to check for any unusual parent-child relationships that indicate malicious activity, such as the execution of unknown processes following the use of the scanner.
  - Examine network logs via NDR for any suspicious outbound connections to unfamiliar IP addresses that might correlate with the execution of the Advanced IP Scanner.
  - Check proxy logs for any web traffic patterns that suggest data exfiltration or communication with known malicious sites following the use of the tool.
