title: GatherNetworkInfo.VBS Reconnaissance Script Output
id: f92a6f1e-a512-4a15-9735-da09e78d7273
related:
- id: 575dce0c-8139-4e30-9295-1ee75969f7fe     # ProcCreation LOLBIN
  type: similar
- id: 07aa184a-870d-413d-893a-157f317f6f58     # ProcCreation Susp
  type: similar
status: test
description: Detects creation of files which are the results of executing the built-in
  reconnaissance script "C:\Windows\System32\gatherNetworkInfo.vbs".
references:
- https://posts.slayerlabs.com/living-off-the-land/#gathernetworkinfovbs
- https://www.mandiant.com/resources/blog/trojanized-windows-installers-ukrainian-government
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023-02-08
tags:
- attack.discovery
logsource:
  product: windows
  category: file_event
detection:
  selection:
    TargetFilename|startswith: 'C:\Windows\System32\config'
    TargetFilename|endswith:
    - '\Hotfixinfo.txt'
    - '\netiostate.txt'
    - '\sysportslog.txt'
    - '\VmSwitchLog.evtx'
  condition: selection
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  This Sigma rule is designed to detect the execution of the built-in Windows reconnaissance script, `gatherNetworkInfo.vbs`, which is used to collect network configuration details. The rule specifically looks for file creations that begin in the directory `C:\Windows\System32\config` and that end with specific filenames indicative of generated output from this script, such as `Hotfixinfo.txt`, `netiostate.txt`, `sysportslog.txt`, and `VmSwitchLog.evtx`. The primary data sources leveraged for this detection are file event logs that note activities associated with the creation of these output files on a Windows system, making it easier to identify potential unauthorized reconnaissance activities.
  ### Investigation Steps
  - **Review EDR alerts** for execution logs related to `gatherNetworkInfo.vbs`, which can provide context about when and where the script was run, including details about the associated parent process.
  - **Examine recent file creations** within `C:\Windows\System32\config` to verify presence of the output files mentioned in the rule and check if their timestamps align with the execution logs.
  - **Cross-reference with user activity logs** to determine if the script execution was initiated by an authorized user or if it appears suspicious, indicating potential malicious intent.
  - **Consult network logs via the NDR** to identify any unusual outbound connections made shortly after the execution of the script, which may indicate data exfiltration or reconnaissance activities post-script execution.
