title: Potential DCOM InternetExplorer.Application DLL Hijack
id: 2f7979ae-f82b-45af-ac1d-2b10e93b0baa
related:
- id: e554f142-5cf3-4e55-ace9-a1b59e0def65
  type: obsolete
- id: f354eba5-623b-450f-b073-0b5b2773b6aa
  type: similar
status: test
description: Detects potential DLL hijack of "iertutil.dll" found in the DCOM InternetExplorer.Application
  Class over the network
references:
- https://threathunterplaybook.com/hunts/windows/201009-RemoteDCOMIErtUtilDLLHijack/notebook.html
author: Roberto Rodriguez @Cyb3rWard0g, Open Threat Research (OTR), wagga
date: 2020-10-12
modified: 2022-12-18
tags:
- attack.lateral-movement
- attack.t1021.002
- attack.t1021.003
logsource:
  product: windows
  category: file_event
detection:
  selection:
    Image: System
    TargetFilename|endswith: '\Internet Explorer\iertutil.dll'
  condition: selection
falsepositives:
- Unknown
level: critical
notes: |
  ### Technical Context
  The detection rule “Potential DCOM InternetExplorer.Application DLL Hijack” aims to identify potential premeditated attacks on the Internet Explorer application by monitoring for suspicious activity associated with the DLL file "iertutil.dll". The primary method leveraged in this detection is the observation of file events linked to the DCOM service, specifically when the DLL is loaded from a location within the Internet Explorer folder hierarchy. By analyzing file-level operations, particularly instances where the `TargetFilename` matches or ends with '\Internet Explorer\iertutil.dll' and driven by the legitimate "System" process, the rule can flag potential hijacking attempts. This type of attack typically seeks to mislead the application into executing harmful code, highlighting the importance of vigilant monitoring in enterprise environments.
  ### Investigation Steps
  - Start by reviewing the file event logs in your EDR solution to identify any recent activities involving "iertutil.dll" and the associated process that triggered the event.
  - Utilize the SIEM platform to correlate the timestamps of the alert with relevant events in the environment, such as user logins, and examine any unusual patterns of behavior.
  - Examine host and network traffic through the NDR and Proxy logs to identify if there are any unexpected outbound connections at the time of the alert, which could indicate lateral movement or data exfiltration attempts.
  - Check the integrity and configuration settings of the Internet Explorer application using logs from the NGFW and AV to ensure that there are no known vulnerable versions or configurations in place that could facilitate such an exploitation.
