title: Potential File Extension Spoofing Using Right-to-Left Override
id: 979baf41-ca44-4540-9d0c-4fcef3b5a3a4
related:
- id: ad691d92-15f2-4181-9aa4-723c74f9ddc3
  type: derived
status: experimental
description: |
  Detects suspicious filenames that contain a right-to-left override character and a potentially spoofed file extensions.
references:
- https://redcanary.com/blog/right-to-left-override/
- https://www.malwarebytes.com/blog/news/2014/01/the-rtlo-method
author: Jonathan Peters (Nextron Systems), Florian Roth (Nextron Systems)
date: 2024-11-17
tags:
- attack.execution
- attack.defense-evasion
- attack.t1036.002
logsource:
  category: file_event
  product: windows
detection:
  selection_rtlo_unicode:
    TargetFilename|contains: '\u202e'
  selection_extensions:
    TargetFilename|contains:
    - 'fpd..'
    - 'nls..'
    - 'vsc..'
    - 'xcod.'
    - 'xslx.'
  condition: all of selection_*
falsepositives:
- Filenames that contains scriptures such as arabic or hebrew might make use of this
  character
level: high
notes: |
  ### Technical Context
  This Sigma rule is designed to detect potential file extension spoofing through the use of a right-to-left override (RTLO) character. The RTLO character (`\u202e`) modifies the way text is displayed, allowing malicious actors to create filenames that appear to have legitimate extensions while actually containing dangerous content. The rule specifically looks for filenames that both include the RTLO character and match certain suspicious extensions, such as "fpd..", "nls..", "vsc..", "xcod.", and "xslx.". This rule leverages Windows file event logs, capturing data such as the file's creation and modification events to identify any suspicious activity surrounding potentially harmful file names.
  By focusing on the presence of this character in combination with common spoofed extensions, this rule aims to proactively identify files that could deceive users and bypass security measures. Responders should be aware that while this rule serves as a critical alerting mechanism, it may generate false positives for legitimate filenames containing Hebrew or Arabic text.
  ### Investigation Steps
  - Utilize your EDR solution to search for recent file creation events that contain the RTLO character in their filenames. Focus on any associated file paths or processes that invoked these file events.
  - Review endpoint logs to trace the execution history of any processes that accessed or created these suspicious files. Look for any patterns in process execution that might indicate malicious behavior.
  - Analyze network traffic logs for any unusual outbound communications that coincide with the timeline of the suspicious file activities. This can help identify potential data exfiltration or malware communication.
  - Examine user activity logs to determine if the file was executed or accessed by any users recently. Look for unusual user behavior or access patterns that may correlate with the alerts for further context.
