title: PDF File Created By RegEdit.EXE
id: 145095eb-e273-443b-83d0-f9b519b7867b
status: experimental
description: |
  Detects the creation of a file with the ".pdf" extension by the "RegEdit.exe" process.
  This indicates that a user is trying to print/save a registry key as a PDF in order to potentially extract sensitive information and bypass defenses.
references:
- https://sensepost.com/blog/2024/dumping-lsa-secrets-a-story-about-task-decorrelation/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2024-07-08
tags:
- attack.defense-evasion
logsource:
  category: file_event
  product: windows
detection:
  selection:
    Image|endswith: '\regedit.exe'
    TargetFilename|endswith: '.pdf'
  condition: selection
falsepositives:
- Unlikely
level: high
notes: |
  ### Technical Context
  The detection rule titled "PDF File Created By RegEdit.EXE" focuses on identifying instances where the `RegEdit.exe` process is used to create files with a ".pdf" extension. This activity may indicate an intent to extract sensitive information from the Windows registry and save it in a more portable format, potentially for malicious purposes. The rule leverages file event logs generated by the Windows operating system, specifically monitoring for process execution events from `RegEdit.exe` and the naming convention of the created files. By correlating the two actions—execution of `RegEdit.exe` and the generation of a PDF file—security teams can flag potentially suspicious behavior indicative of an adversary’s attempt to bypass defenses and exfiltrate sensitive information.
  ### Investigation Steps
  - Review EDR logs to identify details of the `RegEdit.exe` execution, including user account and timestamp information to determine the legitimacy of the action.
  - Analyze any related command-line arguments associated with `RegEdit.exe` to understand the specific registry keys that are being accessed or manipulated.
  - Check for any recent network activity associated with the user account to identify possible information exfiltration attempts, including unusual outbound connections.
  - Inspect cloud storage logs (e.g., AWS S3, GCP Storage) for signs of uploaded PDF files to correlate with the timestamp and user involved in the incident.
