title: Legitimate Application Dropped Archive
id: 654fcc6d-840d-4844-9b07-2c3300e54a26
status: test
description: Detects programs on a Windows system that should not write an archive
  to disk
references:
- https://github.com/Neo23x0/sysmon-config/blob/3f808d9c022c507aae21a9346afba4a59dd533b9/sysmonconfig-export-block.xml#L1326
author: frack113, Florian Roth
date: 2022-08-21
tags:
- attack.defense-evasion
- attack.t1218
logsource:
  product: windows
  category: file_event
detection:
  selection:
    Image|endswith:
            # Microsoft Office Programs Dropping Executables
    - \winword.exe
    - \excel.exe
    - \powerpnt.exe
    - \msaccess.exe
    - \mspub.exe
    - \eqnedt32.exe
    - \visio.exe
    - \wordpad.exe
    - \wordview.exe
            # LOLBINs that can be used to download executables
    - \certutil.exe
    - \certoc.exe
    - \CertReq.exe
            # - \bitsadmin.exe (depends on the environment; comment in if you're sure that bitsadmin doesn't do that in your env)
    - \Desktopimgdownldr.exe
    - \esentutl.exe
            # - \expand.exe
    - \finger.exe
            # Executables that should never drop an executable to disk (but may after a previous process injection or if it's malware that uses a legitimate name)
    - \notepad.exe
    - \AcroRd32.exe
    - \RdrCEF.exe
    - \mshta.exe
    - \hh.exe
    TargetFilename|endswith:
    - '.zip'
    - '.rar'
    - '.7z'
    - '.diagcab'
    - '.appx'
  condition: selection
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  The "Legitimate Application Dropped Archive" rule is designed to detect instances where certain trusted applications on Windows systems are attempting to write archive files to disk. Specific applications identified by the rule include common Microsoft Office programs and other legitimate executables, often referred to as "living-off-the-land" binaries (LOLBINs), that should not typically perform such actions. By monitoring file event logs for these applications, the rule flags any creation of archive files with extensions such as `.zip`, `.rar`, `.7z`, `.diagcab`, or `.appx`. This behavior may indicate misuse of legitimate software, potentially being employed for malicious purposes such as data exfiltration or the delivery of payloads, thus raising a high-level alert for further investigation.
  ### Investigation Steps
  - Review EDR logs for the detected process, examining the command-line arguments and parent-child process relationships to identify the context of the archive creation.
  - Check for recent activity in the corresponding file paths to confirm whether any unusual or unauthorized changes have occurred, potentially correlating with the archive creation.
  - Analyze proxy logs for any outbound connections made by the flagged applications around the time of the detection, which could indicate data exfiltration attempts.
  - Consult Windows event logs and AV logs for any additional alerts or unusual behaviors associated with the processes in question to understand the potential scope and impact of the incident.
