title: DLL Search Order Hijackig Via Additional Space in Path
id: b6f91281-20aa-446a-b986-38a92813a18f
status: test
description: |
  Detects when an attacker create a similar folder structure to windows system folders such as (Windows, Program Files...)
  but with a space in order to trick DLL load search order and perform a "DLL Search Order Hijacking" attack
references:
- https://twitter.com/cyb3rops/status/1552932770464292864
- https://www.wietzebeukema.nl/blog/hijacking-dlls-in-windows
author: frack113, Nasreddine Bencherchali (Nextron Systems)
date: 2022-07-30
tags:
- attack.persistence
- attack.privilege-escalation
- attack.defense-evasion
- attack.t1574.002
logsource:
  category: file_event
  product: windows
detection:
  selection:
    TargetFilename|startswith:
    - 'C:\Windows \'
    - 'C:\Program Files \'
    - 'C:\Program Files (x86) \'
    TargetFilename|endswith: '.dll'
  condition: selection
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This Sigma rule is designed to detect a specific technique known as "DLL Search Order Hijacking." This occurs when an attacker creates a folder path similar to critical Windows system folder paths (like `C:\Windows` or `C:\Program Files`), but introduces a space, thereby manipulating the way Windows searches for Dynamic Link Library (DLL) files. When a legitimate application tries to load a DLL from these paths, it may inadvertently load a malicious DLL placed in the attacker-created folder, leading to potential privilege escalation and system compromise. The rule monitors file events in Windows, particularly focusing on file paths, identifying any DLL files that are located in directory paths which mimic legitimate locations but include additional spaces. The rule falls under the MITRE ATT&CK tactic of Persistence, Privilege Escalation, and Defense Evasion, specifically linked to technique T1574.002.
  ### Investigation Steps
  - **Verify File Existence:** Use EDR to search for the specific DLL files that were detected in the misleading folder paths. Check if the DLLs are legitimate or potentially malicious.
  - **Analyze Process Activity:** Review the process creation logs in Sysmon to identify processes that attempted to load the detected DLLs. Correlate these processes with known applications to verify legitimacy.
  - **Inspect Folder Structure:** Examine the filesystem in the paths that triggered the alert. Look for folder structures that imitate legitimate Windows paths with spaces and quantify the risk of potential exploitation.
  - **Review Related Network Activity:** Use network detection tools to analyze outbound network connections made by the processes that loaded the suspicious DLLs. Investigate any connections to known malicious IPs or domains.
  ### Prioritization
  The alert is classified as high severity due to the potential for significant impact on the system, including unauthorized privilege escalation and execution of malicious code. Any indication of DLL search order hijacking necessitates immediate investigation to prevent compromise.
  ### Blind spots and Assumptions
  This detection rule may not trigger in scenarios where attackers use less obvious folder names or through legitimate software that does not follow the traditional Windows folder structure. Additionally, if attackers deliver malicious DLLs through other means (such as remote code execution or direct filesystem modification) that do not use compromised folders, the detection may fail. Furthermore, it assumes proper logging is set up and operational on the monitored systems. Analysts should also be aware that legitimate applications may inadvertently create folders that match detection criteria.
  > **Disclaimer:** This investigation guide was created using generative AI technology and has not been reviewed for its accuracy and relevance. While every effort has been made to ensure its quality, we recommend validating the content and adapting it to suit specific environment and operational needs. Please communicate any changes to the detection engineering team.
