title: ADSI-Cache File Creation By Uncommon Tool
id: 75bf09fa-1dd7-4d18-9af9-dd9e492562eb
status: test
description: Detects the creation of an "Active Directory Schema Cache File" (.sch)
  file by an uncommon tool.
references:
- https://medium.com/@ivecodoe/detecting-ldapfragger-a-newly-released-cobalt-strike-beacon-using-ldap-for-c2-communication-c274a7f00961
- https://blog.fox-it.com/2020/03/19/ldapfragger-command-and-control-over-ldap-attributes/
- https://github.com/fox-it/LDAPFragger
author: xknow @xknow_infosec, Tim Shelton
date: 2019-03-24
modified: 2023-10-18
tags:
- attack.t1001.003
- attack.command-and-control
logsource:
  product: windows
  category: file_event
detection:
  selection:
    TargetFilename|contains: '\Local\Microsoft\Windows\SchCache\'
    TargetFilename|endswith: '.sch'
  filter_main_generic:
  - Image|endswith:
    - ':\Program Files\Cylance\Desktop\CylanceSvc.exe'
    - ':\Windows\CCM\CcmExec.exe'
    - ':\windows\system32\dllhost.exe'
    - ':\Windows\system32\dsac.exe'
    - ':\Windows\system32\efsui.exe'
    - ':\windows\system32\mmc.exe'
    - ':\windows\system32\svchost.exe'
    - ':\Windows\System32\wbem\WmiPrvSE.exe'
    - ':\windows\system32\WindowsPowerShell\v1.0\powershell.exe'
  - Image|contains:
    - ':\Windows\ccmsetup\autoupgrade\ccmsetup'           # C:\Windows\ccmsetup\autoupgrade\ccmsetup.TMC00002.40.exe
    - ':\Program Files\SentinelOne\Sentinel Agent'           # C:\Program Files\SentinelOne\Sentinel Agent 21.7.7.40005\SentinelAgent.exe
  filter_main_office:
    Image|contains|all:
    - ':\Program Files\'
    - '\Microsoft Office'
    Image|endswith: '\OUTLOOK.EXE'
  filter_optional_ldapwhoami:
    Image|endswith: '\LANDesk\LDCLient\ldapwhoami.exe'
  filter_optional_citrix:
        # Example:
        #   TargetFilename=C:\Windows\ServiceProfiles\NetworkService\AppData\Local\Microsoft\Windows\SchCache\REDACTED.com.sch
    Image|endswith: ':\Program Files\Citrix\Receiver StoreFront\Services\DefaultDomainServices\Citrix.DeliveryServices.DomainServices.ServiceHost.exe'
  condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
falsepositives:
- Other legimate tools, which do ADSI (LDAP) operations, e.g. any remoting activity
  by MMC, Powershell, Windows etc.
level: medium
notes: |
  ### Technical Context
  This detection rule identifies the creation of Active Directory Schema Cache files (with a .sch extension) by uncommon tools. The rule targets specific file events on Windows systems, focusing on files created under the path `\Local\Microsoft\Windows\SchCache\`, while ensuring the creation of these files does not originate from known legitimate software like PowerShell, MMC, or Citrix services. By analyzing file event logs, particularly the `TargetFilename`, and filtering by the `Image` responsible for the file creation, the rule effectively captures the potential misuse of rare or obscure applications that could indicate malicious activity, such as the deployment of Cobalt Strike’s LDAPFragger tool. 
  The underlying data sources for this rule include process creation logs and file event logs, allowing analysts to correlate file creation with the processes that spawned them. This capability is crucial for identifying suspicious behaviors that may evade standard security measures.
  ### Investigation Steps
  - Use EDR tools to review the process history on the affected system, focusing on the detailed activity around the timestamp of the .sch file creation for any anomalies in process execution.
  - Query file event logs to confirm the existence of the targeted .sch files and validate their creation pathway, ensuring no legitimate applications were involved.
  - Analyze network traffic using NDR to identify any unusual communication patterns from the machine in question, especially looking for LDAP-related activity that could suggest command-and-control functions.
  - Check proxy logs for any outbound connections initiated by the processes of interest at the time of the file creation, as this may reveal potential data exfiltration or command-and-control interactions.
