title: GoToAssist Temporary Installation Artefact
id: 5d756aee-ad3e-4306-ad95-cb1abec48de2
status: test
description: |
  An adversary may use legitimate desktop support and remote access software, such as Team Viewer, Go2Assist, LogMein, AmmyyAdmin, etc, to establish an interactive command and control channel to target systems within networks.
  These services are commonly used as legitimate technical support software, and may be allowed by application control within a target environment.
  Remote access tools like VNC, Ammyy, and Teamviewer are used frequently when compared with other legitimate software commonly used by adversaries. (Citation: Symantec Living off the Land)
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1219/T1219.md#atomic-test-4---gotoassist-files-detected-test-on-windows
author: frack113
date: 2022-02-13
tags:
- attack.command-and-control
- attack.t1219
logsource:
  category: file_event
  product: windows
detection:
  selection:
    TargetFilename|contains: '\AppData\Local\Temp\LogMeInInc\GoToAssist Remote Support
      Expert\'
  condition: selection
falsepositives:
- Legitimate use
level: medium
notes: |
  n
  ### Technical Context
  This detection rule identifies the presence of GoToAssist temporary installation artifacts on Windows systems, specifically targeting files created in the temporary application data directory associated with LogMeIn Inc.'s GoToAssist Remote Support tool. The rule focuses on the `TargetFilename` field, looking for occurrences of paths that contain `\AppData\Local\Temp\LogMeInInc\GoToAssist Remote Support Expert\`. Since remote access tools like GoToAssist can be exploited by adversaries for establishing command and control (C2) channels, detecting their artifacts can signify potential malicious activity. Since these applications are often allowed within enterprise environments due to their legitimate use cases, organizations need to carefully evaluate alerts generated by this rule to avoid false positives.
  ### Investigation Steps
  - Query your EDR solution to identify all processes that accessed the detected file paths to assess if they were executed by an authorized user or process.
  - Review the command-line parameters used during the execution of the identified processes to gather context on their purpose and potential misuse.
  - Check logs from the NGFW or Proxy to uncover any external connections established by the GoToAssist process, as these could indicate command and control activity.
  - Analyze cloud service logs from AWS, GCP, or Azure if applicable, to investigate any related activities or configurations involving remote access tools within your cloud environment.
