title: Suspicious DotNET CLR Usage Log Artifact
id: e0b06658-7d1d-4cd3-bf15-03467507ff7c
related:
- id: 4508a70e-97ef-4300-b62b-ff27992990ea
  type: derived
- id: e4b63079-6198-405c-abd7-3fe8b0ce3263
  type: obsolete
status: test
description: Detects the creation of Usage Log files by the CLR (clr.dll). These files
  are named after the executing process once the assembly is finished executing for
  the first time in the (user) session context.
references:
- https://bohops.com/2021/03/16/investigating-net-clr-usage-log-tampering-techniques-for-edr-evasion/
- https://github.com/olafhartong/sysmon-modular/blob/fa1ae53132403d262be2bbd7f17ceea7e15e8c78/11_file_create/include_dotnet.xml
- https://web.archive.org/web/20221026202428/https://gist.github.com/code-scrap/d7f152ffcdb3e0b02f7f394f5187f008
- https://web.archive.org/web/20230329154538/https://blog.menasec.net/2019/07/interesting-difr-traces-of-net-clr.html
author: frack113, omkar72, oscd.community, Wojciech Lesicki
date: 2022-11-18
modified: 2023-02-23
tags:
- attack.defense-evasion
- attack.t1218
logsource:
  category: file_event
  product: windows
  definition: 'Requirements: UsageLogs folder must be monitored by the sysmon configuration'
detection:
  selection:
    TargetFilename|endswith:
    - '\UsageLogs\cmstp.exe.log'
    - '\UsageLogs\cscript.exe.log'
    - '\UsageLogs\mshta.exe.log'
    - '\UsageLogs\msxsl.exe.log'
    - '\UsageLogs\regsvr32.exe.log'
    - '\UsageLogs\rundll32.exe.log'
    - '\UsageLogs\svchost.exe.log'
    - '\UsageLogs\wscript.exe.log'
    - '\UsageLogs\wmic.exe.log'
  filter_main_rundll32:
        # This filter requires the event to be enriched by additional information such as ParentImage and CommandLine activity
    ParentImage|endswith: '\MsiExec.exe'
    ParentCommandLine|contains: ' -Embedding'
    Image|endswith: '\rundll32.exe'
    CommandLine|contains|all:
    - 'Temp'
    - 'zzzzInvokeManagedCustomActionOutOfProc'
  condition: selection and not 1 of filter_main_*
falsepositives:
- Rundll32.exe with zzzzInvokeManagedCustomActionOutOfProc in command line and msiexec.exe
  as parent process - https://twitter.com/SBousseaden/status/1388064061087260675
level: high
notes: |
  ### Technical Context
  The Sigma rule titled "Suspicious DotNET CLR Usage Log Artifact" is designed to identify potentially malicious behaviors involving the .NET Common Language Runtime (CLR) in a Windows environment. Specifically, it focuses on detecting the creation of Usage Log files pertaining to various executable processes that utilize CLR, such as `cmstp.exe`, `cscript.exe`, and `rundll32.exe`. These log files are created when the assembly finishes executing and are named after the executing process, signaling unusual execution patterns that may indicate evasion tactics employed by threat actors. 
  The rule leverages file event logs captured through Windows Sysmon, particularly the file creation events from the UsageLogs directory. By monitoring the logs for specific file names and analyzing process hierarchies (including parent process and command line parameters), the detection is able to filter out benign instances and spotlight suspicious activity that correlates with known evasion techniques.
  ### Investigation Steps
  - Utilize EDR tools to query for `rundll32.exe` processes, specifically filtering for instances with command line arguments including `-Embedding` and patterns indicating interaction with `MsiExec.exe`.
  - Investigate the UsageLogs directory on affected systems to identify any recent log file creation, noting the associated timestamps and executable names.
  - Review the processes leading to log creation in the Sysmon logs, focusing on relevant parent-child relationships to evaluate the legitimacy of the detected activity.
  - Cross-reference detected instances with threat intelligence databases to assess any known malicious indicators associated with the identified commands or processes.
