title: Uncommon File Created In Office Startup Folder
id: a10a2c40-2c4d-49f8-b557-1a946bc55d9d
status: test
description: Detects the creation of a file with an uncommon extension in an Office
  application startup folder
references:
- https://app.any.run/tasks/d6fe6624-6ef8-485d-aa75-3d1bdda2a08c/
- http://addbalance.com/word/startup.htm
- https://answers.microsoft.com/en-us/msoffice/forum/all/document-in-word-startup-folder-doesnt-open-when/44ab0932-2917-4150-8cdc-2f2cf39e86f3
- https://en.wikipedia.org/wiki/List_of_Microsoft_Office_filename_extensions
author: frack113, Nasreddine Bencherchali (Nextron Systems)
date: 2022-06-05
modified: 2023-12-13
tags:
- attack.resource-development
- attack.t1587.001
logsource:
  product: windows
  category: file_event
detection:
  selection_word_paths:
  - TargetFilename|contains: '\Microsoft\Word\STARTUP'
  - TargetFilename|contains|all:
    - '\Office'
    - '\Program Files'
    - '\STARTUP'
  filter_exclude_word_ext:
    TargetFilename|endswith:
    - '.docb'         # Word binary document introduced in Microsoft Office 2007
    - '.docm'         # Word macro-enabled document; same as docx, but may contain macros and scripts
    - '.docx'         # Word document
    - '.dotm'         # Word macro-enabled template; same as dotx, but may contain macros and scripts
    - '.mdb'         # MS Access DB
    - '.mdw'         # MS Access DB
    - '.pdf'         # PDF documents
    - '.wll'         # Word add-in
    - '.wwl'         # Word add-in
  selection_excel_paths:
  - TargetFilename|contains: '\Microsoft\Excel\XLSTART'
  - TargetFilename|contains|all:
    - '\Office'
    - '\Program Files'
    - '\XLSTART'
  filter_exclude_excel_ext:
    TargetFilename|endswith:
    - '.xll'
    - '.xls'
    - '.xlsm'
    - '.xlsx'
    - '.xlt'
    - '.xltm'
    - '.xlw'
  filter_main_office_click_to_run:
    Image|contains: ':\Program Files\Common Files\Microsoft Shared\ClickToRun\'
    Image|endswith: '\OfficeClickToRun.exe'
  filter_main_office_apps:
    Image|contains:
    - ':\Program Files\Microsoft Office\'
    - ':\Program Files (x86)\Microsoft Office\'
    Image|endswith:
    - '\winword.exe'
    - '\excel.exe'
  condition: ((selection_word_paths and not filter_exclude_word_ext) or (selection_excel_paths
    and not filter_exclude_excel_ext)) and not 1 of filter_main_*
falsepositives:
- False positive might stem from rare extensions used by other Office utilities.
level: high
notes: |
  ### Technical Context
  This Sigma rule is designed to detect the creation of files with uncommon extensions within Microsoft Office application startup folders. Specifically, it focuses on the `STARTUP` directory for Microsoft Word and Excel, both located in the standard Office installation paths. The rule looks for file events where a newly created file doesn't match common Office document extensions, such as `.docx` or `.xlsx`, which may indicate potential malicious activity such as the execution of unauthorized macros or scripts. The detection mechanism utilizes file event logs from Windows to monitor the creation of files and checks them against predefined criteria regarding their locations and extensions.
  By ensuring that only files with uncommon extensions trigger alerts, responders can effectively filter out benign activity while focusing on incidents that may warrant further investigation. This rule is particularly important in a corporate environment where Office file formats are ubiquitous, and any unusual behavior within these application startup folders can be indicative of an attempt to leverage Office software for malicious purposes.
  ### Investigation Steps
  - Review file creation events in the company’s EDR solution to identify the specific process that created the uncommon file and its associated command-line parameters.
  - Check the logs of Microsoft Office applications in use to determine if the detected file was accessed or executed, which could suggest further malicious activity.
  - Analyze the context around the file creation by correlating events within the SIEM to identify any suspicious user behavior or relationships between multiple alerts involving the same user.
  - Investigate the network activity using NDR logs to see if any known files or domains associated with malicious Office exploits were contacted following the creation of the file.
