title: Potential Homoglyph Attack Using Lookalike Characters in Filename
id: 4f1707b1-b50b-45b4-b5a2-3978b5a5d0d6
status: test
description: |
  Detects the presence of unicode characters which are homoglyphs, or identical in appearance, to ASCII letter characters.
  This is used as an obfuscation and masquerading techniques. Only "perfect" homoglyphs are included; these are characters that
  are indistinguishable from ASCII characters and thus may make excellent candidates for homoglyph attack characters.
references:
- https://redcanary.com/threat-detection-report/threats/socgholish/#threat-socgholish
- http://www.irongeek.com/homoglyph-attack-generator.php
author: Micah Babinski, @micahbabinski
date: 2023-05-08
tags:
- attack.defense-evasion
- attack.t1036
- attack.t1036.003
    # - attack.t1036.008
logsource:
  category: file_event
  product: windows
detection:
  selection_upper:
    TargetFilename|contains:
    - "А"              # А/A
    - "В"              # В/B
    - "Е"              # Е/E
    - "К"              # К/K
    - "М"              # М/M
    - "Н"              # Н/H
    - "О"              # О/O
    - "Р"              # Р/P
    - "С"              # С/C
    - "Т"              # Т/T
    - "Х"              # Х/X
    - "Ѕ"              # Ѕ/S
    - "І"              # І/I
    - "Ј"              # Ј/J
    - "Ү"              # Ү/Y
    - "Ӏ"              # Ӏ/I
    - "Ԍ"              # Ԍ/G
    - "Ԛ"              # Ԛ/Q
    - "Ԝ"              # Ԝ/W
    - "Α"              # Α/A
    - "Β"              # Β/B
    - "Ε"              # Ε/E
    - "Ζ"              # Ζ/Z
    - "Η"              # Η/H
    - "Ι"              # Ι/I
    - "Κ"              # Κ/K
    - "Μ"              # Μ/M
    - "Ν"              # Ν/N
    - "Ο"              # Ο/O
    - "Ρ"              # Ρ/P
    - "Τ"              # Τ/T
    - "Υ"              # Υ/Y
    - "Χ"              # Χ/X
  selection_lower:
    TargetFilename|contains:
    - "а"              # а/a
    - "е"              # е/e
    - "о"              # о/o
    - "р"              # р/p
    - "с"              # с/c
    - "х"              # х/x
    - "ѕ"              # ѕ/s
    - "і"              # і/i
    - "ӏ"              # ӏ/l
    - "ј"              # ј/j
    - "һ"              # һ/h
    - "ԁ"              # ԁ/d
    - "ԛ"              # ԛ/q
    - "ԝ"              # ԝ/w
    - "ο"              # ο/o
  condition: 1 of selection_*
falsepositives:
- File names with legitimate Cyrillic text. Will likely require tuning (or not be
  usable) in countries where these alphabets are in use.
level: medium
notes: |
  ### Technical Context
  The detection rule identifies potential homoglyph attacks by analyzing filenames for the presence of Unicode characters that closely resemble ASCII letters, known as homoglyphs. These characters are visually indistinguishable from their ASCII counterparts, making it possible for attackers to obfuscate their activities or deceive users. The rule leverages file event logs from Windows systems, specifically focusing on the `TargetFilename` field to detect filenames containing specific upper and lower-case homoglyphs. This functionality allows the SOC to recognize potential attacks that utilize these visual trickery techniques, enhancing the overall defense against obfuscation and masquerading tactics that may be leveraged in malicious activities.
  ### Investigation Steps
  - Review file event logs in your EDR solution to identify instances of the detected filenames containing homoglyphs.
  - Analyze the context of the processes associated with the identified filenames, including the parent process and execution path, to determine whether the activity appears suspicious.
  - Check for related network traffic in your NDR tool that could indicate command-and-control communication or data exfiltration attempts linked to the potential attack.
  - Conduct a search through your AV/Endpoint security logs to see if the identified files have been flagged or quarantined as malicious, and assess the impact on systems and data.
