title: CSExec Service File Creation
id: f0e2b768-5220-47dd-b891-d57b96fc0ec1
status: test
description: Detects default CSExec service filename which indicates CSExec service
  installation and execution
references:
- https://github.com/malcomvetter/CSExec
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023-08-04
tags:
- attack.execution
- attack.t1569.002
- attack.s0029
logsource:
  category: file_event
  product: windows
detection:
  selection:
    TargetFilename|endswith: '\csexecsvc.exe'
  condition: selection
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  The "CSExec Service File Creation" rule detects the creation of a specific file associated with the CSExec tool, a popular utility used for executing processes on remote systems. The rule triggers when it identifies a file named `csexecsvc.exe`, which is the default filename used by CSExec when it installs as a service. This type of behavior is indicative of potential unauthorized access or lateral movement within a network, as CSExec can be exploited by attackers to execute commands remotely and gain further control over systems. The primary technical data sources involved in this detection are file event logs generated by Windows, specifically monitoring the creation of service-related executable files.
  ### Investigation Steps
  - Check EDR logs for any recent activity or unusual process execution related to the `csexecsvc.exe` file to identify potential malicious behavior.
  - Review the system's service management logs to confirm if the CSExec service is running and assess its start time, associated user account, and other properties.
  - Examine network traffic logs through the NDR to identify any connections made by the host where the CSExec service is installed, focusing on unusual external destinations or ports.
  - Analyze user activity logs in the cloud (if applicable) to determine if any administrative actions correlate with the timing of the service creation, indicating potential misuse.
