title: HackTool - SafetyKatz Dump Indicator
id: e074832a-eada-4fd7-94a1-10642b130e16
status: test
description: Detects default lsass dump filename generated by SafetyKatz.
references:
- https://github.com/GhostPack/SafetyKatz
- https://github.com/GhostPack/SafetyKatz/blob/715b311f76eb3a4c8d00a1bd29c6cd1899e450b7/SafetyKatz/Program.cs#L63
author: Markus Neis
date: 2018-07-24
modified: 2024-06-27
tags:
- attack.credential-access
- attack.t1003.001
logsource:
  category: file_event
  product: windows
detection:
  selection:
    TargetFilename|endswith: '\Temp\debug.bin'
  condition: selection
falsepositives:
- Rare legitimate files with similar filename structure
level: high
notes: |
  ### Technical Context
  The Sigma rule titled "HackTool 
  - SafetyKatz Dump Indicator" is designed to detect instances of a specific file creation activity associated with the SafetyKatz tool, which is often used for credential dumping. The rule specifically looks for files named "debug.bin" created in the Windows temporary directory, a common dumping location for malicious tools. By monitoring file events related to processes that generate this filename, the detection mechanism identifies potential unauthorized attempts to extract sensitive information from the Local Security Authority Subsystem Service (LSASS). Data sources leveraged typically include file event logs that capture attributes such as the filename, file path, and process information, enabling analysts to determine if malicious behavior is occurring.
  ### Investigation Steps
  - Review file event logs to confirm the creation of a file named "debug.bin" under the "\Temp" directory, noting the associated user and process details.
  - Utilize Endpoint Detection and Response (EDR) tools to correlate the event with any suspicious processes that might have invoked the creation of the file, paying attention to command-line arguments.
  - Check antivirus (AV) logs or alerts for any detections related to SafetyKatz or similar credential dumping tools that may indicate prior or concurrent malicious activity.
  - Analyze network traffic logs from NGFW or Proxy solutions to identify any outgoing connections from the host that may correlate with data exfiltration attempts following the creation of the suspicious file.
