title: PowerShell Module File Created By Non-PowerShell Process
id: e3845023-ca9a-4024-b2b2-5422156d5527
status: test
description: Detects the creation of a new PowerShell module ".psm1", ".psd1", ".dll",
  ".ps1", etc. by a non-PowerShell process
references:
- Internal Research
- https://learn.microsoft.com/en-us/powershell/scripting/developer/module/understanding-a-windows-powershell-module?view=powershell-7.3
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023-05-09
modified: 2023-10-18
tags:
- attack.persistence
logsource:
  category: file_event
  product: windows
detection:
  selection:
    TargetFilename|contains:
    - '\WindowsPowerShell\Modules\'
    - '\PowerShell\7\Modules\'
  filter_main_pwsh:
    Image|endswith:
    - ':\Program Files\PowerShell\7-preview\pwsh.exe'
    - ':\Program Files\PowerShell\7\pwsh.exe'
    - ':\Windows\System32\poqexec.exe'         # https://github.com/SigmaHQ/sigma/issues/4448
    - ':\Windows\System32\WindowsPowerShell\v1.0\powershell_ise.exe'
    - ':\Windows\System32\WindowsPowerShell\v1.0\powershell.exe'
    - ':\Windows\SysWOW64\poqexec.exe'         # https://github.com/SigmaHQ/sigma/issues/4448
    - ':\Windows\SysWOW64\WindowsPowerShell\v1.0\powershell_ise.exe'
    - ':\Windows\SysWOW64\WindowsPowerShell\v1.0\powershell.exe'
  condition: selection and not 1 of filter_main_*
falsepositives:
- Unknown
level: medium
notes: |
  n
  ### Technical Context
  This Sigma rule identifies the creation of PowerShell module files (e.g., `.psm1`, `.psd1`, `.dll`, and `.ps1`) by processes that are not PowerShell executable files. Such activities may indicate potential abuse or malicious use of PowerShell modules, particularly when initiated by non-standard processes. The detection leverages file event logs on Windows systems, specifically monitoring for target filenames that indicate the location of PowerShell modules being created. The rule's efficacy is particularly based on distinguishing between legitimate PowerShell processes and those initiated by potentially adversarial entities. This aligns with the MITRE ATT&CK framework under the tactic of Persistence and the technique of using legitimate tools for malicious purposes (T1546).
  ### Investigation Steps
  - **Check Process Source:** Investigate the process that triggered this alert by using EDR logs to identify the originating process and its parent process. Look for unusual or unknown executable names that might not be part of the authorized software inventory.
    
  - **Review File Creation Details:** Access file event logs to review the creation time and attributes of the detected PowerShell module files. Ensure they are not part of legitimate IT operations or scheduled maintenance activities.
    
  - **Analyze Command Line Arguments:** Utilize the Sysmon logs to evaluate command-line parameters used by the suspicious process. Pay attention to any parameters that indicate abnormal behavior or scripted interactions with the file system.
    
  - **Consult Security Alerts:** Examine AV and proxy logs for alerts or anomalies associated with the suspicious process and file creations. Cross-reference with threat intelligence to determine if the process or created files have known risks.
  ### Prioritization
  The medium severity level for this alert indicates that while the creation of PowerShell modules by non-PowerShell processes may not be an immediate threat, it represents a potential pivot point for an adversary to maintain persistence and should be investigated promptly.
  ### Blind Spots and Assumptions
  This rule may not fire in environments where legitimate applications create PowerShell modules, or if the execution context for PowerShell is altered in a way that bypasses standard detection mechanisms. Additionally, if adversaries use PowerShell processes to create these files directly or support applications that allow it, the rule could fail to capture the malicious activity. Engineers should understand that sophisticated adversaries may also manipulate process names to evade detection.
  > **Disclaimer:** This investigation guide was created using generative AI technology and has not been reviewed for its accuracy and relevance. While every effort has been made to ensure its quality, we recommend validating the content and adapting it to suit specific environment and operational needs. Please communicate any changes to the detection engineering team.
