title: BloodHound Collection Files
id: 02773bed-83bf-469f-b7ff-e676e7d78bab
status: test
description: Detects default file names outputted by the BloodHound collection tool
  SharpHound
references:
- https://academy.hackthebox.com/course/preview/active-directory-bloodhound/bloodhound--data-collection
author: C.J. May
date: 2022-08-09
modified: 2023-03-29
tags:
- attack.discovery
- attack.t1087.001
- attack.t1087.002
- attack.t1482
- attack.t1069.001
- attack.t1069.002
- attack.execution
- attack.t1059.001
logsource:
  product: windows
  category: file_event
detection:
  selection:
    TargetFilename|endswith:
    - 'BloodHound.zip'
    - '_computers.json'
    - '_containers.json'
    - '_domains.json'
    - '_gpos.json'
    - '_groups.json'
    - '_ous.json'
    - '_users.json'
  filter_optional_ms_winapps:
    Image|endswith: '\svchost.exe'
    TargetFilename|startswith: 'C:\Program Files\WindowsApps\Microsoft.'
    TargetFilename|endswith: '\pocket_containers.json'
  condition: selection and not 1 of filter_optional_*
falsepositives:
- Some false positives may arise in some environment and this may require some tuning.
  Add additional filters or reduce level depending on the level of noise
level: high
notes: |
  ### Technical Context
  The "BloodHound Collection Files" detection rule identifies suspicious file creation activity associated with the BloodHound tool, specifically its data collection component, SharpHound. This tool is often used by attackers to map out Active Directory environments and gather information for unauthorized access or lateral movement. The rule targets specific default file names produced during the data collection process, such as 'BloodHound.zip', '_computers.json', and '_users.json'. These filenames are indicative of potential reconnaissance efforts against the organization’s Active Directory structure. The key log source for this rule is Windows file event logs, which capture details about file creation activities, including the filenames in question and their paths.
  ### Investigation Steps
  - Use the EDR tool to identify the processes that created the detected files, checking for any associated suspicious behavior or unusual process execution.
  - Review file access logs for the same timeframe to determine any unauthorized access attempts or other related file activity by the same user or system.
  - Investigate the network traffic logs via the NDR system to see if there were any outbound connections to known malicious IPs or domains following the detection of the BloodHound files.
  - Check user and device activity in the SIEM or Active Directory logs to confirm whether the user account demonstrated any unusual behavior or was compromised during the collection period.
