title: Anydesk Temporary Artefact
id: 0b9ad457-2554-44c1-82c2-d56a99c42377
status: test
description: |
  An adversary may use legitimate desktop support and remote access software, such as Team Viewer, Go2Assist, LogMein, AmmyyAdmin, etc, to establish an interactive command and control channel to target systems within networks.
  These services are commonly used as legitimate technical support software, and may be allowed by application control within a target environment.
  Remote access tools like VNC, Ammyy, and Teamviewer are used frequently when compared with other legitimate software commonly used by adversaries. (Citation: Symantec Living off the Land)
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1219/T1219.md#atomic-test-2---anydesk-files-detected-test-on-windows
author: frack113
date: 2022-02-11
modified: 2024-07-20
tags:
- attack.command-and-control
- attack.t1219
logsource:
  category: file_event
  product: windows
detection:
  selection:
    TargetFilename|contains:
    - '\AppData\Roaming\AnyDesk\user.conf'
    - '\AppData\Roaming\AnyDesk\system.conf'
  condition: selection
falsepositives:
- Legitimate use
level: medium
notes: |
  ### Technical Context
  The "Anydesk Temporary Artefact" Sigma rule is designed to detect the presence of configuration files associated with the AnyDesk remote access software on Windows systems. Specifically, it identifies file events that include `user.conf` and `system.conf` located within the `AppData\Roaming\AnyDesk` directory. These files may signify that an adversary is using AnyDesk as a remote access tool to establish a command-and-control channel. Remote access software is often blended within a network environment for legitimate purposes, but its misuse can indicate nefarious activity. Detection of these artifacts can trigger an investigation into whether AnyDesk is being employed maliciously, particularly if it deviates from normal operational patterns.
  ### Investigation Steps
  - Examine recent file event logs within the EDR to identify when the AnyDesk configuration files were created or modified, along with the associated user account.
  - Use process creation logs to determine if AnyDesk has been executed from the detected file paths, noting any abnormal command-line parameters that could signify exploitation.
  - Review firewall and proxy logs for outbound connections from AnyDesk applications to external IP addresses that may not correspond to known or legitimate services.
  - Correlate findings with user activity from internal VPN logs to detect any anomalous remote access patterns that might indicate unauthorized access.
