title: Windows Shell/Scripting Application File Write to Suspicious Folder
id: 1277f594-a7d1-4f28-a2d3-73af5cbeab43
status: test
description: Detects Windows shells and scripting applications that write files to
  suspicious folders
references:
- Internal Research
author: Florian Roth (Nextron Systems)
date: 2021-11-20
modified: 2023-03-29
tags:
- attack.execution
- attack.t1059
logsource:
  category: file_event
  product: windows
detection:
  selection_1:
    Image|endswith:
    - '\bash.exe'
    - '\cmd.exe'
    - '\cscript.exe'
    - '\msbuild.exe'          # https://github.com/elastic/detection-rules/blob/c76a39796972ecde44cb1da6df47f1b6562c9770/rules/windows/defense_evasion_execution_msbuild_started_by_office_app.toml
    - '\powershell.exe'
    - '\pwsh.exe'
    - '\sh.exe'
    - '\wscript.exe'
    TargetFilename|startswith:
    - 'C:\PerfLogs\'
    - 'C:\Users\Public\'
  selection_2:
    Image|endswith:
    - '\certutil.exe'
    - '\forfiles.exe'
    - '\mshta.exe'
            # - '\rundll32.exe' # Potential FP
    - '\schtasks.exe'
    - '\scriptrunner.exe'
    - '\wmic.exe'          # https://app.any.run/tasks/c903e9c8-0350-440c-8688-3881b556b8e0/
    TargetFilename|contains:
    - 'C:\PerfLogs\'
    - 'C:\Users\Public\'
    - 'C:\Windows\Temp\'
  condition: 1 of selection_*
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This detection rule is designed to identify potentially malicious activity involving Windows shells and scripting applications that write files to predefined suspicious directories, such as `C:\PerfLogs\`, `C:\Users\Public\`, and `C:\Windows\Temp\`. The rule examines file event logs specifically targeting actions performed by well-known command-line utilities and scripting engines, including `cmd.exe`, `PowerShell`, and `certutil.exe`, among others. By analyzing file write events, particularly in directories often exploited by attackers for data manipulation or evasion, the rule aims to flag unusual behavior that might indicate a security incident. The underlying data sources include Windows file event logs, allowing for detection of file creations and modifications linked to suspicious processes.
  ### Investigation Steps
  - Review alerts in the SIEM for instances of file write operations to suspicious folders identified in the rule, noting the associated user and process.
  - Use EDR tools to examine the execution history of flagged processes, identifying any preceding commands or scripts that may indicate malicious intent.
  - Investigate any labeled processes in the AV logs to determine if they have triggered any security alerts or were flagged for malicious behavior.
  - Query VPN and cloud logs, if applicable, to assess whether the affected systems have exhibited unusual outbound traffic patterns following the detection of suspicious file writes.
