title: Windows Terminal Profile Settings Modification By Uncommon Process
id: 9b64de98-9db3-4033-bd7a-f51430105f00
status: test
description: Detects the creation or modification of the Windows Terminal Profile
  settings file "settings.json" by an uncommon process.
references:
- https://github.com/redcanaryco/atomic-red-team/blob/74438b0237d141ee9c99747976447dc884cb1a39/atomics/T1547.015/T1547.015.md#atomic-test-1---persistence-by-modifying-windows-terminal-profile
- https://twitter.com/nas_bench/status/1550836225652686848
author: frack113, Nasreddine Bencherchali (Nextron Systems)
date: 2023-07-22
tags:
- attack.persistence
- attack.t1547.015
logsource:
  product: windows
  category: file_event
detection:
  selection:
    Image|endswith:
            # Note: Add other potential common applications
    - '\cmd.exe'
    - '\cscript.exe'
    - '\mshta.exe'
    - '\powershell.exe'
    - '\pwsh.exe'
    - '\wscript.exe'
    TargetFilename|endswith: '\AppData\Local\Packages\Microsoft.WindowsTerminal_8wekyb3d8bbwe\LocalState\settings.json'
  condition: selection
falsepositives:
- Some false positives may occur with admin scripts that set WT settings.
level: medium
notes: |
  ### Technical Context
  This rule detects suspicious modifications to the Windows Terminal's profile settings file, `settings.json`, which is critical for user configuration. The rule specifically identifies when this file is created or altered by processes that are not commonly associated with such changes, including `cmd.exe`, `cscript.exe`, `mshta.exe`, `powershell.exe`, `pwsh.exe`, and `wscript.exe`. The presence of these uncommon processes making changes can indicate malicious behavior, such as an attempt to persistently modify terminal settings for nefarious purposes. The detection operates on file event logs that detail when files are created or modified, specifically targeting the path where Windows Terminal settings are stored.
  ### Investigation Steps
  - Review EDR logs to identify the process that initiated the modification of `settings.json`, paying special attention to the command-line arguments used during execution.
  - Check for other related file events in the same directory to understand if this modification is part of a broader manipulation of terminal settings or configurations.
  - Use the AV tool to scan the uncommon process and its parent processes for known malware signatures or behaviors.
  - Examine proxy logs for any unusual outbound connections made by the modifying process, which may reveal attempts to communicate with external command and control infrastructure.
