title: Creation of a Diagcab
id: 3d0ed417-3d94-4963-a562-4a92c940656a
status: test
description: Detects the creation of diagcab file, which could be caused by some legitimate
  installer or is a sign of exploitation (review the filename and its location)
references:
- https://threadreaderapp.com/thread/1533879688141086720.html
author: frack113
date: 2022-06-08
tags:
- attack.resource-development
logsource:
  product: windows
  category: file_event
detection:
  selection:
    TargetFilename|endswith: '.diagcab'
  condition: selection
falsepositives:
- Legitimate microsoft diagcab
level: medium
notes: |
  ### Technical Context
  This detection rule identifies the creation of files with the `.diagcab` extension on Windows systems. Diagcab files are typically used by Microsoft for diagnostics and support, and while they may arise from legitimate software installations, they can also signify exploit attempts or malware activity attempting to gain persistence or stealth. The rule looks for events generated by file system activity, specifically targeting the creation of files that end with the `.diagcab` extension. Analyzing the context around the filename and its location is crucial, as malicious actors may use valid file types in suspicious directories to evade detection.
  ### Investigation Steps
  - Review the file creation logs in the EDR to determine the process that initiated the creation of the `.diagcab` file, correlating it with any known legitimate applications.
  - Check the file’s location to assess whether it resides in a typical directory for Microsoft diagnostics or an unusual, potentially malicious directory.
  - Use the AV solution to scan the newly created diagcab file for known malware signatures or indicators of compromise.
  - Investigate network activity related to the process that created the file by querying the Proxy and NDR logs for anomalous outbound connections shortly after the file creation event.
