title: HackTool - Inveigh Execution Artefacts
id: bb09dd3e-2b78-4819-8e35-a7c1b874e449
status: test
description: Detects the presence and execution of Inveigh via dropped artefacts
references:
- https://github.com/Kevin-Robertson/Inveigh/blob/29d9e3c3a625b3033cdaf4683efaafadcecb9007/Inveigh/Support/Output.cs
- https://github.com/Kevin-Robertson/Inveigh/blob/29d9e3c3a625b3033cdaf4683efaafadcecb9007/Inveigh/Support/Control.cs
- https://thedfirreport.com/2020/11/23/pysa-mespinoza-ransomware/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-10-24
modified: 2024-06-27
tags:
- attack.command-and-control
- attack.t1219
logsource:
  product: windows
  category: file_event
detection:
  selection:
    TargetFilename|endswith:
    - '\Inveigh-Log.txt'
    - '\Inveigh-Cleartext.txt'
    - '\Inveigh-NTLMv1Users.txt'
    - '\Inveigh-NTLMv2Users.txt'
    - '\Inveigh-NTLMv1.txt'
    - '\Inveigh-NTLMv2.txt'
    - '\Inveigh-FormInput.txt'
    - '\Inveigh.dll'
    - '\Inveigh.exe'
    - '\Inveigh.ps1'
    - '\Inveigh-Relay.ps1'
  condition: selection
falsepositives:
- Unlikely
level: critical
notes: |
  ### Technical Context
  This Sigma rule is designed to detect the execution of Inveigh, a tool commonly used for man-in-the-middle attacks and credential harvesting by monitoring specific file artifacts created during its operation. The rule specifically looks for file events on a Windows system that correspond to the output logs and executable components associated with Inveigh, such as `Inveigh-Log.txt`, `Inveigh.exe`, and `Inveigh.ps1`. When these files are created or modified, it indicates that the Inveigh tool may have been executed, potentially signaling malicious activity. The data sources involved in this detection are primarily file event logs generated by the operating system, which provide insight into file access and manipulation activities.
  ### Investigation Steps
  - Check the EDR for the execution history of `Inveigh.exe` or related scripts to confirm whether the tool was run on the system and gather additional context about its usage.
  - Examine the contents of the detected log files (e.g., `Inveigh-Log.txt`) for any suspicious activity or unusual patterns related to network traffic or authentication attempts.
  - Review firewall and proxy logs for unusual outbound connections that may indicate data exfiltration attempts or communications with known malicious IP addresses associated with Inveigh.
  - Assess any user accounts involved in the activity for signs of compromise, such as credential abuse or anomalies in login behavior across other systems and services in the enterprise environment.
