title: File With Uncommon Extension Created By An Office Application
id: c7a74c80-ba5a-486e-9974-ab9e682bc5e4
status: test
description: Detects the creation of files with an executable or script extension
  by an Office application.
references:
- https://thedfirreport.com/2021/03/29/sodinokibi-aka-revil-ransomware/
- https://github.com/vadim-hunter/Detection-Ideas-Rules/blob/02bcbfc2bfb8b4da601bb30de0344ae453aa1afe/Threat%20Intelligence/The%20DFIR%20Report/20210329_Sodinokibi_(aka_REvil)_Ransomware.yaml
author: Vadim Khrykov (ThreatIntel), Cyb3rEng (Rule), Nasreddine Bencherchali (Nextron
  Systems)
date: 2021-08-23
modified: 2023-06-22
tags:
- attack.t1204.002
- attack.execution
logsource:
  product: windows
  category: file_event
detection:
    # Note: Please add more file extensions to the logic of your choice.
  selection1:
    Image|endswith:
    - '\excel.exe'
    - '\msaccess.exe'
    - '\mspub.exe'
    - '\powerpnt.exe'
    - '\visio.exe'
    - '\winword.exe'
  selection2:
    TargetFilename|endswith:
    - '.bat'
    - '.cmd'
    - '.com'
    - '.dll'
    - '.exe'
    - '.hta'
    - '.ocx'
    - '.proj'
    - '.ps1'
    - '.scf'
    - '.scr'
    - '.sys'
    - '.vbe'
    - '.vbs'
    - '.wsf'
    - '.wsh'
  filter_optional_webservicecache:   # matches e.g. directory with name *.microsoft.com
    TargetFilename|contains|all:
    - 'C:\Users\'
    - '\AppData\Local\Microsoft\Office\'
    - '\WebServiceCache\AllUsers'
    TargetFilename|endswith: '.com'
  filter_optional_webex:
    Image|endswith: '\winword.exe'
    TargetFilename|contains: '\AppData\Local\Temp\webexdelta\'
    TargetFilename|endswith:
    - '.dll'
    - '.exe'
  filter_main_localassembly:
    TargetFilename|contains: '\AppData\Local\assembly\tmp\'
    TargetFilename|endswith: '.dll'
  condition: all of selection* and not 1 of filter_main_* and not 1 of filter_optional_*
falsepositives:
- Unknown
level: high
notes: |
  n
  ### Technical Context
  This detection rule identifies the creation of files with uncommon executable or script extensions by legitimate Microsoft Office applications, such as Excel or Word. It specifically monitors the Windows file event logs for instances where these applications generate files with extensions that are not typical for standard documents, such as `.exe`, `.bat`, `.ps1`, among others. The rule operates on the premise that malicious actors may leverage trusted applications to create or execute potentially harmful files without triggering traditional security controls. The relevant MITRE ATT&CK technique associated with this rule is T1204.002: User Execution, which highlights the importance of user interaction in the execution of malicious code.
  ### Investigation Steps
  - **Validate the Source of the Creation Alert:** Use EDR tools to trace the process tree from the detected file creation back to the Office application, confirming the context and legitimacy of the operation.
  - **Assess the Created File:** Search for the created file in the file system and check its properties, including digital signatures and hashes, to evaluate if it is a known malicious file or exhibits suspicious characteristics.
  - **Review User Activity:** Check user logs and file access history in the Windows Security logs to determine if the user was targeted or if there was unusual behavior correlated with the file creation event.
  - **Track Network Connections:** Utilize network logs to investigate whether the created file attempted to communicate externally or interact with known malicious domains or IP addresses to further assess its threat level.
  ### Prioritization
  Given the high severity level of this alert, it indicates a potential misuse of trusted applications to execute harmful scripts, making it critical to investigate promptly given the high-risk profile associated with such occurrences.
  ### Blind Spots and Assumptions
  This rule may not trigger in scenarios where a malicious actor exploits an Office application without creating an uncommon file extension, or if the file creation occurs via copied legitimate documents adjusted to incorporate harmful payloads. Additionally, it assumes that logging is enabled for relevant activity; if users do not have the Office apps listed, or if the extensions monitored are not exhaustive, potential threats might evade detection.
  > **Disclaimer:** This investigation guide was created using generative AI technology and has not been reviewed for its accuracy and relevance. While every effort has been made to ensure its quality and clarity, we recommend validating the content and adapting it to suit specific environment and operational needs. Please communicate any changes to the detection engineering team.
