title: Suspicious LNK Double Extension File Created
id: 3215aa19-f060-4332-86d5-5602511f3ca8
related:
- id: b4926b47-a9d7-434c-b3a0-adc3fa0bd13e
  type: derived
status: test
description: |
  Detects the creation of files with an "LNK" as a second extension. This is sometimes used by malware as a method to abuse the fact that Windows hides the "LNK" extension by default.
references:
- https://www.crowdstrike.com/blog/meet-crowdstrikes-adversary-of-the-month-for-june-mustang-panda/
- https://www.anomali.com/blog/china-based-apt-mustang-panda-targets-minority-groups-public-and-private-sector-organizations
- https://www.cybereason.com/blog/research/a-bazar-of-tricks-following-team9s-development-cycles
- https://twitter.com/malwrhunterteam/status/1235135745611960321
- https://twitter.com/luc4m/status/1073181154126254080
author: Nasreddine Bencherchali (Nextron Systems), frack113
date: 2022-11-07
modified: 2023-10-18
tags:
- attack.defense-evasion
- attack.t1036.007
logsource:
  category: file_event
  product: windows
detection:
  selection:
    TargetFilename|endswith: '.lnk'
    TargetFilename|contains:
    - '.doc.'
    - '.docx.'
    - '.jpg.'
    - '.pdf.'
    - '.ppt.'
    - '.pptx.'
    - '.xls.'
    - '.xlsx.'
  filter_main_recent:
    TargetFilename|contains: '\AppData\Roaming\Microsoft\Windows\Recent\'
  filter_optional_office_recent:
    Image|endswith:
            # Note: Some additional office application might need to be added
    - '\excel.exe'
    - '\powerpnt.exe'
    - '\winword.exe'
    TargetFilename|contains: '\AppData\Roaming\Microsoft\Office\Recent\'
  filter_optional_office_excel:
    Image|endswith: '\excel.exe'
    TargetFilename|contains: '\AppData\Roaming\Microsoft\Excel'
  filter_optional_office_powerpoint:
    Image|endswith: '\powerpnt.exe'
    TargetFilename|contains: '\AppData\Roaming\Microsoft\PowerPoint'
  filter_optional_office_word:
    Image|endswith: '\winword.exe'
    TargetFilename|contains: '\AppData\Roaming\Microsoft\Word'
  condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
falsepositives:
- Some tuning is required for other general purpose directories of third party apps
level: medium
notes: |
  ### Technical Context
  This detection rule identifies suspicious file creation involving Windows shortcut files (LNK) that possess an additional extension (e.g., .doc.lnk or .pdf.lnk). Attackers often exploit the fact that Windows conceals file extensions by default to trick users into executing malicious files disguised as legitimate documents or images. The rule specifically targets files that are created within the user’s Recent Items directories, including those for Microsoft Office applications and common document formats. By analyzing logs generated from file events, the detection engine looks for instances where files that end in ".lnk" also contain potential document extensions in their names, while ensuring they are not typical usage by filtering out legitimate directories.
  ### Investigation Steps
  - Review EDR logs to identify the creation event of the suspicious LNK files and check the process that created them for any anomalies.
  - Analyze the command-line parameters associated with the process creation to determine if they indicate malicious intent or unusual behavior.
  - Inspect proxy logs to track any outbound connections that may have originated from the executing process, which can help identify data exfiltration efforts.
  - Utilize AV logs to see if the identified files or associated processes were flagged for any malicious activity, providing further insight into the potential threat.
