title: Suspicious File Creation Activity From Fake Recycle.Bin Folder
id: cd8b36ac-8e4a-4c2f-a402-a29b8fbd5bca
related:
- id: 5ce0f04e-3efc-42af-839d-5b3a543b76c0
  type: derived
status: test
description: Detects file write event from/to a fake recycle bin folder that is often
  used as a staging directory for malware
references:
- https://www.mandiant.com/resources/blog/infected-usb-steal-secrets
- https://unit42.paloaltonetworks.com/cloaked-ursa-phishing/
author: X__Junior (Nextron Systems)
date: 2023-07-12
modified: 2023-12-11
tags:
- attack.persistence
- attack.defense-evasion
logsource:
  category: file_event
  product: windows
detection:
  selection:
  - Image|contains:
              # e.g. C:\$RECYCLER.BIN
    - 'RECYCLERS.BIN\'
    - 'RECYCLER.BIN\'
  - TargetFilename|contains:
              # e.g. C:\$RECYCLER.BIN
    - 'RECYCLERS.BIN\'
    - 'RECYCLER.BIN\'
  condition: selection
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  The Sigma rule "Suspicious File Creation Activity From Fake Recycle.Bin Folder" is designed to detect anomalous file write events to directories masquerading as Windows recycle bins, specifically targeting paths such as `C:\$RECYCLER.BIN\`. This detection focuses on identifying potential malware staging activities, as malicious actors often use misleading folder names to hide their actions from detection mechanisms. The rule checks for file events involving both the source (where the files are being written from) and target filenames that are consistent with a fake recycle bin directory. The primary data sources involved in this detection include file event logs from Windows systems, which capture relevant details about file creations, modifications, and deletions. 
  ### Investigation Steps
  - Review the process creation logs in your EDR solution to identify the processes responsible for the file creation events in the suspicious recycle bin folders.
  - Examine command-line parameters associated with the processes to gather additional context regarding the actions being performed and whether they are legitimate or potentially malicious.
  - Cross-reference the time of the detected events with user activity logs to identify any irregular access patterns or unauthorized attempts to modify system files.
  - Utilize your AV or NGFW solutions to perform a scan on the affected systems and check for known signatures or behaviors associated with malware linked to such fake recycle bin activities.
