title: Creation Of Non-Existent System DLL
id: df6ecb8b-7822-4f4b-b412-08f524b4576c
related:
- id: 6b98b92b-4f00-4f62-b4fe-4d1920215771     # ImageLoad rule
  type: similar
status: test
description: |
  Detects the creation of system DLLs that are usually not present on the system (or at least not in system directories).
  Usually this technique is used to achieve DLL hijacking.
references:
- https://decoded.avast.io/martinchlumecky/png-steganography/
- https://posts.specterops.io/lateral-movement-scm-and-dll-hijacking-primer-d2f61e8ab992
- https://clement.notin.org/blog/2020/09/12/CVE-2020-7315-McAfee-Agent-DLL-injection/
- https://github.com/Wh04m1001/SysmonEoP
- https://www.hexacorn.com/blog/2013/12/08/beyond-good-ol-run-key-part-5/
- https://github.com/blackarrowsec/redteam-research/tree/26e6fc0c0d30d364758fa11c2922064a9a7fd309/LPE%20via%20StorSvc
author: Nasreddine Bencherchali (Nextron Systems), fornotes
date: 2022-12-01
modified: 2024-01-10
tags:
- attack.defense-evasion
- attack.persistence
- attack.privilege-escalation
- attack.t1574.001
- attack.t1574.002
logsource:
  product: windows
  category: file_event
detection:
  selection:
    TargetFilename|endswith:
    - ':\Windows\System32\TSMSISrv.dll'
    - ':\Windows\System32\TSVIPSrv.dll'
    - ':\Windows\System32\wbem\wbemcomn.dll'
    - ':\Windows\System32\WLBSCTRL.dll'
    - ':\Windows\System32\wow64log.dll'
    - ':\Windows\System32\WptsExtensions.dll'
    - '\SprintCSP.dll'
  condition: selection
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  This rule is designed to detect the creation of non-existent system Dynamic Link Libraries (DLLs) that are typically not found in standard Windows system directories. Attackers often leverage this technique for DLL hijacking, where they create malicious DLLs to be loaded in place of legitimate ones. The rule specifically looks for file creation events targeting specific filenames that are known to be either non-standard or potentially harmful system DLLs. The primary data sources involved in detection are file creation logs from the Windows system, which provide insight into any unauthorized modifications to critical directories such as `C:\Windows\System32`. By monitoring file events, this rule aims to identify potentially malicious behavior indicative of an impending attack or security breach.
  ### Investigation Steps
  - Review EDR logs to correlate the creation of the suspicious DLL files with any recent process activities, particularly for processes with elevated privileges.
  - Check the timeline of changes using Windows file integrity monitoring tools to identify when the DLLs were created and any associated parent process activity.
  - Analyze AV logs for any detections related to the created DLLs or the parent process, which may give context to their legitimacy.
  - Investigate network activity using Proxy and NDR logs to identify any unusual outbound connections or data exfiltration attempts following the DLL creation timestamps.
