title: PowerShell Profile Modification
id: b5b78988-486d-4a80-b991-930eff3ff8bf
status: test
description: Detects the creation or modification of a powershell profile which could
  indicate suspicious activity as the profile can be used as a mean of persistence
references:
- https://www.welivesecurity.com/2019/05/29/turla-powershell-usage/
- https://persistence-info.github.io/Data/powershellprofile.html
author: HieuTT35, Nasreddine Bencherchali (Nextron Systems)
date: 2019-10-24
modified: 2023-10-23
tags:
- attack.persistence
- attack.privilege-escalation
- attack.t1546.013
logsource:
  product: windows
  category: file_event
detection:
  selection:
    TargetFilename|endswith:
    - '\Microsoft.PowerShell_profile.ps1'
    - '\PowerShell\profile.ps1'
    - '\Program Files\PowerShell\7-preview\profile.ps1'
    - '\Program Files\PowerShell\7\profile.ps1'
    - '\Windows\System32\WindowsPowerShell\v1.0\profile.ps1'
    - '\WindowsPowerShell\profile.ps1'
  condition: selection
falsepositives:
- System administrator creating Powershell profile manually
level: medium
notes: |
  ### Technical Context
  The "PowerShell Profile Modification" detection rule focuses on identifying the creation or modification of specific PowerShell profile scripts on Windows systems. These profile scripts can be leveraged by attackers for persistence and to execute malicious commands whenever PowerShell is initiated. The rule monitors events related to file modifications in commonly used PowerShell profile paths. By leveraging file event logs, specifically targeting files with names like `Microsoft.PowerShell_profile.ps1` and other similar profile scripts, the rule can effectively surface suspicious alterations. This is particularly relevant in the context of the MITRE ATT&CK framework, specifically under the tactics of persistence (T1546.013), where adversaries may employ PowerShell for executing and maintaining scripts that ensure continued access to a system.
  ### Investigation Steps
  - **Check EDR for Process Activity**: Look into the EDR logs for any PowerShell executable processes that initiated around the time of the profile modification. Pay close attention to any command-line parameters that may indicate suspicious activities.
  - **Review Windows Security Logs**: Examine Windows Security logs for any user account activity or logon events that coincide with the timing of the profile modification. This can help identify irregular user behavior or unauthorized access.
  - **Correlate with Network Traffic**: Utilize NDR tools to analyze outbound network connections from the affected host around the time of the event. This can help identify if any unusual external communications occurred following the modification.
  - **Inspect for Additional File Modifications**: Look for other recent file changes in the PowerShell directories. Check if there are any other scripts or executables being created or modified that could indicate broader malicious activity.
  ### Prioritization
  This alert is assigned a medium severity level due to the potential for standard system administration practices to create false positives. However, the creation or modification of PowerShell profiles can also signify a more sinister attempt to maintain persistence on compromised systems, necessitating prompt investigation.
  ### Blind spots and Assumptions
  The rule may not trigger in scenarios where administrators intentionally create or modify profiles for legitimate purposes, leading to false positives. Additionally, if an adversary uses stealth techniques or renames scripts to avoid detection, the rule might not capture these modifications. It's assumed that environments may have differing configurations in terms of PowerShell profiles, and variations in user permissions might also influence the detection efficacy. Other patterns of persistence may also bypass this monitoring, necessitating additional detection capabilities to capture a broader range of anomalous behaviors.
  > **Disclaimer:** This investigation guide was created using generative AI technology and has not been reviewed for its accuracy and relevance. While every effort has been made to ensure its quality, we recommend validating the content and adapting it to suit specific environment and operational needs. Please communicate any changes to the detection engineering team.
