title: NTDS.DIT Creation By Uncommon Process
id: 11b1ed55-154d-4e82-8ad7-83739298f720
related:
- id: 4e7050dd-e548-483f-b7d6-527ab4fa784d
  type: similar
status: test
description: Detects creation of a file named "ntds.dit" (Active Directory Database)
  by an uncommon process or a process located in a suspicious directory
references:
- https://stealthbits.com/blog/extracting-password-hashes-from-the-ntds-dit-file/
- https://adsecurity.org/?p=2398
author: Florian Roth (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)
date: 2022-01-11
modified: 2022-07-14
tags:
- attack.credential-access
- attack.t1003.002
- attack.t1003.003
logsource:
  product: windows
  category: file_event
detection:
  selection_ntds:
    TargetFilename|endswith: '\ntds.dit'
  selection_process_img:
    Image|endswith:
            # Add more suspicious processes as you see fit
    - '\cmd.exe'
    - '\cscript.exe'
    - '\mshta.exe'
    - '\powershell.exe'
    - '\pwsh.exe'
    - '\regsvr32.exe'
    - '\rundll32.exe'
    - '\wscript.exe'
    - '\wsl.exe'
    - '\wt.exe'
  selection_process_paths:
    Image|contains:
    - '\AppData\'
    - '\Temp\'
    - '\Public\'
    - '\PerfLogs\'
  condition: selection_ntds and 1 of selection_process_*
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This detection rule targets the creation of a file named "ntds.dit," which is critical as it represents the Active Directory database. The rule is designed to identify instances where this file is created by processes that are either uncommon or located in suspicious directories. By monitoring file event logs on Windows systems, the detection focuses on entries where the target filename ends with "ntds.dit." Additionally, it looks for the invocation of specific processes (like `cmd.exe`, `powershell.exe`, etc.) that are known to be used in various attack vectors. The rule further narrows down potential threats by checking if these processes originate from directories commonly exploited by malicious actors, such as `AppData` or `Temp`. By focusing on these criteria, the rule helps in identifying potential credential access attempts and the misuse of the Active Directory.
  ### Investigation Steps
  - Use EDR tools to examine the process tree related to the detected event, ensuring identification of the parent and child processes involved in the creation of the "ntds.dit" file.
  - Review command-line arguments associated with the suspicious processes to understand the context and intent behind their execution that triggered the alert.
  - Check file system logs or antivirus logs to determine if there are any previous alerts or actions taken against the identified process or file path, which may indicate a malicious history.
  - Analyze network traffic logs from the NGFW or Proxy to ascertain whether there was any unusual outbound communication associated with the process that created the "ntds.dit" file, as this could indicate exfiltration attempts.
