title: Wmiprvse Wbemcomn DLL Hijack - File
id: 614a7e17-5643-4d89-b6fe-f9df1a79641c
status: test
description: Detects a threat actor creating a file named `wbemcomn.dll` in the `C:\Windows\System32\wbem\`
  directory over the network and loading it for a WMI DLL Hijack scenario.
references:
- https://threathunterplaybook.com/hunts/windows/201009-RemoteWMIWbemcomnDLLHijack/notebook.html
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
date: 2020-10-12
modified: 2022-12-02
tags:
- attack.execution
- attack.t1047
- attack.lateral-movement
- attack.t1021.002
logsource:
  product: windows
  category: file_event
detection:
  selection:
    Image: System
    TargetFilename|endswith: '\wbem\wbemcomn.dll'
  condition: selection
falsepositives:
- Unknown
level: critical
notes: |
  ### Technical Context
  This Sigma rule is designed to detect malicious behavior associated with Windows Management Instrumentation (WMI) DLL hijacking, specifically focusing on the unauthorized creation of a file named `wbemcomn.dll` in the `C:\Windows\System32\wbem\` directory. The detection is triggered when processes from the System account attempt to create or modify this targeted DLL file, a behavior commonly exploited by threat actors to execute arbitrary code through WMI. The key data sources for this rule are file event logs that capture file creation and modification activities, particularly those associated with sensitive system directories.
  In scenarios where an attacker successfully builds a WMI DLL hijack, they can leverage the legitimate functionality of WMI to carry out lateral movement or execute commands on remote systems. Consequently, early detection of this activity is crucial for the rapid identification and mitigation of potential security incidents within the environment.
  ### Investigation Steps
  - Review EDR logs for any recent file creation events that reference `C:\Windows\System32\wbem\wbemcomn.dll` initiated from the System account.
  - Correlate this alert with process creation logs to identify any unusual or unauthorized processes that executed around the same time as the file creation event.
  - Inspect network traffic logs to determine if there were any external connections or lateral movement attempts related to WMI services, particularly those using RPC.
  - Analyze Windows event logs for any abnormal WMI activity, such as unexpected execution of WMI commands or scripts that may indicate an exploitation attempt.
