title: Suspicious MSExchangeMailboxReplication ASPX Write
id: 7280c9f3-a5af-45d0-916a-bc01cb4151c9
status: test
description: Detects suspicious activity in which the MSExchangeMailboxReplication
  process writes .asp and .apsx files to disk, which could be a sign of ProxyShell
  exploitation
references:
- https://redcanary.com/blog/blackbyte-ransomware/
author: Florian Roth (Nextron Systems)
date: 2022-02-25
tags:
- attack.initial-access
- attack.t1190
- attack.persistence
- attack.t1505.003
logsource:
  product: windows
  category: file_event
detection:
  selection:
    Image|endswith: '\MSExchangeMailboxReplication.exe'
    TargetFilename|endswith:
    - '.aspx'
    - '.asp'
  condition: selection
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This detection rule identifies potentially malicious behavior associated with the `MSExchangeMailboxReplication.exe` process, specifically when it writes files with `.aspx` and `.asp` extensions to disk. These file types can be utilized in web-based attacks, including those targeting Microsoft Exchange servers, often indicative of ProxyShell exploits. The rule leverages file event logs to track when these suspicious file write operations occur. By monitoring the actions of the MSExchangeMailboxReplication process, the rule aims to uncover unusual activities that could signal an ongoing compromise of the Exchange environment.
  ### Investigation Steps
  - Review the EDR logs to identify the execution context of `MSExchangeMailboxReplication.exe`, including parent processes and execution timestamps. This can help determine whether the process was initiated under unusual circumstances.
  - Examine file event logs for any newly created `.aspx` or `.asp` files, noting their location and the timestamps of their creation. Look for abnormal file paths that do not align with standard Exchange configurations.
  - Analyze network traffic associated with the specific Exchange server during the time of the detected event using NDR tools. This may reveal additional indicators of compromise, such as unexpected outbound connections.
  - Consult proxy logs to identify any unusual web requests made from the compromised Exchange server, particularly those that may involve accessing newly created `.aspx` or `.asp` files. This can help further understand the nature of the threat and any potential data exfiltration.
