title: Suspicious Creation TXT File in User Desktop
id: caf02a0a-1e1c-4552-9b48-5e070bd88d11
status: test
description: Ransomware create txt file in the user Desktop
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1486/T1486.md#atomic-test-5---purelocker-ransom-note
author: frack113
date: 2021-12-26
tags:
- attack.impact
- attack.t1486
logsource:
  product: windows
  category: file_event
detection:
  selection:
    Image|endswith: '\cmd.exe'
    TargetFilename|contains|all:
    - '\Users\'
    - '\Desktop\'
    TargetFilename|endswith: '.txt'
  condition: selection
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This Sigma rule is designed to detect suspicious activities where a text file (with a `.txt` extension) is created on a user's desktop, potentially indicative of ransomware behavior. The rule focuses on events generated by Windows file activity, specifically logs that detail file creation actions undertaken by the command-line interface (`cmd.exe`). By targeting the creation of `.txt` files within the desktop directories of user profiles, the rule leverages file event logs to identify situations where a ransomware strain may be utilized to drop ransom notes or to collect sensitive data.
  The detection mechanism looks for specific patterns in the file creation events, where the process responsible is `cmd.exe`, and the target filename includes the path to the user’s desktop and ends with '.txt'. The presence of these characteristics indicates a high likelihood of malicious intent, triggering an alert for further investigation.
  ### Investigation Steps
  - Review EDR logs for the process tree to identify the parent process of `cmd.exe` and determine how the command line was executed.
  - Check the file creation timestamp and correlate it with other user activities in the Proxy logs to assess potential context surrounding the file's creation.
  - Analyze related file events to look for unusual modifications or behaviors around the time the `.txt` file was created and check for other file types generated simultaneously.
  - Search antivirus logs for any alerts that were triggered regarding ransomware behavior on the user's system around the same timeframe as the detected creation event.
