title: ScreenConnect Temporary Installation Artefact
id: fec96f39-988b-4586-b746-b93d59fd1922
status: test
description: |
  An adversary may use legitimate desktop support and remote access software, such as Team Viewer, Go2Assist, LogMein, AmmyyAdmin, etc, to establish an interactive command and control channel to target systems within networks.
  These services are commonly used as legitimate technical support software, and may be allowed by application control within a target environment.
  Remote access tools like VNC, Ammyy, and Teamviewer are used frequently when compared with other legitimate software commonly used by adversaries. (Citation: Symantec Living off the Land)
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1219/T1219.md#atomic-test-5---screenconnect-application-download-and-install-on-windows
author: frack113
date: 2022-02-13
tags:
- attack.command-and-control
- attack.t1219
logsource:
  category: file_event
  product: windows
detection:
  selection:
    TargetFilename|contains: '\Bin\ScreenConnect.'     # pattern to dll and jar file
  condition: selection
falsepositives:
- Legitimate use
level: medium
notes: |
  ### Technical Context
  This Sigma rule is designed to detect the installation of ScreenConnect, a remote access tool, which can be exploited by adversaries to establish command-and-control channels within target environments. The rule specifically looks for file events that indicate the presence of installation artifacts related to ScreenConnect, checking for filenames that contain '\Bin\ScreenConnect.' within Windows file logs. By analyzing these file events, the rule aims to uncover unauthorized use of legitimate remote desktop tools, which can easily blend in with normal operational activity, making them a common target for malicious exploits. Consequently, organizations must be vigilant about the use of such software, as it may facilitate unauthorized access to systems.
  ### Investigation Steps
  - Review the file event logs in the EDR solution to identify the specific instances where the file path containing `\Bin\ScreenConnect.` was accessed or modified.
  - Investigate the processes associated with the installation to determine if the application was installed as part of normal operations or if it resulted from unauthorized activities.
  - Check the network logs through the NGFW or NDR to identify outbound connections to remote servers associated with ScreenConnect, which may indicate command-and-control activity.
  - Look through user access logs in the Proxy to identify any additional interactions with remote access tools and determine whether legitimate use is documented for the affected accounts.
