title: DHCP Server Loaded the CallOut DLL
id: 13fc89a9-971e-4ca6-b9dc-aa53a445bf40
status: test
description: This rule detects a DHCP server in which a specified Callout DLL (in
  registry) was loaded
references:
- https://blog.3or.de/mimilib-dhcp-server-callout-dll-injection.html
- https://technet.microsoft.com/en-us/library/cc726884(v=ws.10).aspx
- https://msdn.microsoft.com/de-de/library/windows/desktop/aa363389(v=vs.85).aspx
author: Dimitrios Slamaris
date: 2017-05-15
modified: 2022-12-25
tags:
- attack.defense-evasion
- attack.t1574.002
logsource:
  product: windows
  service: system
detection:
  selection:
    EventID: 1033
    Provider_Name: Microsoft-Windows-DHCP-Server
  condition: selection
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This detection rule targets malicious activity associated with DHCP servers, specifically tracking the loading of a certain Callout DLL as indicated in the Windows Event Viewer. The rule flags events where the Event ID 1033 occurs, which is logged when a DHCP server loads a Callout DLL, an action that can signify potential exploitation or misuse of the DHCP service. The Callout DLLs can be exploited to redirect network traffic or execute unauthorized commands, thereby facilitating various malicious activities. The analysis of this event draws primarily from system logs on Windows-based DHCP servers, ensuring that any anomalies related to the loading of these DLLs are promptly investigated.
  ### Investigation Steps
  - Review the Windows Event Logs for Event ID 1033 on the DHCP server to confirm the loading of the suspicious Callout DLL.
  - Investigate the Registry settings to determine the legitimacy and origin of the loaded Callout DLL, focusing on its path and any associated behaviors.
  - Use the Endpoint Detection and Response (EDR) tool to examine process executions and network connections made around the time the Event ID was logged, to identify any unusual or unauthorized activities.
  - Check firewall and proxy logs for any unusual outbound connections initiated by the DHCP server that might indicate further malicious behavior or data exfiltration attempts.
