title: DHCP Server Error Failed Loading the CallOut DLL
id: 75edd3fd-7146-48e5-9848-3013d7f0282c
status: test
description: This rule detects a DHCP server error in which a specified Callout DLL
  (in registry) could not be loaded
references:
- https://blog.3or.de/mimilib-dhcp-server-callout-dll-injection.html
- https://technet.microsoft.com/en-us/library/cc726884(v=ws.10).aspx
- https://msdn.microsoft.com/de-de/library/windows/desktop/aa363389(v=vs.85).aspx
author: 'Dimitrios Slamaris, @atc_project (fix)'
date: 2017-05-15
modified: 2022-12-25
tags:
- attack.defense-evasion
- attack.t1574.002
logsource:
  product: windows
  service: system
detection:
  selection:
    EventID:
    - 1031
    - 1032
    - 1034
    Provider_Name: Microsoft-Windows-DHCP-Server
  condition: selection
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This Sigma rule is designed to detect errors generated by a Windows DHCP server when it fails to load a specified Callout Dynamic-Link Library (DLL). The rule focuses on specific event IDs, namely 1031, 1032, and 1034, which are logged by the Microsoft-Windows-DHCP-Server provider. These event IDs indicate issues with the DHCP service, particularly with the loading of Callout DLLs, which are often used for extending the functionality of the DHCP server. If a Callout DLL cannot be loaded as intended, it may indicate potential misuse or exploitation of the DHCP service, often associated with attempts to manipulate network behavior or perform malicious activities. Detecting such errors can help security teams identify and respond to potential threats or misconfigurations in the network environment.
  ### Investigation Steps
  - Review the triggered event logs from the Windows Event Viewer for the DHCP server to gain insight into the specific error details and the corresponding Callout DLL.
  - Use Endpoint Detection and Response (EDR) tools to analyze processes related to the DHCP server around the time of the alerts for any unusual behavior or unauthorized modifications.
  - Conduct a review of network logs, including DHCP lease assignments and traffic patterns, to identify any anomalies that may correlate with the detected errors.
  - Investigate any recent changes made to the DHCP server's configuration or installed DLLs using change management records or configuration logs.
