title: Eventlog Cleared
id: a62b37e0-45d3-48d9-a517-90c1a1b0186b
related:
- id: f2f01843-e7b8-4f95-a35a-d23584476423
  type: obsolete
- id: d99b79d2-0a6f-4f46-ad8b-260b6e17f982
  type: derived
- id: 100ef69e-3327-481c-8e5c-6d80d9507556
  type: derived
status: test
description: One of the Windows Eventlogs has been cleared. e.g. caused by "wevtutil
  cl" command execution
references:
- https://twitter.com/deviouspolack/status/832535435960209408
- https://www.hybrid-analysis.com/sample/027cc450ef5f8c5f653329641ec1fed91f694e0d229928963b30f6b0d7d3a745?environmentId=100
author: Florian Roth (Nextron Systems)
date: 2017-01-10
modified: 2023-11-15
tags:
- attack.defense-evasion
- attack.t1070.001
- car.2016-04-002
logsource:
  product: windows
  service: system
detection:
  selection:
    EventID: 104
    Provider_Name: 'Microsoft-Windows-Eventlog'
  filter_main_covered:
        # The channels below are already covered by the rule 100ef69e-3327-481c-8e5c-6d80d9507556
    Channel:
    - 'Microsoft-Windows-PowerShell/Operational'
    - 'Microsoft-Windows-Sysmon/Operational'
    - 'PowerShellCore/Operational'
    - 'Security'
    - 'System'
    - 'Windows PowerShell'
  condition: selection and not 1 of filter_main_*
falsepositives:
- Rollout of log collection agents (the setup routine often includes a reset of the
  local Eventlog)
- System provisioning (system reset before the golden image creation)
level: medium
notes: |
  ### Technical Context
  This Sigma rule is designed to detect the clearing of Windows Event Logs, specifically through the execution of the command "wevtutil cl", which can indicate malicious activity aimed at obscuring evidence of prior actions on the system. The rule identifies instances where Event ID 104 is generated by the Microsoft-Windows-Eventlog provider, signaling that an event log has been cleared. The rule ensures that it's not triggered by specific common log-clearing operations that are already monitored by other rules, such as those related to PowerShell or Sysmon operational logs, thereby reducing false positives. The rule requires an examination of Windows System logs, which are vital for understanding potential security incidents.
  ### Investigation Steps
  - Review the EDR for any recent execution of the "wevtutil" command and identify the user or process responsible for this action. 
  - Check application logs to confirm if any administrative actions were performed that might explain the clearing of logs, such as maintenance or software updates.
  - Analyze network traffic via the NDR tool to detect any unusual remote connections or data exfiltration attempts that coincide with the time of the log clearance.
  - Inspect other relevant logs (e.g., AV or Proxy logs) for any signs of suspicious activity preceding the log clearing event that may indicate a broader attack pattern.
