title: Loading Diagcab Package From Remote Path
id: 50cb47b8-2c33-4b23-a2e9-4600657d9746
status: test
description: Detects loading of diagcab packages from a remote path, as seen in DogWalk
  vulnerability
references:
- https://twitter.com/nas_bench/status/1539679555908141061
- https://twitter.com/j00sean/status/1537750439701225472
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-08-14
tags:
- attack.execution
logsource:
  product: windows
  service: diagnosis-scripted
detection:
  selection:
    EventID: 101
    PackagePath|contains: '\\\\'     # Example would be: \\webdav-test.herokuapp.com@ssl\DavWWWRoot\package
  condition: selection
falsepositives:
- Legitimate package hosted on a known and authorized remote location
level: high
notes: |
  ### Technical Context
  The Sigma rule "Loading Diagcab Package From Remote Path" identifies potential malicious activity involving the loading of diagnostic cabinet (diagcab) packages from remote locations, specifically through UNC paths, which can indicate exploitation attempts related to known vulnerabilities like DogWalk. This rule is primarily based on Windows Event ID 101 and monitors events generated by the Windows diagnosis background service. When a diagcab package is loaded from a remote path (e.g., an external URL using WebDAV), the rule activates to flag this potentially risky behavior. Such activities can undermine system integrity as attackers may utilize remote packages to deploy malicious payloads or exfiltrate sensitive information.
  ### Investigation Steps
  - Review EDR logs to trace the process execution path associated with the Event ID 101, focusing on the command-line parameters to identify the specific remote package being accessed.
  - Validate the source of the diagcab package by querying network logs in the NGFW or Proxy to determine if the remote path is known and trusted or if it poses a security risk.
  - Analyze file system activities and file creation times using EDR to confirm if any unauthorized files have been downloaded or executed corresponding to the detected event.
  - Conduct a review using SIEM to correlate this alert with any other suspicious activities or alerts that occurred concurrently, assessing the broader context of potential security incidents.
