title: Remove Exported Mailbox from Exchange Webserver
id: 09570ae5-889e-43ea-aac0-0e1221fb3d95
status: test
description: Detects removal of an exported Exchange mailbox which could be to cover
  tracks from ProxyShell exploit
references:
- https://github.com/rapid7/metasploit-framework/blob/1416b5776d963f21b7b5b45d19f3e961201e0aed/modules/exploits/windows/http/exchange_proxyshell_rce.rb#L430
author: Christian Burkard (Nextron Systems)
date: 2021-08-27
modified: 2023-01-23
tags:
- attack.defense-evasion
- attack.t1070
logsource:
  service: msexchange-management
  product: windows
detection:
  keywords:
    '|all':
    - 'Remove-MailboxExportRequest'
    - ' -Identity '
    - ' -Confirm "False"'
  condition: keywords
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  The detection rule titled "Remove Exported Mailbox from Exchange Webserver" is designed to identify the activity of removing an exported mailbox from Microsoft Exchange servers. This action can indicate an attempt to cover tracks following a ProxyShell exploit, which allows unauthorized access to Exchange servers. The rule monitors logs from the Microsoft Exchange management service, specifically looking for command-line activities related to "Remove-MailboxExportRequest" along with its identifiable parameters, such as '-Identity' and '-Confirm "False"'. By analyzing these specific keywords in the logs, security teams can proactively detect potential misuse or malicious activities targeting Exchange environments.
  ### Investigation Steps
  - Review recent Exchange management logs to identify instances of the "Remove-MailboxExportRequest" command being executed. Check for the specific identifiers used in the command to understand which mailboxes were targeted.
  - Correlate the timestamps of the detected activity with other logs (e.g., EDR and VPN logs) to assess if there were suspicious logins or unusual activities around the same time.
  - Utilize incident response tools to analyze the system's state during the event, focusing on any running processes or network connections that could indicate compromise.
  - Check the user accounts involved in the mailbox removal for anomalies, such as abnormal authentication events or permissions that should not exist.
