title: ProxyLogon MSExchange OabVirtualDirectory
id: 550d3350-bb8a-4ff3-9533-2ba533f4a1c0
status: test
description: Detects specific patterns found after a successful ProxyLogon exploitation
  in relation to a Commandlet invocation of Set-OabVirtualDirectory
references:
- https://bi-zone.medium.com/hunting-down-ms-exchange-attacks-part-1-proxylogon-cve-2021-26855-26858-27065-26857-6e885c5f197c
author: Florian Roth (Nextron Systems)
date: 2021-08-09
modified: 2023-01-23
tags:
- attack.t1587.001
- attack.resource-development
logsource:
  product: windows
  service: msexchange-management
detection:
  keywords_cmdlet:
    '|all':
    - 'OabVirtualDirectory'
    - ' -ExternalUrl '
  keywords_params:
  - 'eval(request'
  - 'http://f/<script'
  - '"unsafe"};'
  - 'function Page_Load()'
  condition: keywords_cmdlet and keywords_params
falsepositives:
- Unlikely
level: critical
notes: |
  ### Technical Context
  The ProxyLogon MSExchange OabVirtualDirectory detection rule targets specific patterns indicative of malicious activities following a successful exploitation of Microsoft Exchange servers via ProxyLogon vulnerabilities. This rule specifically monitors for the invocation of the Set-OabVirtualDirectory commandlet with suspicious command-line parameters. The rule works by analyzing logs from the Microsoft Exchange management service, focusing on keyword patterns that may signal unauthorized configuration changes or potential web shell deployments, such as invocation of URLs and script functions. By correlating these specific commandlet usages with distinctive parameter patterns, the rule aims to uncover ongoing attacks that exploit misconfigurations and vulnerabilities in the Exchange infrastructure.
  ### Investigation Steps
  - Investigate the Exchange management logs for the timestamp associated with the alert to identify any related commandlet executions and changes to the OAB (Offline Address Book) virtual directory.
  - Correlate EDR events to ascertain if any processes associated with the suspicious commandlet invocation exhibit unusual behavior or indications of compromise, such as the execution of unrecognized scripts.
  - Use the SIEM to identify any anomalous network traffic patterns originating from the Exchange server around the time of the alert, paying particular attention to outbound connections that may indicate data exfiltration.
  - Check cloud logs from Azure or other utilized cloud services for any changes or accesses made to Exchange resources during the same timeframe to determine if there has been any unauthorized access from external sources.
