title: Failed MSExchange Transport Agent Installation
id: c7d16cae-aaf3-42e5-9c1c-fb8553faa6fa
status: test
description: Detects a failed installation of a Exchange Transport Agent
references:
- https://speakerdeck.com/heirhabarov/hunting-for-persistence-via-microsoft-exchange-server-or-outlook?slide=8
author: Tobias Michalski (Nextron Systems)
date: 2021-06-08
modified: 2022-07-12
tags:
- attack.persistence
- attack.t1505.002
logsource:
  service: msexchange-management
  product: windows
    # warning: The 'data' field used in the detection section is the container for the event data as a whole. You may have to adapt the rule for your backend accordingly
detection:
  selection:
    EventID: 6
    Data|contains: 'Install-TransportAgent'
  condition: selection
fields:
- AssemblyPath
falsepositives:
- Legitimate installations of exchange TransportAgents. AssemblyPath is a good indicator
  for this.
level: high
notes: |
  ### Technical Context
  This detection rule is focused on identifying failed installation attempts of Microsoft Exchange Transport Agents, a potential indicator of malicious activity aimed at gaining persistence within an Exchange environment. The rule triggers upon the detection of specific event logs, specifically Event ID 6, which captures installation events within the Microsoft Exchange Management service. The rule further refines this by looking for instances where the data contains the phrase 'Install-TransportAgent', which indicates that an attempt was made to install a transport agent. The primary data source for this detection is the Windows event logs related to the Microsoft Exchange server environment, specifically those generated by the management service.
  ### Investigation Steps
  - Review the EDR logs for any related process creation entries around the time of the failed installation to identify originating applications and user accounts.
  - Cross-reference the timestamps of the failed installations with any suspicious logins or abnormal behavior captured in the AV logs to ascertain if there is a correlation with a potential compromise.
  - Check the transport agent assembly paths in the event logs against known legitimate software to eliminate false positives.
  - Analyze proxy logs to inspect outbound traffic during the failed installation time to verify any unexpected connections that might indicate further compromise attempts.
