title: Exchange Set OabVirtualDirectory ExternalUrl Property
id: 9db37458-4df2-46a5-95ab-307e7f29e675
status: test
description: Rule to detect an adversary setting OabVirtualDirectory External URL
  property to a script in Exchange Management log
references:
- https://twitter.com/OTR_Community/status/1371053369071132675
author: Jose Rodriguez @Cyb3rPandaH
date: 2021-03-15
modified: 2023-01-23
tags:
- attack.persistence
- attack.t1505.003
logsource:
  product: windows
  service: msexchange-management
detection:
  keywords:
    '|all':
    - 'Set-OabVirtualDirectory'
    - 'ExternalUrl'
    - 'Page_Load'
    - 'script'
  condition: keywords
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This Sigma rule is designed to detect potential adversarial activity within Exchange Management logs by monitoring for modifications to the OabVirtualDirectory's ExternalUrl property. Specifically, the rule flags instances where the ExternalUrl is set to a script, indicating possible manipulation or a malicious redirection method by an attacker. This kind of alteration may be associated with persistence mechanisms, as it allows unauthorized external scripts to be executed under the guise of legitimate Exchange behavior. The rule leverages data from the Exchange Management logs, capturing key commands such as `Set-OabVirtualDirectory` and parameters like `ExternalUrl`, focusing on instances involving the keyword 'script' to pinpoint potentially harmful changes.
  ### Investigation Steps
  - Review Exchange Management logs for instances of the command `Set-OabVirtualDirectory`, specifically noting changes to the `ExternalUrl` property that include a `script` reference.
  - Utilize EDR tools to analyze related process activities and ensure no unauthorized or suspicious scripts are being executed from the Exchange server environment.
  - Check network traffic logs via the NGFW to monitor for any outbound connections initiated from the affected OabVirtualDirectory that may suggest data exfiltration or communication with malicious infrastructure.
  - Investigate user activity logs to determine if the changes were made by authorized personnel, and assess any legitimacy behind the access rights of the user who executed the command.
