title: MSExchange Transport Agent Installation - Builtin
id: 4fe151c2-ecf9-4fae-95ae-b88ec9c2fca6
related:
- id: 83809e84-4475-4b69-bc3e-4aad8568612f
  type: derived
status: test
description: Detects the Installation of a Exchange Transport Agent
references:
- https://speakerdeck.com/heirhabarov/hunting-for-persistence-via-microsoft-exchange-server-or-outlook?slide=7
author: Tobias Michalski (Nextron Systems)
date: 2021-06-08
modified: 2022-11-27
tags:
- attack.persistence
- attack.t1505.002
logsource:
  product: windows
  service: msexchange-management
detection:
  selection:
  - 'Install-TransportAgent'
  condition: selection
fields:
- AssemblyPath
falsepositives:
- Legitimate installations of exchange TransportAgents. AssemblyPath is a good indicator
  for this.
level: medium
notes: |
  ### Technical Context
  The MSExchange Transport Agent Installation detection rule focuses on identifying unauthorized or suspicious installations of Exchange Transport Agents within a Microsoft Exchange environment. Transport Agents are components that allow for the customization of message processing, and their installation can indicate potential malicious activity aimed at leveraging Exchange for persistence or other nefarious purposes. This rule monitors process logs from the Microsoft Exchange management service, specifically looking for execution of the command `Install-TransportAgent`. When this command is detected, the rule captures relevant fields, such as the `AssemblyPath`, which provides insight into the specific agent being installed. This context helps incident responders distinguish between legitimate administrative actions and potentially harmful installations by enabling focused analysis on specific indicators.
  ### Investigation Steps
  - Review the process creation logs to confirm the `Install-TransportAgent` command was executed, noting the timestamp and the user account involved.
  - Investigate the `AssemblyPath` associated with the detected installation to determine if it corresponds to known legitimate Transport Agents or if it raises concerns about unauthorized modifications.
  - Cross-reference relevant SIEM alerts to assess any other associated suspicious activities that may indicate malintent, such as unusual traffic patterns or access from non-standard locations.
  - Assess system and user activity logs for any abnormal behavior that could indicate further exploitation or persistence mechanisms related to the installation of the Transport Agent.
