title: MSSQL XPCmdshell Suspicious Execution
id: 7f103213-a04e-4d59-8261-213dddf22314
status: test
description: Detects when the MSSQL "xp_cmdshell" stored procedure is used to execute
  commands
references:
- https://www.netspi.com/blog/technical/network-penetration-testing/sql-server-persistence-part-1-startup-stored-procedures/
- https://thedfirreport.com/2022/07/11/select-xmrig-from-sqlserver/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-07-12
modified: 2024-06-26
tags:
- attack.execution
logsource:
  product: windows
  service: application
  definition: 'Requirements: MSSQL audit policy to monitor for "xp_cmdshell" must
    be enabled in order to receive this event in the application log (Follow this
    tutorial https://dba.stackexchange.com/questions/103183/is-there-any-way-to-monitor-execution-of-xp-cmdshell-in-sql-server-2012)'
    # warning: The 'data' field used in the detection section is the container for the event data as a whole. You may have to adapt the rule for your backend accordingly
detection:
  selection:
    Provider_Name|contains: 'MSSQL'     # Note: We use contains to account for other third party providers - See https://github.com/SigmaHQ/sigma/issues/4876
    EventID: 33205
    Data|contains|all:
            # You can modify this to include specific commands
    - 'object_name:xp_cmdshell'
    - 'statement:EXEC'
  condition: selection
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This detection rule focuses on identifying the execution of the MSSQL "xp_cmdshell" stored procedure, which allows SQL Server to execute system commands. When enabled, this feature can pose a significant security risk as it enables attackers to run arbitrary commands on the underlying operating system. The rule detects specific SQL Server auditing events (EventID 33205), looking for entries in the application logs where the Provider_Name contains 'MSSQL' and the Data has both 'object_name:xp_cmdshell' and 'statement:EXEC'. The implementation of this rule requires that the MSSQL audit policy is configured correctly to monitor the execution of stored procedures.
  By monitoring these specific events, security operations center (SOC) analysts can identify potentially malicious activity that indicates an attacker is attempting to exploit the database server to gain control over the operating system or exfiltrate data.
  ### Investigation Steps
  - Review MSSQL logs for EventID 33205 to identify recent execution of the xp_cmdshell procedure and the commands executed within it.
  - Utilize EDR tools to correlate any suspicious activities or processes that were executed on the server around the same time as the detected xp_cmdshell usage.
  - Check for abnormal network connections in the NDR data to determine if any sensitive data may have been transferred out of the network following the command execution.
  - Conduct a review of user permissions to ensure that only authorized personnel have the capability to execute stored procedures like xp_cmdshell.
