title: MSSQL Add Account To Sysadmin Role
id: 08200f85-2678-463e-9c32-88dce2f073d1
status: test
description: Detects when an attacker tries to backdoor the MSSQL server by adding
  a backdoor account to the sysadmin fixed server role
references:
- https://www.netspi.com/blog/technical/network-penetration-testing/sql-server-persistence-part-1-startup-stored-procedures/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-07-13
modified: 2024-06-26
tags:
- attack.persistence
logsource:
  product: windows
  service: application
  definition: 'Requirements: MSSQL audit policy must be enabled in order to receive
    this event in the application log'
    # warning: The 'data' field used in the detection section is the container for the event data as a whole. You may have to adapt the rule for your backend accordingly
detection:
  selection:
    Provider_Name|contains: 'MSSQL'     # Note: We use contains to account for other third party providers - See https://github.com/SigmaHQ/sigma/issues/4876
    EventID: 33205
    Data|contains|all:
    - 'object_name:sysadmin'
    - 'statement:alter server role [sysadmin] add member '
  condition: selection
falsepositives:
- Rare legitimate administrative activity
level: high
notes: |
  ### Technical Context
  The Sigma rule titled "MSSQL Add Account To Sysadmin Role" is designed to detect potentially malicious attempts to create backdoor accounts within a Microsoft SQL Server (MSSQL) environment. Specifically, it identifies when an account is added to the sysadmin fixed server role—an operation that grants elevated privileges. The rule operates by looking for specific event logs generated by the SQL Server when changes occur in user roles. Key components include the event with ID 33205, which logs the activity related to alterations in server roles, and checks for specific parameters within the event data that confirm the addition of a member to the sysadmin role.
  In terms of data sources, this detection rule relies on MSSQL application logs. For the rule to work effectively, proper MSSQL audit policies must be enabled to capture the relevant events. This means that any unauthorized attempts to escalate privileges by adding accounts to the sysadmin role can be quickly identified, thereby aiding in the detection of potential compromise or insider threat activities.
  ### Investigation Steps
  - Examine the MSSQL application logs for Event ID 33205 to confirm the occurrence of the event and the specifics of the adjusted roles.
  - Utilize EDR tools to investigate the timeline of user activities leading up to the event, paying special attention to account logins and their previously assigned roles.
  - Check for any suspicious or unexpected user accounts that were added to the sysadmin role, and verify their origin and legitimacy.
  - Review network traffic through the firewall logs and VPN connections to trace any external access attempts during the timeframe of the detected activity.
