title: MSSQL Server Failed Logon
id: 218d2855-2bba-4f61-9c85-81d0ea63ac71
related:
- id: ebfe73c2-5bc9-4ed9-aaa8-8b54b2b4777d
  type: similar
status: experimental
description: Detects failed logon attempts from clients to MSSQL server.
references:
- https://cybersecthreat.com/2020/07/08/enable-mssql-authentication-log-to-eventlog/
- https://www.experts-exchange.com/questions/27800944/EventID-18456-Failed-to-open-the-explicitly-specified-database.html
author: Nasreddine Bencherchali (Nextron Systems), j4son
date: 2023-10-11
modified: 2024-06-26
tags:
- attack.credential-access
- attack.t1110
logsource:
  product: windows
  service: application
  definition: 'Requirements: Must enable MSSQL authentication.'
detection:
  selection:
    Provider_Name|contains: 'MSSQL'     # Note: We use contains to account for other third party providers - See https://github.com/SigmaHQ/sigma/issues/4876
    EventID: 18456
  condition: selection
falsepositives:
- This event could stem from users changing an account's password that's used to authenticate
  via a job or an automated process. Investigate the source of such events and mitigate
  them
level: low
notes: |
  ### Technical Context
  The MSSQL Server Failed Logon rule is designed to detect unsuccessful login attempts made by clients to a Microsoft SQL Server instance. It focuses on capturing Event ID 18456, which indicates a failed login, along with ensuring that the event is logged by a Windows application identified as employing MSSQL as the provider. These logs can provide critical information for identifying potential unauthorized access attempts, misconfigurations, or issues related to user accounts, such as expired or incorrect passwords. The detection mechanism leverages Windows event logs to capture this data, making it essential to ensure logging is correctly configured in the MSSQL authentication settings.
  ### Investigation Steps
  - Utilize the EDR tool to search for the source IP addresses or user accounts associated with the failed logon events. This can help identify whether the failed attempts are coming from legitimate users or external threats.
  - Review MSSQL server logs and event details for any additional context surrounding the failed logon attempts. Pay special attention to patterns, such as repeated attempts from the same source.
  - Check the configuration of user accounts and permissions within the MSSQL server to ensure there are no misconfigurations that could be leading to failed logins.
  - If applicable, analyze network traffic logs via the NDR solution to detect any suspicious activities correlated with the failed logon attempts, particularly from unusual geographic locations or previously unseen IP addresses.
