title: Dump Ntds.dit To Suspicious Location
id: 94dc4390-6b7c-4784-8ffc-335334404650
status: test
description: Detects potential abuse of ntdsutil to dump ntds.dit database to a suspicious
  location
references:
- https://twitter.com/mgreen27/status/1558223256704122882
- https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-r2-and-2012/jj574207(v=ws.11)
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-08-14
modified: 2023-10-23
tags:
- attack.execution
logsource:
  product: windows
  service: application
    # warning: The 'data' field used in the detection section is the container for the event data as a whole. You may have to adapt the rule for your backend accordingly
detection:
  selection_root:
    Provider_Name: 'ESENT'
    EventID: 325     # New Database Created
    Data|contains: 'ntds.dit'
  selection_paths:
    Data|contains:
            # Add more locations that you don't use in your env or that are just suspicious
    - ':\ntds.dit'
    - '\Appdata\'
    - '\Desktop\'
    - '\Downloads\'
    - '\Perflogs\'
    - '\Temp\'
    - '\Users\Public\'
  condition: all of selection_*
falsepositives:
- Legitimate backup operation/creating shadow copies
level: medium
notes: |
  ### Technical Context
  This detection rule identifies potential misuse of the `ntdsutil` utility—the tool used for managing Active Directory database files—by monitoring for the creation of the `ntds.dit` database file in suspicious directory locations. The rule specifically looks for Windows event logs generated by the ESENT provider that indicate a new database has been created (Event ID 325) and checks if the database name contains `ntds.dit`. The subsequent step is to verify the creation path of this file against a list of known suspicious directories, such as user profile folders (Downloads, Desktop), or public accessible paths (e.g., Public folders). Recognizing the potential abuse of this operation is crucial, as unauthorized access to this file can lead to the extraction of sensitive information from Active Directory.
  ### Investigation Steps
  - Investigate the process creation logs on the endpoint where the alert was triggered to find any associated instances of `ntdsutil.exe` and review the command-line arguments used during execution.
  - Use EDR tools to analyze the file system activities to confirm if the `ntds.dit` file was actually created in the specified suspicious locations.
  - Correlate alerts with logs from the SIEM to determine if there are any patterns of unauthorized access to other sensitive files or unusual account activities around the same time.
  - Review the logs from the network security solutions (such as NGFW or NDR) to check for any suspicious outbound connections that may indicate an exfiltration attempt of the dumped data.
