title: Ntdsutil Abuse
id: e6e88853-5f20-4c4a-8d26-cd469fd8d31f
status: test
description: Detects potential abuse of ntdsutil to dump ntds.dit database
references:
- https://twitter.com/mgreen27/status/1558223256704122882
- https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-r2-and-2012/jj574207(v=ws.11)
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-08-14
tags:
- attack.credential-access
- attack.t1003.003
logsource:
  product: windows
  service: application
    # warning: The 'data' field used in the detection section is the container for the event data as a whole. You may have to adapt the rule for your backend accordingly
detection:
  selection:
    Provider_Name: 'ESENT'
    EventID:
    - 216
    - 325
    - 326
    - 327
    Data|contains: 'ntds.dit'
  condition: selection
falsepositives:
- Legitimate backup operation/creating shadow copies
level: medium
notes: |
  ### Technical Context
  This Sigma rule detects potential abuse of the `ntdsutil` tool, which is commonly used for managing Active Directory (AD) databases, particularly to dump the `ntds.dit` database file that contains user credentials and other sensitive data. The detection focuses on specific Windows event logs generated by the ESENT (Extensible Storage Engine) provider, specifically Event IDs 216, 325, 326, and 327. These events indicate activities related to the manipulation or access of the `ntds.dit` database. By monitoring these events, the rule aims to identify unauthorized attempts to access sensitive AD data, which may be indicative of credential dumping or other malicious activities.
  ### Investigation Steps
  - Check your EDR solution for any recent executions of `ntdsutil` and gather details on the process lineage and user context to identify if the action was legitimate or suspicious.
  - Review Windows Event Logs for Event IDs 216, 325, 326, and 327 around the time of the alert to understand the sequence of actions taken in relation to the `ntds.dit` file.
  - Analyze user account activity in Active Directory to identify any unauthorized access or changes made by the user associated with the `ntdsutil` execution.
  - Query application and security logs to assess if there are any related alerts or anomalies, such as multiple failed login attempts or unusual command executions prior to the event.
