title: Potential Active Directory Reconnaissance/Enumeration Via LDAP
id: 31d68132-4038-47c7-8f8e-635a39a7c174
status: test
description: Detects potential Active Directory enumeration via LDAP
references:
- https://techcommunity.microsoft.com/t5/microsoft-defender-for-endpoint/hunting-for-reconnaissance-activities-using-ldap-search-filters/ba-p/824726
- https://github.com/PowerShellMafia/PowerSploit/blob/d943001a7defb5e0d1657085a77a0e78609be58f/Recon/PowerView.ps1
- https://github.com/BloodHoundAD/SharpHound3/blob/7d96b991b1887ff50349ce59c80980bc0d95c86a/SharpHound3/LdapBuilder.cs
- https://medium.com/falconforce/falconfriday-detecting-active-directory-data-collection-0xff21-c22d1a57494c
- https://github.com/fox-it/BloodHound.py/blob/d65eb614831cd30f26028ccb072f5e77ca287e0b/bloodhound/ad/domain.py#L427
- https://ipurple.team/2024/07/15/sharphound-detection/
author: Adeem Mawani
date: 2021-06-22
modified: 2024-08-27
tags:
- attack.discovery
- attack.t1069.002
- attack.t1087.002
- attack.t1482
logsource:
  product: windows
  service: ldap
  definition: 'Requirements: Microsoft-Windows-LDAP-Client/Debug ETW logging'
detection:
  generic_search:
    EventID: 30
    SearchFilter|contains:
    - '(groupType:1.2.840.113556.1.4.803:=2147483648)'
    - '(groupType:1.2.840.113556.1.4.803:=2147483656)'
    - '(groupType:1.2.840.113556.1.4.803:=2147483652)'
    - '(groupType:1.2.840.113556.1.4.803:=2147483650)'
    - '(sAMAccountType=805306369)'
    - '(sAMAccountType=805306368)'
    - '(sAMAccountType=536870913)'
    - '(sAMAccountType=536870912)'
    - '(sAMAccountType=268435457)'
    - '(sAMAccountType=268435456)'
    - '(objectCategory=groupPolicyContainer)'
    - '(objectCategory=organizationalUnit)'
    - '(objectCategory=Computer)'
    - '(objectCategory=nTDSDSA)'
    - '(objectCategory=server)'
    - '(objectCategory=domain)'
    - '(objectCategory=person)'
    - '(objectCategory=group)'
    - '(objectCategory=user)'
    - '(objectClass=trustedDomain)'
    - '(objectClass=computer)'
    - '(objectClass=server)'
    - '(objectClass=group)'
    - '(objectClass=user)'
    - '(primaryGroupID=521)'
    - '(primaryGroupID=516)'
    - '(primaryGroupID=515)'
    - '(primaryGroupID=512)'
    - 'Domain Admins'
    - 'objectGUID=\*'
    - '(schemaIDGUID=\*)'
    - 'admincount=1'
  distinguished_name_enumeration:
    EventID: 30
    SearchFilter: '(objectclass=\*)'
    DistinguishedName|contains:
    - 'CN=Domain Admins'
    - 'CN=Enterprise Admins'
    - 'CN=Group Policy Creator Owners'
  suspicious_flag:
    EventID: 30
    SearchFilter|contains:
    - '(userAccountControl:1.2.840.113556.1.4.803:=4194304)'
    - '(userAccountControl:1.2.840.113556.1.4.803:=2097152)'
    - '!(userAccountControl:1.2.840.113556.1.4.803:=1048574)'
    - '(userAccountControl:1.2.840.113556.1.4.803:=524288)'
    - '(userAccountControl:1.2.840.113556.1.4.803:=65536)'
    - '(userAccountControl:1.2.840.113556.1.4.803:=8192)'
    - '(userAccountControl:1.2.840.113556.1.4.803:=544)'
    - '!(UserAccountControl:1.2.840.113556.1.4.803:=2)'
    - 'msDS-AllowedToActOnBehalfOfOtherIdentity'
    - 'msDS-AllowedToDelegateTo'
    - 'msDS-GroupManagedServiceAccount'
    - '(accountExpires=9223372036854775807)'
    - '(accountExpires=0)'
    - '(adminCount=1)'
    - 'ms-MCS-AdmPwd'
  narrow_down_filter:
    EventID: 30
    SearchFilter|contains:
    - '(domainSid=*)'
    - '(objectSid=*)'
  condition: (generic_search and not narrow_down_filter) or suspicious_flag or distinguished_name_enumeration
level: medium
notes: |
  ### Technical Context
  This detection rule aims to identify potential reconnaissance activities targeting Active Directory (AD) via Lightweight Directory Access Protocol (LDAP). It primarily looks for specific LDAP search filters that indicate attempts to enumerate groups, users, and other objects within the AD environment. The rule analyzes Event ID 30 logs generated by the Microsoft-Windows-LDAP-Client, which must be enabled for detection. It tracks various attributes, including `sAMAccountType`, `objectCategory`, and `userAccountControl`, which help categorize the object types and their permissions. Additionally, certain filters related to distinguished names are monitored to flag potential enumeration of high-privilege groups like Domain Admins.
  By correlating the attributes queried through LDAP, the rule identifies patterns that might signify reconnaissance behaviors, such as the listing of sensitive objects or groups within the AD. The alerts generated can indicate whether an entity is potentially gathering intelligence for future malicious actions.
  ### Investigation Steps
  - Review the EDR logs for any recent LDAP queries or connections that correspond with the time the alert was generated, particularly focusing on Event ID 30.
  - Check for unusual or unauthorized account activity in the logs to see if any accounts associated with the detected LDAP queries have a history of suspicious behavior.
  - Utilize the SIEM to correlate the LDAP query events with network traffic data, searching for abnormal access patterns or connections to unauthorized systems.
  - Analyze Proxy logs for any outbound connections initiated by potentially malicious accounts to further investigate if data extraction or external reconnaissance efforts are taking place.
