title: Previously Installed IIS Module Was Removed
id: 9e1a1fdf-ee58-40ce-8e15-b66ca5a80e1f
status: experimental
description: Detects the removal of a previously installed IIS module.
references:
- https://learn.microsoft.com/en-us/iis/manage/provisioning-and-managing-iis/configure-logging-in-iis
- https://www.microsoft.com/en-us/security/blog/2022/12/12/iis-modules-the-evolution-of-web-shells-and-how-to-detect-them/
- https://www.microsoft.com/en-us/security/blog/2022/07/26/malicious-iis-extensions-quietly-open-persistent-backdoors-into-servers/
- https://learn.microsoft.com/en-us/iis/get-started/introduction-to-iis/iis-modules-overview
author: Nasreddine Bencherchali
date: 2024-10-06
tags:
- attack.defense-evasion
- attack.persistence
- attack.t1562.002
- attack.t1505.004
logsource:
  product: windows
  service: iis-configuration
detection:
  selection:
    EventID: 29
    Configuration|contains: '/system.webServer/modules/remove'
  condition: selection
falsepositives:
- Legitimate administrator activity
# Note: Upgrade after an initial baseline
level: low
notes: |
  ### Technical Context
  This detection rule identifies the removal of a previously installed Internet Information Services (IIS) module, which can signify potential malicious activity, particularly if performed without proper authorization. The rule relies on logs generated by IIS that capture configuration changes, specifically monitoring for events where an IIS module is removed, indicated by EventID 29 in conjunction with configuration changes that contain the string `/system.webServer/modules/remove`. Monitoring these logs is crucial for maintaining the security posture of web applications hosted on IIS, as unauthorized removals may indicate attempts to evade detection or establish persistence through backdoor mechanisms.
  Responders should be aware that legitimate administrative changes can trigger this rule, particularly when system configurations are modified for maintenance. However, it is essential to investigate high-risk environments, where such actions could lead to potential exploitation or compromise.
  ### Investigation Steps
  - Analyze the IIS configuration logs for EventID 29 to review the specific module(s) that were removed and the timestamp of the action for context.
  - Cross-reference the logs with the list of authorized personnel to determine if the action was taken by a legitimate administrator or if it aligns with expected operational procedures.
  - Review recent user activity and logins in your EDR system to identify any suspicious logins or changes made by accounts around the time of the module removal.
  - Check for related alerts or anomalies in other security tools (e.g., AV, NDR) that may indicate broader malicious behavior, such as unauthorized access attempts or known threats targeting IIS environments.
