title: Ngrok Usage with Remote Desktop Service
id: 64d51a51-32a6-49f0-9f3d-17e34d640272
status: test
description: Detects cases in which ngrok, a reverse proxy tool, forwards events to
  the local RDP port, which could be a sign of malicious behaviour
references:
- https://twitter.com/tekdefense/status/1519711183162556416?s=12&t=OTsHCBkQOTNs1k3USz65Zg
- https://ngrok.com/
author: Florian Roth (Nextron Systems)
date: 2022-04-29
tags:
- attack.command-and-control
- attack.t1090
logsource:
  product: windows
  service: terminalservices-localsessionmanager
detection:
  selection:
    EventID: 21
    Address|contains: '16777216'
  condition: selection
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  The Sigma rule titled "Ngrok Usage with Remote Desktop Service" aims to detect potential misuse of the Ngrok tool, which is commonly used as a reverse proxy to expose local servers to the internet. Specifically, the rule searches for occurrences where Ngrok is forwarding traffic to the local Remote Desktop Protocol (RDP) port. This behavior is often associated with malicious activities, such as unauthorized access or remote exploitation of systems. The rule utilizes Windows event logs, specifically Event ID 21 (which logs successful connections to the terminal services), and looks for an address indicator that is characteristic of Ngrok, '16777216', suggesting a tunnel being established to the local RDP service. Such connections can signal covert command-and-control setups employed by attackers, making detection critical for incident response.
  ### Investigation Steps
  - Review EDR logs for any process creation events relating to Ngrok. Focus on the command-line parameters used during its execution for any suspicious activity.
  - Check the Windows event logs for Event ID 21. Identify any RDP connection attempts that coincide with the use of Ngrok, noting timestamps and originating IP addresses.
  - Utilize network detection tools to analyze outbound connections made by the affected host at the time of the alert. Look for unusual external IP addresses that may represent unauthorized remote access attempts.
  - Investigate the system’s historical logs, including any related AV or IDS alerts, to assess if this behavior is part of a larger pattern of suspicious activities or previous alerts involving the use of Ngrok.
