title: Suspicious Printer Driver Empty Manufacturer
id: e0813366-0407-449a-9869-a2db1119dc41
status: test
description: Detects a suspicious printer driver installation with an empty Manufacturer
  value
references:
- https://twitter.com/SBousseaden/status/1410545674773467140
author: Florian Roth (Nextron Systems)
date: 2020-07-01
modified: 2023-08-17
tags:
- attack.privilege-escalation
- attack.t1574
- cve.2021-1675
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|contains|all:
    - '\Control\Print\Environments\Windows x64\Drivers'
    - '\Manufacturer'
    Details: '(Empty)'
  filter_cutepdf:
    TargetObject|contains: '\CutePDF Writer v4.0\'
  filter_vnc:
    TargetObject|contains:
    - '\VNC Printer (PS)\'
    - '\VNC Printer (UD)\'
  filter_pdf24:
    TargetObject|contains: '\Version-3\PDF24\'
  condition: selection and not 1 of filter_*
falsepositives:
- Alerts on legitimate printer drivers that do not set any more details in the Manufacturer
  value
level: high
notes: |
  ### Technical Context
  This Sigma rule is designed to detect the installation of suspicious printer drivers on Windows systems when the Manufacturer value is empty. The rule inspects registry key changes specifically under the path `\Control\Print\Environments\Windows x64\Drivers`, where printer driver details are stored. By monitoring registry activity, the rule identifies any entries that have an empty Manufacturer while also excluding known benign drivers like CutePDF, VNC Printers, and PDF24 versions. Detection of such anomalous printer drivers could indicate potential privilege escalation attempts, as attackers may use malicious drivers to gain higher system access or visibility into network activities.
  ### Investigation Steps
  - Review process creation logs for any recent installations or changes related to printer drivers around the time of the alert, focusing on unusual processes or command-line parameters.
  - Query the EDR for any suspicious activity from the affected systems, particularly looking for execution of tools that could exploit system drivers or printer services.
  - Examine network logs for outgoing connections or traffic patterns that could indicate data exfiltration or command and control communication linked to the detected printer driver installation.
  - Check Windows Event logs for any security events that coincide with the timestamp of the registry alert, which may help correlate suspicious activity or unauthorized access.
