title: UAC Bypass via Sdclt
id: 5b872a46-3b90-45c1-8419-f675db8053aa
status: test
description: Detects the pattern of UAC Bypass using registry key manipulation of
  sdclt.exe (e.g. UACMe 53)
references:
- https://enigma0x3.net/2017/03/17/fileless-uac-bypass-using-sdclt-exe/
- https://github.com/hfiref0x/UACME
author: Omer Yampel, Christian Burkard (Nextron Systems)
date: 2017-03-17
modified: 2023-08-17
tags:
- attack.defense-evasion
- attack.privilege-escalation
- attack.t1548.002
- car.2019-04-001
logsource:
  category: registry_set
  product: windows
detection:
  selection1:
    TargetObject|endswith: 'Software\Classes\exefile\shell\runas\command\isolatedCommand'
  selection2:
    TargetObject|endswith: 'Software\Classes\Folder\shell\open\command\SymbolicLinkValue'
    Details|re: '-1[0-9]{3}\\Software\\Classes\\'
  condition: 1 of selection*
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This Sigma rule is designed to detect attempts to bypass User Account Control (UAC) on Windows systems through manipulation of specific registry keys associated with `sdclt.exe`. Attackers employ UAC bypass techniques to gain elevated privileges without triggering standard security warnings. The rule focuses on monitoring modifications to the registry paths `Software\Classes\exefile\shell\runas\command\isolatedCommand` and `Software\Classes\Folder\shell\open\command\SymbolicLinkValue`, where suspicious command strings may indicate an attempt to execute code with heightened privileges in an isolated context. Event logs related to these registry changes serve as the primary data source for detection, enabling the identification of potential security incidents linked to privilege escalation.
  ### Investigation Steps
  - Review EDR logs for any related process executions or modifications to the specified registry keys within recent activity to identify the context and potential source of the UAC bypass.
  - Analyze command-line parameters associated with process executions by `sdclt.exe` to discern if arguments were passed that suggest unauthorized intentions or manipulation.
  - Query SIEM for any alerts correlated with elevated privilege attempts or unusual registry changes, paying particular attention to the timestamps of the detected modifications.
  - Investigate any related events or logs from AV solutions to determine if any malware or potentially unwanted applications have been detected and potentially linked to the UAC bypass attempt.
