title: WinSock2 Autorun Keys Modification
id: d6c2ce7e-afb5-4337-9ca4-4b5254ed0565
related:
- id: 17f878b8-9968-4578-b814-c4217fc5768c
  type: derived
status: test
description: Detects modification of autostart extensibility point (ASEP) in registry.
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1547.001/T1547.001.md
- https://learn.microsoft.com/en-us/sysinternals/downloads/autoruns
- https://gist.github.com/GlebSukhodolskiy/0fc5fa5f482903064b448890db1eaf9d     # a list with registry keys
author: Victor Sergeev, Daniil Yugoslavskiy, Gleb Sukhodolskiy, Timur Zinniatullin,
  oscd.community, Tim Shelton, frack113 (split)
date: 2019-10-25
modified: 2023-08-17
tags:
- attack.persistence
- attack.t1547.001
logsource:
  category: registry_set
  product: windows
detection:
  winsock_parameters_base:
    TargetObject|contains: '\System\CurrentControlSet\Services\WinSock2\Parameters'
  winsock_parameters:
    TargetObject|contains:
    - '\Protocol_Catalog9\Catalog_Entries'
    - '\NameSpace_Catalog5\Catalog_Entries'
  filter:
  - Details: '(Empty)'
  - Image: 'C:\Windows\System32\MsiExec.exe'
  - Image: 'C:\Windows\syswow64\MsiExec.exe'
  condition: winsock_parameters_base and winsock_parameters and not filter
fields:
- SecurityID
- ObjectName
- OldValueType
- NewValueType
falsepositives:
- Legitimate software automatically (mostly, during installation) sets up autorun
  keys for legitimate reason
- Legitimate administrator sets up autorun keys for legitimate reason
level: medium
notes: |
  n
  ### Technical Context
  This detection rule focuses on identifying unauthorized modifications to Windows Registry keys related to the Winsock2 service, specifically within the autostart extensibility points (ASEP). The rule targets changes to the registry path `\System\CurrentControlSet\Services\WinSock2\Parameters` and its associated entries like `\Protocol_Catalog9\Catalog_Entries` and `\NameSpace_Catalog5\Catalog_Entries`. By monitoring registry_set logs, the rule captures events where settings may have been altered, and it filters out common benign changes made by legitimate applications, particularly those involving the MsiExec.exe process, which is often used for software installation.
  When a modification is detected that does not match the established benign activity filter, it raises an alert, indicating a potential persistence mechanism being employed by malicious actors. This can signify an attempt to persistently install malicious software or to manipulate network behaviors. Analysts should investigate such alerts to determine if the changes were indeed made by a legitimate process or if they represent a threat.
  ### Investigation Steps
  - Check the relevant registry keys using a registry viewer or PowerShell to review recent changes and identify the responsible process and user context.
  - Review EDR logs for any instances of `MsiExec.exe` or other related installers around the time of the registry modification to determine if there were concurrent legitimate activities.
  - Analyze endpoint behavior around the time of the alert, looking for any unusual network connections or new services that might suggest malicious software installation.
  - Conduct a threat intelligence lookup on any uncommon entries related to Winsock2 alterations to assess if they correlate with known malicious tactics or campaigns.
