title: Suspicious Path In Keyboard Layout IME File Registry Value
id: 9d8f9bb8-01af-4e15-a3a2-349071530530
related:
- id: b888e3f2-224d-4435-b00b-9dd66e9ea1f1
  type: derived
status: test
description: |
  Detects usage of Windows Input Method Editor (IME) keyboard layout feature, which allows an attacker to load a DLL into the process after sending the WM_INPUTLANGCHANGEREQUEST message.
  Before doing this, the client needs to register the DLL in a special registry key that is assumed to implement this keyboard layout. This registry key should store a value named "Ime File" with a DLL path.
  IMEs are essential for languages that have more characters than can be represented on a standard keyboard, such as Chinese, Japanese, and Korean.
references:
- https://www.linkedin.com/pulse/guntior-story-advanced-bootkit-doesnt-rely-windows-disk-baranov-wue8e/
author: X__Junior (Nextron Systems)
date: 2023-11-21
tags:
- attack.defense-evasion
- attack.t1562.001
logsource:
  product: windows
  category: registry_set
detection:
  selection_registry:
    TargetObject|contains|all:
    - '\Control\Keyboard Layouts\'
    - 'Ime File'
  selection_folders_1:
    Details|contains:
    - ':\Perflogs\'
    - ':\Users\Public\'
    - ':\Windows\Temp\'
    - '\AppData\Local\Temp\'
    - '\AppData\Roaming\'
    - '\Temporary Internet'
  selection_folders_2:
  - Details|contains|all:
    - ':\Users\'
    - '\Favorites\'
  - Details|contains|all:
    - ':\Users\'
    - '\Favourites\'
  - Details|contains|all:
    - ':\Users\'
    - '\Contacts\'
  condition: selection_registry and 1 of selection_folders_*
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This detection rule identifies potentially malicious behavior related to the Windows Input Method Editor (IME) by monitoring modifications made to registry values that pertain to keyboard layouts. Specifically, it focuses on the "Ime File" registry key, which can be used by an attacker to load a malicious DLL. Successful exploitation typically requires sending a `WM_INPUTLANGCHANGEREQUEST` message to the client and registering the DLL under particular suspicious directory paths, which are investigated through this rule. By capturing these registry modifications in conjunction with the path where the DLL is stored, the rule aims to highlight potentially evasive tactics employed by attackers to hide their malicious activities within the IME framework.
  ### Investigation Steps
  - Review the relevant registry changes using EDR tools to identify any unauthorized modifications made to the "Ime File" registry key. 
  - Extract the detected DLL path and check if it resides in any of the suspicious directories such as `C:\Windows\Temp\` or `C:\Users\Public\`, indicating possible malicious intent. 
  - Conduct a retrospective analysis of process creation logs around the time the registry modification occurred, looking for any unusual processes that may have loaded the DLL. 
  - Search network logs and proxy records for outgoing connections from the involved user or system to identify any attempts to communicate with potentially malicious external endpoints.
