title: Potential Persistence Via LSA Extensions
id: 41f6531d-af6e-4c6e-918f-b946f2b85a36
status: test
description: |
  Detects when an attacker modifies the "REG_MULTI_SZ" value named "Extensions" to include a custom DLL to achieve persistence via lsass.
  The "Extensions" list contains filenames of DLLs being automatically loaded by lsass.exe. Each DLL has its InitializeLsaExtension() method called after loading.
references:
- https://persistence-info.github.io/Data/lsaaextension.html
- https://twitter.com/0gtweet/status/1476286368385019906
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-07-21
modified: 2023-08-17
tags:
- attack.persistence
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|contains: '\SYSTEM\CurrentControlSet\Control\LsaExtensionConfig\LsaSrv\Extensions'
  condition: selection
falsepositives:
- Unlikely
level: high
notes: |
  ### Technical Context
  This detection rule focuses on identifying potential persistence mechanisms utilized by attackers via modifications to the Windows Registry. Specifically, it looks for changes to the "Extensions" value under `\SYSTEM\CurrentControlSet\Control\LsaExtensionConfig\LsaSrv`. This value, which is of the type "REG_MULTI_SZ", lists DLLs intended to be automatically loaded by the Local Security Authority Subsystem Service (lsass.exe). When a custom DLL is added to this list, it can lead to unauthorized access and manipulation of security protocols during the boot process, allowing an attacker to achieve persistent access to the system. The technical data sources involved in this detection include registry change logs, particularly those that detail modifications around the LSA extensions.
  ### Investigation Steps
  - Review the registry change logs in your SIEM to confirm the modification of the "Extensions" value at `\SYSTEM\CurrentControlSet\Control\LsaExtensionConfig\LsaSrv`.
  - Utilize EDR tools to monitor lsass.exe processes, focusing on any associated DLLs that are now loaded as part of the extended functionality.
  - Analyze command-line arguments and parent processes of any recently executed instances of lsass.exe to identify any unusual behavior or correlations with the DLLs listed in the "Extensions".
  - Cross-reference user account activities and access logs to identify any suspicious logon behavior that may correlate with the timing of the registry modification.
