title: Potential Persistence Via Visual Studio Tools for Office
id: 9d15044a-7cfe-4d23-8085-6ebc11df7685
status: test
description: Detects persistence via Visual Studio Tools for Office (VSTO) add-ins
  in Office applications.
references:
- https://twitter.com/_vivami/status/1347925307643355138
- https://vanmieghem.io/stealth-outlook-persistence/
author: Bhabesh Raj
date: 2021-01-10
modified: 2023-08-28
tags:
- attack.t1137.006
- attack.persistence
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|contains:
    - '\Software\Microsoft\Office\Outlook\Addins\'
    - '\Software\Microsoft\Office\Word\Addins\'
    - '\Software\Microsoft\Office\Excel\Addins\'
    - '\Software\Microsoft\Office\Powerpoint\Addins\'
    - '\Software\Microsoft\VSTO\Security\Inclusion\'
  filter_image:
    Image|endswith:
    - '\msiexec.exe'
    - '\regsvr32.exe'         # e.g. default Evernote installation
    # triggered by a default Office 2019 installation
  filter_office:
    Image|endswith:
    - '\excel.exe'
    - '\integrator.exe'
    - '\OfficeClickToRun.exe'
    - '\winword.exe'
    - '\visio.exe'
  filter_teams:
    Image|endswith: '\Teams.exe'
  filter_avg:
    Image: 'C:\Program Files\AVG\Antivirus\RegSvr.exe'
    TargetObject|contains: '\Microsoft\Office\Outlook\Addins\Antivirus.AsOutExt\'
  condition: selection and not 1 of filter_*
falsepositives:
- Legitimate Addin Installation
level: medium
notes: |
  ### Technical Context
  This Sigma rule is designed to detect potential persistence mechanisms used by attackers through Visual Studio Tools for Office (VSTO) add-ins within Microsoft Office applications. The rule specifically monitors for changes made to registry keys associated with Office add-ins in Outlook, Word, Excel, and PowerPoint. The key elements being tracked are the TargetObject paths in the Windows registry, which indicate the registration of new or modified add-ins. Additionally, the rule filters out legitimate processes that may interact with these registry keys (like `msiexec.exe` for installers and various Office applications) to reduce false positives. By identifying these modifications, analysts can quickly notice suspicious behaviors that may indicate an attempt to persist malware on a system.
  ### Investigation Steps
  - Review the registry changes logged for the TargetObject paths in the detection rule. Investigate any modifications to the specified Office add-in registry paths that may indicate unauthorized persistence.
  - Use your EDR solution to examine the process creation logs associated with the detected activity. Look for any unusual behaviors or command-line arguments related to `msiexec.exe`, `regsvr32.exe`, or the relevant Office application.
  - Check Proxy and network logs for any outbound connections made by processes related to Office applications during the time of the flagged persistence attempt. This can help identify if any malicious payloads were downloaded or executed.
  - Conduct a forensic analysis on the involved system, focusing on running processes and any recent installations of add-ins. Validate the legitimacy of the add-ins and consider inspecting the network activity around `Teams.exe` and antivirus-specific entries as well.
