title: Disable Windows Event Logging Via Registry
id: 2f78da12-f7c7-430b-8b19-a28f269b77a3
status: test
description: Detects tampering with the "Enabled" registry key in order to disable
  Windows logging of a Windows event channel
references:
- https://twitter.com/WhichbufferArda/status/1543900539280293889
- https://github.com/DebugPrivilege/CPP/blob/c39d365617dbfbcb01fffad200d52b6239b2918c/Windows%20Defender/RestoreDefenderConfig.cpp
author: frack113, Nasreddine Bencherchali (Nextron Systems)
date: 2022-07-04
modified: 2024-03-25
tags:
- attack.defense-evasion
- attack.t1562.002
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|contains: '\Microsoft\Windows\CurrentVersion\WINEVT\Channels\'
    TargetObject|endswith: '\Enabled'
    Details: 'DWORD (0x00000000)'
  filter_main_wevutil:
    Image: 'C:\Windows\system32\wevtutil.exe'     # FP generated during installation of manifests via wevtutil
  filter_main_iis:
    Image|startswith: 'C:\Windows\winsxs\'
    Image|endswith: '\TiWorker.exe'      # Many different TargetObjects
  filter_main_svchost:
    Image: 'C:\Windows\System32\svchost.exe'
    TargetObject|contains:
    - '\Microsoft\Windows\CurrentVersion\WINEVT\Channels\Microsoft-Windows-FileInfoMinifilter'
    - '\Microsoft\Windows\CurrentVersion\WINEVT\Channels\Microsoft-Windows-ASN1\'
    - '\Microsoft\Windows\CurrentVersion\WINEVT\Channels\Microsoft-Windows-Kernel-AppCompat\'
    - '\Microsoft\Windows\CurrentVersion\WINEVT\Channels\Microsoft-Windows-Runtime\Error\'
    - '\Microsoft\Windows\CurrentVersion\WINEVT\Channels\Microsoft-Windows-CAPI2/Operational\'
  filter_main_trusted_installer:
    Image: C:\Windows\servicing\TrustedInstaller.exe
    TargetObject|contains: '\Microsoft\Windows\CurrentVersion\WINEVT\Channels\Microsoft-Windows-Compat-Appraiser'
  filter_optional_empty:   # This filter is related to aurora. Should be removed when fix is deployed. # TODO: Remove later
    Image: ''
  filter_optional_null:   # This filter is related to aurora. Should be removed when fix is deployed. # TODO: Remove later
    Image:
  condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
falsepositives:
- Rare falsepositives may occur from legitimate administrators disabling specific
  event log for troubleshooting
level: high
notes: |
  n
  ### Technical Context
  This Sigma rule is designed to detect illicit attempts to modify Windows event logging settings via manipulation of the Windows Registry. Specifically, it targets changes made to the "Enabled" registry key within the Windows Event Channels, which controls whether specific event logging is active or not. Malicious actors may disable logging to evade detection during their operations. The telemetry for this detection relies heavily on the Windows Registry logs, particularly focusing on the `registry_set` log source. By monitoring for changes that indicate a DWORD value of '0' set to the Enabled key of relevant event channels, the rule aims to identify potential tampering. This detection falls under the MITRE ATT&CK techniques for defense evasion, specifically T1562.002 (Impair Defenses: Disable Security Tools).
  ### Investigation Steps
  - **Check EDR Alerts**: Use your EDR solution to review any alerts correlated with registry changes around the same time as the detection alert. Pay close attention to process creation logs in conjunction with these changes.
    
  - **Examine Event Logs**: Investigate the Windows Event Logs, particularly the Security and System logs, for any anomalies or unusual activity that correlates with the timing of registry key modifications.
  - **Cross-reference Initial Access**: Review recent logs from your NGFW, VPN, or proxy services to determine if there were any unauthorized access attempts or suspicious network communication leading up to the event.
  - **Review User Activity**: Analyze user activity logs to ascertain if there were any legitimate actions taken by administrators around the time of detection, which might indicate troubleshooting efforts instead of malicious tampering.
  ### Prioritization
  Given that the alert indicates potential tampering with Windows Event logging, which is a critical defense mechanism, it is classified as high severity. Such actions could indicate an attempt to evade detection of malicious activities within the enterprise environment.
  ### Blind Spots and Assumptions
  This rule may not fire if legitimate administrators disable specific event logging for troubleshooting purposes, which could lead to rare false positives. An assumption is also made that any alterations to the registry will be captured in the logs; however, if the logging mechanism itself is compromised or disabled beforehand, the rule may fail to detect such malicious actions. 
  > **Disclaimer:** This investigation guide was created using generative AI technology and has not been reviewed for its accuracy and relevance. While every effort has been made to ensure its quality, we recommend validating the content and adapting it to suit specific environment and operational needs. Please communicate any changes to the detection engineering team.
