title: Wdigest Enable UseLogonCredential
id: d6a9b252-c666-4de6-8806-5561bbbd3bdc
status: test
description: Detects potential malicious modification of the property value of UseLogonCredential
  from HKLM:\SYSTEM\CurrentControlSet\Control\SecurityProviders\WDigest to enable
  clear-text credentials
references:
- https://threathunterplaybook.com/hunts/windows/190510-RegModWDigestDowngrade/notebook.html
- https://support.microsoft.com/en-us/topic/microsoft-security-advisory-update-to-improve-credentials-protection-and-management-may-13-2014-93434251-04ac-b7f3-52aa-9f951c14b649
- https://github.com/redcanaryco/atomic-red-team/blob/73fcfa1d4863f6a4e17f90e54401de6e30a312bb/atomics/T1112/T1112.md#atomic-test-3---modify-registry-to-store-logon-credentials
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
date: 2019-09-12
modified: 2023-08-17
tags:
- attack.defense-evasion
- attack.t1112
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|endswith: 'WDigest\UseLogonCredential'
    Details: DWORD (0x00000001)
  condition: selection
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  The Sigma rule "Wdigest Enable UseLogonCredential" is designed to detect unauthorized modifications to the WDigest registry key, specifically the `UseLogonCredential` setting, which, if enabled, allows the storage of user credentials in clear text. This property resides in the Windows registry at `HKLM:\SYSTEM\CurrentControlSet\Control\SecurityProviders\WDigest`. Attackers may manipulate this setting to exploit clear-text credentials during authentication processes, facilitating credential theft. Detection is implemented through monitoring registry set events, which include the targeting of the `Wdigest\UseLogonCredential` object with a specific value of `DWORD (0x00000001)`. Analysts must ensure that any modifications are evaluated within the context of user behavior and system configuration to assess the potential for malicious intent.
  ### Investigation Steps
  - Analyze recent registry modification logs for alterations related to `Wdigest\UseLogonCredential` using EDR tools, focusing on timestamps, user accounts involved, and processes that executed the changes.
  - Examine process creation logs around the time of the registry modification to identify suspicious processes or command-line arguments that may indicate exploit attempts.
  - Review authentication logs and clear-text credential usage across enterprise systems to determine if any accounts have displayed unusual access patterns following the registry change.
  - Investigate potential lateral movement or credential harvesting events using proxy and network traffic logs to identify communications with unauthorized external entities post-modification.
