title: Modification of IE Registry Settings
id: d88d0ab2-e696-4d40-a2ed-9790064e66b3
status: test
description: Detects modification of the registry settings used for Internet Explorer
  and other Windows components that use these settings. An attacker can abuse this
  registry key to add a domain to the trusted sites Zone or insert javascript for
  persistence
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1112/T1112.md#atomic-test-4---add-domain-to-trusted-sites-zone
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1112/T1112.md#atomic-test-5---javascript-in-registry
author: frack113
date: 2022-01-22
modified: 2023-08-17
tags:
- attack.defense-evasion
- attack.t1112
logsource:
  category: registry_set
  product: windows
detection:
  selection_domains:
    TargetObject|contains: '\Software\Microsoft\Windows\CurrentVersion\Internet Settings'
  filter_dword:
    Details|startswith: 'DWORD'
  filter_office:
    Details:
    - 'Cookie:'
    - 'Visited:'
    - '(Empty)'
  filter_path:
    TargetObject|contains:
    - '\Cache'
    - '\ZoneMap'
    - '\WpadDecision'
  filter_binary:
    Details: 'Binary Data'
  filter_accepted_documents:
        # Spotted during office installations
    TargetObject|contains: '\Accepted Documents\'
  condition: selection_domains and not 1 of filter_*
falsepositives:
- Unknown
level: low
notes: |
  ### Technical Context
  This detection rule is aimed at identifying modifications made to the Windows registry settings associated with Internet Explorer and other components utilizing these settings. The rule specifically looks for changes in keys located within the path `\Software\Microsoft\Windows\CurrentVersion\Internet Settings`, indicating potential malicious activities such as adding domains to the trusted sites zone or inserting JavaScript for persistence. It inspects various types of modifications—such as DWORD changes, binary data, and specific entries related to office installations—across relevant registry paths. The underlying data sources for this rule typically include registry modification logs from Windows operating systems, which provide insights into registry key activities that may signify unauthorized alterations.
  ### Investigation Steps
  - Check the Windows registry for the specific keys mentioned in the alert to determine the exact modifications made and whether they are consistent with legitimate updates.
  - Use EDR tools to review the process creation logs around the time of the detected registry modification to identify any unusual or unauthorized processes.
  - Analyze network traffic through the Firewall or Proxy logs to see if there were any connections made to suspicious or newly trusted domains shortly after the registry change.
  - If applicable, query cloud logs (such as AWS CloudTrail or Azure Monitor) for any corresponding activities that may be linked to user account actions, such as logins or deployments, around the time of the detection.
