title: Potential Persistence Via Netsh Helper DLL - Registry
id: c90362e0-2df3-4e61-94fe-b37615814cb1
related:
- id: 56321594-9087-49d9-bf10-524fe8479452
  type: similar
- id: e7b18879-676e-4a0e-ae18-27039185a8e7
  type: similar
status: test
description: |
  Detects changes to the Netsh registry key to add a new DLL value. This change might be an indication of a potential persistence attempt by adding a malicious Netsh helper
references:
- https://www.ired.team/offensive-security/persistence/t1128-netsh-helper-dll
- https://pentestlab.blog/2019/10/29/persistence-netsh-helper-dll/
author: Anish Bogati
date: 2023-11-28
tags:
- attack.persistence
- attack.t1546.007
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|contains: '\SOFTWARE\Microsoft\NetSh'
    Details|contains: '.dll'
  condition: selection
falsepositives:
- Legitimate helper added by different programs and the OS
level: medium
notes: |
  n
  ### Technical Context
  This detection rule monitors changes to the Windows registry specifically targeting the Netsh key, which is used for network configuration tasks. The rule looks for modifications that introduce new Dynamic Link Libraries (DLLs) under the registry path `\SOFTWARE\Microsoft\NetSh`. Such changes can indicate attempts to achieve persistence through malicious means, as attackers may use helper DLLs to maintain access to a system. This is particularly relevant to Windows systems where persistence techniques are common, and the rule leverages registry set logs as its primary data source, which track changes to registry keys and values.
  ### Investigation Steps
  - Review recent changes to the registry by querying the EDR for detailed logs related to the Netsh registry path and inspect the changed values for any suspicious DLL entries.
  - Correlate the timestamps of detected registry changes with other security event logs to identify any related suspicious activities or processes that may have occurred at the same time.
  - Utilize the AV solution to run a scan on the identified DLL files and check for known signatures or behaviors associated with malware or unwanted applications.
  - Check network logs in the Proxy and NDR tools for any unusual outbound connections or data transfers that may indicate compromised system behavior after the registry change.
