title: Outlook EnableUnsafeClientMailRules Setting Enabled - Registry
id: 6763c6c8-bd01-4687-bc8d-4fa52cf8ba08
related:
- id: c3cefdf4-6703-4e1c-bad8-bf422fc5015a
  type: similar
- id: 55f0a3a1-846e-40eb-8273-677371b8d912     # ProcCreation variation
  type: similar
status: test
description: Detects an attacker trying to enable the outlook security setting "EnableUnsafeClientMailRules"
  which allows outlook to run applications or execute macros
references:
- https://support.microsoft.com/en-us/topic/how-to-control-the-rule-actions-to-start-an-application-or-run-a-macro-in-outlook-2016-and-outlook-2013-e4964b72-173c-959d-5d7b-ead562979048
- https://speakerdeck.com/heirhabarov/hunting-for-persistence-via-microsoft-exchange-server-or-outlook?slide=44
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023-02-08
modified: 2023-08-17
tags:
- attack.defense-evasion
- attack.t1112
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|endswith: '\Outlook\Security\EnableUnsafeClientMailRules'
    Details: 'DWORD (0x00000001)'
  condition: selection
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This Sigma rule detects attempts by an attacker to enable the Outlook security setting "EnableUnsafeClientMailRules" in the Windows registry. This specific setting allows Outlook to run applications or execute potentially harmful macros, posing a security risk for the environment. The rule monitors registry changes that indicate this setting has been modified, specifically looking for entries where the "TargetObject" ends with `\Outlook\Security\EnableUnsafeClientMailRules` and the value is set to `DWORD (0x00000001)`. Typical data sources utilized for this detection include Windows registry logs, which provide insights into changes made to critical security settings.
  ### Investigation Steps
  - Use EDR tools to check for any recent registry modifications related to Outlook, focusing on the value of "EnableUnsafeClientMailRules."
  - Review the process creation logs for associated application executions or command-line entries that may indicate malicious intent or unusual behavior.
  - Examine network traffic logs via Proxy or NDR solutions for abnormal communication patterns, particularly from Outlook clients that could indicate exploitation.
  - Investigate user account activities in Active Directory to identify any unauthorized or suspicious login attempts that coincide with the registry change event.
