title: IE ZoneMap Setting Downgraded To MyComputer Zone For HTTP Protocols
id: 3fd4c8d7-8362-4557-a8e6-83b29cc0d724
related:
- id: 10344bb3-7f65-46c2-b915-2d00d47be5b0
  type: similar
status: test
description: |
  Detects changes to Internet Explorer's (IE / Windows Internet properties) ZoneMap configuration of the "HTTP" and "HTTPS" protocols to point to the "My Computer" zone. This allows downloaded files from the Internet to be granted the same level of trust as files stored locally.
references:
- https://twitter.com/M_haggis/status/1699056847154725107
- https://twitter.com/JAMESWT_MHT/status/1699042827261391247
- https://learn.microsoft.com/en-us/troubleshoot/developer/browsers/security-privacy/ie-security-zones-registry-entries
- https://www.virustotal.com/gui/file/339ff720c74dc44265b917b6d3e3ba0411d61f3cd3c328e9a2bae81592c8a6e5/content
author: Nasreddine Bencherchali (Nextron Systems), Michael Haag (idea)
date: 2023-09-05
tags:
- attack.defense-evasion
logsource:
  product: windows
  category: registry_set
detection:
  selection:
    TargetObject|contains: '\Microsoft\Windows\CurrentVersion\Internet Settings\ZoneMap\ProtocolDefaults'
    TargetObject|endswith:
    - '\http'
    - '\https'
    Details|contains: 'DWORD (0x00000000)'
  condition: selection
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  The detection rule identifies changes to the Internet Explorer (IE) ZoneMap settings, specifically modifications to the configuration of the "HTTP" and "HTTPS" protocols. This configuration can be altered to change the trust settings of these protocols to point to the "My Computer" zone, which poses a security risk as it allows files downloaded from the Internet to be treated as local files, significantly increasing the potential for malicious content execution. The rule works by monitoring registry changes under the path `\Microsoft\Windows\CurrentVersion\Internet Settings\ZoneMap\ProtocolDefaults`, specifically looking for entries that end with `\http` or `\https` and have a value of `DWORD (0x00000000)`. The rule's relevance is aligned with the MITRE ATT&CK tactic of "Defense Evasion," recognizing that adversaries may employ such configurations to bypass security restrictions.
  ### Investigation Steps
  - **Check Registry Logs:** Review Windows registry logs for modifications in the `ZoneMap` registry entries, confirming any unauthorized changes to the HTTP and HTTPS protocols.
    
  - **Assess EDR Alerts:** Utilize EDR tools to track processes and activities associated with the time frame of the registry change, looking for any unusual behavior or indicators of compromise.
  - **Analyze Network Traffic:** Analyze recent network connections to identify if any connections were made to potentially malicious domains that could correlate with the modified ZoneMap settings.
  - **Review User Activity:** Audit relevant user accounts and their activities around the time of the alert to check for any unauthorized logins or malicious downloads.
  ### Prioritization
  This alert is classified as high severity due to the potential risk of allowing malicious files downloaded from the Internet to execute with local trust levels, increasing the likelihood of a successful compromise within an enterprise environment.
  ### Blind Spots and Assumptions
  This rule may not fire if the changes to the registry are made using methods that do not involve typical process trees or through obfuscated scripts. Additionally, if the environment employs custom security policies or group policies that override the registry settings in question, the detection may yield false negatives. What’s more, an attacker may employ various evasion techniques to alter the settings without triggering standard logging or alerts.
  > **Disclaimer:** This investigation guide was created using generative AI technology and has not been reviewed for its accuracy and relevance. While every effort has been made to ensure its quality, we recommend validating the content and adapting it to suit specific environment and operational needs. Please communicate any changes to the detection engineering team.
