title: ServiceDll Hijack
id: 612e47e9-8a59-43a6-b404-f48683f45bd6
status: test
description: |
  Detects changes to the "ServiceDLL" value related to a service in the registry.
  This is often used as a method of persistence.
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1543.003/T1543.003.md#atomic-test-4---tinyturla-backdoor-service-w64time
- https://www.hexacorn.com/blog/2013/09/19/beyond-good-ol-run-key-part-4/
author: frack113
date: 2022-02-04
modified: 2024-04-03
tags:
- attack.persistence
- attack.privilege-escalation
- attack.t1543.003
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|contains|all:
    - '\System\'
    - 'ControlSet'
    - '\Services\'
    TargetObject|endswith: '\Parameters\ServiceDll'
  filter_main_printextensionmanger:
    Details: 'C:\Windows\system32\spool\drivers\x64\3\PrintConfig.dll'
  filter_main_domain_controller:
    Image: 'C:\Windows\system32\lsass.exe'
    TargetObject|endswith: '\Services\NTDS\Parameters\ServiceDll'
    Details: '%%systemroot%%\system32\ntdsa.dll'
  filter_main_poqexec:
    Image: 'C:\Windows\System32\poqexec.exe'
  filter_optional_safetica:
    Image|endswith: '\regsvr32.exe'
    Details: 'C:\Windows\System32\STAgent.dll'
  condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
falsepositives:
- Administrative scripts
- Installation of a service
level: medium
notes: |
  n
  ### Technical Context
  The "ServiceDll Hijack" detection rule is designed to identify alterations made to the "ServiceDLL" registry value, which is commonly used by attackers to establish persistence on a compromised system. This rule looks for entries in the Windows Registry under paths that typically pertain to system services, particularly focusing on modifications to the ServiceDll settings within the Parameters key. The detection leverages registry set logs as the source, analyzing whether the changes are made to specific target objects associated with the service while excluding known benign scenarios, such as legitimate administrative actions or common service installations.
  By monitoring these changes, the rule helps identify potentially malicious behavior, where malware may replace a legitimate ServiceDll with a harmful payload. The rule utilizes various filters to screen out typical administrative tasks and known safe images to reduce false positives in order to enhance the efficiency of incident responders.
  ### Investigation Steps
  - Review the EDR process creation logs for any suspicious activities related to service modifications, particularly focusing on processes that may have altered the "ServiceDLL" registry key.
  - Check the registry logs to track changes made to the ServiceDll values, and identify the account that performed these changes to ascertain whether it was a legitimate administrator or an unauthorized user.
  - Utilize the AV and threat intelligence tools to scan for known malicious DLL files that may have been introduced as a result of the hijack, specifically targeting those which match the ignored filter conditions.
  - Inspect network traffic through the NDR and Proxy logs for any unusual connections initiated by the service tied to the modified DLL, which could indicate further malicious behavior or data exfiltration.
