title: ETW Logging Disabled In .NET Processes - Sysmon Registry
id: bf4fc428-dcc3-4bbd-99fe-2422aeee2544
related:
- id: a4c90ea1-2634-4ca0-adbb-35eae169b6fc
  type: similar
status: test
description: Potential adversaries stopping ETW providers recording loaded .NET assemblies.
references:
- https://twitter.com/_xpn_/status/1268712093928378368
- https://social.msdn.microsoft.com/Forums/vstudio/en-US/0878832e-39d7-4eaf-8e16-a729c4c40975/what-can-i-use-e13c0d23ccbc4e12931bd9cc2eee27e4-for?forum=clr
- https://github.com/dotnet/runtime/blob/ee2355c801d892f2894b0f7b14a20e6cc50e0e54/docs/design/coreclr/jit/viewing-jit-dumps.md#setting-configuration-variables
- https://github.com/dotnet/runtime/blob/f62e93416a1799aecc6b0947adad55a0d9870732/src/coreclr/src/inc/clrconfigvalues.h#L35-L38
- https://github.com/dotnet/runtime/blob/7abe42dc1123722ed385218268bb9fe04556e3d3/src/coreclr/src/inc/clrconfig.h#L33-L39
- https://github.com/dotnet/runtime/search?p=1&q=COMPlus_&unscoped_q=COMPlus_
- https://bunnyinside.com/?term=f71e8cb9c76a
- http://managed670.rssing.com/chan-5590147/all_p1.html
- https://github.com/dotnet/runtime/blob/4f9ae42d861fcb4be2fcd5d3d55d5f227d30e723/docs/coding-guidelines/clr-jit-coding-conventions.md#1412-disabling-code
- https://blog.xpnsec.com/hiding-your-dotnet-complus-etwenabled/
- https://i.blackhat.com/EU-21/Wednesday/EU-21-Teodorescu-Veni-No-Vidi-No-Vici-Attacks-On-ETW-Blind-EDRs.pdf
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
date: 2020-06-05
modified: 2023-08-17
tags:
- attack.defense-evasion
- attack.t1112
- attack.t1562
logsource:
  product: windows
  category: registry_set
detection:
  selection_etw_enabled:
    TargetObject|endswith: 'SOFTWARE\Microsoft\.NETFramework\ETWEnabled'
    Details: 'DWORD (0x00000000)'
  selection_complus:
    TargetObject|endswith:
    - '\COMPlus_ETWEnabled'
    - '\COMPlus_ETWFlags'
    Details:
    - 0         # For REG_SZ type
    - 'DWORD (0x00000000)'
  condition: 1 of selection_*
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This detection rule identifies instances where adversaries may attempt to disable Event Tracing for Windows (ETW) inside .NET processes. Specifically, it looks for registry changes indicating that the ETW providers for the .NET Framework, typically used for monitoring and debugging, have been turned off. By examining registry paths associated with `.NETFramework\ETWEnabled` and `COMPlus`, the rule can detect when an ETW-related field has been set to zero (0), which effectively stops the logging of important events. The primary data sources tracked include registry set logs that reflect these critical changes.
  This action is often a tactic employed by threat actors to evade detection mechanisms such as security information and event management (SIEM) systems, especially when malicious .NET applications are executed. Identifying these changes is crucial for maintaining vigilance against potential intrusions and ensuring the integrity of monitoring capabilities within enterprise environments.
  ### Investigation Steps
  - Examine recent registry changes in the Windows environment, focusing on the paths `SOFTWARE\Microsoft\.NETFramework\ETWEnabled` and `COMPlus_ETWEnabled`. Look for entries set to `0`, which could indicate attempts to disable logging.
  - Utilize EDR tools to analyze related process activities and any suspicious behavior exhibited by .NET applications running on the system. Pay close attention to unusual command-line parameters that may accompany these processes.
  - Review event logs from the SIEM for any alerts related to process manipulation, specifically those involving the .NET Framework and registry modifications. This may provide context to the detected registry changes.
  - Investigate network activity through Proxy and NDR tools for connections made by processes that have modified their registry settings. This can help correlate internal behaviors with potentially malicious external communications.
