title: Potential Credential Dumping Attempt Using New NetworkProvider - REG
id: 0442defa-b4a2-41c9-ae2c-ea7042fc4701
related:
- id: baef1ec6-2ca9-47a3-97cc-4cf2bda10b77
  type: similar
status: test
description: Detects when an attacker tries to add a new network provider in order
  to dump clear text credentials, similar to how the NPPSpy tool does it
references:
- https://learn.microsoft.com/en-us/troubleshoot/windows-client/setup-upgrade-and-drivers/network-provider-settings-removed-in-place-upgrade
- https://github.com/gtworek/PSBits/tree/master/PasswordStealing/NPPSpy
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-08-23
modified: 2023-08-17
tags:
- attack.credential-access
- attack.t1003
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|contains|all:
    - '\System\CurrentControlSet\Services\'
    - '\NetworkProvider'
  filter:
    TargetObject|contains:
    - '\System\CurrentControlSet\Services\WebClient\NetworkProvider'
    - '\System\CurrentControlSet\Services\LanmanWorkstation\NetworkProvider'
    - '\System\CurrentControlSet\Services\RDPNP\NetworkProvider'
            # - '\System\CurrentControlSet\Services\P9NP\NetworkProvider' # Related to WSL remove the comment if you use WSL in your ENV
  filter_valid_procs:
    Image: C:\Windows\System32\poqexec.exe
  condition: selection and not 1 of filter*
falsepositives:
- Other legitimate network providers used and not filtred in this rule
level: medium
notes: |
  ### Technical Context
  This Sigma detection rule identifies potential credential dumping attempts by monitoring registry changes related to network providers on Windows systems. Specifically, the rule focuses on actions that attempt to create new entries under the registry path `\System\CurrentControlSet\Services\` for network providers, which can be exploited by adversaries to access clear text credentials, similar to techniques utilized by the NPPSpy tool. By analyzing registry activity, particularly for alterations that may involve malicious network provider entries while filtering against known legitimate services (like WebClient and LanmanWorkstation), the rule aims to mitigate the risk of credential theft. This detection aligns with the MITRE ATT&CK technique T1003 (Credential Dumping), highlighting its relevance in understanding and responding to credential access threats.
  ### Investigation Steps
  - **Review Registry Changes:** Inspect the Windows Security logs to identify the specific registry modifications and verify the context and ownership of the changes made to `\System\CurrentControlSet\Services\`.
  - **Examine Process Activity:** Use EDR to analyze the process creation logs around the time of the detected event, particularly focusing on the instance of `poqexec.exe`, to determine if it correlates with any malicious behavior.
  - **Correlate Network Activity:** Check the network connections using EDR or NDR tools to identify any suspicious outbound communication from devices around the time of the alerts that may indicate data exfiltration.
  - **Assess User Activity:** Investigate the user account associated with the action. Look for any anomalous behavior or previous indicators of compromise that might suggest that the account has been compromised and used for credential dumping.
  ### Prioritization
  The severity of this alert is considered medium due to the potential for credential theft, which can facilitate larger attacks such as lateral movement or access to sensitive data. However, the presence of other legitimate network provider configurations may lead to occasional false positives.
  ### Blind Spots and Assumptions
  The rule may not fire in scenarios where malicious actors use alternative methods to manipulate network providers or engage in credential dumping via processes not monitored or captured by the criteria specified (e.g., if the attacker leverages a different method or registry path not included in the filter). Additionally, the detection relies on the monitoring of legitimate processes, and if an attacker uses a legitimate process for their activities, they may bypass detection. It's also assumed that the environment being monitored does not include custom or rarely used network providers outside of the specified filters, as they may also lead to unintended alerts.
  > **Disclaimer:** This investigation guide was created using generative AI technology and has not been reviewed for its accuracy and relevance. While every effort has been made to ensure its quality, we recommend validating the content and adapting it to suit specific environment and operational needs. Please communicate any changes to the detection engineering team.
