title: Potential Persistence Via Outlook Today Page
id: 487bb375-12ef-41f6-baae-c6a1572b4dd1
related:
- id: ddd171b5-2cc6-4975-9e78-f0eccd08cc76
  type: similar
status: test
description: |
  Detects potential persistence activity via outlook today page.
  An attacker can set a custom page to execute arbitrary code and link to it via the registry values "URL" and "UserDefinedUrl".
references:
- https://speakerdeck.com/heirhabarov/hunting-for-persistence-via-microsoft-exchange-server-or-outlook?slide=74
- https://trustedsec.com/blog/specula-turning-outlook-into-a-c2-with-one-registry-change
author: Tobias Michalski (Nextron Systems), David Bertho (@dbertho) & Eirik Sveen
  (@0xSV1), Storebrand
date: 2021-06-10
modified: 2024-08-07
tags:
- attack.persistence
- attack.t1112
logsource:
  product: windows
  category: registry_set
detection:
  selection_main:
    TargetObject|contains|all:
    - 'Software\Microsoft\Office\'
    - '\Outlook\Today\'
  selection_value_stamp:
    TargetObject|endswith: '\Stamp'
    Details: 'DWORD (0x00000001)'
  selection_value_url:
    TargetObject|endswith:
    - '\URL'
    - '\UserDefinedUrl'
  filter_main_office:
    Image|startswith:
    - 'C:\Program Files\Common Files\Microsoft Shared\ClickToRun\'
    - 'C:\Program Files\Common Files\Microsoft Shared\ClickToRun\Updates\'
    Image|endswith: '\OfficeClickToRun.exe'
  condition: selection_main and 1 of selection_value_* and not 1 of filter_main_*
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  The "Potential Persistence Via Outlook Today Page" Sigma rule is designed to identify potential malicious persistence mechanisms that leverage Microsoft Outlook's Today page feature. This method can be exploited by attackers who modify registry values related to Outlook to execute arbitrary code every time Outlook is launched. The rule specifically looks for changes in registry keys associated with Outlook, particularly under `Software\Microsoft\Office\Outlook\Today\`. It tracks the existence of specific subkeys like `URL` or `UserDefinedUrl`, which can point to external resources invoked during Outlook's startup process. The rule uses data from Windows registry set logs, which detail any alterations made to registry keys that could indicate potential malicious activity.
  ### Investigation Steps
  - Review the relevant registry changes by leveraging EDR tools to examine the recent modifications in the `Software\Microsoft\Office\Outlook\Today\` keys and note any unexpected values.
  - Utilize the SIEM to correlate the timestamps of the detected registry modifications with user login activities and Outlook process launches for any anomalous patterns.
  - Check process execution logs to verify if `OfficeClickToRun.exe` was launched around the same time as the registry changes, noting any deviations from expected behavior.
  - Analyze network traffic and proxy logs for outbound connections initiated by Outlook around the time of the registry change, focusing on suspicious URLs or endpoints that align with known malicious indicators.
