title: Lolbas OneDriveStandaloneUpdater.exe Proxy Download
id: 3aff0be0-7802-4a7e-a4fa-c60c74bc5e1d
status: test
description: |
  Detects setting a custom URL for OneDriveStandaloneUpdater.exe to download a file from the Internet without executing any
  anomalous executables with suspicious arguments. The downloaded file will be in C:\Users\redacted\AppData\Local\Microsoft\OneDrive\StandaloneUpdaterreSignInSettingsConfig.json
references:
- https://lolbas-project.github.io/lolbas/Binaries/OneDriveStandaloneUpdater/
author: frack113
date: 2022-05-28
modified: 2023-08-17
tags:
- attack.command-and-control
- attack.t1105
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|contains: '\SOFTWARE\Microsoft\OneDrive\UpdateOfficeConfig\UpdateRingSettingURLFromOC'
  condition: selection
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This Sigma rule is designed to detect when a custom URL is set for the `OneDriveStandaloneUpdater.exe` process to download a configuration file from the Internet. Specifically, it involves monitoring registry changes, focusing on the `UpdateRingSettingURLFromOC` key associated with the OneDrive update configuration on Windows systems. When this key's value is modified, it indicates that an external URL is being used by OneDrive to obtain files, which could be a technique used by attackers to execute control over an organization's OneDrive service without downloading any directly suspicious executables with notable arguments. The primary data sources utilized for this detection include Windows registry change logs, which provide valuable insights into configuration alterations made to critical software.
  ### Investigation Steps
  - Utilize your EDR solution to track processes associated with `OneDriveStandaloneUpdater.exe` and analyze if there are any unusual command-line arguments or parent processes linked to the modification event.
  - Review recent changes in the Windows registry for the `UpdateRingSettingURLFromOC` key to identify when the custom URL was set and which user account performed the action.
  - Leverage the AV or endpoint protection platform to scan for any potentially malicious files that may have been downloaded following the change in the URL, particularly looking for anomalies in the OneDrive folder.
  - Examine proxy logs for outbound connections to the custom URL to assess if any data exfiltration or unauthorized downloads were initiated as a result of the modification.
