title: Office Macros Warning Disabled
id: 91239011-fe3c-4b54-9f24-15c86bb65913
related:
- id: a166f74e-bf44-409d-b9ba-ea4b2dd8b3cd
  type: obsolete
status: test
description: Detects registry changes to Microsoft Office "VBAWarning" to a value
  of "1" which enables the execution of all macros, whether signed or unsigned.
references:
- https://twitter.com/inversecos/status/1494174785621819397
- https://www.mcafee.com/blogs/other-blogs/mcafee-labs/zloader-with-a-new-infection-technique/
- https://securelist.com/scarcruft-surveilling-north-korean-defectors-and-human-rights-activists/105074/
author: Trent Liffick (@tliffick), Nasreddine Bencherchali (Nextron Systems)
date: 2020-05-22
modified: 2024-03-19
tags:
- attack.defense-evasion
- attack.t1112
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|endswith: '\Security\VBAWarnings'
    Details: 'DWORD (0x00000001)'
  condition: selection
falsepositives:
- Unlikely
level: high
notes: |
  ### Technical Context
  The "Office Macros Warning Disabled" Sigma rule is designed to detect registry changes that alter the behavior of Microsoft Office applications with respect to macros. Specifically, it monitors for modifications to the `VBAWarnings` registry key located in the Windows registry. When this key is set to a value of `1`, it enables the execution of all macros, which includes both signed and unsigned code. This can pose a significant security risk as it allows potentially harmful macros embedded in Office documents to run without user consent. The primary data source for this detection comes from Windows registry logs, specifically those that capture changes to the registry key associated with macro security settings.
  ### Investigation Steps
  - Review the recent registry changes on the affected system through EDR to identify who made the changes and when.
  - Analyze the user's process creation logs to determine if any Office applications were recently executed prior to the registry change.
  - Check the domain logs and proxy logs for any recent file downloads or document accesses from external sources that may have introduced malicious content.
  - Consult the AV and endpoint protection logs for any alerts or detections related to malicious macros or unusual behaviors around the time of the registry change.
