title: New File Association Using Exefile
id: 44a22d59-b175-4f13-8c16-cbaef5b581ff
status: test
description: Detects the abuse of the exefile handler in new file association. Used
  for bypass of security products.
references:
- https://twitter.com/mrd0x/status/1461041276514623491
author: Andreas Hunkeler (@Karneades)
date: 2021-11-19
modified: 2023-08-17
tags:
- attack.defense-evasion
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|contains: 'Classes\.'
    Details: 'exefile'
  condition: selection
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This detection rule targets suspicious modifications to the Windows Registry, specifically focusing on new file associations that utilize the executable file handler, `exefile`. By monitoring changes in the registry where file associations are defined (e.g., `HKEY_CLASSES_ROOT`), the rule aims to identify potential bypass attempts against security products. Attackers often exploit file associations to execute malicious payloads, thereby evading detection; for instance, associating a harmless file type with the `exefile` handler can lead to unintended execution of arbitrary commands. The technical data sources involved in this rule include event logs generated by registry modifications on Windows systems.
  ### Investigation Steps
  - Review recent registry change events in your EDR system to identify any new file associations, particularly those related to `exefile`.  
  - Analyze command-line activity associated with the identified registry modifications to uncover any potentially malicious behavior.  
  - Examine logs from your antivirus and endpoint protection tools to check for alerts or blocked actions related to the impacted file types.  
  - Investigate traffic patterns in your proxy and network logs to determine if there was any unusual data exfiltration or command-and-control (C2) communication following the file association change.
