title: CurrentControlSet Autorun Keys Modification
id: f674e36a-4b91-431e-8aef-f8a96c2aca35
related:
- id: 17f878b8-9968-4578-b814-c4217fc5768c
  type: obsolete
status: test
description: Detects modification of autostart extensibility point (ASEP) in registry.
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1547.001/T1547.001.md
- https://learn.microsoft.com/en-us/sysinternals/downloads/autoruns
- https://gist.github.com/GlebSukhodolskiy/0fc5fa5f482903064b448890db1eaf9d     # a list with registry keys
author: Victor Sergeev, Daniil Yugoslavskiy, Gleb Sukhodolskiy, Timur Zinniatullin,
  oscd.community, Tim Shelton, frack113 (split)
date: 2019-10-25
modified: 2023-08-17
tags:
- attack.persistence
- attack.t1547.001
logsource:
  category: registry_set
  product: windows
detection:
  system_control_base:
    TargetObject|contains: '\SYSTEM\CurrentControlSet\Control'
  system_control_keys:
    TargetObject|contains:
    - '\Terminal Server\WinStations\RDP-Tcp\InitialProgram'
    - '\Terminal Server\Wds\rdpwd\StartupPrograms'
    - '\SecurityProviders\SecurityProviders'
    - '\SafeBoot\AlternateShell'
    - '\Print\Providers'
    - '\Print\Monitors'
    - '\NetworkProvider\Order'
    - '\Lsa\Notification Packages'
    - '\Lsa\Authentication Packages'
    - '\BootVerificationProgram\ImagePath'
  filter_empty:
    Details: '(Empty)'
  filter_cutepdf:
    Image: 'C:\Windows\System32\spoolsv.exe'
    TargetObject|contains: '\Print\Monitors\CutePDF Writer Monitor'
    Details:
    - 'cpwmon64_v40.dll'
    - 'CutePDF Writer'
  filter_onenote:
    Image: C:\Windows\System32\spoolsv.exe
    TargetObject|contains: 'Print\Monitors\Appmon\Ports\Microsoft.Office.OneNote_'
    User|contains:     # covers many language settings
    - 'AUTHORI'
    - 'AUTORI'
  filter_poqexec:
    Image: 'C:\Windows\System32\poqexec.exe'
    TargetObject|endswith: '\NetworkProvider\Order\ProviderOrder'
  filter_realvnc:
    Image: 'C:\Windows\System32\spoolsv.exe'
    TargetObject|endswith: '\Print\Monitors\MONVNC\Driver'
    Details: 'VNCpm.dll'
  condition: all of system_control_* and not 1 of filter_*
fields:
- SecurityID
- ObjectName
- OldValueType
- NewValueType
falsepositives:
- Legitimate software automatically (mostly, during installation) sets up autorun
  keys for legitimate reason
- Legitimate administrator sets up autorun keys for legitimate reason
level: medium
notes: |
  n
  ### Technical Context
  The "CurrentControlSet Autorun Keys Modification" rule is designed to detect unauthorized modifications to critical autostart settings in the Windows registry, specifically within the CurrentControlSet area. These registry keys are integral to the operation of persistent software that launches during system boot or logon, making them a common target for malware seeking longevity on a system. The rule analyzes logs from Windows registry changes, focusing on known autostart extensibility points (ASEPs) that may indicate malicious persistence methods, aligned with the MITRE ATT&CK tactic for Persistence (T1547.001). It tracks changes to specific registry keys that are typically associated with remote access tools, printing utilities, and system configurations that could suggest malicious intent.
  The data sources leveraged in this detection include system control base registry logs and registry set change notifications. By monitoring these logs, the detection rule can identify anomalies or unauthorized modifications that deviate from the established baseline of legitimate autorun configurations.
  ### Investigation Steps
  - **Review Recent Registry Changes**: Use Windows Event Logs to identify recent modifications to the autorun-related registry keys. Pay special attention to the user accounts responsible for these changes to assess legitimacy.
  - **Correlate with Process Activity**: Utilize EDR tools to review process creation logs around the time of the registry modification alerts. Investigate any processes related to spooling or remote access tools that are running concurrently.
  - **Analyze User Account Behavior**: Check logins and activities associated with accounts that made modifications to the registry. Verify whether these actions align with the typical behavior of the account, such as task automation or legitimate administrative tasks.
  - **Investigate Network Connections**: Examine network logs for unusual outbound connections or command-and-control (C2) communications that may correlate with the timing of the autorun keys modification. This helps identify any remote access that could be indicative of exploitation.
  ### Prioritization
  The severity level is classified as medium due to the potential risk posed by changes to autorun settings, which can indicate persistence mechanisms employed by an attacker. Effective response is crucial as such modifications can allow the attacker to maintain access and control over the compromised system.
  ### Blind Spots and Assumptions
  This rule may not fire if legitimate software installations or administrator activities occur that modify autorun keys for valid purposes, leading to potential false positives. Additionally, sophisticated adversaries could employ techniques to mask their activities or use steganographic methods to hide changes in the registry, avoiding detection. It's vital that engineers understand these limitations and collaborate with incident response teams to fine-tune rules and minimize irrelevant alerts.
  > **Disclaimer:** This investigation guide was created using generative AI technology and has not been reviewed for its accuracy and relevance. While every effort has been made to ensure its quality, we recommend validating the content and adapting it to suit specific environment and operational needs. Please communicate any changes to the detection engineering team.
