title: Service Binary in Suspicious Folder
id: a07f0359-4c90-4dc4-a681-8ffea40b4f47
related:
- id: c0abc838-36b0-47c9-b3b3-a90c39455382
  type: obsolete
status: test
description: Detect the creation of a service with a service binary located in a suspicious
  directory
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.001/T1562.001.md
author: Florian Roth (Nextron Systems), frack113
date: 2022-05-02
modified: 2023-08-17
tags:
- attack.defense-evasion
- attack.t1112
logsource:
  category: registry_set
  product: windows
detection:
  selection_1:
    TargetObject|startswith: 'HKLM\System\CurrentControlSet\Services\'
    TargetObject|endswith: '\Start'
    Image|contains:
    - '\Users\Public\'
    - '\Perflogs\'
    - '\ADMIN$\'
    - '\Temp\'
    Details:
    - 'DWORD (0x00000000)'          # boot
    - 'DWORD (0x00000001)'          # System
    - 'DWORD (0x00000002)'          # Automatic
            # 3 - Manual , 4 - Disabled
  selection_2:
    TargetObject|startswith: 'HKLM\System\CurrentControlSet\Services\'
    TargetObject|endswith: '\ImagePath'
    Details|contains:
    - '\Users\Public\'
    - '\Perflogs\'
    - '\ADMIN$\'
    - '\Temp\'
  filter_1:
    Image|contains|all:     # Filter FP with Avast software
    - '\Common Files\'
    - '\Temp\'
  condition: 1 of selection_* and not 1 of filter_*
falsepositives:
- Unknown
level: high
notes: |
  n
  ### Technical Context
  The "Service Binary in Suspicious Folder" Sigma rule detects the creation of Windows services that reference binary files stored in unauthorized or unusual directories. The rule focuses on registry keys associated with service configurations, particularly examining the paths specified in the 'ImagePath' and 'Start' registry entries. It targets suspicious directories such as `C:\Users\Public\`, `C:\Perflogs\`, `C:\ADMIN$`, and `C:\Temp\`, as malware often uses these locations to obscure its presence. By monitoring changes in the `HKLM\System\CurrentControlSet\Services\` registry hive, the rule seeks to identify potential malicious activity, supporting the MITRE ATT&CK tactics of Defense Evasion (T1140) and the specific technique T1112 which involves service creation. 
  ### Investigation Steps
  - **Check Registry Changes**: Utilize a registry monitoring tool to examine recent changes made to the `HKLM\System\CurrentControlSet\Services\` path, focusing particularly on new entries or changes to existing service configurations.
  - **Review Security Logs**: Access Windows Security Event Logs for events related to service creation and modifications, specifically looking for Event ID 7045 that corresponds to a service being installed.
  - **Correlate with EDR**: Use EDR to identify any processes associated with the suspicious service and examine their behavior, including command-line arguments and parent process information.
  - **Analyze File Locations**: Investigate the files located in the directories flagged by the rule. Ensure they are legitimate, and assess whether any unusual activity (like network connections) is associated with these files.
  ### Prioritization
  The alert is categorized as high severity due to the potential for adversaries to establish persistence through unauthorized services, which can lead to further compromise of the system and network.
  ### Blind Spots and Assumptions
  Potential blind spots include legitimate applications that may use common directories for binaries, potentially resulting in false positives. Additionally, this rule may not fire if the service creation is done through methods that do not update the registry, such as direct API calls, or if predetermined legitimate services are in use. Moreover, if an adversary employs legitimate channels to deploy their services, this detection could be circumvented.
  > **Disclaimer:** This investigation guide was created using generative AI technology and has not been reviewed for its accuracy and relevance. While every effort has been made to ensure its quality and applicability, we recommend validating the content and adapting it to suit specific environment and operational needs. Please communicate any changes to the detection engineering team.
