title: Persistence Via Disk Cleanup Handler - Autorun
id: d4e2745c-f0c6-4bde-a3ab-b553b3f693cc
status: test
description: |
  Detects when an attacker modifies values of the Disk Cleanup Handler in the registry to achieve persistence via autorun.
  The disk cleanup manager is part of the operating system.
  It displays the dialog box […] The user has the option of enabling or disabling individual handlers by selecting or clearing their check box in the disk cleanup manager's UI.
  Although Windows comes with a number of disk cleanup handlers, they aren't designed to handle files produced by other applications.
  Instead, the disk cleanup manager is designed to be flexible and extensible by enabling any developer to implement and register their own disk cleanup handler.
  Any developer can extend the available disk cleanup services by implementing and registering a disk cleanup handler.
references:
- https://persistence-info.github.io/Data/diskcleanuphandler.html
- https://www.hexacorn.com/blog/2018/09/02/beyond-good-ol-run-key-part-86/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-07-21
modified: 2023-08-17
tags:
- attack.persistence
logsource:
  category: registry_set
  product: windows
detection:
  root:
    TargetObject|contains: '\SOFTWARE\Microsoft\Windows\CurrentVersion\Explorer\VolumeCaches\'
  selection_autorun:
        # Launching PreCleanupString / CleanupString programs w/o gui, i.e. while using e.g. /autoclean
    TargetObject|contains: '\Autorun'
    Details: 'DWORD (0x00000001)'
  selection_pre_after:
    TargetObject|contains:
    - '\CleanupString'
    - '\PreCleanupString'
    Details|contains:
            # Add more as you see fit
    - 'cmd'
    - 'powershell'
    - 'rundll32'
    - 'mshta'
    - 'cscript'
    - 'wscript'
    - 'wsl'
    - '\Users\Public\'
    - '\Windows\TEMP\'
    - '\Microsoft\Windows\Start Menu\Programs\Startup\'
  condition: root and 1 of selection_*
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  The "Persistence Via Disk Cleanup Handler 
  - Autorun" detection rule is designed to identify unauthorized modifications to the Windows registry that enable adversaries to achieve persistence on a compromised system. Specifically, it focuses on changes within the Disk Cleanup Handler’s settings in the registry. By monitoring specific registry paths and values, this rule detects when an attacker alters the `Autorun` configuration or sets up executable commands—such as `cmd`, `powershell`, or similar—to be triggered automatically during disk cleanup processes. The rule uses data from Windows registry logs to identify these potentially malicious alterations that could lead to unauthorized command execution.
  Key technical data sources involved in this detection include registry change logs, which capture adjustments to the system’s persistence mechanisms. Specifically, the rule looks for operations targeting paths within the `\SOFTWARE\Microsoft\Windows\CurrentVersion\Explorer\VolumeCaches\` registry branch, along with indications that certain commands are set to run automatically without user intervention.
  ### Investigation Steps
  - Review the Windows registry logs for recent modifications to the paths specified in the detection rule, focusing specifically on the Disk Cleanup Handler settings.
  - Utilize EDR tools to check for any unusual or malicious processes that may have been executed as a result of the detected registry changes.
  - Analyze command-line parameters and execution contexts around the identified `cmd`, `powershell`, and other scripts listed in the rule for any signs of unauthorized execution.
  - Consult proxy and network logs to identify any outbound connections originating from the processes linked to the Disk Cleanup Handler alterations, which may indicate exfiltration of data or communication with command and control servers.
