title: New Root or CA or AuthRoot Certificate to Store
id: d223b46b-5621-4037-88fe-fda32eead684
status: test
description: Detects the addition of new root, CA or AuthRoot certificates to the
  Windows registry
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1553.004/T1553.004.md#atomic-test-6---add-root-certificate-to-currentuser-certificate-store
- https://posts.specterops.io/code-signing-certificate-cloning-attacks-and-defenses-6f98657fc6ec
author: frack113
date: 2022-04-04
modified: 2023-08-17
tags:
- attack.impact
- attack.t1490
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|contains:
    - '\SOFTWARE\Microsoft\SystemCertificates\Root\Certificates\'
    - '\SOFTWARE\Policies\Microsoft\SystemCertificates\Root\Certificates\'
    - '\SOFTWARE\Microsoft\EnterpriseCertificates\Root\Certificates\'
    - '\SOFTWARE\Microsoft\SystemCertificates\CA\Certificates\'
    - '\SOFTWARE\Policies\Microsoft\SystemCertificates\CA\Certificates\'
    - '\SOFTWARE\Microsoft\EnterpriseCertificates\CA\Certificates\'
    - '\SOFTWARE\Microsoft\SystemCertificates\AuthRoot\Certificates\'
    - '\SOFTWARE\Policies\Microsoft\SystemCertificates\AuthRoot\Certificates\'
    - '\SOFTWARE\Microsoft\EnterpriseCertificates\AuthRoot\Certificates\'
    TargetObject|endswith: '\Blob'
    Details: 'Binary Data'
  condition: selection
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  This Sigma rule detects the addition of new root, Certificate Authority (CA), or AuthRoot certificates to the Windows registry, specifically targeting key paths where such certificates are stored. These registry paths include system and enterprise certificate stores, which can be manipulated by both legitimate software installations and malicious actors attempting to introduce unauthorized certificates. By monitoring for changes in these registry keys, security teams can identify potential certificate misuse, such as trusted certificates being added without appropriate authorization, which could lead to man-in-the-middle attacks or other forms of exploitation.
  The rule analyzes Windows registry set logs to identify any entries within specified certificate directories. The detection specifically looks for entries that contain certain key paths associated with root certificates and checks for binary data that indicates a new certificate may have been added. The insights gained from this detection can help SOC analysts assess the legitimacy of certificate additions and identify potential security incidents early.
  ### Investigation Steps
  - Query the EDR to identify the process responsible for the registry change, focusing on process creation logs around the time of the alert to find any suspicious activities.
  - Review Windows registry logs using your SIEM to gather context on previous additions or modifications of certificates in the targeted paths, identifying any patterns or anomalies.
  - Examine endpoint logs to trace user activity prior to the certificate addition event, checking for any unauthorized access or administrative tasks performed on the affected systems.
  - Analyze network traffic through the NDR for any unusual communication patterns that may indicate exploitation attempts following the addition of the new certificates, including communication with known malicious domains.
