title: Default RDP Port Changed to Non Standard Port
id: 509e84b9-a71a-40e0-834f-05470369bd1e
status: test
description: |
  Detects changes to the default RDP port.
  Remote desktop is a common feature in operating systems. It allows a user to log into a remote system using an interactive session with a graphical user interface.
  Microsoft refers to its implementation of the Remote Desktop Protocol (RDP) as Remote Desktop Services (RDS).
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1021.001/T1021.001.md#atomic-test-1---rdp-to-domaincontroller
author: frack113
date: 2022-01-01
modified: 2024-03-25
tags:
- attack.persistence
- attack.t1547.010
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|endswith: '\Control\Terminal Server\WinStations\RDP-Tcp\PortNumber'
  filter_main_port:
    Details: DWORD (0x00000d3d)     # 3389
  condition: selection and not 1 of filter_main_*
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This Sigma rule is designed to detect changes to the default Remote Desktop Protocol (RDP) port on Windows systems, which is typically set to port 3389. By monitoring the Windows registry for modifications to the `PortNumber` value located at `\Control\Terminal Server\WinStations\RDP-Tcp`, the rule captures any attempts to change the RDP port to a non-standard value. This is relevant for incident response, as malicious actors often alter the default RDP port to obfuscate unauthorized remote access. The detection mechanism relies on registry set logs with a focus on the `TargetObject` that indicates the RDP port setting.
  ### Investigation Steps
  - Review EDR alerts for any process creation events occurring around the time the RDP port was changed, especially looking for unauthorized changes made by unexpected sources.
  - Examine Windows event logs related to security and system events to identify any attempts to connect to RDP or there have been failed login attempts that may indicate an exploit attempt.
  - Query your network firewall (NGFW) logs for any traffic directed to the new RDP port, establishing if any external IP addresses have made connections.
  - Cross-reference cloud platform logs (if applicable) for any deployments or changes that may have affected remote desktop configurations, especially in environments leveraging hybrid or multi-cloud setups.
