title: Registry Explorer Policy Modification
id: 1c3121ed-041b-4d97-a075-07f54f20fb4a
status: test
description: Detects registry modifications that disable internal tools or functions
  in explorer (malware like Agent Tesla uses this technique)
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1112/T1112.md
author: frack113
date: 2022-03-18
modified: 2023-08-17
tags:
- attack.defense-evasion
- attack.t1112
logsource:
  category: registry_set
  product: windows
detection:
  selection_set_1:
    TargetObject|endswith:
    - 'SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\Explorer\NoLogOff'
    - 'SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\Explorer\NoDesktop'
    - 'SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\Explorer\NoRun'
    - 'SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\Explorer\NoFind'
    - 'SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\Explorer\NoControlPanel'
    - 'SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\Explorer\NoFileMenu'
    - 'SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\Explorer\NoClose'
    - 'SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\Explorer\NoSetTaskbar'
    - 'SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\Explorer\NoPropertiesMyDocuments'
    - 'SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\Explorer\NoTrayContextMenu'
    Details: 'DWORD (0x00000001)'
  condition: selection_set_1
falsepositives:
- Legitimate admin script
level: medium
notes: |
  ### Technical Context
  The "Registry Explorer Policy Modification" detection rule is designed to identify modifications in the Windows registry that can disable critical user interface functionalities in Windows Explorer. This rule specifically targets changes to various registry keys under `SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\Explorer`, which are typically manipulated by malware such as Agent Tesla to hinder user activity and facilitate persistence. The detection operates by monitoring for `DWORD` entries set to `0x00000001` in these specified registry paths, signaling that features like logoff, desktop access, and control panel operations may be restricted. By leveraging registry set logs from Windows, this rule helps reveal potentially malicious alterations aimed at evading detection by internal security measures.
  ### Investigation Steps
  - Investigate the host’s registry changes by reviewing the registry set logs to confirm modifications to the targeted keys in the specified paths.
  - Use EDR tools to analyze the processes that made these registry changes, checking for unusual or suspicious activity associated with them.
  - Check proxy and VPN logs to see if there are unexplained outbound connections or access to non-standard services occurring around the time of the registry changes.
  - Review any alerts generated by AV solutions to determine if they have flagged related processes or malware variants, providing further context to the detected registry modifications.
