title: Driver Added To Disallowed Images In HVCI - Registry
id: 555155a2-03bf-4fe7-af74-d176b3fdbe16
related:
- id: 44cee399-f6b1-45cc-a87c-ea14c6064d6b
  type: similar
status: experimental
description: |
  Detects changes to the "HVCIDisallowedImages" registry value to potentially add a driver to the list, in order to prevent it from loading.
references:
- https://github.com/yardenshafir/conference_talks/blob/3de1f5d7c02656c35117f067fbff0a219c304b09/OffensiveCon_2023_Your_Mitigations_are_My_Opportunities.pdf
- https://x.com/yarden_shafir/status/1822667605175324787
author: Nasreddine Bencherchali (Nextron Systems), Omar Khaled (@beacon_exe)
date: 2023-12-05
modified: 2024-08-21
tags:
- attack.defense-evasion
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|contains|all:
    - '\Control\CI\'
    - '\HVCIDisallowedImages'
  condition: selection
falsepositives:
- Legitimate usage of this key would also trigger this. Investigate the driver being
  added and make sure its intended
level: high
notes: |
  ### Technical Context
  This Sigma rule is designed to detect modifications to the "HVCIDisallowedImages" registry key in Windows, which is used to manage Hypervisor-protected Code Integrity (HVCI). The primary goal is to identify instances where a driver is being added to this disallowed image list, aiming to prevent the loading of potentially malicious or unauthorized drivers. By monitoring changes to this specific registry path, security teams can proactively identify possible attempts to evade security controls through driver manipulation.
  The data sources involved in this detection include Windows registry logs, specifically focusing on right access or changes made to the "HVCIDisallowedImages" key. When changes occur in this area, it is crucial for incident responders to investigate the context of the change to determine if it is a legitimate action or an indicator of potential threats.
  ### Investigation Steps
  - Use your EDR tool to review recent process activity and identify any processes that attempted to load drivers or were associated with changes to registry settings in the last 24 hours.
  - Examine the Windows registry set logs for alterations made to the "HVCIDisallowedImages" key, paying particular attention to timestamps and the user or system account that made the change.
  - Cross-reference the identified driver with threat intelligence feeds to verify whether it has any known malicious associations or vulnerabilities.
  - Evaluate the context of the change, including user roles and recent system activity, to discern whether the addition of the driver appears legitimate or if further investigation is warranted.
