title: CrashControl CrashDump Disabled
id: 2ff692c2-4594-41ec-8fcb-46587de769e0
status: test
description: Detects disabling the CrashDump per registry (as used by HermeticWiper)
references:
- https://www.sentinelone.com/labs/hermetic-wiper-ukraine-under-attack/
author: Tobias Michalski (Nextron Systems)
date: 2022-02-24
modified: 2023-08-17
tags:
- attack.t1564
- attack.t1112
logsource:
  product: windows
  category: registry_set
detection:
  selection:
    TargetObject|contains: 'SYSTEM\CurrentControlSet\Control\CrashControl'
    Details: 'DWORD (0x00000000)'
  condition: selection
falsepositives:
- Legitimate disabling of crashdumps
level: medium
notes: |
  ### Technical Context
  The "CrashControl CrashDump Disabled" detection rule identifies attempts to disable crash dumps on Windows systems, a maneuver often utilized by malware like HermeticWiper to evade detection and forensic analysis. When crash dumps are disabled via the registry setting located at `SYSTEM\CurrentControlSet\Control\CrashControl`, the value is set to `DWORD (0x00000000)`. This act can indicate malicious activity as attackers aim to prevent system crash data from being collected, making it harder for incident responders to analyze the events leading up to a compromise. The rule leverages Windows registry set logs to trigger alerts when such disabling occurs, enabling security teams to take action.
  ### Investigation Steps
  - Review recent registry changes in EDR solutions to confirm if the crash dump setting was modified, noting the timestamp and the user or process responsible for the change.
  - Correlate the timing of the registry modification with other security alerts or incidents to establish if this change relates to any known malicious activity.
  - Check for associated process creation logs around the time of the registry change to identify any unusual or unexpected processes that may have initiated the disabling of the crash dump.
  - Analyze network logs in your NDR or proxy systems to investigate any outbound connections or anomalies that coincide with the registry modification, helping to clarify if additional malicious behavior is present.
