title: Disable Internal Tools or Feature in Registry
id: e2482f8d-3443-4237-b906-cc145d87a076
status: test
description: Detects registry modifications that change features of internal Windows
  tools (malware like Agent Tesla uses this technique)
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1112/T1112.md
- https://www.mandiant.com/resources/unc2165-shifts-to-evade-sanctions
- https://blogs.vmware.com/security/2022/11/batloader-the-evasive-downloader-malware.html
- https://www.malwarebytes.com/blog/detections/pum-optional-nodispbackgroundpage
- https://www.malwarebytes.com/blog/detections/pum-optional-nodispcpl
author: frack113, Nasreddine Bencherchali (Nextron Systems), CrimpSec
date: 2022-03-18
modified: 2023-11-20
tags:
- attack.defense-evasion
- attack.t1112
logsource:
  category: registry_set
  product: windows
detection:
  selection_set_1:
    TargetObject|endswith:
    - 'SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\Explorer\StartMenuLogOff'
    - 'SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\System\DisableChangePassword'
    - 'SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\System\DisableLockWorkstation'
    - 'SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\System\DisableRegistryTools'
    - 'SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\System\DisableTaskmgr'
    - 'SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\System\NoDispBackgroundPage'
    - 'SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\System\NoDispCPL'
    - 'SOFTWARE\Policies\Microsoft\Windows\Explorer\DisableNotificationCenter'
    - 'SOFTWARE\Policies\Microsoft\Windows\System\DisableCMD'
    Details: 'DWORD (0x00000001)'
  selection_set_0:
    TargetObject|endswith:
    - 'SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\System\ConsentPromptBehaviorAdmin'
    - 'SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\System\shutdownwithoutlogon'
    - 'SOFTWARE\Microsoft\Windows\CurrentVersion\PushNotifications\ToastEnabled'
    - 'SYSTEM\CurrentControlSet\Control\Storage\Write Protection'
    - 'SYSTEM\CurrentControlSet\Control\StorageDevicePolicies\WriteProtect'
    Details: 'DWORD (0x00000000)'
  condition: 1 of selection_set_*
falsepositives:
- Legitimate admin script
level: medium
notes: |
  n
  ### Technical Context
  The detection rule "Disable Internal Tools or Feature in Registry" is designed to identify suspicious modifications in the Windows registry that could indicate malicious activity, specifically by malware such as Agent Tesla. This rule monitors registry changes targeting key entries that control internal Windows features and tools, such as disabling the password change feature, locking the workstation, or preventing access to Task Manager and the registry itself. By logging activities that involve altering these particular registry keys, the rule becomes a proactive measure against common evasion techniques employed by attackers to maintain persistence and control over compromised systems. This rule aligns with the MITRE ATT&CK technique T1112: Modify Registry, which is categorized under the Defense Evasion tactic.
  ### Investigation Steps
  - **Review Registry Changes:** Utilize the Windows Event Log to check for any recent modifications made to the specified registry keys, focusing particularly on entries listed in the detection rule.
  - **Correlate with Process Activity:** Leverage EDR tools to view any associated process creation events or activities around the time the registry changes occurred to identify potential malicious processes.
  - **Check User Context:** Analyze the user accounts responsible for making these registry modifications by reviewing login logs and aligning them with user activity to ensure they were authorized operations.
  - **Analyze Related Network Traffic:** Examine network connection logs (NDR) and proxy logs to assess whether any suspicious external communications coincide with the timing of the registry changes.
  ### Prioritization
  The alert triggered by this rule is classified as medium severity due to the potential for significant impact on system functionality and user experience, particularly if an unauthorized user is attempting to evade detection and maintain persistence by disabling critical security features of the Windows environment.
  ### Blind Spots and Assumptions
  This rule may not fire if an administrator legitimately alters the registry for maintenance or configuration purposes, which can lead to false positives. Additionally, if malware employs sophisticated techniques to modify registry entries unnoticed or if these changes occur using direct registry manipulation tools outside the monitored context, detection may fail. It is also assumed that proper logging and monitoring configurations are in place; otherwise, malicious actions might go undetected.
  > **Disclaimer:** This investigation guide was created using generative AI technology and has not been reviewed for its accuracy and relevance. While every effort has been made to ensure its quality, we recommend validating the content and adapting it to suit specific environment and operational needs. Please communicate any changes to the detection engineering team.
