title: Uncommon Microsoft Office Trusted Location Added
id: f742bde7-9528-42e5-bd82-84f51a8387d2
related:
- id: a0bed973-45fa-4625-adb5-6ecdf9be70ac
  type: derived
status: test
description: Detects changes to registry keys related to "Trusted Location" of Microsoft
  Office where the path is set to something uncommon. Attackers might add additional
  trusted locations to avoid macro security restrictions.
references:
- Internal Research
- https://admx.help/?Category=Office2016&Policy=excel16.Office.Microsoft.Policies.Windows::L_TrustedLoc01
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023-06-21
modified: 2023-09-29
tags:
- attack.defense-evasion
- attack.t1112
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|contains: 'Security\Trusted Locations\Location'
    TargetObject|endswith: '\Path'
  filter_exclude_known_paths:
    Details|contains:
    - '%APPDATA%\Microsoft\Templates'
    - '%%APPDATA%%\Microsoft\Templates'
    - '%APPDATA%\Microsoft\Word\Startup'
    - '%%APPDATA%%\Microsoft\Word\Startup'
    - ':\Program Files (x86)\Microsoft Office\root\Templates\'
    - ':\Program Files\Microsoft Office (x86)\Templates'
    - ':\Program Files\Microsoft Office\root\Templates\'
    - ':\Program Files\Microsoft Office\Templates\'
  filter_main_office_click_to_run:
    Image|contains: ':\Program Files\Common Files\Microsoft Shared\ClickToRun\'
    Image|endswith: '\OfficeClickToRun.exe'
  filter_main_office_apps:
    Image|contains:
    - ':\Program Files\Microsoft Office\'
    - ':\Program Files (x86)\Microsoft Office\'
  condition: selection and not 1 of filter_main_* and not 1 of filter_exclude_*
falsepositives:
- Other unknown legitimate or custom paths need to be filtered to avoid false positives
level: high
notes: |
  ### Technical Context
  This detection rule focuses on monitoring changes to the Microsoft Office Trusted Locations within the Windows registry. Attackers can manipulate these registry entries to create uncommon trusted paths, allowing the execution of potentially malicious macros without triggering standard security restrictions. The rule specifically looks for modifications to the registry keys under `Security\Trusted Locations\Location` that end with `\Path`. It filters out known safe paths, such as those commonly used by Microsoft Office applications, to avoid false positives. The underlying data sources for this detection include Windows registry set logs, which capture modifications to registry keys.
  ### Investigation Steps
  - Use EDR tools to review recent changes to the registry related to Office Trusted Locations, focusing specifically on unusual paths added to the trusted locations.
  - Search AV and application logs for potential malicious activity indicating the execution of macros from unfamiliar trusted paths.
  - Consult Proxy logs to track any unusual outbound connections from applications that may be leveraging these newly added trusted locations.
  - Review cloud logging services in Azure, AWS, or GCP to identify any associated user activity, file access patterns, or other anomalies that could be linked to the suspicious registry changes.
