title: Potential PendingFileRenameOperations Tampering
id: 4eec988f-7bf0-49f1-8675-1e6a510b3a2a
status: test
description: |
  Detect changes to the "PendingFileRenameOperations" registry key from uncommon or suspicious images locations to stage currently used files for rename or deletion after reboot.
references:
- https://any.run/report/3ecd4763ffc944fdc67a9027e459cd4f448b1a8d1b36147977afaf86bbf2a261/64b0ba45-e7ce-423b-9a1d-5b4ea59521e6
- https://devblogs.microsoft.com/scripting/determine-pending-reboot-statuspowershell-style-part-1/
- https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-2000-server/cc960241(v=technet.10)?redirectedfrom=MSDN
- https://www.trendmicro.com/en_us/research/21/j/purplefox-adds-new-backdoor-that-uses-websockets.html
- https://www.trendmicro.com/en_us/research/19/i/purple-fox-fileless-malware-with-rookit-component-delivered-by-rig-exploit-kit-now-abuses-powershell.html
author: frack113
date: 2023-01-27
modified: 2024-07-03
tags:
- attack.defense-evasion
- attack.t1036.003
logsource:
  category: registry_set
  product: windows
detection:
  selection_main:
    EventType: 'SetValue'
    TargetObject|contains: '\CurrentControlSet\Control\Session Manager\PendingFileRenameOperations'
  selection_susp_paths:
    Image|contains:
    - '\AppData\Local\Temp\'
    - '\Users\Public\'
  selection_susp_images:
    Image|endswith:
    - '\reg.exe'
    - '\regedit.exe'
  condition: selection_main and 1 of selection_susp_*
falsepositives:
- Installers and updaters may set currently in use files for rename or deletion after
  a reboot.
level: medium
notes: |
  ### Technical Context
  This detection rule focuses on monitoring changes to the Windows registry key **PendingFileRenameOperations**, which is utilized to schedule files for rename or deletion during system startup. Specifically, it identifies alterations to this key made by processes originating from uncommon or suspicious directories, such as **Temp** and **Public** folders, or initiated by potentially malicious executables like **reg.exe** and **regedit.exe**. By analyzing registry set events, the rule aims to detect deceptive actions that attackers may use to manipulate system behavior post-reboot, as this can indicate an attempt to persistently evade detection and maintain control over compromised systems. 
  The relevant technical sources for this rule include **registry set logs**, which will capture the modification events, and process information to ascertain the locations of executables interacting with the registry. If the rule's conditions are triggered, it suggests that a potentially malicious actor is attempting to manipulate critical system functions.
  ### Investigation Steps
  - Review the registry set logs for changes to the **PendingFileRenameOperations** key to confirm the specific values being set and associated timestamp details.
  - Utilize EDR tools to examine the process tree and investigate the execution paths of suspicious executables like **reg.exe** or **regedit.exe**, particularly regarding their source directories.
  - Check the context of the suspicious image locations by analyzing logs from **AV** solutions to identify any flagged activities or known indicators of compromise associated with these paths.
  - Conduct a comprehensive review of the affected system using **NTA** (Network Traffic Analysis) to identify any abnormal network activity that may correlate with the registry modifications, providing insight into potential exfiltration or command and control connections.
