title: Potentially Suspicious ODBC Driver Registered
id: e4d22291-f3d5-4b78-9a0c-a1fbaf32a6a4
status: test
description: Detects the registration of a new ODBC driver where the driver is located
  in a potentially suspicious location
references:
- https://www.hexacorn.com/blog/2020/08/23/odbcconf-lolbin-trifecta/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023-05-23
modified: 2023-08-17
tags:
- attack.persistence
- attack.t1003
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|contains: '\SOFTWARE\ODBC\ODBCINST.INI\'
    TargetObject|endswith:
    - '\Driver'
    - '\Setup'
    Details|contains:
    - ':\PerfLogs\'
    - ':\ProgramData\'
    - ':\Temp\'
    - ':\Users\Public\'
    - ':\Windows\Registration\CRMLog'
    - ':\Windows\System32\com\dmp\'
    - ':\Windows\System32\FxsTmp\'
    - ':\Windows\System32\Microsoft\Crypto\RSA\MachineKeys\'
    - ':\Windows\System32\spool\drivers\color\'
    - ':\Windows\System32\spool\PRINTERS\'
    - ':\Windows\System32\spool\SERVERS\'
    - ':\Windows\System32\Tasks_Migrated\'
    - ':\Windows\System32\Tasks\Microsoft\Windows\SyncCenter\'
    - ':\Windows\SysWOW64\com\dmp\'
    - ':\Windows\SysWOW64\FxsTmp\'
    - ':\Windows\SysWOW64\Tasks\Microsoft\Windows\PLA\System\'
    - ':\Windows\SysWOW64\Tasks\Microsoft\Windows\SyncCenter\'
    - ':\Windows\Tasks\'
    - ':\Windows\Temp\'
    - ':\Windows\Tracing\'
    - '\AppData\Local\Temp\'
    - '\AppData\Roaming\'
  condition: selection
falsepositives:
- Unlikely
level: high
notes: |
  ### Technical Context
  This detection rule identifies potentially suspicious activity involving the registration of new ODBC (Open Database Connectivity) drivers in Windows environments. Specifically, it looks for changes in the Windows registry that indicate an ODBC driver is being registered in high-risk locations, such as temporary folders, user public directories, and certain Windows system paths. The critical data source for this rule is Windows registry set logs, which capture modifications to the registry, particularly targeting the `\SOFTWARE\ODBC\ODBCINST.INI\` path. The rule flags registrations where the driver's path is associated with locations known to be used by malicious actors for persistence and evasion tactics, raising the concern that these actions may be indicative of an Attack Vector.
  ### Investigation Steps
  - Use EDR tools to search for recent process creation events around the time of the ODBC driver registration to identify any suspicious or unauthorized executables that may have initiated this registration.
  - Review the Windows registry directly to confirm the presence of the registered ODBC driver and to collect details on its properties and the associated user account if possible.
  - Check the system logs for any related events, particularly in the Application and Security logs, which may reveal attempts to create, modify, or delete entries linked to the suspicious ODBC driver.
  - Analyze network traffic through the NGFW or NDR to identify any unexpected outbound connections made by the processes associated with the new driver, particularly to known command and control domains.
