title: RestrictedAdminMode Registry Value Tampering
id: d6ce7ebd-260b-4323-9768-a9631c8d4db2
related:
- id: 28ac00d6-22d9-4a3c-927f-bbd770104573     # process_creation
  type: similar
status: test
description: |
  Detects changes to the "DisableRestrictedAdmin" registry value in order to disable or enable RestrictedAdmin mode.
  RestrictedAdmin mode prevents the transmission of reusable credentials to the remote system to which you connect using Remote Desktop.
  This prevents your credentials from being harvested during the initial connection process if the remote server has been compromise
references:
- https://github.com/redcanaryco/atomic-red-team/blob/a8e3cf63e97b973a25903d3df9fd55da6252e564/atomics/T1112/T1112.md
- https://social.technet.microsoft.com/wiki/contents/articles/32905.remote-desktop-services-enable-restricted-admin-mode.aspx
author: frack113
date: 2023-01-13
modified: 2024-08-23
tags:
- attack.defense-evasion
- attack.t1112
logsource:
  product: windows
  category: registry_set
detection:
  selection:
    TargetObject|endswith: 'System\CurrentControlSet\Control\Lsa\DisableRestrictedAdmin'
  condition: selection
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  The "RestrictedAdminMode Registry Value Tampering" detection rule specifically monitors changes to the Windows registry key associated with the `DisableRestrictedAdmin` value. This registry setting is crucial for managing the security posture of Remote Desktop connections, as RestrictedAdmin mode is designed to prevent the transmission of reusable credentials to remote systems. Unauthorized modifications to this registry key can indicate malicious activity, such as an attacker trying to disable security features in order to harvest credentials from users during Remote Desktop sessions. The primary data source for this detection is Windows registry change logs, which record instances when the target registry key is accessed or modified.
  ### Investigation Steps
  - Investigate the registry change by reviewing the Windows event logs for any recent modifications to the `DisableRestrictedAdmin` key, paying special attention to the user and process involved in making the changes.
  - Utilize EDR tools to trace any suspicious process activity around the time the registry change occurred, focusing on processes that may not normally interact with registry settings.
  - Correlate the findings with user activity logs to identify if the change was made during an authorized session or if it coincides with unusual login patterns or geographical anomalies.
  - Check for any additional indicators of compromise by assessing Remote Desktop access logs in conjunction with network traffic for anomalies related to credential usage or unauthorized connections.
