title: MaxMpxCt Registry Value Changed
id: 0e6a9e62-627e-496c-aef5-bfa39da29b5e
status: test
description: |
  Detects changes to the "MaxMpxCt" registry value.
  MaxMpxCt specifies the maximum outstanding network requests for the server per client, which is used when negotiating a Server Message Block (SMB) connection with a client. Note if the value is set beyond 125 older Windows 9x clients will fail to negotiate.
  Ransomware threat actors and operators (specifically BlackCat) were seen increasing this value in order to handle a higher volume of traffic.
references:
- https://www.huntress.com/blog/blackcat-ransomware-affiliate-ttps
- https://securityscorecard.com/research/deep-dive-into-alphv-blackcat-ransomware
- https://www.intrinsec.com/alphv-ransomware-gang-analysis/?cn-reloaded=1
- https://www.sentinelone.com/labs/blackcat-ransomware-highly-configurable-rust-driven-raas-on-the-prowl-for-victims/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2024-03-19
tags:
- attack.defense-evasion
- attack.t1070.005
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|endswith: '\Services\LanmanServer\Parameters\MaxMpxCt'
  condition: selection
falsepositives:
- Unknown
level: low
notes: |
  ### Technical Context
  The "MaxMpxCt Registry Value Changed" detection rule identifies modifications made to the MaxMpxCt registry value in Windows systems. This value regulates the maximum number of concurrent network requests a server can manage from a single client, influencing SMB connection negotiations. When this value is modified, particularly beyond the threshold of 125, it can hinder older Windows 9x clients from establishing connections. The rule specifically targets alterations to the registry key `\Services\LanmanServer\Parameters\MaxMpxCt`, as threat actors, including those associated with BlackCat ransomware, have been observed increasing this limit to facilitate higher traffic volumes during attacks. By monitoring changes to this specific registry key, the detection rule aims to alert SOC analysts to potential malicious activity.
  ### Investigation Steps
  - Query the EDR for any recent changes to the registry key `\Services\LanmanServer\Parameters\MaxMpxCt` to confirm the timestamp and source of the modification.
  - Review Windows Event Logs for activities associated with the process responsible for the registry modification, looking for any unusual patterns or correlating events.
  - Utilize network detection tools (NDR) to analyze SMB traffic for any anomalies or increased volume that coincide with the time of the registry change.
  - Check cloud logs (if applicable) to review user activity around the time the registry value was changed, especially focusing on any unusual access patterns or integrations.
