title: Outlook Macro Execution Without Warning Setting Enabled
id: e3b50fa5-3c3f-444e-937b-0a99d33731cd
status: test
description: Detects the modification of Outlook security setting to allow unprompted
  execution of macros.
references:
- https://www.mdsec.co.uk/2020/11/a-fresh-outlook-on-mail-based-persistence/
- https://speakerdeck.com/heirhabarov/hunting-for-persistence-via-microsoft-exchange-server-or-outlook?slide=53
author: '@ScoubiMtl'
date: 2021-04-05
modified: 2023-08-17
tags:
- attack.persistence
- attack.command-and-control
- attack.t1137
- attack.t1008
- attack.t1546
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|endswith: '\Outlook\Security\Level'
    Details|contains: '0x00000001'     # Enable all Macros
  condition: selection
falsepositives:
- Unlikely
level: high
notes: |
  ### Technical Context
  This Sigma rule detects unauthorized changes to Microsoft Outlook's security settings, specifically modifications that enable the execution of macros without user prompts. Malicious actors may exploit Outlook’s capabilities for persistence or command-and-control purposes by altering the registry settings that manage macro execution behavior. This rule monitors Windows registry settings, targeting changes to the security level configured for Outlook macros. The targeted registry path is `\Outlook\Security\Level`, where a change indicating that all macros are enabled (`0x00000001`) will trigger an alert. The presence of this condition suggests a potential internal or external attempt to compromise Outlook's operational integrity, making it a vital point of investigation.
  ### Investigation Steps
  - Review the EDR logs for any process creation events related to Outlook around the time of the detected registry change to identify potential sources of the modification.
  - Check for any anomalous or unauthorized application activity in the Security logs, especially focusing on scripts or executables that may have manipulated the registry settings.
  - Utilize the SIEM to search for user activity associated with the altered Outlook settings, including email interactions or macro execution patterns that deviate from the norm.
  - Inspect cloud logs, especially from any integrated Microsoft services, to identify any interactions that may signify unauthorized access or malicious behavior coming from cloud-stored Outlook data.
