title: Potential Persistence Via MyComputer Registry Keys
id: 8fbe98a8-8f9d-44f8-aa71-8c572e29ef06
status: test
description: Detects modification to the "Default" value of the "MyComputer" key and
  subkeys to point to a custom binary that will be launched whenever the associated
  action is executed (see reference section for example)
references:
- https://www.hexacorn.com/blog/2017/01/18/beyond-good-ol-run-key-part-55/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-08-09
modified: 2024-01-11
tags:
- attack.persistence
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|contains: '\Microsoft\Windows\CurrentVersion\Explorer\MyComputer'
    TargetObject|endswith: '(Default)'
  condition: selection
falsepositives:
- Unlikely but if you experience FPs add specific processes and locations you would
  like to monitor for
level: high
notes: |
  ### Technical Context
  This Sigma rule detects suspicious modifications to registry keys related to "MyComputer" in the Windows operating system. It focuses on alterations to the "Default" value of the registry key located at `HKEY_LOCAL_MACHINE\SOFTWARE\Microsoft\Windows\CurrentVersion\Explorer\MyComputer`. Such changes may indicate an attempt at persistence by malware, where a malicious binary is set to run automatically when a user interacts with specific actions related to "MyComputer". This behavior is indicative of advanced persistent threats (APTs) or other forms of malicious activity aimed at maintaining access to a compromised system.
  The rule looks for logs generated from registry modifications, specifically filtering for events where the target object matches the "MyComputer" key and its subkeys. This enables the detection of unauthorized changes that could allow an attacker to execute their payload upon user interactions, potentially leading to further exploitation of the system.
  ### Investigation Steps
  - Review recent registry change logs in the EDR to identify the user account that modified the "MyComputer" keys and examine the associated timestamp for context.
  - Analyze the system's process creation logs to detect any unusual or unauthorized binaries that may have been launched shortly after the registry modification.
  - Check for additional indicators of compromise (IOC) on the affected machine by scanning with the AV solution for known malware signatures.
  - Investigate network traffic from the affected host using NDR tools to identify any suspicious outbound connections that could suggest remote command and control activity.
