title: Potential CobaltStrike Service Installations - Registry
id: 61a7697c-cb79-42a8-a2ff-5f0cdfae0130
status: test
description: |
  Detects known malicious service installs that appear in cases in which a Cobalt Strike beacon elevates privileges or lateral movement.
references:
- https://www.sans.org/webcasts/tech-tuesday-workshop-cobalt-strike-detection-log-analysis-119395
author: Wojciech Lesicki
date: 2021-06-29
modified: 2024-03-25
tags:
- attack.execution
- attack.privilege-escalation
- attack.lateral-movement
- attack.t1021.002
- attack.t1543.003
- attack.t1569.002
logsource:
  category: registry_set
  product: windows
detection:
  selection_key:
  - TargetObject|contains: '\System\CurrentControlSet\Services'
  - TargetObject|contains|all:
    - '\System\ControlSet'
    - '\Services'
  selection_details:
  - Details|contains|all:
    - 'ADMIN$'
    - '.exe'
  - Details|contains|all:
    - '%COMSPEC%'
    - 'start'
    - 'powershell'
  condition: all of selection_*
falsepositives:
- Unlikely
level: high
notes: |
  ### Technical Context
  This detection rule aims to identify potentially malicious service installations related to Cobalt Strike activity. Cobalt Strike is a widely recognized penetration testing tool that can also be exploited by threat actors for privilege escalation and lateral movement within a compromised environment. The rule focuses on specific Windows registry changes to the `\System\CurrentControlSet\Services` directory, which is often targeted by attackers to establish persistence through malicious services. It looks for registry entries containing specific keywords such as 'ADMIN$', '.exe', and command-line parameters indicative of PowerShell execution. The primary data sources involved are Windows registry logs that track modifications to service configurations, providing critical insight into malicious activity.
  ### Investigation Steps
  - Review recent registry modifications to the `\System\CurrentControlSet\Services` path to identify any unauthorized changes or newly created services.
  - Utilize EDR tools to trace process creation events related to the detected registry entries, focusing on command-line arguments that indicate suspicious execution patterns.
  - Inspect network traffic patterns associated with the identified service to assess whether there is any communication with known malicious IP addresses or domains.
  - Analyze user activity logs, particularly for administrative actions, to determine if the service installation correlates with abnormal privilege escalation attempts or lateral movement.
