title: Usage of Renamed Sysinternals Tools - RegistrySet
id: 8023f872-3f1d-4301-a384-801889917ab4
related:
- id: 25ffa65d-76d8-4da5-a832-3f2b0136e133
  type: derived
- id: f50f3c09-557d-492d-81db-9064a8d4e211
  type: similar
status: test
description: Detects non-sysinternals tools setting the "accepteula" key which normally
  is set on sysinternals tool execution
references:
- Internal Research
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-08-24
modified: 2023-08-17
tags:
- attack.resource-development
- attack.t1588.002
logsource:
  product: windows
  category: registry_set
detection:
  selection:
    TargetObject|contains:
    - '\PsExec'
    - '\ProcDump'
    - '\Handle'
    - '\LiveKd'
    - '\Process Explorer'
    - '\PsLoglist'
    - '\PsPasswd'
    - '\Active Directory Explorer'
    TargetObject|endswith: '\EulaAccepted'
  filter_main_image_names:
    Image|endswith:
    - '\PsExec.exe'
    - '\PsExec64.exe'
    - '\procdump.exe'
    - '\procdump64.exe'
    - '\handle.exe'
    - '\handle64.exe'
    - '\livekd.exe'
    - '\livekd64.exe'
    - '\procexp.exe'
    - '\procexp64.exe'
    - '\psloglist.exe'
    - '\psloglist64.exe'
    - '\pspasswd.exe'
    - '\pspasswd64.exe'
    - '\ADExplorer.exe'
    - '\ADExplorer64.exe'
  filter_optional_null:
    Image:          # Race condition with some logging tools
  condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
falsepositives:
- Unlikely
level: high
notes: |
  ### Technical Context
  This detection rule is designed to identify suspicious activity involving the unauthorized use of renamed Sysinternals tools on Windows systems. Specifically, it monitors for attempts to set registry keys, particularly the "accepteula" key, which is typically modified during the execution of legitimate Sysinternals tools. The rule checks for the presence of specific target objects in the registry that are associated with common Sysinternals utilities like PsExec, ProcDump, and Process Explorer while filtering out valid executions of these tools. The data sources utilized for this detection include registry set logs from Windows systems, which contain information on changes made to the registry keys.
  ### Investigation Steps
  - Review recent registry changes related to the "accepteula" key using Windows registry logs to identify the originating user and process.
  - Utilize EDR solutions to correlate the detected registry modification with process execution logs, examining the command line parameters for any unusual behavior.
  - Analyze network activity related to the identified process using NDR tools to determine if there was any external communication or data exfiltration during or after the tool was executed.
  - Check AV and endpoint telemetry for additional alerts or indicators of compromise (IOCs) associated with the identified Sysinternals tools or behaviors flagged by the detection rule.
