title: Office Autorun Keys Modification
id: baecf8fb-edbf-429f-9ade-31fc3f22b970
related:
- id: 17f878b8-9968-4578-b814-c4217fc5768c
  type: obsolete
status: test
description: Detects modification of autostart extensibility point (ASEP) in registry.
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1547.001/T1547.001.md
- https://learn.microsoft.com/en-us/sysinternals/downloads/autoruns
- https://gist.github.com/GlebSukhodolskiy/0fc5fa5f482903064b448890db1eaf9d     # a list with registry keys
author: Victor Sergeev, Daniil Yugoslavskiy, Gleb Sukhodolskiy, Timur Zinniatullin,
  oscd.community, Tim Shelton, frack113 (split)
date: 2019-10-25
modified: 2023-08-17
tags:
- attack.persistence
- attack.t1547.001
logsource:
  category: registry_set
  product: windows
detection:
  office:
    TargetObject|contains:
    - '\Software\Wow6432Node\Microsoft\Office'
    - '\Software\Microsoft\Office'
  office_details:
    TargetObject|contains:
    - '\Word\Addins'
    - '\PowerPoint\Addins'
    - '\Outlook\Addins'
    - '\Onenote\Addins'
    - '\Excel\Addins'
    - '\Access\Addins'
    - 'test\Special\Perf'
  filter_empty:
    Details: '(Empty)'
  filter_known_addins:
    Image|startswith:
    - 'C:\Program Files\Microsoft Office\'
    - 'C:\Program Files (x86)\Microsoft Office\'
    - 'C:\Windows\System32\msiexec.exe'
    - 'C:\Windows\System32\regsvr32.exe'
    TargetObject|contains:
            # Remove any unused addins in your environment from the filter
            # Known addins for excel
    - '\Excel\Addins\AdHocReportingExcelClientLib.AdHocReportingExcelClientAddIn.1\'
    - '\Excel\Addins\ExcelPlugInShell.PowerMapConnect\'
    - '\Excel\Addins\NativeShim\'
    - '\Excel\Addins\NativeShim.InquireConnector.1\'
    - '\Excel\Addins\PowerPivotExcelClientAddIn.NativeEntry.1\'
            # Known addins for outlook
    - '\Outlook\AddIns\AccessAddin.DC\'
    - '\Outlook\AddIns\ColleagueImport.ColleagueImportAddin\'
    - '\Outlook\AddIns\EvernoteCC.EvernoteContactConnector\'
    - '\Outlook\AddIns\EvernoteOLRD.Connect\'
            # - '\Outlook\Addins\GrammarlyAddIn.Connect' # Uncomment if you use Grammarly
    - '\Outlook\Addins\Microsoft.VbaAddinForOutlook.1\'
    - '\Outlook\Addins\OcOffice.OcForms\'
    - '\Outlook\Addins\\OneNote.OutlookAddin'
    - '\Outlook\Addins\OscAddin.Connect\'
    - '\Outlook\Addins\OutlookChangeNotifier.Connect\'
    - '\Outlook\Addins\UCAddin.LyncAddin.1'
    - '\Outlook\Addins\UCAddin.UCAddin.1'
    - '\Outlook\Addins\UmOutlookAddin.FormRegionAddin\'
  filter_officeclicktorun:
    Image|startswith:
    - 'C:\Program Files\Common Files\Microsoft Shared\ClickToRun\'
    - 'C:\Program Files\Common Files\Microsoft Shared\ClickToRun\Updates\'
    Image|endswith: '\OfficeClickToRun.exe'
  filter_avg:
    Image: 'C:\Program Files\AVG\Antivirus\RegSvr.exe'
    TargetObject|contains: '\Microsoft\Office\Outlook\Addins\Antivirus.AsOutExt\'
  condition: office and office_details and not 1 of filter_*
fields:
- SecurityID
- ObjectName
- OldValueType
- NewValueType
falsepositives:
- Legitimate software automatically (mostly, during installation) sets up autorun
  keys for legitimate reason
- Legitimate administrator sets up autorun keys for legitimate reason
level: medium
notes: |
  ### Technical Context
  This detection rule focuses on identifying unauthorized modifications to the autostart extensibility points (ASEP) within the Windows Registry, specifically targeting Microsoft Office applications. Malicious actors may alter these registry keys to ensure persistence of malware or unauthorized add-ins when users start their Office applications. The rule monitors registry modification events associated with specific Office add-in paths, such as those found under `\Software\Microsoft\Office` and its applications like Word, Outlook, and Excel. By filtering for known legitimate add-ins and common Office installation paths, the rule effectively distinguishes between benign modifications and potentially harmful changes indicative of unauthorized persistence attempts.
  ### Investigation Steps
  - Use EDR tools to investigate the endpoint's registry modifications around the time of the alert, focusing on the targeted Office add-in registry paths.
  - Collect and analyze relevant process creation logs to identify any suspicious processes that may have accessed or altered the Office registry keys.
  - Search for indications of unauthorized software installations or modifications from the AV logs that may correlate with the registry changes detected.
  - Review proxy logs for any unusual outbound connections from Office applications that could indicate exploitation or data exfiltration attempts.
