title: Potential Persistence Via Event Viewer Events.asp
id: a1e11042-a74a-46e6-b07c-c4ce8ecc239b
status: test
description: Detects potential registry persistence technique using the Event Viewer
  "Events.asp" technique
references:
- https://twitter.com/nas_bench/status/1626648985824788480
- https://admx.help/?Category=Windows_7_2008R2&Policy=Microsoft.Policies.InternetCommunicationManagement::EventViewer_DisableLinks
- https://www.hexacorn.com/blog/2019/02/15/beyond-good-ol-run-key-part-103/
- https://github.com/redcanaryco/atomic-red-team/blob/f296668303c29d3f4c07e42bdd2b28d8dd6625f9/atomics/T1112/T1112.md
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023-02-17
modified: 2023-03-05
tags:
- attack.persistence
- attack.defense-evasion
- attack.t1112
logsource:
  category: registry_set
  product: windows
detection:
  selection:
        # Covers both "\Policies\" and "\Software\" paths for both "Machine" and "User" level configs
        # Also "MicrosoftRedirectionProgramCommandLineParameters" key
    TargetObject|contains:
    - '\Microsoft\Windows NT\CurrentVersion\Event Viewer\MicrosoftRedirectionProgram'
    - '\Microsoft\Windows NT\CurrentVersion\Event Viewer\MicrosoftRedirectionURL'
  filter_default_redirect_program:
    Image|endswith: 'C:\WINDOWS\system32\svchost.exe'     # Set via GPO
    TargetObject|endswith: '\Microsoft\Windows NT\CurrentVersion\Event Viewer\MicrosoftRedirectionProgram'
    Details: '%%SystemRoot%%\PCHealth\HelpCtr\Binaries\HelpCtr.exe'
  filter_default_redirect_program_cli:
    Image|endswith: 'C:\WINDOWS\system32\svchost.exe'     # Set via GPO
    TargetObject|endswith: '\Microsoft\Windows NT\CurrentVersion\Event Viewer\MicrosoftRedirectionProgramCommandLineParameters'
    Details: '-url hcp://services/centers/support?topic=%%s'
  filter_url:
    Details: 'http://go.microsoft.com/fwlink/events.asp'
  filter_cleaner:
    Details: '(Empty)'
  condition: selection and not 1 of filter_*
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  This Sigma rule aims to detect potential persistence techniques leveraged through the Windows Event Viewer, specifically through manipulation of registry keys associated with Microsoft Redirection. Attackers may set registry values to redirect legitimate Event Viewer functionalities to malicious URLs or applications, enabling unauthorized access and persistence. The rule looks for specific registry paths—namely `MicrosoftRedirectionProgram` and `MicrosoftRedirectionURL`—and checks their configuration against suspicious values indicative of such malicious activities. The primary data sources utilized for detection include registry set logs, which capture changes to Windows registry settings, particularly those made by the `svchost.exe` process, which is often used to host various services in Windows.
  ### Investigation Steps
  1. Review the EDR logs to identify any process activity related to `svchost.exe`, especially timestamps matching the registry changes detected by the rule.
  2. Examine the Windows Registry to check entries under the paths `\Microsoft\Windows NT\CurrentVersion\Event Viewer\MicrosoftRedirectionProgram` and `\Microsoft\Windows NT\CurrentVersion\Event Viewer\MicrosoftRedirectionURL` for suspicious modifications.
  3. Analyze network logs from your NDR or proxy tools for any outbound connections to the URLs mentioned in the alerts, particularly `http://go.microsoft.com/fwlink/events.asp`.
  4. Conduct a full scan using your AV solution on the impacted system to identify any additional malware that may have been deployed as a result of the detected persistence technique.
