title: Hiding User Account Via SpecialAccounts Registry Key
id: f8aebc67-a56d-4ec9-9fbe-7b0e8b7b4efd
related:
- id: 8a58209c-7ae6-4027-afb0-307a78e4589a
  type: obsolete
- id: 9ec9fb1b-e059-4489-9642-f270c207923d
  type: similar
status: test
description: Detects modifications to the registry key "HKLM\Software\Microsoft\Windows
  NT\CurrentVersion\Winlogon\SpecialAccounts\Userlist" where the value is set to "0"
  in order to hide user account from being listed on the logon screen.
references:
- https://thedfirreport.com/2022/07/11/select-xmrig-from-sqlserver/
- https://github.com/redcanaryco/atomic-red-team/blob/40b77d63808dd4f4eafb83949805636735a1fd15/atomics/T1564.002/T1564.002.md
author: Nasreddine Bencherchali (Nextron Systems), frack113
date: 2022-07-12
modified: 2023-01-26
tags:
- attack.defense-evasion
- attack.t1564.002
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    EventType: 'SetValue'
    TargetObject|contains: '\SOFTWARE\Microsoft\Windows NT\CurrentVersion\Winlogon\SpecialAccounts\UserList'
    Details: 'DWORD (0x00000000)'
  condition: selection
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This Sigma rule is designed to detect modifications to a specific Windows registry key that could indicate attempts to hide user accounts from the logon screen, which is often a tactic used by malicious actors to obscure unauthorized access. The rule monitors changes to the registry path `HKLM\Software\Microsoft\Windows NT\CurrentVersion\Winlogon\SpecialAccounts\Userlist`, specifically looking for instances where values are set to `0`, indicating that a user account is being hidden. In a Windows environment, these modifications are captured through registry event logs. The information gleaned from these logs allows security teams to identify potentially malicious activities and investigate user access management anomalies.
  ### Investigation Steps
  - Review the registry change logs using EDR to identify the source of the modification and the associated user or process that performed the action.
  - Check for related process creation events around the time of the registry change to determine if there are any suspicious applications or scripts that may have executed.
  - Investigate user account activity logs through the SIEM to ascertain if the affected user account has had any unusual login attempts or activities prior to or following the registry modification.
  - Use the NGFW and Proxy logs to analyze any unusual outbound connections from the affected system that could indicate exfiltration or command-and-control communication.
