title: Disabled Windows Defender Eventlog
id: fcddca7c-b9c0-4ddf-98da-e1e2d18b0157
status: test
description: Detects the disabling of the Windows Defender eventlog as seen in relation
  to Lockbit 3.0 infections
references:
- https://twitter.com/WhichbufferArda/status/1543900539280293889/photo/2
author: Florian Roth (Nextron Systems)
date: 2022-07-04
modified: 2023-08-17
tags:
- attack.defense-evasion
- attack.t1562.001
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|contains: '\Microsoft\Windows\CurrentVersion\WINEVT\Channels\Microsoft-Windows-Windows
      Defender/Operational\Enabled'
    Details: 'DWORD (0x00000000)'
  condition: selection
falsepositives:
- Other Antivirus software installations could cause Windows to disable that eventlog
  (unknown)
level: high
notes: |
  ### Technical Context
  This rule is designed to detect the disabling of the Windows Defender event log, a critical component in monitoring and threat detection within the Windows environment. Specifically, it looks for modifications to the Windows registry that indicate the event logging for Windows Defender has been turned off. The rule triggers when it detects an entry where the target object corresponds to the Windows Defender Operational event log and reports a value of `DWORD (0x00000000)`, signifying that event logging has been disabled. Such an action is commonly associated with malicious activities, particularly in the context of ransomware, including known strains like LockBit 3.0. The primary data source leveraged for this detection includes the registry modification logs that capture changes to the Windows operating system's settings.
  ### Investigation Steps
  - Review the relevant registry modifications via your EDR solution to identify the source and timing of the changes to the Windows Defender event log.
  - Correlate the timeline of the Windows Defender event log disablement with any other suspicious activities or alerts in the environment to determine if it relates to a broader attack.
  - Check the system for additional artifacts or behaviors associated with ransomware, such as unusual process creations or file modifications, using EDR tools.
  - Investigate network traffic patterns in your NDR solution to identify any anomalous command and control communications or data exfiltration attempts that could indicate a compromised host.
