title: Add Port Monitor Persistence in Registry
id: 944e8941-f6f6-4ee8-ac05-1c224e923c0e
status: test
description: |
  Adversaries may use port monitors to run an attacker supplied DLL during system boot for persistence or privilege escalation.
  A port monitor can be set through the AddMonitor API call to set a DLL to be loaded at startup.
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1547.010/T1547.010.md
author: frack113
date: 2021-12-30
modified: 2024-03-25
tags:
- attack.persistence
- attack.t1547.010
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|contains: '\Control\Print\Monitors\'
    Details|endswith: '.dll'
  filter_optional_cutepdf:
    Image: 'C:\Windows\System32\spoolsv.exe'
    TargetObject|contains: '\Control\Print\Monitors\CutePDF Writer Monitor v4.0\Driver'
    Details: 'cpwmon64_v40.dll'
    User|contains:     # covers many language settings
    - 'AUTHORI'
    - 'AUTORI'
  filter_optional_monvnc:
    TargetObject|contains: '\Control\Print\Monitors\MONVNC\Driver'
  filter_optional_vnc:
    TargetObject|contains|all:
    - 'Control\Print\Environments\'
    - '\Drivers\'
    - '\VNC Printer'
  condition: selection and not 1 of filter_optional_*
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  This Sigma rule detects potential persistence mechanisms employed by adversaries who leverage port monitors in Windows systems to load malicious DLLs during system startup. Specifically, the rule targets changes made to registry keys associated with print monitors, specifically looking for entries within the `\Control\Print\Monitors\` path that indicate the presence of a DLL file. Data sources include Windows registry change logs, which detail the modification of registry keys and the associated parameters. By checking for the presence of specific DLL file names that may be indicative of malicious intent, this rule helps identify unusual persistence techniques utilized by attackers for both privilege escalation and long-term access to compromised systems.
  ### Investigation Steps
  - Query the EDR solution for process creation events related to `spoolsv.exe` shortly before the registry modification to determine if a suspicious process initiated the change.
  - Review Windows registry logs to find recent modifications to the `HKEY_LOCAL_MACHINE\SOFTWARE\Microsoft\Windows NT\CurrentVersion\Print\Monitors` path, focusing on any unusual DLL entries.
  - Cross-reference the identified DLLs with known threat intelligence databases to check for any reports or indicators of compromise associated with these files.
  - Analyze network traffic through proxies and NGFW logs to identify any unusual outbound connections that might indicate communication with a command and control server following the registry modification.
