title: Hide Schedule Task Via Index Value Tamper
id: 5b16df71-8615-4f7f-ac9b-6c43c0509e61
related:
- id: acd74772-5f88-45c7-956b-6a7b36c294d2
  type: similar
- id: 526cc8bc-1cdc-48ad-8b26-f19bff969cec
  type: similar
status: test
description: |
  Detects when the "index" value of a scheduled task is modified from the registry
  Which effectively hides it from any tooling such as "schtasks /query" (Read the referenced link for more information about the effects of this technique)
references:
- https://blog.qualys.com/vulnerabilities-threat-research/2022/06/20/defending-against-scheduled-task-attacks-in-windows-environments
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-08-26
modified: 2023-08-17
tags:
- attack.defense-evasion
- attack.t1562
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|contains|all:
    - '\SOFTWARE\Microsoft\Windows NT\CurrentVersion\Schedule\TaskCache\Tree\'
    - 'Index'
    Details: DWORD (0x00000000)
  condition: selection
falsepositives:
- Unlikely
level: high
notes: |
  ### Technical Context
  This detection rule focuses on identifying modifications to the "index" value of scheduled tasks within the Windows registry. The rule specifically targets changes made to the registry keys under the path `\SOFTWARE\Microsoft\Windows NT\CurrentVersion\Schedule\TaskCache\Tree\`. When an attacker alters the index value to `DWORD (0x00000000)`, it effectively hides the scheduled task from standard tools, such as the `schtasks /query` command, making it difficult for administrators to detect potentially malicious activities. The rule leverages registry set logs as the primary data source, aiming to provide early detection of evasion tactics used by threat actors to conceal their scheduled tasks.
  ### Investigation Steps
  - Utilize EDR solutions to examine the history of scheduled task modifications and their associated processes to identify any unusual activities.
  - Query registry logs for recent changes to the specified task-related registry keys to verify if the modification aligns with the alert triggered by this rule.
  - Analyze the system for any related scheduled tasks using command-line tools to confirm whether they are behaving as expected or exhibiting signs of tampering.
  - Review network traffic logs from the NGFW and Proxy to look for any anomalous connections initiated by the suspect task, which may indicate additional malicious intent.
