title: Sysmon Driver Altitude Change
id: 4916a35e-bfc4-47d0-8e25-a003d7067061
status: test
description: |
  Detects changes in Sysmon driver altitude value.
  If the Sysmon driver is configured to load at an altitude of another registered service, it will fail to load at boot.
references:
- https://posts.specterops.io/shhmon-silencing-sysmon-via-driver-unload-682b5be57650
- https://youtu.be/zSihR3lTf7g
author: B.Talebi
date: 2022-07-28
modified: 2024-03-25
tags:
- attack.defense-evasion
- attack.t1562.001
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|contains: '\Services\'
    TargetObject|endswith: '\Instances\Sysmon Instance\Altitude'
  condition: selection
falsepositives:
- Legitimate driver altitude change to hide sysmon
level: high
notes: |
  ### Technical Context
  This Sigma rule is designed to detect unauthorized changes to the altitude value of the Sysmon driver, which can be an indicator of attempts to evade detection by modifying the order in which drivers load at system boot. The rule specifically looks for modifications in the Windows Registry related to Sysmon's altitude, denoted by entries under `\Services\` ending with `\Instances\Sysmon Instance\Altitude`. When the altitude is mistakenly set to a value of another registered driver, the Sysmon driver may fail to load, thus making it harder for security monitoring solutions to collect relevant telemetry for detection and response efforts. Data sources leveraged in this detection include Windows registry set logs that record any changes made to these crucial Sysmon settings.
  ### Investigation Steps
  - Examine the registry change logs within your SIEM to identify the specific user or process that initiated the alteration to Sysmon's altitude.
  - Utilize EDR tools to analyze the process execution history around the time of the registry change, looking for any suspicious applications that might indicate malicious intent.
  - Review security events and alerts related to driver loading and unloading in Sysmon to correlate any failed attempts to load the Sysmon driver following the altitude change.
  - Inspect any applicable logs from AV solutions, firewalls, and proxies for anomalous behavior or network traffic from systems associated with the modified Sysmon instance.
