title: Microsoft Office Protected View Disabled
id: a5c7a43f-6009-4a8c-80c5-32abf1c53ecc
related:
- id: 7c637634-c95d-4bbf-b26c-a82510874b34
  type: obsolete
status: test
description: Detects changes to Microsoft Office protected view registry keys with
  which the attacker disables this feature.
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.001/T1562.001.md
- https://unit42.paloaltonetworks.com/unit42-gorgon-group-slithering-nation-state-cybercrime/
- https://yoroi.company/research/cyber-criminal-espionage-operation-insists-on-italian-manufacturing/
- https://admx.help/HKCU/software/policies/microsoft/office/16.0/excel/security/protectedview
author: frack113, Nasreddine Bencherchali (Nextron Systems)
date: 2021-06-08
modified: 2023-08-17
tags:
- attack.defense-evasion
- attack.t1562.001
logsource:
  product: windows
  category: registry_set
detection:
  selection_path:
    TargetObject|contains|all:
    - '\SOFTWARE\Microsoft\Office\'
    - '\Security\ProtectedView\'
  selection_values_1:
    Details: 'DWORD (0x00000001)'
    TargetObject|endswith:
    - '\DisableAttachementsInPV'         # Turn off Protected View for attachments opened from Outlook
    - '\DisableInternetFilesInPV'         # Turn off Protected View for files downloaded from Internet zone
    - '\DisableIntranetCheck'         # Turn off Protected View for file located in UNC paths
    - '\DisableUnsafeLocationsInPV'         # Turn off Protected View for unsafe locations
  selection_values_0:
    Details: 'DWORD (0x00000000)'
    TargetObject|endswith:
    - '\enabledatabasefileprotectedview'
    - '\enableforeigntextfileprotectedview'
  condition: selection_path and 1 of selection_values_*
falsepositives:
- Unlikely
level: high
notes: |
  ### Technical Context
  The Sigma rule "Microsoft Office Protected View Disabled" monitors changes to the Windows registry that affect Microsoft Office's Protected View feature. Protected View is a security mechanism designed to prevent potentially harmful files from executing when opened by users. By checking for specific modifications to registry keys related to Protected View, the rule detects when an attacker may disable this feature to allow unsafe content to run without restrictions. The key data sources for this detection include Windows registry logs, specifically focusing on paths that involve changes to Protected View settings, which are relevant for identifying potential malicious activity within an enterprise environment.
  ### Investigation Steps
  - Review the Windows registry changes corresponding to the alerts to identify what specific settings were modified and when.
  - Analyze endpoint logs from EDR tools to determine if any unexpected Office documents were opened or if suspicious behaviors were detected before or after the registry changes.
  - Check for network activity associated with the affected endpoints using NDR solutions to identify any unusual communication patterns or connections to known malicious domains.
  - Consult proxy logs to assess whether any recent downloads from the internet correspond to the timestamps of registry modifications and to investigate if they were from suspicious sources.
