title: Registry Disable System Restore
id: 5de03871-5d46-4539-a82d-3aa992a69a83
status: test
description: Detects the modification of the registry to disable a system restore
  on the computer
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1490/T1490.md#atomic-test-9---disable-system-restore-through-registry
author: frack113
date: 2022-04-04
modified: 2023-08-17
tags:
- attack.impact
- attack.t1490
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|contains:
    - '\Policies\Microsoft\Windows NT\SystemRestore'
    - '\Microsoft\Windows NT\CurrentVersion\SystemRestore'
    TargetObject|endswith:
    - DisableConfig
    - DisableSR
    Details: 'DWORD (0x00000001)'
  condition: selection
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This detection rule identifies the modification of Windows registry keys associated with disabling the System Restore feature. Specifically, it focuses on changes to the registry paths `\Policies\Microsoft\Windows NT\SystemRestore` and `\Microsoft\Windows NT\CurrentVersion\SystemRestore`, where critical values such as `DisableConfig` and `DisableSR` are set to a DWORD value of `0x00000001`. Disabling System Restore can be indicative of malicious activity or attempts to evade detection by preventing system recovery options. The rule evaluates these registry changes by monitoring log data sourced from registry modification events on Windows systems.
  ### Investigation Steps
  - Review recent registry change logs in your EDR solution to confirm if there was a modification to the specified registry keys associated with System Restore.
  - Check for related process activity that might have triggered this change, particularly looking for any unauthorized executables or scripts that may have executed around the same time.
  - Utilize AV console logs to identify any alerts or detections related to malicious software that might attempt to disable System Restore as part of its evasion tactics.
  - Analyze system and user access logs to detect any suspicious logins or account activity that may correlate with the timing of the registry modification.
