title: COM Object Hijacking Via Modification Of Default System CLSID Default Value
id: 790317c0-0a36-4a6a-a105-6e576bf99a14
related:
- id: 3d968d17-ffa4-4bc0-bfdc-f139de76ce77
  type: obsolete
- id: a0ff33d8-79e4-4cef-b4f3-9dc4133ccd12
  type: obsolete
status: experimental
description: Detects potential COM object hijacking via modification of default system
  CLSID.
references:
- https://www.microsoft.com/security/blog/2022/07/27/untangling-knotweed-european-private-sector-offensive-actor-using-0-day-exploits/
  (idea)
- https://unit42.paloaltonetworks.com/snipbot-romcom-malware-variant/
- https://blog.talosintelligence.com/uat-5647-romcom/
- https://global.ptsecurity.com/analytics/pt-esc-threat-intelligence/darkhotel-a-cluster-of-groups-united-by-common-techniques
- https://threatbook.io/blog/Analysis-of-APT-C-60-Attack-on-South-Korea
author: Nasreddine Bencherchali (Nextron Systems)
date: 2024-07-16
modified: 2024-12-14
tags:
- attack.persistence
- attack.t1546.015
logsource:
  category: registry_set
  product: windows
detection:
  selection_target_root:
    TargetObject|contains: '\CLSID\'
    TargetObject|endswith:
    - '\InprocServer32\(Default)'
    - '\LocalServer32\(Default)'
  selection_target_builtin_clsid:
    TargetObject|contains:
            # Note: Add other legitimate CLSID
    - '\{1f486a52-3cb1-48fd-8f50-b8dc300d9f9d}\'
    - '\{2155fee3-2419-4373-b102-6843707eb41f}\'
    - '\{4590f811-1d3a-11d0-891f-00aa004b2e24}\'
    - '\{4de225bf-cf59-4cfc-85f7-68b90f185355}\'
    - '\{ddc05a5a-351a-4e06-8eaf-54ec1bc2dcea}\'
    - '\{F56F6FDD-AA9D-4618-A949-C1B91AF43B1A}\'
    - '\{F82B4EF1-93A9-4DDE-8015-F7950A1A6E31}\'
    - '\{7849596a-48ea-486e-8937-a2a3009f31a9}\'
    - '\{0b91a74b-ad7c-4a9d-b563-29eef9167172}\'
    - '\{603D3801-BD81-11d0-A3A5-00C04FD706EC}\'
  selection_susp_location_1:
    Details|contains:
            # Note: Add more suspicious paths and locations
    - ':\Perflogs\'
    - '\AppData\Local\'
    - '\Desktop\'
    - '\Downloads\'
    - '\Microsoft\Windows\Start Menu\Programs\Startup\'
    - '\System32\spool\drivers\color\'         # as seen in the knotweed blog
    - '\Temporary Internet'
    - '\Users\Public\'
    - '\Windows\Temp\'
    - '%appdata%'
    - '%temp%'
    - '%tmp%'
  selection_susp_location_2:
  - Details|contains|all:
    - ':\Users\'
    - '\Favorites\'
  - Details|contains|all:
    - ':\Users\'
    - '\Favourites\'
  - Details|contains|all:
    - ':\Users\'
    - '\Contacts\'
  - Details|contains|all:
    - ':\Users\'
    - '\Pictures\'
  condition: all of selection_target_* and 1 of selection_susp_location_*
falsepositives:
- Unlikely
level: high
notes: |
  ### Technical Context
  This detection rule targets potential COM object hijacking through modifications of the default values for system Component Object Model (COM) identifiers (CLSID). Specifically, it looks for registry modifications in the Windows Registry under the paths associated with CLSID, namely `\CLSID\` and its associated InprocServer32 and LocalServer32 entries. The rule observes changes made to known legitimate CLSIDs and identifying suspicious locations frequently used by malicious actors, such as user directories and system folders like `Temp`, `Downloads`, and `Startup`. By analyzing these registry changes, the detection engine can ascertain if unauthorized modifications were made with potentially malicious intent, which correlates with the MITRE ATT&CK technique for persistence (T1546.015). This can lead to unauthorized access or execution of malicious code masquerading as legitimate COM objects.
  ### Investigation Steps
  - **Confirm Registry Modification:** Check the Windows Registry leveraging PowerShell or Registry Editor to identify if the CLSID default values correspond to known legitimate entries or if they have been altered suspiciously.
  - **Correlate with Event Logs:** Review Windows Security and Sysmon logs pertaining to registry access to gain insights into the source of the changes and whether they align with typical user behavior.
  - **Assess User Environment:** Investigate the user environment via EDR and check for other processes that might correlate with the timeline of the detected registry modifications, focusing on abnormal execution patterns.
  - **Perform Threat Intelligence Lookup:** Utilize threat intelligence resources to gather additional context on identified CLSIDs and paths to determine if they are associated with known vulnerabilities, malware, or ongoing campaigns.
  ### Prioritization
  Given the nature of COM object hijacking involving registry manipulation, this alert is rated high severity within an enterprise environment. Such activities are often indicative of an ongoing attack that may serve as the foundation for further exploitation or lateral movement within the network.
  ### Blind Spots and Assumptions
  This rule may not fire if:
  - **Legitimate Changes Occur:** The changes to CLSID might be legitimate, executed by authorized personnel or applications, leading to possible false negatives. 
  - **Obfuscation Techniques:** Advanced adversaries may utilize obfuscation techniques, such as altering less common registry keys not monitored by this rule, hence evading detection.
  - **Limited CLSID Monitoring:** The rule may miss specific CLSIDs not included in the detection logic or when modifications occur outside the predefined suspicious paths.
  Understanding these limitations is critical for the detection engineering team to improve and refine the detection capabilities.
  > **Disclaimer:** This investigation guide was created using generative AI technology and has not been reviewed for its accuracy and relevance. While every effort has been made to ensure its quality, we recommend validating the content and adapting it to suit specific environment and operational needs. Please communicate any changes to the detection engineering team.
