title: Disable Windows Defender Functionalities Via Registry Keys
id: 0eb46774-f1ab-4a74-8238-1155855f2263
related:
- id: a64e4198-c1c8-46a5-bc9c-324c86455fd4
  type: obsolete
- id: fd115e64-97c7-491f-951c-fc8da7e042fa
  type: obsolete
status: test
description: Detects when attackers or tools disable Windows Defender functionalities
  via the Windows registry
references:
- https://thedfirreport.com/2021/10/18/icedid-to-xinglocker-ransomware-in-24-hours/
- https://gist.github.com/anadr/7465a9fde63d41341136949f14c21105
- https://admx.help/?Category=Windows_7_2008R2&Policy=Microsoft.Policies.WindowsDefender::SpyNetReporting
- https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/ransomware-hive-conti-avoslocker
- https://www.tenforums.com/tutorials/32236-enable-disable-microsoft-defender-pua-protection-windows-10-a.html
- https://www.tenforums.com/tutorials/105533-enable-disable-windows-defender-exploit-protection-settings.html
- https://www.tenforums.com/tutorials/123792-turn-off-tamper-protection-microsoft-defender-antivirus.html
- https://securelist.com/key-group-ransomware-samples-and-telegram-schemes/114025/
author: AlertIQ, Ján Trenčanský, frack113, Nasreddine Bencherchali, Swachchhanda Shrawan
  Poudel
date: 2022-08-01
modified: 2024-10-07
tags:
- attack.defense-evasion
- attack.t1562.001
logsource:
  product: windows
  category: registry_set
detection:
  selection_main:
    TargetObject|contains:
    - '\SOFTWARE\Microsoft\Windows Defender\'
    - '\SOFTWARE\Policies\Microsoft\Windows Defender Security Center\'
    - '\SOFTWARE\Policies\Microsoft\Windows Defender\'
  selection_dword_1:
    TargetObject|endswith:
    - '\DisableAntiSpyware'
    - '\DisableAntiVirus'
    - '\DisableBehaviorMonitoring'
    - '\DisableBlockAtFirstSeen'
    - '\DisableEnhancedNotifications'
    - '\DisableIntrusionPreventionSystem'
    - '\DisableIOAVProtection'
    - '\DisableOnAccessProtection'
    - '\DisableRealtimeMonitoring'
    - '\DisableScanOnRealtimeEnable'
    - '\DisableScriptScanning'
    Details: 'DWORD (0x00000001)'
  selection_dword_0:
    TargetObject|endswith:
    - '\DisallowExploitProtectionOverride'
    - '\Features\TamperProtection'
    - '\MpEngine\MpEnablePus'
    - '\PUAProtection'
    - '\Signature Update\ForceUpdateFromMU'
    - '\SpyNet\SpynetReporting'
    - '\SpyNet\SubmitSamplesConsent'
    - '\Windows Defender Exploit Guard\Controlled Folder Access\EnableControlledFolderAccess'
    Details: 'DWORD (0x00000000)'
  filter_optional_symantec:
    Image|startswith: 'C:\Program Files\Symantec\Symantec Endpoint Protection\'
    Image|endswith: '\sepWscSvc64.exe'
  condition: selection_main and 1 of selection_dword_* and not 1 of filter_optional_*
falsepositives:
- Administrator actions via the Windows Defender interface
- Third party Antivirus
level: high
notes: |
  ### Technical Context
  This detection rule identifies when malicious actors or tools attempt to disable Windows Defender functionalities through modifications to Windows registry keys. The specific keys and values targeted by this rule relate to various aspects of Windows Defender's protective measures, including anti-virus capabilities, behavior monitoring, and real-time protection. The detection is relevant for tracking the MITRE ATT&CK tactic of "Defense Evasion" (T1562.001), which highlights adversarial behavior aimed at circumventing security controls.
  To effectively monitor these activities, the detection leverages Windows registry logs, specifically looking for keys that contain references to Windows Defender settings. The rule specifies conditions where certain DWORD values are set to enable or disable protective features, signaling potential malicious intent. By capturing attempts to alter these critical system settings, SOC analysts can quickly identify and respond to potential security breaches aimed at compromising endpoint security.
  ### Investigation Steps
  - **Verify Registry Changes:** Utilize Windows Event Logs to review the specific registry keys that were modified. Confirm whether the changes recorded align with standard administrative practices or indicate potential malicious activity.
  - **Check for Endpoint Connections:** Investigate endpoint activity using EDR tools to identify any anomalous behavior or connections immediately preceding or following the registry change event. Look for sudden spikes in network traffic or unusual processes running on the system.
  - **Review Security Logs:** Examine Windows Security logs for any corresponding security alerts related to the registry changes. Determine if any legitimate administrative actions may explain the changes or if they are suspicious.
  - **Cross-Reference with Threat Intelligence:** Consult threat intelligence feeds related to the specific registry changes made and any known malware or attacks that may utilize these techniques. Determine if there are patterns of the registry keys being modified in correlation to emerging threats.
  ### Prioritization
  This alert is categorized as high severity due to the critical nature of Windows Defender in maintaining endpoint security. Any unauthorized modifications to its functionalities can significantly increase the risk of malware infections or data breaches, warranting immediate investigation.
  ### Blind Spots and Assumptions
  This rule may not fire in instances where there are legitimate administrative actions performed by system administrators who alter Windows Defender settings through authorized means. Additionally, organizations using third-party antivirus solutions may experience false positives, as their actions could also reflect similar registry changes. It’s essential for detection engineers to understand that skilled adversaries may use legitimate administrative tools to disable defenses without raising alarms, thus avoiding triage by this detection rule.
  > **Disclaimer:** This investigation guide was created using generative AI technology and has not been reviewed for its accuracy and relevance. While every effort has been made to ensure its quality, we recommend validating the content and adapting it to suit specific environment and operational needs. Please communicate any changes to the detection engineering team.
