title: RDP Sensitive Settings Changed to Zero
id: a2863fbc-d5cb-48d5-83fb-d976d4b1743b
related:
- id: 3f6b7b62-61aa-45db-96bd-9c31b36b653c
  type: similar
status: test
description: |
  Detects tampering of RDP Terminal Service/Server sensitive settings.
  Such as allowing unauthorized users access to a system via the 'fAllowUnsolicited' or enabling RDP via 'fDenyTSConnections', etc.
references:
- https://web.archive.org/web/20200929062532/https://blog.menasec.net/2019/02/threat-hunting-rdp-hijacking-via.html     # Related to RDP hijacking via the "ServiceDll" key
- http://woshub.com/rds-shadow-how-to-connect-to-a-user-session-in-windows-server-2012-r2/     # Related to the Shadow RPD technique
- https://twitter.com/SagieSec/status/1469001618863624194?t=HRf0eA0W1YYzkTSHb-Ky1A&s=03     # Related to the Shadow RPD technique
- https://threathunterplaybook.com/hunts/windows/190407-RegModEnableRDPConnections/notebook.html
- https://bazaar.abuse.ch/sample/6f3aa9362d72e806490a8abce245331030d1ab5ac77e400dd475748236a6cc81/
- http://etutorials.org/Microsoft+Products/microsoft+windows+server+2003+terminal+services/Chapter+6+Registry/Registry+Keys+for+Terminal+Services/     # Contain description for most of the keys mentioned here (check it out if you want more information
- https://admx.help/HKLM/SOFTWARE/Policies/Microsoft/Windows%20NT/Terminal%20Services     # Contain description for most of the keys mentioned here (check it out if you want more information)
author: Samir Bousseaden, David ANDRE, Roberto Rodriguez @Cyb3rWard0g, Nasreddine
  Bencherchali
date: 2022-09-29
modified: 2022-11-26
tags:
- attack.defense-evasion
- attack.persistence
- attack.t1112
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    TargetObject|endswith:
    - '\fDenyTSConnections'         # Specifies whether Remote Desktop connections are enabled - When set to zero RDP is enabled
    - '\fSingleSessionPerUser'         # When changed to 0 it allows multiple RDP sessions
    - '\UserAuthentication'         # Specifies that Network-Level user authentication is not required before the remote desktop connection is established
    Details: 'DWORD (0x00000000)'
  condition: selection
falsepositives:
- Some of the keys mentioned here could be modified by an administrator while setting
  group policy (it should be investigated either way)
level: medium
notes: |
  ### Technical Context
  This detection rule monitors for changes to sensitive settings in the Windows Remote Desktop Protocol (RDP), specifically focusing on alterations made to the registry keys that control RDP access. The rule looks for specific registry keys, including `fDenyTSConnections`, `fSingleSessionPerUser`, and `UserAuthentication`, being set to a value of zero. This configuration typically means that RDP access is being enabled without necessary constraints, potentially allowing unauthorized users to connect to the system. The primary data sources utilized for this rule are registry set logs that capture modifications to these critical settings, providing insight into potential security risks related to RDP configurations.
  ### Investigation Steps
  - **Check recent registry modifications**: Utilize EDR or SIEM tools to review the logs for any recent changes to the specified RDP-related registry keys.
  - **Identify the user responsible for changes**: Query EDR or log files for information on the user account that made the modifications to the registry keys to determine if the changes were authorized.
  - **Audit RDP connection attempts**: Use network monitoring tools to analyze RDP connection logs for any unauthorized or suspicious access attempts following the changes.
  - **Verify the current RDP settings**: Cross-reference current RDP settings against organizational policies to ensure compliance and investigate any discrepancies.
