title: Windows Defender Real-Time Protection Failure/Restart
id: dd80db93-6ec2-4f4c-a017-ad40da6ffe81
status: stable
description: Detects issues with Windows Defender Real-Time Protection features
references:
- Internal Research
- https://www.microsoft.com/en-us/security/blog/2023/04/11/guidance-for-investigating-attacks-using-cve-2022-21894-the-blacklotus-campaign/
- https://gist.github.com/nasbench/33732d6705cbdc712fae356f07666346     # Contains the list of Feature Names (use for filtering purposes)
author: Nasreddine Bencherchali (Nextron Systems), Christopher Peacock '@securepeacock'
  (Update)
date: 2023-03-28
modified: 2023-05-05
tags:
- attack.defense-evasion
- attack.t1562.001
logsource:
  product: windows
  service: windefend
detection:
  selection:
    EventID:
    - 3002         # Real-Time Protection feature has encountered an error and failed
    - 3007         # Real-time Protection feature has restarted
  filter_optional_network_inspection:
    Feature_Name: '%%886'     # Network Inspection System
    Reason:
    - '%%892'         # The system is missing updates that are required for running Network Inspection System.  Install the required updates and restart the device.
    - '%%858'         # Antimalware security intelligence has stopped functioning for an unknown reason. In some instances, restarting the service may resolve the problem.
  condition: selection and not 1 of filter_optional_*
falsepositives:
- Some crashes can occur sometimes and the event doesn't provide enough information
  to tune out these cases. Manual exception is required
level: medium
notes: |
  ### Technical Context
  This detection rule targets failures and restarts of Windows Defender's Real-Time Protection features by monitoring specific event IDs generated by the Windows Defender service (windefend). It looks for Event ID 3002, indicating an error with the Real-Time Protection feature, and Event ID 3007, signaling a restart of this feature. Additionally, the rule further narrows down the focus to instances where the Network Inspection System feature is involved, filtering specific conditions based on feature names and potential reasons for failure. The criticality of this rule lies in its ability to prompt investigations into potential evasion tactics or system misconfigurations that can leave the environment vulnerable to threats. 
  ### Investigation Steps
  - Review the Windows Defender event logs in the EDR solution to identify the frequency and context of Event IDs 3002 and 3007.
  - Utilize the SIEM to correlate any alerts related to network activity during the times of the detected failures, which may indicate an attempted compromise or exploitation.
  - Examine system updates and patch management logs to verify if missing updates align with the detected errors, particularly for the Network Inspection System.
  - Check for any recent changes to Group Policy or security configurations that may have impacted Windows Defender’s functionalities, utilizing logs from your Active Directory or GPO management.
