title: PSExec and WMI Process Creations Block
id: 97b9ce1e-c5ab-11ea-87d0-0242ac130003
status: test
description: Detects blocking of process creations originating from PSExec and WMI
  commands
references:
- https://learn.microsoft.com/en-us/defender-endpoint/attack-surface-reduction-rules-reference?view=o365-worldwide#block-process-creations-originating-from-psexec-and-wmi-commands
- https://twitter.com/duff22b/status/1280166329660497920
author: Bhabesh Raj
date: 2020-07-14
modified: 2022-12-25
tags:
- attack.execution
- attack.lateral-movement
- attack.t1047
- attack.t1569.002
logsource:
  product: windows
  service: windefend
  definition: 'Requirements:Enabled Block process creations originating from PSExec
    and WMI commands from Attack Surface Reduction (GUID: d1e49aac-8f56-4280-b9ba-993a6d77406c)'
detection:
  selection:
    EventID: 1121
    ProcessName|endswith:
    - '\wmiprvse.exe'
    - '\psexesvc.exe'
  condition: selection
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This Sigma rule is designed to detect and respond to the blocking of process creations that originate from PSExec and Windows Management Instrumentation (WMI) commands. It focuses on the identification of specific Windows Event ID 1121 logs related to the execution of processes associated with PSExec (`psexesvc.exe`) and WMI (`wmiprvse.exe`). By monitoring these events, security teams can gain insights into potentially malicious lateral movement attempts, as both PSExec and WMI are frequently exploited by attackers for remote execution and unauthorized access to systems. The underlying technical data sources for this rule include Windows Defender logs which provide visibility into process creation activities, allowing analysts to understand and investigate suspicious behavior on endpoints.
  ### Investigation Steps
  - Review the associated Windows Event ID 1121 logs in the EDR platform to identify the originating host and any commands executed with PSExec or WMI.
  - Cross-reference the process creation logs with any known malicious IP addresses or domains using the Proxy or firewall logs to assess the potential for external control.
  - Check recent user account activity and authentication logs to understand if the execution was linked to legitimate administrative tasks or unauthorized access attempts.
  - Determine if any other security tools, such as AV or NDR solutions, flagged the activities to gather additional context that could indicate whether the blocking event was a false positive or a real threat.
