title: Windows Defender Configuration Changes
id: 801bd44f-ceed-4eb6-887c-11544633c0aa
related:
- id: 1321dc4e-a1fe-481d-a016-52c45f0c8b4f
  type: similar
- id: a3ab73f1-bd46-4319-8f06-4b20d0617886
  type: similar
- id: 91903aba-1088-42ee-b680-d6d94fe002b0
  type: similar
status: stable
description: Detects suspicious changes to the Windows Defender configuration
references:
- https://learn.microsoft.com/en-us/defender-endpoint/troubleshoot-microsoft-defender-antivirus?view=o365-worldwide
- https://bidouillesecurity.com/disable-windows-defender-in-powershell/#DisableAntiSpyware
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-12-06
modified: 2023-11-24
tags:
- attack.defense-evasion
- attack.t1562.001
logsource:
  product: windows
  service: windefend
detection:
  selection:
    EventID: 5007     # The antimalware platform configuration changed.
    NewValue|contains:
            # TODO: Add more suspicious values
    - '\Windows Defender\DisableAntiSpyware '
            # - '\Windows Defender\Features\TamperProtection ' # Might produce FP
    - '\Windows Defender\Scan\DisableRemovableDriveScanning '
    - '\Windows Defender\Scan\DisableScanningMappedNetworkDrivesForFullScan '
    - '\Windows Defender\SpyNet\DisableBlockAtFirstSeen '
    - '\Real-Time Protection\SpyNetReporting '
            # Exclusions changes are covered in 1321dc4e-a1fe-481d-a016-52c45f0c8b4f
            # Exploit guard changes are covered in a3ab73f1-bd46-4319-8f06-4b20d0617886
  condition: selection
falsepositives:
- Administrator activity (must be investigated)
level: high
notes: |
  ### Technical Context
  This Sigma rule is designed to detect potentially malicious changes made to the Windows Defender configuration on enterprise systems. The rule focuses on Event ID 5007, which indicates that the antimalware platform's settings have been altered. It specifically looks for changes that may suggest an attempt to disable critical security features, such as disabling real-time protection, altering scanning capabilities for removable drives, or modifying telemetry reporting settings. These types of changes can be indicative of attackers striving to evade detection while executing malicious activities on the network. The data sources involved in this detection include Windows event logs, specifically those related to the Windows Defender service, which captures configuration modifications.
  ### Investigation Steps
  - Review the relevant Windows event logs to identify the context and source of the configuration changes, focusing on Event ID 5007.
  - Check for any associated user actions or processes that triggered the configuration changes by correlating logs from the EDR.
  - Investigate the system's command history for any PowerShell commands executed that may relate to modifying Windows Defender settings.
  - Assess whether there were any additional security alerts or anomalies around the same timeframe to understand the broader scope of potential compromise.
