title: Windows Defender Malware Detection History Deletion
id: 2afe6582-e149-11ea-87d0-0242ac130003
status: test
description: Windows Defender logs when the history of detected infections is deleted.
references:
- https://learn.microsoft.com/en-us/defender-endpoint/troubleshoot-microsoft-defender-antivirus
- https://web.archive.org/web/20160727113019/https://answers.microsoft.com/en-us/protect/forum/mse-protect_scanning/microsoft-antimalware-has-removed-history-of/f15af6c9-01a9-4065-8c6c-3f2bdc7de45e
author: Cian Heasley
date: 2020-08-13
modified: 2023-11-24
tags:
- attack.defense-evasion
logsource:
  product: windows
  service: windefend
detection:
  selection:
    EventID: 1013     # The antimalware platform deleted history of malware and other potentially unwanted software.
  condition: selection
falsepositives:
- Deletion of Defender malware detections history for legitimate reasons
level: informational
notes: |
  ### Technical Context
  This detection rule focuses on monitoring Windows Defender's behavior regarding the deletion of malware detection history. Specifically, it looks for EventID 1013, which indicates that the Windows Defender antimalware platform has removed records of malware detections and other potentially unwanted software. The deletion of such history can be a legitimate action following system clean-up or policy enforcement; however, it may also signify attempts to cover up malicious activities. The primary data source involved is the security event log generated by Windows Defender, which provides insights into the actions taken by the antivirus service.
  By leveraging this detection, SOC analysts can identify unexpected deletions of malware history, which may warrant further investigation to determine if they are part of a defense evasion tactic employed by threat actors.
  ### Investigation Steps
  - Review the related Windows Defender logs for any anomalies or patterns surrounding the EventID 1013.
  - Use EDR tools to verify if any suspicious processes or applications were running at or before the time of the history deletion.
  - Check for user account activity in conjunction with the event to see if any accounts with suspicious behavior were involved around the time of the deletion.
  - Analyze network traffic logs from the NGFW or proxy to identify any unusual outbound connections that might correlate with the period of event occurrence.
