title: Windows Defender Threat Detected
id: 57b649ef-ff42-4fb0-8bf6-62da243a1708
status: stable
description: Detects actions taken by Windows Defender malware detection engines
references:
- https://learn.microsoft.com/en-us/defender-endpoint/troubleshoot-microsoft-defender-antivirus
author: Ján Trenčanský
date: 2020-07-28
tags:
- attack.execution
- attack.t1059
logsource:
  product: windows
  service: windefend
detection:
  selection:
    EventID:
    - 1006         # The antimalware engine found malware or other potentially unwanted software.
    - 1015         # The antimalware platform detected suspicious behavior.
    - 1116         # The antimalware platform detected malware or other potentially unwanted software.
    - 1117         # he antimalware platform performed an action to protect your system from malware or other potentially unwanted software.
  condition: selection
falsepositives:
- Unlikely
level: high
notes: |
  ### Technical Context
  This detection rule monitors for events generated by Windows Defender Threat Detection, specifically targeting incidents that signify the detection of malware or potentially unwanted software. It looks for specific Event IDs related to malware detection and mitigation activities, such as Event ID 1006 (malware detection), Event ID 1015 (suspicious behavior detection), and Event IDs 1116 and 1117, which indicate either the detection of malware or actions taken to mitigate threats. The rule leverages logs produced by the Windows Defender service (`windefend`), thus focusing on the security posture of Windows systems within the enterprise environment. By identifying these specific Event IDs, the rule helps SOC analysts respond proactively to malware threats and other security concerns on user endpoints.
  ### Investigation Steps
  - Correlate the detected Event IDs with process creation logs from your EDR solution to identify the associated processes and user accounts involved.
  - Review the Windows Defender logs for additional context regarding the detection, including the specific types of malware identified and the actions taken.
  - Check the associated endpoint for signs of compromise or unusual behavior that may correlate with the timing of the detected events.
  - Conduct a network analysis using NDR tools to see if there were any outbound connections or communication attempts by the affected device that could indicate further malicious activity.
