title: Potential Persistence Via Disk Cleanup Handler - Registry
id: d4f4e0be-cf12-439f-9e25-4e2cdcf7df5a
status: test
description: |
  Detects when an attacker modifies values of the Disk Cleanup Handler in the registry to achieve persistence.
  The disk cleanup manager is part of the operating system. It displays the dialog box […]
  The user has the option of enabling or disabling individual handlers by selecting or clearing their check box in the disk cleanup manager's UI.
  Although Windows comes with a number of disk cleanup handlers, they aren't designed to handle files produced by other applications.
  Instead, the disk cleanup manager is designed to be flexible and extensible by enabling any developer to implement and register their own disk cleanup handler.
  Any developer can extend the available disk cleanup services by implementing and registering a disk cleanup handler.
references:
- https://persistence-info.github.io/Data/diskcleanuphandler.html
- https://www.hexacorn.com/blog/2018/09/02/beyond-good-ol-run-key-part-86/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-07-21
modified: 2023-02-07
tags:
- attack.persistence
logsource:
  product: windows
  category: registry_add
detection:
  selection:
    EventType: CreateKey
    TargetObject|contains: '\SOFTWARE\Microsoft\Windows\CurrentVersion\Explorer\VolumeCaches\'
  filter:
        # Default Keys
    TargetObject|endswith:
    - '\Active Setup Temp Folders'
    - '\BranchCache'
    - '\Content Indexer Cleaner'
    - '\D3D Shader Cache'
    - '\Delivery Optimization Files'
    - '\Device Driver Packages'
    - '\Diagnostic Data Viewer database files'
    - '\Downloaded Program Files'
    - '\DownloadsFolder'
    - '\Feedback Hub Archive log files'
    - '\Internet Cache Files'
    - '\Language Pack'
    - '\Microsoft Office Temp Files'
    - '\Offline Pages Files'
    - '\Old ChkDsk Files'
    - '\Previous Installations'
    - '\Recycle Bin'
    - '\RetailDemo Offline Content'
    - '\Setup Log Files'
    - '\System error memory dump files'
    - '\System error minidump files'
    - '\Temporary Files'
    - '\Temporary Setup Files'
    - '\Temporary Sync Files'
    - '\Thumbnail Cache'
    - '\Update Cleanup'
    - '\Upgrade Discarded Files'
    - '\User file versions'
    - '\Windows Defender'
    - '\Windows Error Reporting Files'
    - '\Windows ESD installation files'
    - '\Windows Upgrade Log Files'
  condition: selection and not filter
falsepositives:
- Legitimate new entry added by windows
level: medium
notes: |
  ### Technical Context
  This Sigma rule is designed to detect potential persistence mechanisms employed by attackers via modifications to the Windows registry related to the Disk Cleanup Handler. The Disk Cleanup Manager allows users to enable or disable various cleanup handlers through its interface. By monitoring the creation of new registry keys under `\SOFTWARE\Microsoft\Windows\CurrentVersion\Explorer\VolumeCaches\`, the rule identifies modifications that deviate from established keys associated with legitimate Windows activities. The logs captured for this rule primarily originate from the Windows registry and involve key operations like `CreateKey`, specifically filtering out default cleanup handlers to reveal unusual, potentially malicious entries.
  ### Investigation Steps
  - Review the EDR logs for the specified registry key alterations to identify the source process responsible for the modification, which may indicate unauthorized changes.
  - Correlate the timestamp of the registry modifications with user activity logs and any recent command execution to establish context around the potential malicious behavior.
  - Check antivirus logs for any detections related to the process that created the suspicious registry key to determine if it had been flagged for malicious activity.
  - Analyze network traffic through the NDR tool for any unusual outbound communication that could indicate command and control activity following the registry modification.
