title: Potential COM Object Hijacking Via TreatAs Subkey - Registry
id: 9b0f8a61-91b2-464f-aceb-0527e0a45020
status: test
description: Detects COM object hijacking via TreatAs subkey
references:
- https://bohops.com/2018/08/18/abusing-the-com-registry-structure-part-2-loading-techniques-for-evasion-and-persistence/
author: Kutepov Anton, oscd.community
date: 2019-10-23
modified: 2023-02-07
tags:
- attack.persistence
- attack.t1546.015
logsource:
  category: registry_add
  product: windows
detection:
  selection:
    EventType: 'CreateKey'      # Don't want DeleteKey events
    TargetObject|contains|all:
    - 'HKU\'
    - 'Classes\CLSID\'
    - '\TreatAs'
  filter_svchost:
        # Example of target object by svchost
        # TargetObject: HKU\S-1-5-21-1098798288-3663759343-897484398-1001_Classes\CLSID\{0003000A-0000-0000-C000-000000000046}\TreatAs
    Image: 'C:\WINDOWS\system32\svchost.exe'
  condition: selection and not 1 of filter_*
falsepositives:
- Maybe some system utilities in rare cases use linking keys for backward compatibility
level: medium
notes: |
  ### Technical Context
  This detection rule identifies potential COM object hijacking attempts via the manipulation of the Windows Registry's TreatAs subkey. Specifically, it monitors for the creation of registry keys in the Windows registry path associated with COM objects, particularly under the `HKU\` and `Classes\CLSID\` directories, which indicates that a specific COM object is being manipulated. The rule also ensures that the event is not merely a routine deletion or modification by denying events that don't originate from the `svchost.exe` process, focusing instead on potential malicious activities aimed at establishing persistence or altering the behavior of legitimate COM objects. By detecting these registry changes, the rule helps identify attempts to execute malicious code disguised as legitimate COM component operations.
  ### Investigation Steps
  - Query the EDR solution for recent process activity involving `svchost.exe` to identify any abnormal behaviors or patterns that coincide with the time of the detection alert.
  - Review the registry change logs to verify the specific keys that were created or modified, focusing on those located under the `Classes\CLSID\` and `TreatAs` paths.
  - Cross-reference the detected activity against known good baselines to determine if legitimate applications may have necessitated these registry modifications.
  - Analyze network traffic through NDR or proxy logs for any suspicious outbound connections initiated by the `svchost.exe` instance following the registry changes, as these may indicate further malicious activities.
