title: NTLMv1 Logon Between Client and Server
id: e9d4ab66-a532-4ef7-a502-66a9e4a34f5d
status: test
description: Detects the reporting of NTLMv1 being used between a client and server.
  NTLMv1 is insecure as the underlying encryption algorithms can be brute-forced by
  modern hardware.
references:
- https://github.com/nasbench/EVTX-ETW-Resources/blob/f1b010ce0ee1b71e3024180de1a3e67f99701fe4/ETWProvidersManifests/Windows10/22H2/W10_22H2_Pro_20230321_19045.2728/WEPExplorer/LsaSrv.xml
author: Tim Shelton, Nasreddine Bencherchali (Nextron Systems)
date: 2022-04-26
modified: 2023-06-06
tags:
- attack.defense-evasion
- attack.lateral-movement
- attack.t1550.002
logsource:
  product: windows
  service: system
detection:
  selection:
    Provider_Name: "LsaSrv"
    EventID:
    - 6038
    - 6039
  condition: selection
falsepositives:
- Environments that use NTLMv1
level: medium
notes: |
  ### Technical Context
  This Sigma rule is designed to detect instances of NTLMv1 authentication being utilized between a client and server within a Windows environment. NTLMv1 is known for its weak security protocols, which can be easily compromised by modern brute-force methods. The rule leverages event logs generated by the LsaSrv provider, specifically monitoring Event IDs 6038 and 6039, which signify NTLMv1 authentication events. By focusing on these specific events, the rule enables the detection of potentially insecure authentication practices that could expose the network to unauthorized access or lateral movement by attackers.
  The rule is particularly important in environments where NTLMv1 is still in use, as it raises alerts that can direct incident responders to investigate and take appropriate action. In case these events are generated, it allows teams to evaluate the security settings of their systems and consider remediation steps or policy adjustments needed to enhance network security.
  ### Investigation Steps
  - Check EDR logs to determine if there are any recent instances of NTLMv1 usage, especially from systems known to be vulnerable or outdated.
  - Review Windows security logs to correlate Event IDs 6038 and 6039 with user activity, identifying any unauthorized access attempts following these authentication events.
  - Analyze network traffic through the NDR solution to capture any related sessions or connections that utilized NTLMv1, noting the source and destination IP addresses.
  - Validate whether NTLMv1 is being used as part of an application process or service configuration, and recommend transitioning to more secure authentication methods such as NTLMv2 or Kerberos if found.
