title: DNS Query To MEGA Hosting Website
id: 613c03ba-0779-4a53-8a1f-47f914a4ded3
related:
- id: 66474410-b883-415f-9f8d-75345a0a66a6
  type: similar
status: test
description: Detects DNS queries for subdomains related to MEGA sharing website
references:
- https://research.nccgroup.com/2021/05/27/detecting-rclone-an-effective-tool-for-exfiltration/
author: Aaron Greetham (@beardofbinary) - NCC Group
date: 2021-05-26
modified: 2023-09-18
tags:
- attack.exfiltration
- attack.t1567.002
logsource:
  product: windows
  category: dns_query
detection:
  selection:
    QueryName|contains: 'userstorage.mega.co.nz'
  condition: selection
falsepositives:
- Legitimate DNS queries and usage of Mega
level: medium
notes: |
  ### Technical Context
  This detection rule identifies DNS queries that target subdomains associated with the MEGA file-sharing website, specifically focusing on the query `userstorage.mega.co.nz`. The rule utilizes DNS query logs sourced from Windows systems to monitor for potentially malicious behavior, particularly concerning data exfiltration attempts. By analyzing these queries, analysts can flag activities that may indicate improper use of the MEGA service, which can be a vector for data leakages or unauthorized transfers of sensitive information. As organizations become more vigilant about data loss prevention, recognizing these common exfiltration paths is critical for maintaining data security and integrity.
  ### Investigation Steps
  - Use EDR tools to inspect the endpoint where the DNS query originated, checking for any unusual processes or network activities that align with the timings of the detected DNS requests.
  - Query the DNS logs to determine if there were multiple requests to `userstorage.mega.co.nz` from the same source, which may indicate automated or scripted activities.
  - Review proxy logs for any web traffic attempts to the MEGA service to corroborate the DNS query findings and assess user actions related to data transfer.
  - Check cloud platform logs (AWS, GCP, Azure) for any API calls or outbound traffic to MEGA's endpoints that could signal unauthorized data transfers or suspicious access patterns.
