title: DNS Query Tor .Onion Address - Sysmon
id: b55ca2a3-7cff-4dda-8bdd-c7bfa63bf544
related:
- id: 8384bd26-bde6-4da9-8e5d-4174a7a47ca2
  type: similar
status: test
description: Detects DNS queries to an ".onion" address related to Tor routing networks
references:
- https://www.logpoint.com/en/blog/detecting-tor-use-with-logpoint/
author: frack113
date: 2022-02-20
modified: 2023-09-18
tags:
- attack.command-and-control
- attack.t1090.003
logsource:
  product: windows
  category: dns_query
detection:
  selection:
    QueryName|contains: '.onion'
  condition: selection
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This Sigma rule is designed to detect DNS queries that contain ".onion" addresses, which are associated with Tor hidden services. Tor is often utilized for anonymous communications, and requests to ".onion" domains can indicate potentially malicious activity such as command-and-control (C2) communications or data exfiltration attempts. The rule relies on data from DNS query logs generated by Windows systems, making it possible to identify suspicious queries that might indicate attempts to access unauthorized or illegal services over the Tor network. By monitoring these queries, security teams can take proactive steps against threats related to clandestine operations executed via Tor.
  ### Investigation Steps
  - Review the DNS query logs within your SIEM to identify the source IP addresses making requests to ".onion" domains. Cross-reference these IPs with threat intelligence databases for known malicious actors.
  - Use your EDR solution to investigate the devices originating these queries, focusing on process creation and command-line arguments that may indicate how Tor was accessed or installed.
  - Check firewall and proxy logs to see if any traffic is being routed to the identified ".onion" addresses. Analyze patterns of access which may reveal broader attempts to reach other potentially harmful resources.
  - Engage with endpoint security solutions to run comprehensive scans on the affected systems, as residual artifacts or malware may exist, indicating a deeper compromise related to the Tor usage.
