title: DNS Query To AzureWebsites.NET By Non-Browser Process
id: e043f529-8514-4205-8ab0-7f7d2927b400
related:
- id: 5c80b618-0dbb-46e6-acbb-03d90bcb6d83
  type: derived
status: experimental
description: |
  Detects a DNS query by a non browser process on the system to "azurewebsites.net". The latter was often used by threat actors as a malware hosting and exfiltration site.
references:
- https://www.sentinelone.com/labs/wip26-espionage-threat-actors-abuse-cloud-infrastructure-in-targeted-telco-attacks/
- https://symantec-enterprise-blogs.security.com/threat-intelligence/harvester-new-apt-attacks-asia
- https://www.ptsecurity.com/ww-en/analytics/pt-esc-threat-intelligence/higaisa-or-winnti-apt-41-backdoors-old-and-new/
- https://intezer.com/blog/research/how-we-escaped-docker-in-azure-functions/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2024-06-24
tags:
- attack.command-and-control
- attack.t1219
logsource:
  product: windows
  category: dns_query
detection:
  selection:
    QueryName|endswith: 'azurewebsites.net'
  filter_optional_chrome:
    Image:
    - 'C:\Program Files\Google\Chrome\Application\chrome.exe'
    - 'C:\Program Files (x86)\Google\Chrome\Application\chrome.exe'
  filter_optional_firefox:
    Image:
    - 'C:\Program Files\Mozilla Firefox\firefox.exe'
    - 'C:\Program Files (x86)\Mozilla Firefox\firefox.exe'
  filter_optional_ie:
    Image:
    - 'C:\Program Files (x86)\Internet Explorer\iexplore.exe'
    - 'C:\Program Files\Internet Explorer\iexplore.exe'
  filter_optional_edge_1:
  - Image|startswith: 'C:\Program Files (x86)\Microsoft\EdgeWebView\Application\'
  - Image|endswith: '\WindowsApps\MicrosoftEdge.exe'
  - Image:
    - 'C:\Program Files (x86)\Microsoft\Edge\Application\msedge.exe'
    - 'C:\Program Files\Microsoft\Edge\Application\msedge.exe'
  filter_optional_edge_2:
    Image|startswith:
    - 'C:\Program Files (x86)\Microsoft\EdgeCore\'
    - 'C:\Program Files\Microsoft\EdgeCore\'
    Image|endswith:
    - '\msedge.exe'
    - '\msedgewebview2.exe'
  filter_optional_safari:
    Image|endswith: '\safari.exe'
  filter_optional_defender:
    Image|endswith:
    - '\MsMpEng.exe'         # Microsoft Defender executable
    - '\MsSense.exe'         # Windows Defender Advanced Threat Protection Service Executable
  filter_optional_brave:
    Image|endswith: '\brave.exe'
    Image|startswith: 'C:\Program Files\BraveSoftware\'
  filter_optional_maxthon:
    Image|contains: '\AppData\Local\Maxthon\'
    Image|endswith: '\maxthon.exe'
  filter_optional_opera:
    Image|contains: '\AppData\Local\Programs\Opera\'
    Image|endswith: '\opera.exe'
  filter_optional_seamonkey:
    Image|startswith:
    - 'C:\Program Files\SeaMonkey\'
    - 'C:\Program Files (x86)\SeaMonkey\'
    Image|endswith: '\seamonkey.exe'
  filter_optional_vivaldi:
    Image|contains: '\AppData\Local\Vivaldi\'
    Image|endswith: '\vivaldi.exe'
  filter_optional_whale:
    Image|startswith:
    - 'C:\Program Files\Naver\Naver Whale\'
    - 'C:\Program Files (x86)\Naver\Naver Whale\'
    Image|endswith: '\whale.exe'
  filter_optional_tor:
    Image|contains: '\Tor Browser\'
  filter_optional_whaterfox:
    Image|startswith:
    - 'C:\Program Files\Waterfox\'
    - 'C:\Program Files (x86)\Waterfox\'
    Image|endswith: '\Waterfox.exe'
  filter_optional_midori:
    Image|contains: '\AppData\Local\Programs\midori-ng\'
    Image|endswith: '\Midori Next Generation.exe'
  filter_optional_slimbrowser:
    Image|startswith:
    - 'C:\Program Files\SlimBrowser\'
    - 'C:\Program Files (x86)\SlimBrowser\'
    Image|endswith: '\slimbrowser.exe'
  filter_optional_flock:
    Image|contains: '\AppData\Local\Flock\'
    Image|endswith: '\Flock.exe'
  filter_optional_phoebe:
    Image|contains: '\AppData\Local\Phoebe\'
    Image|endswith: '\Phoebe.exe'
  filter_optional_falkon:
    Image|startswith:
    - 'C:\Program Files\Falkon\'
    - 'C:\Program Files (x86)\Falkon\'
    Image|endswith: '\falkon.exe'
  filter_optional_avant:
    Image|startswith:
    - 'C:\Program Files (x86)\Avant Browser\'
    - 'C:\Program Files\Avant Browser\'
    Image|endswith: '\avant.exe'
  condition: selection and not 1 of filter_optional_*
falsepositives:
- Likely with other browser software. Apply additional filters for any other browsers
  you might use.
level: medium
notes: |
  ### Technical Context
  This detection rule aims to identify DNS queries directed at "azurewebsites.net" made by non-browser processes. The tactic aligns with the MITRE ATT&CK framework under the Command and Control (T1219) technique, commonly employed by threat actors for malware distribution and data exfiltration. The primary data source for this rule is the DNS query logs collected from Windows systems, which will detail the applications making the DNS requests. The detection engine looks for any process not classified as a standard web browser (such as Chrome, Firefox, or Edge) attempting to resolve the "azurewebsites.net" domain. By excluding legitimate browsers, the rule aims to minimize false positives while focusing on potentially malicious activities, signaling that an attacker might be leveraging an unconventional method to communicate with command-and-control servers.
  ### Investigation Steps
  - **Check DNS Log Entries:** Analyze the DNS query logs to identify the exact timestamp and the process initiating the DNS request to "azurewebsites.net." Cross-reference this data with Sysmon process creation events to pinpoint the associated process.
    
  - **Identify the Process Execution Context:** Use EDR tools to gather contextual information about the non-browser process, including its parent process, execution time, and command-line parameters, which may reveal the intent behind the DNS query.
  - **Review Network Traffic:** Inspect network traffic that corresponds with the timestamp of the DNS query using NDR solutions. Look for abnormal outbound connections or data exfiltration attempts towards "azurewebsites.net."
  - **Run Threat Intelligence Lookup:** Cross-check the identified process with threat intelligence sources to assess whether it has known malicious behavior or is associated with past incidents relating to command-and-control activities.
  ### Prioritization
  Given the increasing use of infrastructure like "azurewebsites.net" in malicious campaigns, alerts triggered by this rule should be considered of medium to high severity. An immediate investigation is warranted to determine if any potentially harmful activity is being carried out by the non-browser process.
  ### Blind Spots and Assumptions
  This rule relies on the assumption that all legitimate browser processes are properly filtered out through specified image paths. However, if a malicious actor gains control over a legitimate browser or disguises their process, the rule may fail to trigger. In addition, DNS tunneling or other sophisticated evasion techniques may also result in missed detections. This necessitates continuous updates and validation of the filters to ensure they accurately reflect the software environment in use.
  > **Disclaimer:** This investigation guide was created using generative AI technology and has not been reviewed for its accuracy and relevance. While every effort has been made to ensure its quality, we recommend validating the content and adapting it to suit specific environment and operational needs. Please communicate any changes to the detection engineering team.
