title: DNS Query for Anonfiles.com Domain - Sysmon
id: 065cceea-77ec-4030-9052-fc0affea7110
related:
- id: 29f171d7-aa47-42c7-9c7b-3c87938164d9
  type: similar
status: test
description: Detects DNS queries for "anonfiles.com", which is an anonymous file upload
  platform often used for malicious purposes
references:
- https://www.trendmicro.com/vinfo/us/security/news/ransomware-spotlight/ransomware-spotlight-blackbyte
author: pH-T (Nextron Systems)
date: 2022-07-15
modified: 2023-01-16
tags:
- attack.exfiltration
- attack.t1567.002
logsource:
  product: windows
  category: dns_query
detection:
  selection:
    QueryName|contains: '.anonfiles.com'
  condition: selection
falsepositives:
- Rare legitimate access to anonfiles.com
level: high
notes: |
  ### Technical Context
  This detection rule focuses on identifying DNS queries made to the domain "anonfiles.com", a platform associated with anonymous file uploads that can be exploited for malicious purposes, such as malware distribution or data exfiltration. The rule utilizes Windows DNS query logs, particularly looking for entries where the queried domain includes ".anonfiles.com". When a process on a Windows system makes a DNS request, this log entry is created, capturing pertinent details like the queried Name and associated timestamp. By monitoring these queries, the rule aims to detect potentially harmful activities related to data leaks or unauthorized file transfers.
  ### Investigation Steps
  - Review recent DNS query logs in your SIEM to identify the frequency and context of queries to the "anonfiles.com" domain.
  - Utilize the EDR tool to check for any processes that generated the DNS queries to determine associated executable activity and potential user behavior.
  - Search for any outgoing traffic in the NGFW logs related to "anonfiles.com" to assess if data may have been transferred to or from this domain.
  - Investigate proxy logs for additional context on web traffic leading to "anonfiles.com", focusing on user sessions and providing insights into how the domain was accessed.
