title: DNS Server Discovery Via LDAP Query
id: a21bcd7e-38ec-49ad-b69a-9ea17e69509e
status: test
description: Detects DNS server discovery via LDAP query requests from uncommon applications
references:
- https://github.com/redcanaryco/atomic-red-team/blob/980f3f83fd81f37c1ca9c02dccfd1c3d9f9d0841/atomics/T1016/T1016.md#atomic-test-9---dns-server-discovery-using-nslookup
- https://learn.microsoft.com/en-us/openspecs/windows_protocols/ms-adts/7fcdce70-5205-44d6-9c3a-260e616a2f04
author: frack113
date: 2022-08-20
modified: 2023-09-18
tags:
- attack.discovery
- attack.t1482
logsource:
  product: windows
  category: dns_query
detection:
  selection:
    QueryName|startswith: '_ldap.'
  filter_main_generic:
    Image|contains:
    - ':\Program Files\'
    - ':\Program Files (x86)\'
    - ':\Windows\'
  filter_main_defender:
    Image|contains: ':\ProgramData\Microsoft\Windows Defender\Platform\'
    Image|endswith: '\MsMpEng.exe'
  filter_main_unknown:
    Image: '<unknown process>'
  filter_optional_azure:
    Image|startswith: 'C:\WindowsAzure\GuestAgent'
  filter_main_null:
    Image:
  filter_optional_browsers:
        # Note: This list is for browsers installed in the user context. To avoid basic evasions based on image name. Best to baseline this list with the browsers you use internally and add their full paths.
    Image|endswith:
    - '\chrome.exe'
    - '\firefox.exe'
    - '\opera.exe'
  condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
falsepositives:
- Likely
# Note: Incrase the level once a baseline is established
level: low
notes: |
  ### Technical Context
  This Sigma rule is designed to detect potentially malicious DNS server discovery attempts using LDAP queries initiated by uncommon or suspicious applications on Windows systems. It specifically looks for DNS query names that begin with '_ldap.', indicating an attempt to locate LDAP services over DNS. The detection focuses on the sources from which these queries originate, specifically excluding well-known applications like browsers or system services. The rule utilizes Windows DNS query logs as the primary data source, along with filters to differentiate between common executable paths and potentially harmful or unknown processes that may be attempting to query DNS for LDAP services. By targeting uncommon applications running from specific directories, the rule aims to reduce false positives and increase the accuracy of detection.
  ### Investigation Steps
  - **Review the EDR Alerts:** Utilize the EDR to investigate the specific process that triggered the alert, focusing on the execution path and parent process information.
  - **Analyze DNS Logs:** Look into the DNS query logs to confirm the frequency and context of the `_ldap.` queries, noting any anomalies or patterns consistent with malicious behavior.
  - **Check for Event Logs:** Examine Windows event logs to gather additional context about the processes involved, including user activities around the time of the query attempts.
  - **Cross-reference with Threat Intelligence:** Use threat intelligence platforms to check the involved application and processes against known indicators of compromise (IoCs) or attack methodologies.
