title: DNS Query To Visual Studio Code Tunnels Domain
id: b3e6418f-7c7a-4fad-993a-93b65027a9f1
related:
- id: 9501f8e6-8e3d-48fc-a8a6-1089dd5d7ef4     # Net Connection DevTunnels
  type: similar
- id: 4b657234-038e-4ad5-997c-4be42340bce4     # Net Connection VsCode
  type: similar
- id: 1cb0c6ce-3d00-44fc-ab9c-6d6d577bf20b     # DNS DevTunnels
  type: similar
status: test
description: |
  Detects DNS query requests to Visual Studio Code tunnel domains. Attackers can abuse that feature to establish a reverse shell or persistence on a machine.
references:
- https://ipfyx.fr/post/visual-studio-code-tunnel/
- https://badoption.eu/blog/2023/01/31/code_c2.html
- https://cydefops.com/vscode-data-exfiltration
author: citron_ninja
date: 2023-10-25
modified: 2023-11-20
tags:
- attack.command-and-control
- attack.t1071.001
logsource:
  category: dns_query
  product: windows
detection:
  selection:
    QueryName|endswith: '.tunnels.api.visualstudio.com'
  condition: selection
falsepositives:
- Legitimate use of Visual Studio Code tunnel will also trigger this.
level: medium
notes: |
  ### Technical Context
  This detection rule targets DNS query requests made to domains associated with Visual Studio Code tunnel services, specifically those ending in `.tunnels.api.visualstudio.com`. The ability to create code tunnels can be exploited by attackers to establish persistent access or initiate reverse shells on compromised machines. By monitoring DNS logs, this rule identifies potentially malicious activity associated with suspicious query patterns made by users or processes attempting to connect to Visual Studio Code's tunneling service. The primary data source leveraged for this detection is DNS query logs from Windows systems, which capture the requests made to resolve domain names into IP addresses.
  ### Investigation Steps
  - Review the DNS query logs for corresponding timestamps to confirm the legitimacy of the requests to the Visual Studio Code tunnel domains.
  - Utilize endpoint detection and response (EDR) solutions to inspect the processes that initiated the DNS queries, checking for any unauthorized or suspicious applications.
  - Analyze network traffic through the network detection and response (NDR) platform to uncover any related outbound connections that may indicate command-and-control (C2) communications.
  - Cross-reference user activity logs to determine whether the software was legitimately employed for development purposes or if its usage aligns with regular operational behavior.
