title: DNS Server Discovery Via LDAP Query
id: a21bcd7e-38ec-49ad-b69a-9ea17e69509e
status: test
description: Detects DNS server discovery via LDAP query requests from uncommon applications
references:
- https://github.com/redcanaryco/atomic-red-team/blob/980f3f83fd81f37c1ca9c02dccfd1c3d9f9d0841/atomics/T1016/T1016.md#atomic-test-9---dns-server-discovery-using-nslookup
- https://learn.microsoft.com/en-us/openspecs/windows_protocols/ms-adts/7fcdce70-5205-44d6-9c3a-260e616a2f04
author: frack113
date: 2022-08-20
modified: 2023-09-18
tags:
- attack.discovery
- attack.t1482
logsource:
  product: windows
  category: dns_query
detection:
  selection:
    QueryName|startswith: '_ldap.'
  filter_main_generic:
    Image|contains:
    - ':\Program Files\'
    - ':\Program Files (x86)\'
    - ':\Windows\'
  filter_main_defender:
    Image|contains: ':\ProgramData\Microsoft\Windows Defender\Platform\'
    Image|endswith: '\MsMpEng.exe'
  filter_main_unknown:
    Image: '<unknown process>'
  filter_optional_azure:
    Image|startswith: 'C:\WindowsAzure\GuestAgent'
  filter_main_null:
    Image:
  filter_optional_browsers:
        # Note: This list is for browsers installed in the user context. To avoid basic evasions based on image name. Best to baseline this list with the browsers you use internally and add their full paths.
    Image|endswith:
    - '\chrome.exe'
    - '\firefox.exe'
    - '\opera.exe'
  condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
falsepositives:
- Likely
# Note: Incrase the level once a baseline is established
level: low
notes: |
  n
  ### Technical Context
  This detection rule identifies potential DNS server discovery activities via LDAP queries from uncommon applications on Windows systems. It looks for DNS queries that start with '_ldap.', which are typically associated with requests to locate LDAP services. The rule also examines the source of these queries by filtering on the image path to differentiate between legitimate system processes and potential malicious activity. The primary data sources involved are DNS query logs, which are monitored to detect any unusual or unexpected sources initiating LDAP-based DNS queries. This aligns with the MITRE ATT&CK tactic of Discovery, specifically the technique T1482, which pertains to querying for information about infrastructure.
  ### Investigation Steps
  - **Review DNS Query Logs:** Examine specific DNS query logs for LDAP queries (e.g., those that begin with '_ldap.') and note the originating process and its execution path.
  - **Analyze Process Origins:** Utilize EDR tools to identify and assess the image paths and origins of any uncommon processes associated with the detected DNS queries.
  - **Cross-Reference with Security Tools:** Check AV and security logs for any alerts related to the processes identified during the DNS query analysis to determine if they are flagged as benign or malicious.
  - **Validate Baselines:** Investigate the behavior of the identified processes against an established baseline to understand whether they are expected in your environment or indicative of anomalies.
  ### Prioritization
  Given the potential use of LDAP queries for reconnaissance and their association with malicious behavior, alerts generated by this rule are assigned a low severity level initially until a comprehensive baseline is established, which may later warrant heightened attention.
  ### Blind spots and Assumptions
  The rule may not trigger if legitimate applications performing DNS queries are running under non-standard paths or if they utilize alternative methods to perform LDAP queries that bypass detection. Additionally, the rule relies on correct configurations and logging of DNS query activities, thereby creating an assumption that all relevant DNS traffic is being logged appropriately. Adversaries may also spoof legitimate applications by running them from atypical locations to evade detection.
  > **Disclaimer:** This investigation guide was created using generative AI technology and has not been reviewed for its accuracy and relevance. While every effort has been made to ensure its quality, we recommend validating the content and adapting it to suit specific environment and operational needs. Please communicate any changes to the detection engineering team.
