title: DNS Query Request By QuickAssist.EXE
id: 882e858a-3233-4ba8-855e-2f3d3575803d
status: experimental
description: |
  Detects DNS queries initiated by "QuickAssist.exe" to Microsoft Quick Assist primary endpoint that is used to establish a session.
references:
- https://www.microsoft.com/en-us/security/blog/2024/05/15/threat-actors-misusing-quick-assist-in-social-engineering-attacks-leading-to-ransomware/
- https://www.linkedin.com/posts/kevin-beaumont-security_ive-been-assisting-a-few-orgs-hit-with-successful-activity-7268055739116445701-xxjZ/
- https://x.com/cyb3rops/status/1862406110365245506
- https://learn.microsoft.com/en-us/windows/client-management/client-tools/quick-assist
author: Muhammad Faisal (@faisalusuf)
date: 2024-12-19
tags:
- attack.initial-access
- attack.t1071.001
- attack.t1210
logsource:
  category: dns_query
  product: windows
detection:
  selection:
    Image|endswith: '\QuickAssist.exe'
    QueryName|endswith: 'remoteassistance.support.services.microsoft.com'
  condition: selection
falsepositives:
- Legitimate use of Quick Assist in the environment.
level: low
notes: |
  ### Technical Context
  This Sigma rule is designed to detect potentially malicious activities related to the Windows application "QuickAssist.exe." It specifically looks for DNS queries initiated by this application to the Microsoft Quick Assist primary endpoint, which facilitates remote assistance sessions. The detection relies primarily on DNS query logs collected from Windows systems and analyzes the queried domain name to identify any requests made to 'remoteassistance.support.services.microsoft.com.' This could indicate that an attacker is misusing Quick Assist in social engineering attacks aimed at establishing unwanted remote sessions, a tactic linked to various cyber threats, including ransomware. Incident responders should be aware that legitimate usage of Quick Assist exists within organizations, making context and verification crucial in responding to alerts generated by this rule.
  ### Investigation Steps
  - Use EDR tools to correlate the QuickAssist.exe process creation with the timestamps of the detected DNS queries to establish a timeline of events.
  - Review the command line parameters associated with the QuickAssist.exe process to determine if it was executed legitimately or possibly manipulated by a threat actor.
  - Check the firewall logs to identify any unusual outbound connections to IP addresses associated with the queried domain, which may reveal further suspicious behavior.
  - Analyze user activity logs and session records to ascertain if there was any unauthorized access or interactions while Quick Assist was in use.
