title: Suspicious DNS Query for IP Lookup Service APIs
id: ec82e2a5-81ea-4211-a1f8-37a0286df2c2
status: test
description: Detects DNS queries for IP lookup services such as "api.ipify.org" originating
  from a non browser process.
references:
- https://www.binarydefense.com/analysis-of-hancitor-when-boring-begets-beacon
- https://twitter.com/neonprimetime/status/1436376497980428318
- https://www.trendmicro.com/en_us/research/23/e/managed-xdr-investigation-of-ducktail-in-trend-micro-vision-one.html
author: Brandon George (blog post), Thomas Patzke
date: 2021-07-08
modified: 2024-03-22
tags:
- attack.reconnaissance
- attack.t1590
logsource:
  product: windows
  category: dns_query
detection:
  selection:
  - QueryName:
    - 'www.ip.cn'
    - 'l2.io'
  - QueryName|contains:
    - 'api.2ip.ua'
    - 'api.bigdatacloud.net'
    - 'api.ipify.org'
    - 'bot.whatismyipaddress.com'
    - 'canireachthe.net'
    - 'checkip.amazonaws.com'
    - 'checkip.dyndns.org'
    - 'curlmyip.com'
    - 'db-ip.com'
    - 'edns.ip-api.com'
    - 'eth0.me'
    - 'freegeoip.app'
    - 'geoipy.com'
    - 'getip.pro'
    - 'icanhazip.com'
    - 'ident.me'
    - 'ifconfig.io'
    - 'ifconfig.me'
    - 'ip-api.com'
    - 'ip.360.cn'
    - 'ip.anysrc.net'
    - 'ip.taobao.com'
    - 'ip.tyk.nu'
    - 'ipaddressworld.com'
    - 'ipapi.co'
    - 'ipconfig.io'
    - 'ipecho.net'
    - 'ipinfo.io'
    - 'ipip.net'
    - 'ipof.in'
    - 'ipv4.icanhazip.com'
    - 'ipv4bot.whatismyipaddress.com'
    - 'ipv6-test.com'
    - 'ipwho.is'
    - 'jsonip.com'
    - 'myexternalip.com'
    - 'seeip.org'
    - 'wgetip.com'
    - 'whatismyip.akamai.com'
    - 'whois.pconline.com.cn'
    - 'wtfismyip.com'
  filter_optional_brave:
    Image|endswith: '\brave.exe'
  filter_optional_chrome:
    Image:
    - 'C:\Program Files\Google\Chrome\Application\chrome.exe'
    - 'C:\Program Files (x86)\Google\Chrome\Application\chrome.exe'
  filter_optional_firefox:
    Image:
    - 'C:\Program Files\Mozilla Firefox\firefox.exe'
    - 'C:\Program Files (x86)\Mozilla Firefox\firefox.exe'
  filter_optional_ie:
    Image:
    - 'C:\Program Files (x86)\Internet Explorer\iexplore.exe'
    - 'C:\Program Files\Internet Explorer\iexplore.exe'
  filter_optional_maxthon:
    Image|endswith: '\maxthon.exe'
  filter_optional_edge_1:
  - Image|startswith: 'C:\Program Files (x86)\Microsoft\EdgeWebView\Application\'
  - Image|endswith: '\WindowsApps\MicrosoftEdge.exe'
  - Image:
    - 'C:\Program Files (x86)\Microsoft\Edge\Application\msedge.exe'
    - 'C:\Program Files\Microsoft\Edge\Application\msedge.exe'
  filter_optional_edge_2:
    Image|startswith:
    - 'C:\Program Files (x86)\Microsoft\EdgeCore\'
    - 'C:\Program Files\Microsoft\EdgeCore\'
    Image|endswith:
    - '\msedge.exe'
    - '\msedgewebview2.exe'
  filter_optional_opera:
    Image|endswith: '\opera.exe'
  filter_optional_safari:
    Image|endswith: '\safari.exe'
  filter_optional_seamonkey:
    Image|endswith: '\seamonkey.exe'
  filter_optional_vivaldi:
    Image|endswith: '\vivaldi.exe'
  filter_optional_whale:
    Image|endswith: '\whale.exe'
  condition: selection and not 1 of filter_optional_*
falsepositives:
- Legitimate usage of IP lookup services such as ipify API
level: medium
notes: |
  ### Technical Context
  This detection rule identifies suspicious DNS queries directed at IP lookup service APIs from non-browser processes, a common behavior observed in reconnaissance phases of various cyber threats. The rule specifically monitors DNS query logs and searches for specific domain names associated with IP information services, such as "api.ipify.org," "checkip.amazonaws.com," and many others. By evaluating the query strings against a predefined list, it helps flag instances that could indicate potential malicious activity, as these queries should typically originate from browser applications rather than background processes or scripts. This behavior is linked to the MITRE ATT&CK technique T1590 (Gathering Information from External Sources) which is often leveraged by attackers to ascertain external system configurations or validate access to specific network resources.
  ### Investigation Steps
  - **Review the Source Process:** Investigate the process initiating the DNS queries through EDR logs. Identify its characteristics, purpose, and whether it is a known legitimate application or service.
  - **Correlate with Network Traffic:** Analyze the network logs to see if there are any additional suspicious behaviors or connections made by the same process. Look for unusual outbound connections following the detected DNS activity.
  - **Check for Endpoint Anomalies:** Utilize AV and EDR tools to scan the endpoint for malware or other indicators of compromise. Focus particularly on any file or process that exhibits unusual modifications or behavior patterns.
  - **Consult with User Activity Logs:** Examine Windows Event Logs for relevant user activities around the time of the DNS queries. This helps establish a timeline and context for the detection, indicating if it aligns with legitimate or suspicious actions.
  ### Prioritization
  The alert carries a medium severity level due to the potential risk of reconnaissance activities leading to future attacks. While certain benign applications may trigger this rule, it warrants prompt investigation to mitigate the risk of system exploitation.
  ### Blind Spots and Assumptions
  This rule relies on the assumption that non-browser processes should not query IP lookup services, which may not always hold true; for instance, legitimate applications or scripts may use these services for valid reasons. Additionally, the rule may fail to capture threats using legitimate processes or those that spoof their image names, thus bypassing detection. It is important for other detection engineers to remain vigilant about known legitimate processes that may use these services and to consider the evolving nature of adversary tactics to avoid blind spots in the detection strategy.
  > **Disclaimer:** This investigation guide was created using generative AI technology and has not been reviewed for its accuracy and relevance. While every effort has been made to ensure its quality, we recommend validating the content and adapting it to suit specific environment and operational needs. Please communicate any changes to the detection engineering team.
