title: Unusual File Deletion by Dns.exe
id: 8f0b1fb1-9bd4-4e74-8cdf-a8de4d2adfd0
related:
- id: 9f383dc0-fdeb-4d56-acbc-9f9f4f8f20f3     # FileChange version
  type: similar
status: test
description: Detects an unexpected file being deleted by dns.exe which my indicate
  activity related to remote code execution or other forms of exploitation as seen
  in CVE-2020-1350 (SigRed)
references:
- https://www.elastic.co/guide/en/security/current/unusual-file-modification-by-dns-exe.html
author: Tim Rauch (Nextron Systems), Elastic (idea)
date: 2022-09-27
modified: 2023-02-15
tags:
- attack.initial-access
- attack.t1133
logsource:
  category: file_delete
  product: windows
detection:
  selection:
    Image|endswith: '\dns.exe'
  filter:
    TargetFilename|endswith: '\dns.log'
  condition: selection and not filter
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This Sigma rule is designed to detect unusual file deletion activities specifically executed by the `dns.exe` process, a legitimate Windows DNS service executable. The rule focuses on identifying instances where `dns.exe` attempts to delete files with a `.log` extension, such as `dns.log`. While this behavior may occasionally occur during routine operations, its occurrence can also indicate malicious activity, potentially linked to exploitation techniques like those seen in CVE-2020-1350 (SigRed). Detection relies on monitoring file deletion logs from Windows environments, targeting the process name and the specific file extensions to distinguish between authorized and suspicious actions.
  ### Investigation Steps
  - Review EDR alerts for any instances of `dns.exe` deletions, paying special attention to the timeframe and context around the event.
  - Examine Windows security event logs to trace the sequence of actions leading to the file deletion, including related process executions and command line parameters.
  - Cross-reference the user account associated with `dns.exe` activity against established user behavior baselines to identify any deviations indicative of compromise.
  - Investigate any network connections initiated by `dns.exe` during the same period to determine if there is any correlation with potential remote code execution or other suspicious activities.
