title: IIS WebServer Access Logs Deleted
id: 3eb8c339-a765-48cc-a150-4364c04652bf
status: test
description: Detects the deletion of IIS WebServer access logs which may indicate
  an attempt to destroy forensic evidence
references:
- https://www.elastic.co/guide/en/security/current/webserver-access-logs-deleted.html
author: Tim Rauch (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)
date: 2022-09-16
modified: 2023-02-15
tags:
- attack.defense-evasion
- attack.t1070
logsource:
  category: file_delete
  product: windows
detection:
  selection:
    TargetFilename|contains: '\inetpub\logs\LogFiles\'
    TargetFilename|endswith: '.log'
  condition: selection
falsepositives:
- During uninstallation of the IIS service
- During log rotation
level: medium
notes: |
  ### Technical Context
  This Sigma rule aims to identify the unauthorized deletion of Internet Information Services (IIS) web server access logs, which is often a tactic employed by threat actors to eliminate forensic evidence following malicious activities. The rule specifically scans for file deletion events targeting the log files located within the `C:\inetpub\logs\LogFiles\` directory, focusing on log files that have a `.log` extension. The primary data source involved in this detection is the file deletion logs generated by the Windows operating system, allowing the detection engine to catch any attempts to erase these crucial logs. By flagging these deletions, security operations can investigate possible malicious intent behind the action, thereby enhancing forensic capacity and response preparedness.
  ### Investigation Steps
  - Review file deletion logs in your EDR tool to identify the user accounts and processes involved in the log deletion activity.
  - Cross-reference the timestamps of the log deletions with other system events to determine if there were any associated unauthorized activities, such as unexpected service changes or failed login attempts.
  - Check the IIS logs prior to deletion using backup or alternate storage solutions to assess what data might have been compromised or obscured.
  - Investigate the system for any signs of lateral movement or persistence mechanisms that may be associated with the detected file deletion, referencing network traffic logs if applicable.
