title: File Was Not Allowed To Run
id: 401e5d00-b944-11ea-8f9a-00163ecd60ae
status: test
description: Detect run not allowed files. Applocker is a very useful tool, especially
  on servers where unprivileged users have access. For example terminal servers. You
  need configure applocker and log collect to receive these events.
references:
- https://learn.microsoft.com/en-us/windows/security/application-security/application-control/windows-defender-application-control/applocker/what-is-applocker
- https://learn.microsoft.com/en-us/windows/security/application-security/application-control/windows-defender-application-control/applocker/using-event-viewer-with-applocker
- https://nxlog.co/documentation/nxlog-user-guide/applocker.html
author: Pushkarev Dmitry
date: 2020-06-28
modified: 2021-11-27
tags:
- attack.execution
- attack.t1204.002
- attack.t1059.001
- attack.t1059.003
- attack.t1059.005
- attack.t1059.006
- attack.t1059.007
logsource:
  product: windows
  service: applocker
detection:
  selection:
    EventID:
    - 8004
    - 8007
    - 8022
    - 8025
  condition: selection
fields:
- PolicyName
- RuleId
- RuleName
- TargetUser
- TargetProcessId
- FilePath
- FileHash
- Fqbn
falsepositives:
- Need tuning applocker or add exceptions in SIEM
level: medium
notes: |
  ### Technical Context
  The "File Was Not Allowed To Run" Sigma rule is designed to detect attempts to execute files that have been blocked by Windows AppLocker, a security feature that controls which apps and files users can run. When a user attempts to run a file that isn't permitted by the configured policies, AppLocker generates specific event logs—identified by Event IDs 8004, 8007, 8022, and 8025. This rule captures those entries, which include details such as the policy name, rule ID, user information, and the file path, helping to identify unauthorized or potentially malicious activity on Windows systems, particularly where users may have unprivileged access, like terminal servers.
  This detection relies on AppLocker event logs, which can be collected through various log collection mechanisms. Analysts can leverage these logs to assess executable file execution, ensuring compliance with security policies and helping to identify attempts at unauthorized execution of applications.
  ### Investigation Steps
  - Review AppLocker event logs for the specified Event IDs to identify which files were attempted to be executed and by whom.
  - Utilize endpoint detection and response (EDR) tools to trace the activity of the user associated with the event to determine the context of the file execution attempt.
  - Check if there are any configured AppLocker policies and their respective rules to see if legitimate business needs might necessitate an exception for the flagged file.
  - Investigate the file path and hashes of the blocked files against threat intelligence sources to establish if the files are known malware or otherwise suspect.
