title: Suspicious Service Installation
id: 1d61f71d-59d2-479e-9562-4ff5f4ead16b
related:
- id: ca83e9f3-657a-45d0-88d6-c1ac280caf53
  type: obsolete
- id: 26481afe-db26-4228-b264-25a29fe6efc7
  type: similar
status: test
description: Detects suspicious service installation commands
references:
- Internal Research
author: pH-T (Nextron Systems), Florian Roth (Nextron Systems)
date: 2022-03-18
modified: 2023-12-04
tags:
- attack.persistence
- attack.privilege-escalation
- car.2013-09-005
- attack.t1543.003
logsource:
  product: windows
  service: system
detection:
  selection:
    Provider_Name: 'Service Control Manager'
    EventID: 7045
    ImagePath|contains:
    - ' -nop '
    - ' -sta '
    - ' -w hidden '
    - ':\Temp\'
    - '.downloadfile('         # PowerShell download command
    - '.downloadstring('         # PowerShell download command
    - '\ADMIN$\'
    - '\Perflogs\'
    - '&&'
  condition: selection
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  The "Suspicious Service Installation" rule is designed to detect unusual service installation commands on Windows systems, particularly those that may indicate malicious activity. This detection focuses on events generated by the Service Control Manager (SCM) with Event ID 7045, which logs information about newly created services. The rule looks for specific suspicious keywords in the `ImagePath` of the service, such as command line arguments often associated with PowerShell commands used for malicious purposes (e.g., `-nop`, `-sta`, `-w hidden`). By monitoring these indicators, the rule aims to identify potential persistence mechanisms employed by threat actors, which can facilitate unauthorized access and privilege escalation.
  To effectively implement this rule, appropriate logs must be collected from the Windows Event Log, ensuring visibility into service installations. Investigators should also be aware that legitimate applications may sometimes trigger these events, so it's essential to evaluate context and corroborate findings with other data sources.
  ### Investigation Steps
  - Query the EDR for any recent service installations, specifically focusing on processes that match the suspicious indicators outlined in the rule.
  - Review relevant Event ID 7045 logs for the timestamps associated with the alert to gain insight into the service's attributes and its creation context.
  - Examine the associated command-line parameters in the process tree to determine how the service was initiated and to evaluate its legitimacy.
  - Cross-reference against proxy logs to identify any outbound or suspicious connections made by the newly installed service, which may suggest further malicious activity.
