title: PAExec Service Installation
id: de7ce410-b3fb-4e8a-b38c-3b999e2c3420
status: test
description: Detects PAExec service installation
references:
- https://www.poweradmin.com/paexec/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-10-26
tags:
- attack.execution
- attack.t1569.002
logsource:
  product: windows
  service: system
detection:
  selection_eid:
    Provider_Name: 'Service Control Manager'
    EventID: 7045
  selection_image:
  - ServiceName|startswith: 'PAExec-'
  - ImagePath|startswith: 'C:\WINDOWS\PAExec-'
  condition: all of selection_*
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  The "PAExec Service Installation" rule is designed to detect the installation of the PAExec service on Windows systems. PAExec is a tool that allows remote execution of processes on Windows operating systems, often used by system administrators but also exploited by attackers for lateral movement within a network. The rule monitors Windows Event Logs generated by the Service Control Manager (SCM), specifically looking for Event ID 7045, which indicates a service installation event. The rule's detection logic focuses on identifying service names and image paths that start with "PAExec-", signaling a potential unauthorized installation or abuse of this tool.
  By leveraging Windows system logs, this detection is relevant for threat hunting and incident response teams observing anomalous administrative activities or unauthorized access. Investigating these alerts can unveil misuse or compromise of legitimate administrative tools, enabling a swift response to potential threats.
  ### Investigation Steps
  - Review the identified service installation in Windows Event Logs to confirm the presence of the PAExec service, paying attention to associated timestamps and user accounts.
  - Use EDR (Endpoint Detection and Response) tools to analyze related process creation events following the installation, looking for any suspicious command-line arguments or unexpected behavior.
  - Check firewall and network logs for any outbound connections or unusual traffic patterns initiated by the PAExec service, as this could indicate lateral movement attempts.
  - Investigate user account activity around the time of the installation to ensure that no unauthorized users were involved or that no credential tampering occurred.
