title: CSExec Service Installation
id: a27e5fa9-c35e-4e3d-b7e0-1ce2af66ad12
status: test
description: Detects CSExec service installation and execution events
references:
- https://github.com/malcomvetter/CSExec
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023-08-07
tags:
- attack.execution
- attack.t1569.002
logsource:
  product: windows
  service: system
detection:
  selection_eid:
    Provider_Name: 'Service Control Manager'
    EventID: 7045
  selection_service:
  - ServiceName: 'csexecsvc'
  - ImagePath|endswith: '\csexecsvc.exe'
  condition: all of selection_*
falsepositives:
- Unknown
level: medium

notes: |
  ### Technical Context
  The CSExec Service Installation rule detects unauthorized installations and executions of the CSExec service on Windows systems by monitoring event logs generated by the Service Control Manager. Specifically, it looks for Event ID 7045, which indicates the installation of a new service. The detection mechanism focuses on identifying instances where the service name is 'csexecsvc' or the associated executable path ends with 'csexecsvc.exe'. This behavior is particularly relevant as the CSExec tool can be utilized for executing arbitrary commands on remote systems, which poses security risks if leveraged by malicious actors. By analyzing system logs, defenders can effectively identify potential misuse of this service and initiate appropriate responses.
  ### Investigation Steps
  - Review EDR logs for any process execution involving 'csexecsvc.exe' and correlate with timestamps of the service installation event.
  - Check for any recent changes in service configurations through the Service Control Manager logs to ascertain if there was unauthorized modification.
  - Investigate network activity using NDR and Proxy logs for any suspicious connections originating from the host running the CSExec service, focusing on unexpected external destinations.
  - Assess user activity logs in the environment to determine if there are unusual logins or privilege escalations that might correlate with the CSExec service installation.
