title: NetSupport Manager Service Install
id: 2d510d8d-912b-45c5-b1df-36faa3d8c3f4
status: test
description: Detects NetSupport Manager service installation on the target system.
references:
- http://resources.netsupportsoftware.com/resources/manualpdfs/nsm_manual_uk.pdf
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-10-31
tags:
- attack.persistence
logsource:
  product: windows
  service: system
detection:
    # Example:
    #   <EventData>
    #       <Data Name="ServiceName">Client32</Data>
    #       <Data Name="ImagePath">"C:\Program Files (x86)\NetSupport\NetSupport Manager\client32.exe" /* *</Data>
    #       <Data Name="ServiceType">user mode service</Data>
    #       <Data Name="StartType">auto start</Data>
    #       <Data Name="AccountName">LocalSystem</Data>
    #   </EventData>
  selection_root:
    Provider_Name: 'Service Control Manager'
    EventID: 7045
  selection_service:
  - ImagePath|contains: '\NetSupport Manager\client32.exe'
  - ServiceName: 'Client32'
  condition: all of selection_*
falsepositives:
- Legitimate use of the tool
level: medium
notes: |
  ### Technical Context
  This detection rule is designed to identify the installation of the NetSupport Manager service on Windows systems, which is commonly exploited for remote management and may be indicative of unauthorized use or persistence mechanisms by threat actors. The rule captures specific event logs, particularly Event ID 7045 from the Service Control Manager, that detail the creation of new services on a system. It specifically looks for entries where the service name is "Client32" and the image path contains "NetSupport Manager," indicating a potential unauthorized installation of this remote management tool.
  By analyzing these event logs, the rule can help detect instances where the NetSupport Manager is installed, which, while legitimate in some contexts, may also signal malicious activity. Incident responders should be aware of normal environments and legitimate uses for this tool to minimize false positives during investigations.
  ### Investigation Steps
  - Query the EDR for detailed information on the service installation, focusing on the event logs surrounding the time of the alert to capture any preceding activities or anomalies.
  - Review process creation logs related to the service to identify any associated processes or command-line arguments that could indicate malicious intent or unauthorized access.
  - Check network logs from the NDR or firewall to identify any unusual connections initiated by the NetSupport Manager during the time of installation, which could reveal further context or intrusion attempts.
  - Analyze user activity logs to determine whether the account that initiated the installation had legitimate access rights and whether this aligns with normal operational behavior.
