title: Windows Defender Threat Detection Service Disabled
id: 6c0a7755-6d31-44fa-80e1-133e57752680
related:
- id: fe34868f-6e0e-4882-81f6-c43aa8f15b62
  type: derived
status: stable
description: Detects when the "Windows Defender Threat Protection" service is disabled.
references:
- https://learn.microsoft.com/en-us/defender-endpoint/troubleshoot-microsoft-defender-antivirus
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.001/T1562.001.md
author: Ján Trenčanský, frack113
date: 2020-07-28
modified: 2024-07-02
tags:
- attack.defense-evasion
- attack.t1562.001
logsource:
  product: windows
  service: system
detection:
  selection:
    EventID: 7036
    Provider_Name: 'Service Control Manager'
        # Note: The service name and messages are localized
    param1:
    - 'Windows Defender Antivirus Service'
    - 'Service antivirus Microsoft Defender'         # French OS
    param2:
    - 'stopped'
    - 'arrêté'         # French OS
  condition: selection
falsepositives:
- Administrator actions
- Auto updates of Windows Defender causes restarts
level: medium
notes: |
  ### Technical Context
  This Sigma rule is designed to detect when the "Windows Defender Threat Protection" service is disabled on Windows systems. It specifically monitors the Windows Event Log for events generated by the Service Control Manager (SCM), looking for Event ID 7036, which indicates a change in service status. The rule checks for messages indicating that the Windows Defender Antivirus Service has been stopped, exclusive to both English and French localization. This detection is important as the disabling of Windows Defender can signify a potential security risk, particularly if executed without legitimate intent, and could be related to evasion tactics used by malware to avoid detection.
  The data sources involved primarily include the system logs where service status changes are recorded. By analyzing these logs, the SOC can identify potentially malicious activity, especially in environments where endpoint protection is crucial for maintaining overall cybersecurity.
  ### Investigation Steps
  - Review the relevant logs from the EDR solution to confirm the disabling of the Windows Defender Threat Protection service and check for any related suspicious activity around the same time frame.
  - Analyze historical data from the SIEM to determine if there were prior adjustments to antivirus settings or unusual patterns of service status changes that could indicate persistent threats.
  - Correlate the event with other related logs, such as firewall or VPN logs, to assess if there are connections to potentially compromised systems or unauthorized access attempts.
  - Reach out to affected systems' administrators to discern whether the service was disabled as part of legitimate maintenance or if additional follow-ups are needed for suspicious activity.
