title: New PDQDeploy Service - Client Side
id: b98a10af-1e1e-44a7-bab2-4cc026917648
status: test
description: |
  Detects PDQDeploy service installation on the target system.
  When a package is deployed via PDQDeploy it installs a remote service on the target machine with the name "PDQDeployRunner-X" where "X" is an integer starting from 1
references:
- https://documentation.pdq.com/PDQDeploy/13.0.3.0/index.html?windows-services.htm
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-07-22
tags:
- attack.privilege-escalation
- attack.t1543.003
logsource:
  product: windows
  service: system
detection:
  selection_root:
    Provider_Name: 'Service Control Manager'
    EventID: 7045
  selection_service:
  - ImagePath|contains: 'PDQDeployRunner-'
  - ServiceName|startswith: 'PDQDeployRunner-'
  condition: all of selection_*
falsepositives:
- Legitimate use of the tool
level: medium
notes: |
  ### Technical Context
  This detection rule monitors Windows systems for the installation of services associated with PDQDeploy, a software deployment tool commonly used in enterprise environments. Specifically, it looks for the creation of services with names that follow the format "PDQDeployRunner-X," where "X" is an integer starting from 1. The key event being tracked is Event ID 7045, which is generated by the Service Control Manager whenever a new service is installed. By capturing the ImagePath and ServiceName of these services, the rule helps identify potentially unauthorized deployments, which could indicate misuse of the tool for privilege escalation or other malicious activities.
  The relevant data sources for this detection include Windows event logs, specifically focusing on service installation events. Incident responders should be aware that legitimate use of PDQDeploy may generate similar log entries, necessitating careful investigation to differentiate between authorized and rogue installations.
  ### Investigation Steps
  - Review the EDR logs to identify the context of the service installation, including the user and process that initiated it. This can help determine whether the action was legitimate or potentially malicious.
  - Investigate the command-line parameters associated with any installations of PDQDeploy to look for unusual or unauthorized activities. Any discrepancies may warrant further scrutiny.
  - Cross-reference the timestamp of the service creation with user activity logs available in the SIEM to identify any suspicious user behavior leading up to the event.
  - Check for network activity through the NGFW or Proxy logs that could indicate communication to external, unauthorized servers following the installation of the PDQDeploy service. This can reveal potential data exfiltration or command and control communication.
