title: Tap Driver Installation
id: 8e4cf0e5-aa5d-4dc3-beff-dc26917744a9
status: test
description: Well-known TAP software installation. Possible preparation for data exfiltration
  using tunnelling techniques
references:
- https://community.openvpn.net/openvpn/wiki/ManagingWindowsTAPDrivers
author: Daniil Yugoslavskiy, Ian Davis, oscd.community
date: 2019-10-24
modified: 2022-12-25
tags:
- attack.exfiltration
- attack.t1048
logsource:
  product: windows
  service: system
detection:
  selection:
    Provider_Name: 'Service Control Manager'
    EventID: 7045
    ImagePath|contains: 'tap0901'
  condition: selection
falsepositives:
- Legitimate OpenVPN TAP installation
level: medium
notes: |
  ### Technical Context
  This detection rule identifies the installation of TAP drivers, specifically those associated with OpenVPN, which are known to facilitate tunneling and potential data exfiltration activities. The rule focuses on Windows Event ID 7045, which logs the addition of a new service, particularly monitoring entries where the provider is the Service Control Manager and the ImagePath indicates the presence of 'tap0901'. By capturing this event, the rule serves to alert incident responders to any unapproved or potentially malicious installations of tunneling software that could be indicative of nefarious activities attempting to bypass corporate security measures.
  The primary data sources leveraged in this detection include Windows system logs that record service management events. The focus on the 'tap0901' component allows for the tracking of specific driver installations known to create virtual network interfaces used in VPN solutions, raising concerns about unauthorized data access or exfiltration.
  ### Investigation Steps
  - Verify the context of the TAP driver installation by checking the source and purpose of the installation through the Event Log on the affected system, ensuring it aligns with organizational policies on software deployments. 
  - Utilize EDR tools to review the process tree and associated activities around the time of the installation to determine if there are any signs of malicious behavior or unauthorized access.
  - Examine network logs from the NGFW and NDR to identify unusual outbound traffic patterns that might suggest data exfiltration attempts following the TAP driver installation.
  - Investigate user activity logs and access patterns to establish whether legitimate users initiated the installation or if it was performed under suspicious circumstances, potentially by an unauthorized entity.
