title: Remote Access Tool Services Have Been Installed - System
id: 1a31b18a-f00c-4061-9900-f735b96c99fc
related:
- id: c8b00925-926c-47e3-beea-298fd563728e
  type: similar
status: test
description: Detects service installation of different remote access tools software.
  These software are often abused by threat actors to perform
references:
- https://redcanary.com/blog/misbehaving-rats/
author: Connor Martin, Nasreddine Bencherchali
date: 2022-12-23
modified: 2023-06-22
tags:
- attack.persistence
- attack.t1543.003
- attack.t1569.002
logsource:
  product: windows
  service: system
detection:
  selection:
    Provider_Name: 'Service Control Manager'
    EventID:
    - 7045
    - 7036
    ServiceName|contains:
            # Based on https://github.com/SigmaHQ/sigma/pull/2841
    - 'AmmyyAdmin'         # https://www.ammyy.com/en/
    - 'Atera'
    - 'BASupportExpressSrvcUpdater'         # https://www.systemlookup.com/O23/6837-BASupSrvcUpdater_exe.html
    - 'BASupportExpressStandaloneService'         # https://www.systemlookup.com/O23/6839-BASupSrvc_exe.html
    - 'chromoting'
    - 'GoToAssist'         # https://www.goto.com/it-management/resolve
    - 'GoToMyPC'         # https://get.gotomypc.com/
    - 'jumpcloud'
    - 'LMIGuardianSvc'         # https://www.logmein.com/
    - 'LogMeIn'         # https://www.logmein.com/
    - 'monblanking'
    - 'Parsec'
    - 'RManService'         # https://www.systemlookup.com/O23/7855-rutserv_exe.html
    - 'RPCPerformanceService'         # https://www.remotepc.com/
    - 'RPCService'         # https://www.remotepc.com/
    - 'SplashtopRemoteService'         # https://www.splashtop.com/
    - 'SSUService'
    - 'TeamViewer'
    - 'TightVNC'         # https://www.tightvnc.com/
    - 'vncserver'
    - 'Zoho'
  condition: selection
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  This detection rule identifies the installation of specific Remote Access Tools (RATs) on Windows systems, as logged by the Service Control Manager. It monitors for Event IDs 7045 and 7036, which indicate changes to system services, and looks for the presence of well-known RAT service names such as 'TeamViewer', 'LogMeIn', and 'GoToAssist'. By focusing on these service names, the rule captures potential malicious activity, as threat actors frequently utilize these tools to gain unauthorized access to systems. The logs generated by the Service Control Manager serve as the primary data source for this rule, enabling detection of atypical installations of remote access software, which could signify a security breach.
  ### Investigation Steps
  - Query EDR logs to identify any recent installations or modifications of the services flagged by the rule, checking for the associated user accounts and processes responsible for these changes.
  - Review the firewall logs in NGFW to see if the connections from the identified services were initiated to any suspicious external IP addresses.
  - Check Proxy logs to determine if there was any unusual web traffic or attempts to access download sites associated with these remote access tools, which might indicate attempted exploitation.
  - Examine system and application logs in the cloud environment (AWS, GCP, or Azure) for alerts or anomalies around the same timeframe as the detected installations to establish any correlation with cloud resources.
