title: RemCom Service Installation
id: 9e36ed87-4986-482e-8e3b-5c23ffff11bf
status: test
description: Detects RemCom service installation and execution events
references:
- https://github.com/kavika13/RemCom/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023-08-07
tags:
- attack.execution
- attack.t1569.002
logsource:
  product: windows
  service: system
detection:
  selection_eid:
    Provider_Name: 'Service Control Manager'
    EventID: 7045
  selection_service:
  - ServiceName: 'RemComSvc'
  - ImagePath|endswith: '\RemComSvc.exe'
  condition: all of selection_*
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  The "RemCom Service Installation" detection rule is designed to identify unauthorized installations and execution attempts of the RemCom service, which is often used for remote command execution on Windows systems. This rule specifically monitors Windows Event Log entries generated by the Service Control Manager (SCM), focusing on Event ID 7045, which records when a new service is installed. It looks for specific attributes such as the service name, 'RemComSvc', and the associated executable path, ensuring that any instances of the RemCom service being added are flagged for further investigation. By leveraging these logs, the rule enables security teams to detect potential misuse of this service that could indicate nefarious activity, such as establishing a persistent backdoor on a compromised system.
  ### Investigation Steps
  - Review the relevant Windows Event Logs in your EDR tool to verify if Event ID 7045 was triggered, noting the specific timestamp and source machine.
  - Investigate the service details within the system using the command line or EDR console to check if the RemCom service is running or was recently installed, along with its configuration settings.
  - Cross-reference the installation timestamp with other logs from your SIEM, such as process creation logs, to see if there were any unusual access patterns or known malicious IP interactions around that time.
  - If necessary, check network behavior with your NDR tools to identify any outbound connections initiated by the system after the RemCom service was installed, as this may indicate unauthorized remote access attempts.
