title: Anydesk Remote Access Software Service Installation
id: 530a6faa-ff3d-4022-b315-50828e77eef5
status: test
description: Detects the installation of the anydesk software service. Which could
  be an indication of anydesk abuse if you the software isn't already used.
references:
- https://thedfirreport.com/2022/08/08/bumblebee-roasts-its-way-to-domain-admin/
- https://thedfirreport.com/2025/02/24/confluence-exploit-leads-to-lockbit-ransomware/
author: Nasreddine Bencherchali (Nextron Systems), Swachchhanda Shrawan Poudel (Nextron
  Systems)
date: 2022-08-11
modified: 2025-02-24
tags:
- attack.persistence
logsource:
  product: windows
  service: system
detection:
  selection_provider:
    Provider_Name: 'Service Control Manager'
    EventID: 7045
  selection_service:
  - ServiceName|contains|all:
    - 'AnyDesk'           # Covers both AnyDesk Service and AnyDesk MSI Service
    - 'Service'
  - ImagePath|contains: 'AnyDesk'
  condition: all of selection_*
falsepositives:
- Legitimate usage of the anydesk tool
level: medium
notes: |
  ### Technical Context
  This Sigma rule is designed to detect the installation of AnyDesk Remote Access Software, an application that allows remote control of computers. The rule focuses on monitoring the Windows Service Control Manager for Event ID 7045, which indicates that a new service has been installed. By examining the `ServiceName` and `ImagePath`, the rule identifies services related to AnyDesk. This detection method is critical because unauthorized installations of remote access tools can signify potential malicious activity, especially in environments where such tools are not approved or monitored. The primary data sources utilized include system event logs, particularly those related to service installations, enabling the identification of unexpected or unauthorized changes in the system's service configuration.
  ### Investigation Steps
  - Check the EDR tool for any associated process creation and termination logs for AnyDesk during the timeframe around the service installation. This will help determine if the software was actively used for remote access.
  - Review the logs from the enterprise VPN to see if there were any unusual connections to external IP addresses corresponding to the installation events. This could indicate unauthorized remote access attempts.
  - Cross-reference the Service Control Manager events with deployment logs from the software inventory management system. Confirm if the AnyDesk installation was sanctioned, or if it was indeed unauthorized.
  - Utilize the AV and endpoint detection tool to scan for any additional related anomalies or unauthorized applications that might have been installed alongside AnyDesk. This will assist in understanding the broader scope of potential security threats.
