title: Remote Utilities Host Service Install
id: 85cce894-dd8b-4427-a958-5cc47a4dc9b9
status: test
description: Detects Remote Utilities Host service installation on the target system.
references:
- https://www.remoteutilities.com/support/kb/host-service-won-t-start/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-10-31
tags:
- attack.persistence
logsource:
  product: windows
  service: system
detection:
    # Example:
    #   <EventData>
    #       <Data Name="ServiceName">Remote Utilities - Host</Data>
    #       <Data Name="ImagePath">"C:\Program Files (x86)\Remote Utilities - Host\rutserv.exe" -service</Data>
    #       <Data Name="ServiceType">user mode service</Data>
    #       <Data Name="StartType">auto start</Data>
    #       <Data Name="AccountName">LocalSystem</Data>
    #   </EventData>
  selection_root:
    Provider_Name: 'Service Control Manager'
    EventID: 7045
  selection_service:
  - ImagePath|contains|all:
    - '\rutserv.exe'
    - '-service'
  - ServiceName: 'Remote Utilities - Host'
  condition: all of selection_*
falsepositives:
- Legitimate use of the tool
level: medium
notes: |
  ### Technical Context
  The Sigma rule titled "Remote Utilities Host Service Install" aims to detect the installation of the Remote Utilities Host service on Windows systems. It does this by monitoring events from the Service Control Manager (SCM) that indicate a service installation, specifically looking for Event ID 7045. The rule checks for specific characteristics of the installed service, such as the service name "Remote Utilities 
  - Host" and the presence of the executable path "C:\Program Files (x86)\Remote Utilities 
  - Host\rutserv.exe" along with the command-line parameter "-service." Given the potential use of this software in unauthorized remote access, this detection rule assists incident responders in identifying anomalies that may signify suspicious or malicious activity.
  The primary data sources involved include system event logs, particularly those related to service changes and installations. The focus on command-line arguments and specific service attributes enables this rule to discern legitimate installations from potentially harmful ones, aiding in the overall security posture of the organization.
  ### Investigation Steps
  - **Review the EDR logs** for any recent service installation events, particularly focusing on those that reference "Remote Utilities 
  - Host" and the associated executable path.
  - **Cross-check the time of the event** with other security logs (such as VPN or Proxy) to determine if there were any unusual external connections or computer access attempts around the same time.
  - **Inspect the corresponding process details** using your EDR or process monitoring tools to verify whether the `rutserv.exe` file is running and what command-line arguments it is launched with.
  - **Conduct a threat intelligence lookup** to understand the reputation of the IP addresses or domains accessed by the related processes, which may aid in identifying malicious behavior associated with this service installation.
