title: Sliver C2 Default Service Installation
id: 31c51af6-e7aa-4da7-84d4-8f32cc580af2
status: test
description: Detects known malicious service installation that appear in cases in
  which a Sliver implants execute the PsExec commands
references:
- https://github.com/BishopFox/sliver/blob/79f2d48fcdfc2bee4713b78d431ea4b27f733f30/client/command/commands.go#L1231
- https://www.microsoft.com/security/blog/2022/08/24/looking-for-the-sliver-lining-hunting-for-emerging-command-and-control-frameworks/
author: Florian Roth (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)
date: 2022-08-25
tags:
- attack.execution
- attack.privilege-escalation
- attack.t1543.003
- attack.t1569.002
logsource:
  product: windows
  service: system
detection:
  selection_eid:
    Provider_Name: 'Service Control Manager'
    EventID: 7045
  selection_service_1:
    ImagePath|re: '^[a-zA-Z]:\\windows\\temp\\[a-zA-Z0-9]{10}\.exe'
  selection_service_2:
    ServiceName:
    - 'Sliver'
    - 'Sliver implant'
  condition: selection_eid and 1 of selection_service_*
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This detection rule focuses on identifying the installation of malicious services associated with the Sliver Command and Control (C2) framework, particularly through the use of PsExec commands. The rule triggers on Windows service creation events, specifically looking for event ID 7045, which indicates that a new service was added. It employs regular expression matching to identify executable files in the Windows Temp directory, pointing to potential malware. The specific service names being monitored for this rule include “Sliver” and “Sliver implant,” which are known identifiers used by Sliver implants. When these criteria are met, the alert is generated, enabling SOC analysts to investigate further.
  ### Investigation Steps
  - Review the Service Control Manager logs for event ID 7045 to identify the details of the service that was created, including its ImagePath and ServiceName.
  - Utilize the Endpoint Detection and Response (EDR) tool to trace the file’s origin, behavior, and any associated processes, particularly those that executed PsExec commands.
  - Examine the Windows Temp directory for any suspicious executable files that match the naming convention of the detected service, and check for signs of lateral movement or privilege escalation in the system.
  - Correlate findings with firewall and network logs to see if there were any outbound connections made by the detected service that indicate communication with a remote command and control server.
