title: TacticalRMM Service Installation
id: 4bb79b62-ef12-4861-981d-2aab43fab642
status: test
description: Detects a TacticalRMM service installation. Tactical RMM is a remote
  monitoring & management tool.
references:
- https://thedfirreport.com/2022/11/28/emotet-strikes-again-lnk-file-leads-to-domain-wide-ransomware/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-11-28
tags:
- attack.command-and-control
- attack.t1219
logsource:
  product: windows
  service: system
detection:
  selection_root:
    Provider_Name: 'Service Control Manager'
    EventID: 7045
  selection_service:
  - ImagePath|contains: 'tacticalrmm.exe'
  - ServiceName|contains: 'TacticalRMM Agent Service'
  condition: all of selection_*
falsepositives:
- Legitimate use of the tool
level: medium
notes: |
  ### Technical Context
  This Sigma rule is designed to detect the installation of a TacticalRMM service, a remote monitoring and management tool used primarily in IT environments. It focuses on system logs generated by the Windows Service Control Manager (SCM) and specifically looks for Event ID 7045, which indicates that a new service has been created. The rule filters for instances where the service's executable path contains "tacticalrmm.exe" and the service name includes "TacticalRMM Agent Service". Such installations can suggest a potential compromise, as the tool may be leveraged by attackers for command and control or other malicious activities within a network. 
  ### Investigation Steps
  - Review EDR logs for any unusual process behavior surrounding the installation time, especially those related to "tacticalrmm.exe".
  - Check the system's Service Control Manager logs for additional context regarding the creation of the service, looking for any correlated or unusual activities.
  - Investigate user activity logs from relevant systems to identify any unauthorized access or installation of the TacticalRMM tool.
  - Analyze network traffic logs to determine if the TacticalRMM service is communicating with known malicious IP addresses or domains.
