title: Important Windows Service Terminated With Error
id: d6b5520d-3934-48b4-928c-2aa3f92d6963
related:
- id: acfa2210-0d71-4eeb-b477-afab494d596c
  type: similar
status: test
description: Detects important or interesting Windows services that got terminated
  for whatever reason
references:
- https://www.microsoft.com/en-us/security/blog/2023/04/11/guidance-for-investigating-attacks-using-cve-2022-21894-the-blacklotus-campaign/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023-04-14
tags:
- attack.defense-evasion
logsource:
  product: windows
  service: system
detection:
  selection_eid:
    Provider_Name: 'Service Control Manager'
    EventID: 7023     # The X Service service terminated with the following error
  selection_name:
  - param1|contains:
              # Note that these names are "Display Names" and are language specific. If you're using a non-english system these can and will be different
    - ' Antivirus'
    - ' Firewall'
    - 'Application Guard'
    - 'BitLocker Drive Encryption Service'
    - 'Encrypting File System'
    - 'Microsoft Defender'
    - 'Threat Protection'
    - 'Windows Event Log'
        # Use this If you collect the binary value provided from this event, which is the wide hex encoded value of the service name.
  - Binary|contains:
    - '770069006e0064006500660065006e006400'           # windefend (Microsoft Defender Antivirus Service)
    - '4500760065006e0074004c006f006700'           # EventLog
    - '6d0070007300730076006300'           # mpssvc (Windows Defender Firewall)
    - '530065006e0073006500'           # Sense (Windows Defender Advanced Threat Protection Service)
    - '450046005300'           # EFS (Encrypting File System)
    - '420044004500530056004300'           # BDESVC (BitLocker Drive Encryption Service)
  condition: all of selection_*
falsepositives:
- Rare false positives could occur since service termination could happen due to multiple
  reasons
level: high
notes: |
  ### Technical Context
  This Sigma rule is designed to detect the abrupt termination of critical Windows services, particularly those related to security and data protection, such as Antivirus, Firewall, and BitLocker services. It leverages Windows Security Event logs, specifically Event ID 7023, generated by the Service Control Manager. The rule expedites the identification of potentially malicious activity; for instance, if an attacker disables a security service to facilitate an intrusion or covered their tracks by stopping logging services. This aligns with the MITRE ATT&CK framework's Defense Evasion tactic, focusing on techniques where adversaries circumvent detection mechanisms.
  The primary data sources utilized in this rule include Windows Event Logs that capture details about the service termination events. The rule is configured to identify events documented with specific display names or binary values associated to services that are critical for the security posture of the enterprise environment. When these services are terminated unexpectedly, it could indicate potential malicious activities or system misconfigurations requiring immediate investigation.
  ### Investigation Steps
  - **Check Event Details:** Review the relevant Event ID 7023 logs in Windows Security to determine the specific service that terminated and the associated error message for context on the termination reason.
  - **Analyze Service Dependencies:** Inspect if the terminated services had dependencies that may have impacted other critical services or applications, using the Service Management Console or PowerShell.
  - **Correlate with Other Alerts:** Cross-reference the termination event with other security alerts on the EDR solution, as multiple anomalies occurring concurrently may indicate a coordinated attack.
  - **Conduct Threat Intelligence Search:** Utilize threat intelligence repositories or the SOC's context database to check for any known adversaries or tools that have previously exploited similar service terminations.
  ### Prioritization
  The alert is categorized as high severity due to the critical nature of the terminated services, which can directly impact the organization's security and operational integrity. Immediate attention is warranted to discern whether these service terminations are benign or indicative of a potential security incident. 
  ### Blind spots and Assumptions
  There are potential blind spots where this rule may not detect all malicious activity; for instance, an attacker could disable the system logs or perform service termination under a legitimate context, thereby avoiding detection. Additionally, environments configured with non-English Windows systems may trigger false negatives due to varied service display names. Engineers must recognize that service termination can frequently occur due to routine maintenance, policy changes, or unexpected system issues, which may lead to a misinterpretation of legitimate operational actions versus a security threat.
  > **Disclaimer:** This investigation guide was created using generative AI technology and has not been reviewed for its accuracy and relevance. While every effort has been made to ensure its quality, we recommend validating the content and adapting it to suit specific environment and operational needs. Please communicate any changes to the detection engineering team.
