title: RTCore Suspicious Service Installation
id: 91c49341-e2ef-40c0-ac45-49ec5c3fe26c
status: test
description: Detects the installation of RTCore service. Which could be an indication
  of Micro-Star MSI Afterburner vulnerable driver abuse
references:
- https://github.com/br-sn/CheekyBlinder/blob/e1764a8a0e7cda8a3716aefa35799f560686e01c/CheekyBlinder/CheekyBlinder.cpp
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-08-30
tags:
- attack.persistence
logsource:
  product: windows
  service: system
detection:
  selection:
    Provider_Name: 'Service Control Manager'
    EventID: 7045
    ServiceName: 'RTCore64'
  condition: selection
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  The "RTCore Suspicious Service Installation" detection rule identifies the installation of a specific Windows service associated with the RTCore64 service name, which is linked to the MSI Afterburner application. This detection utilizes event logs generated by the Windows Service Control Manager (SCM), specifically looking for Event ID 7045. The presence of this service may indicate potential exploitation through the abuse of vulnerable drivers that can manipulate system settings or escalate privileges. The rule primarily evaluates the process of service installation and can provide a signal indicating whether a malicious actor is attempting to leverage known vulnerabilities related to MSI Afterburner.
  ### Investigation Steps
  - Review the EDR logs to identify any recent installations or changes to the RTCore64 service. Check for abnormal file timestamps that may indicate suspicious activity.
  - Query system logs using the SIEM to track the history of service installations associated with Event ID 7045. Look for anomalies or patterns linking back to user accounts that should not have made those changes.
  - Analyze network traffic through the NDR system for any outbound connections made shortly after the service installation. This can provide context on whether the service is being used for malicious activity.
  - Investigate any corresponding incidents or alerts logged by the Antivirus (AV) solution to ensure that no associated malware signatures or indicators of compromise have been detected.
