title: Meterpreter or Cobalt Strike Getsystem Service Installation - System
id: 843544a7-56e0-4dcc-a44f-5cc266dd97d6
status: test
description: Detects the use of getsystem Meterpreter/Cobalt Strike command by detecting
  a specific service installation
references:
- https://speakerdeck.com/heirhabarov/hunting-for-privilege-escalation-in-windows-environment
- https://blog.cobaltstrike.com/2014/04/02/what-happens-when-i-type-getsystem/
author: Teymur Kheirkhabarov, Ecco, Florian Roth (Nextron Systems)
date: 2019-10-26
modified: 2023-11-15
tags:
- attack.privilege-escalation
- attack.t1134.001
- attack.t1134.002
logsource:
  product: windows
  service: system
detection:
  selection_id:
    Provider_Name: 'Service Control Manager'
    EventID: 7045
  selection_cli_cmd:
        # meterpreter getsystem technique 1: cmd.exe /c echo 559891bb017 > \\.\pipe\5e120a
        # cobaltstrike getsystem technique 1: %COMSPEC% /c echo 559891bb017 > \\.\pipe\5e120a
        # cobaltstrike getsystem technique 1b (expanded %COMSPEC%): %COMSPEC% /c echo 559891bb017 > \\.\pipe\5e120a
    ImagePath|contains|all:
    - '/c'
    - 'echo'
    - '\pipe\'
    ImagePath|contains:
    - 'cmd'
    - '%COMSPEC%'
  selection_cli_rundll:
        # meterpreter getsystem technique 2: rundll32.exe C:\Users\test\AppData\Local\Temp\tmexsn.dll,a /p:tmexsn
    ImagePath|contains|all:
    - 'rundll32'
    - '.dll,a'
    - '/p:'
  selection_cli_share:
    ImagePath|startswith: '\\\\127.0.0.1\\ADMIN$\'      # https://twitter.com/svch0st/status/1413688851877416960?lang=en
  condition: selection_id and 1 of selection_cli_*
falsepositives:
- Unlikely
level: high
notes: |
  ### Technical Context
  This detection rule aims to identify potential privilege escalation attempts via the Meterpreter or Cobalt Strike frameworks by monitoring specific service installations in Windows environments. It looks for events generated by the Service Control Manager (Event ID 7045) in conjunction with command-line patterns indicative of the `getsystem` command. The command itself is utilized to acquire system-level permissions, typically leveraging either `cmd.exe` or `rundll32.exe` to manipulate Windows services for privilege escalation. By examining the `ImagePath` for well-known indicators such as the command line options and shared pipe paths, the rule identifies anomalous behaviors that align with these tactics. This rule utilizes process creation logs and Windows event logs to pinpoint potentially malicious activities.
  ### Investigation Steps
  - Query the EDR solution to gather detailed process execution history related to the detected event, focusing on the `cmd.exe` and `rundll32.exe` executions and their command-line parameters.
  - Analyze Service Control Manager logs (Event ID 7045) within the SIEM to identify any recent service installations that coincide with the suspicious command-line activity detected.
  - Use AV logs to scan for any flagged files or behaviors around the time the alert was generated, particularly focusing on the `tmexsn.dll` or any other files involved in the potentially malicious activity.
  - Review network logs or proxy data for any outbound connections or communications from `ADMIN$` shares during the time frame of the alert to assess for further signs of compromise.
