title: Invoke-Obfuscation Obfuscated IEX Invocation - System
id: 51aa9387-1c53-4153-91cc-d73c59ae1ca9
status: test
description: Detects all variations of obfuscated powershell IEX invocation code generated
  by Invoke-Obfuscation framework from the code block linked in the references
references:
- https://github.com/danielbohannon/Invoke-Obfuscation/blob/f20e7f843edd0a3a7716736e9eddfa423395dd26/Out-ObfuscatedStringCommand.ps1#L873-L888
author: Daniel Bohannon (@Mandiant/@FireEye), oscd.community
date: 2019-11-08
modified: 2022-11-27
tags:
- attack.defense-evasion
- attack.t1027
logsource:
  product: windows
  service: system
detection:
  selection_eid:
    EventID: 7045
  selection_imagepath:
  - ImagePath|re: '\$PSHome\[\s*\d{1,3}\s*\]\s*\+\s*\$PSHome\['
  - ImagePath|re: '\$ShellId\[\s*\d{1,3}\s*\]\s*\+\s*\$ShellId\['
  - ImagePath|re: '\$env:Public\[\s*\d{1,3}\s*\]\s*\+\s*\$env:Public\['
  - ImagePath|re: '\$env:ComSpec\[(\s*\d{1,3}\s*,){2}'
  - ImagePath|re: '\\*mdr\*\W\s*\)\.Name'
  - ImagePath|re: '\$VerbosePreference\.ToString\('
  - ImagePath|re: '\String\]\s*\$VerbosePreference'
  condition: all of selection_*
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This Sigma rule is designed to detect variations of obfuscated PowerShell commands that utilize the `Invoke-Obfuscation` framework, specifically through the use of the `IEX` (Invoke-Expression) command. The rule looks for specific event logs generated by Windows, primarily focusing on Event ID 7045, which indicates a service installation event. It examines the `ImagePath` field for obfuscated command patterns that are characteristic of this framework, such as specific environmental variable access patterns and other manipulation techniques typical of obfuscation methods. By analyzing these indicators, the rule aims to identify potential malicious activity trying to evade standard detection mechanisms.
  ### Investigation Steps
  - Review recent Event ID 7045 logs in your EDR to identify any unusual service installations that match the obfuscated command patterns described in the rule.
  - Utilize your SIEM to correlate the detected events with recent PowerShell activity, focusing on command-line parameters associated with the `IEX` command.
  - Investigate the affected systems using live response tools or your EDR to gather additional context, checking for any other suspicious processes or connections initiated following the PowerShell invocation.
  - Analyze network traffic using NDR tools, especially filtering for outbound connections from the affected host, to detect any potential data exfiltration or communication with known malicious domains.
