title: Uncommon Service Installation Image Path
id: 26481afe-db26-4228-b264-25a29fe6efc7
related:
- id: ca83e9f3-657a-45d0-88d6-c1ac280caf53
  type: obsolete
- id: 1d61f71d-59d2-479e-9562-4ff5f4ead16b
  type: derived
status: test
description: |
  Detects uncommon service installation commands by looking at suspicious or uncommon image path values containing references to encoded powershell commands, temporary paths, etc.
references:
- Internal Research
author: Florian Roth (Nextron Systems)
date: 2022-03-18
modified: 2024-02-09
tags:
- attack.persistence
- attack.privilege-escalation
- car.2013-09-005
- attack.t1543.003
logsource:
  product: windows
  service: system
detection:
  selection:
    Provider_Name: 'Service Control Manager'
    EventID: 7045
  suspicious_paths:
    ImagePath|contains:
    - '\\\\.\\pipe'
    - '\Users\Public\'
    - '\Windows\Temp\'
  suspicious_encoded_flag:
    ImagePath|contains: ' -e'
  suspicious_encoded_keywords:
    ImagePath|contains:
    - ' aQBlAHgA'         # PowerShell encoded commands
    - ' aWV4I'         # PowerShell encoded commands
    - ' IAB'         # PowerShell encoded commands
    - ' JAB'         # PowerShell encoded commands
    - ' PAA'         # PowerShell encoded commands
    - ' SQBFAFgA'         # PowerShell encoded commands
    - ' SUVYI'         # PowerShell encoded commands
  filter_optional_thor_remote:
    ImagePath|startswith: 'C:\WINDOWS\TEMP\thor10-remote\thor64.exe'
  filter_main_defender_def_updates:
    ImagePath|startswith: 'C:\ProgramData\Microsoft\Windows Defender\Definition Updates\'
  condition: selection and ( suspicious_paths or all of suspicious_encoded_* ) and
    not 1 of filter_main_* and not 1 of filter_optional_*
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  The "Uncommon Service Installation Image Path" detection rule identifies potential backdoor or malicious service installations on Windows systems. It focuses on monitoring the Event ID 7045 generated by the Service Control Manager, which logs service creation activities. The rule looks for uncommon or suspicious image paths that often indicate malicious behavior, such as paths involving temporary directories, public user directories, or the usage of encoded PowerShell commands. Specifically, it checks for image paths containing specific keywords typically associated with evasion techniques, such as ' -e' or sequences of characters indicative of Base64 encoded data. By employing these criteria, the rule can effectively flag potential attempts by adversaries to establish persistence through unusual service installations.
  ### Investigation Steps
  - Review the event logs for Event ID 7045 within your EDR solution to identify the specific services being created, focusing on those flagged by this Sigma rule.
  - Use the SIEM to correlate any flagged services with user account activity to determine whether the account creating the service has a legitimate use case for this behavior.
  - Examine the command line and process creation logs in EDR to see if there are additional suspicious processes or commands associated with the services listed.
  - Search through firewall and network proxy logs to see if there are any unusual outbound connections originating from the services, which may suggest malicious intent or ongoing exploitation.
