title: ProcessHacker Privilege Elevation
id: c4ff1eac-84ad-44dd-a6fb-d56a92fc43a9
status: test
description: Detects a ProcessHacker tool that elevated privileges to a very high
  level
references:
- https://twitter.com/1kwpeter/status/1397816101455765504
author: Florian Roth (Nextron Systems)
date: 2021-05-27
modified: 2022-12-25
tags:
- attack.execution
- attack.privilege-escalation
- attack.t1543.003
- attack.t1569.002
logsource:
  product: windows
  service: system
detection:
  selection:
    Provider_Name: 'Service Control Manager'
    EventID: 7045
    ServiceName|startswith: 'ProcessHacker'
    AccountName: 'LocalSystem'
  condition: selection
falsepositives:
- Unlikely
level: high
notes: |
  ### Technical Context
  The Sigma rule titled "ProcessHacker Privilege Elevation" is designed to detect the use of the ProcessHacker tool within Windows environments, specifically when it is initiated as a service with elevated privileges. ProcessHacker is a legitimate but often abused utility that can manipulate system processes and services. This rule specifically looks for Windows Event ID 7045 logs, which are generated by the Service Control Manager (SCM) when a new service is created on the system. The detection criteria focus on entries where the service name begins with "ProcessHacker" and is associated with the 'LocalSystem' account, indicating a high privilege context. The identification of this activity raises potential flags for privilege escalation attempts, as attacker use of this tool often aligns with malicious intent.
  ### Investigation Steps
  - Review EDR logs for recent process activity associated with the detected ProcessHacker service to identify any anomalous behavior or parent-child process relationships.
  - Check for related command-line arguments in the process creation logs to ascertain whether any flags or unusual commands were used at the time of execution.
  - Utilize SIEM solutions to correlate this detection with other security events that may indicate a broader attack vector, such as unauthorized access attempts or unusual login events.
  - Analyze system accounts and configurations in Active Directory or other identity management tools to confirm that the LocalSystem account was legitimately utilized or if this is a sign of potential misuse.
