title: Service Installation in Suspicious Folder
id: 5e993621-67d4-488a-b9ae-b420d08b96cb
status: test
description: Detects service installation in suspicious folder appdata
author: pH-T (Nextron Systems)
references:
- Internal Research
date: 2022-03-18
modified: 2024-01-18
tags:
- attack.persistence
- attack.privilege-escalation
- car.2013-09-005
- attack.t1543.003
logsource:
  product: windows
  service: system
detection:
  selection:
    Provider_Name: 'Service Control Manager'
    EventID: 7045
    ImagePath|contains:
    - '\AppData\'
    - '\\\\127.0.0.1'
    - '\\\\localhost'
  filter_optional_zoom:
    ServiceName: 'Zoom Sharing Service'
    ImagePath|contains: ':\Program Files\Common Files\Zoom\Support\CptService.exe'
  condition: selection and not 1 of filter_optional_*
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  This detection rule identifies the installation of services in suspicious folders, particularly within the Windows `AppData` directory, which is often used by malicious actors to conceal their activities. The rule looks for events where the Service Control Manager (SCM) logs the installation of a service with Event ID 7045, indicating that a new service has been created. The rule specifically targets `ImagePath` entries that include patterns suggesting the installation took place within the `AppData` folder or points to local loopback addresses such as `127.0.0.1` or `localhost`. By monitoring these specific characteristics, security operations can effectively uncover potential persistence mechanisms that attackers might employ to maintain access to compromised systems.
  ### Investigation Steps
  - Utilize the EDR tool to inspect the system for recently installed services. Focus on those located in the `AppData` directory to determine if they give rise to any suspicious activity.
  - Review process creation logs around the timestamps of the event to identify any anomalous process execution that may correlate with the service installation.
  - Check firewall logs for any outbound or suspicious local connections to validate if the newly installed service is attempting to communicate externally.
  - Analyze the application logs for the specific service to gather insights into any actions performed post-installation, including error messages or unusual behavior.
