title: HybridConnectionManager Service Running
id: b55d23e5-6821-44ff-8a6e-67218891e49f
status: test
description: Rule to detect the Hybrid Connection Manager service running on an endpoint.
references:
- https://twitter.com/Cyb3rWard0g/status/1381642789369286662
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
date: 2021-04-12
modified: 2024-08-05
tags:
- attack.persistence
- attack.t1554
logsource:
  product: windows
  service: microsoft-servicebus-client   # Change to servicebus-client once validators are up to date
detection:
  selection:
    EventID:
    - 40300
    - 40301
    - 40302
  keywords:
  - 'HybridConnection'
  - 'sb://'
  - 'servicebus.windows.net'
  - 'HybridConnectionManage'
  condition: selection and keywords
falsepositives:
- Legitimate use of Hybrid Connection Manager via Azure function apps.
level: high
notes: |
  ### Technical Context
  The "HybridConnectionManager Service Running" detection rule identifies instances when the Hybrid Connection Manager service is executed on Windows endpoints. This service is linked to Azure's Hybrid Connections feature, which allows applications to connect to on-premises services securely. The rule examines logs for specific Event IDs (40300, 40301, and 40302) associated with these executions. Additionally, it looks for keywords in the logs that may indicate hybrid connection attempts, specifically those relating to Azure's service bus connections, such as 'HybridConnection' and 'sb://'. By correlating these event logs with the keywords, the rule can flag potentially unwanted or malicious use of the Hybrid Connection Manager that may compromise enterprise security.
  ### Investigation Steps
  - Use the EDR tool to check for activities related to the Hybrid Connection Manager, focusing on process creation events around the time the alerts were generated. 
  - Review Windows Event Logs, specifically Event ID logs 40300, 40301, and 40302, to gather context about the execution of the Hybrid Connection Manager service.
  - Search through AV logs on impacted endpoints for any detections or anomalies related to the Hybrid Connection Manager, which may indicate misuse or compromise.
  - Analyze network traffic logs from the NGFW to identify any unusual outbound connections to 'servicebus.windows.net', which could suggest unauthorized access attempts.
