title: HackTool - Generic Process Access
id: d0d2f720-d14f-448d-8242-51ff396a334e
status: test
description: Detects process access requests from hacktool processes based on their
  default image name
references:
- https://jsecurity101.medium.com/bypassing-access-mask-auditing-strategies-480fb641c158
- https://www.splunk.com/en_us/blog/security/you-bet-your-lsass-hunting-lsass-access.html
author: Nasreddine Bencherchali (Nextron Systems), Swachchhanda Shrawan Poudel
date: 2023-11-27
tags:
- attack.credential-access
- attack.t1003.001
- attack.s0002
logsource:
  category: process_access
  product: windows
detection:
  selection:
  - SourceImage|endswith:
    - '\Akagi.exe'
    - '\Akagi64.exe'
    - '\atexec_windows.exe'
    - '\Certify.exe'
    - '\Certipy.exe'
    - '\CoercedPotato.exe'
    - '\crackmapexec.exe'
    - '\CreateMiniDump.exe'
    - '\dcomexec_windows.exe'
    - '\dpapi_windows.exe'
    - '\findDelegation_windows.exe'
    - '\GetADUsers_windows.exe'
    - '\GetNPUsers_windows.exe'
    - '\getPac_windows.exe'
    - '\getST_windows.exe'
    - '\getTGT_windows.exe'
    - '\GetUserSPNs_windows.exe'
    - '\gmer.exe'
    - '\hashcat.exe'
    - '\htran.exe'
    - '\ifmap_windows.exe'
    - '\impersonate.exe'
    - '\Inveigh.exe'
    - '\LocalPotato.exe'
    - '\mimikatz_windows.exe'
    - '\mimikatz.exe'
    - '\netview_windows.exe'
    - '\nmapAnswerMachine_windows.exe'
    - '\opdump_windows.exe'
    - '\PasswordDump.exe'
    - '\Potato.exe'
    - '\PowerTool.exe'
    - '\PowerTool64.exe'
    - '\psexec_windows.exe'
    - '\PurpleSharp.exe'
    - '\pypykatz.exe'
    - '\QuarksPwDump.exe'
    - '\rdp_check_windows.exe'
    - '\Rubeus.exe'
    - '\SafetyKatz.exe'
    - '\sambaPipe_windows.exe'
    - '\SelectMyParent.exe'
    - '\SharpChisel.exe'
    - '\SharPersist.exe'
    - '\SharpEvtMute.exe'
    - '\SharpImpersonation.exe'
    - '\SharpLDAPmonitor.exe'
    - '\SharpLdapWhoami.exe'
    - '\SharpUp.exe'
    - '\SharpView.exe'
    - '\smbclient_windows.exe'
    - '\smbserver_windows.exe'
    - '\sniff_windows.exe'
    - '\sniffer_windows.exe'
    - '\split_windows.exe'
    - '\SpoolSample.exe'
    - '\Stracciatella.exe'
    - '\SysmonEOP.exe'
    - '\temp\rot.exe'
    - '\ticketer_windows.exe'
    - '\TruffleSnout.exe'
    - '\winPEASany_ofs.exe'
    - '\winPEASany.exe'
    - '\winPEASx64_ofs.exe'
    - '\winPEASx64.exe'
    - '\winPEASx86_ofs.exe'
    - '\winPEASx86.exe'
    - '\xordump.exe'
  - SourceImage|contains:
    - '\goldenPac'
    - '\just_dce_'
    - '\karmaSMB'
    - '\kintercept'
    - '\LocalPotato'
    - '\ntlmrelayx'
    - '\rpcdump'
    - '\samrdump'
    - '\secretsdump'
    - '\smbexec'
    - '\smbrelayx'
    - '\wmiexec'
    - '\wmipersist'
    - 'HotPotato'
    - 'Juicy Potato'
    - 'JuicyPotato'
    - 'PetitPotam'
    - 'RottenPotato'
  condition: selection
falsepositives:
- Unlikely
level: high
notes: |
  ### Technical Context
  This Sigma rule is designed to detect potentially malicious activity by monitoring process access requests made by known hacking tools on Windows systems. The detection mechanism focuses on specific executable names associated with credential access attack techniques. It identifies instances where these processes attempt to access resources, typically used by threat actors during credential theft or privilege escalation. The primary data sources involved include process access logs which provide visibility into which processes are executing, their command-line arguments, and the source image paths. By filtering for known names of hacking tools, security analysts can pinpoint activities that deviate from normal behavior, facilitating early detection of potential compromise.
  ### Investigation Steps
  - Review EDR logs to identify the specific process access events associated with the detected hacktool executables, examining the context and parent-child relationships of these processes.
  - Analyze the command-line arguments of the flagged processes within the EDR to discern the intent and potential scope of the activity, noting any unusual or potentially harmful parameters.
  - Check SIEM alerts and correlate with network logs to assess if the suspect processes initiated any external connections or data exfiltration attempts during their execution.
  - Investigate user account activities through Active Directory logs to determine if any unauthorized access or privilege escalation occurred as a result of the detected processes.
