title: LSASS Memory Access by Tool With Dump Keyword In Name
id: 9bd012ee-0dff-44d7-84a0-aa698cfd87a3
status: test
description: Detects LSASS process access requests from a source process with the
  "dump" keyword in its image name.
references:
- https://twitter.com/_xpn_/status/1491557187168178176
- https://www.ired.team/offensive-security/credential-access-and-credential-dumping/dump-credentials-from-lsass-process-without-mimikatz
author: Florian Roth (Nextron Systems)
date: 2022-02-10
modified: 2023-11-29
tags:
- attack.credential-access
- attack.t1003.001
- attack.s0002
logsource:
  category: process_access
  product: windows
detection:
  selection:
    TargetImage|endswith: '\lsass.exe'
    SourceImage|contains: 'dump'
    GrantedAccess|endswith:
    - '10'
    - '30'
    - '50'
    - '70'
    - '90'
    - 'B0'
    - 'D0'
    - 'F0'
    - '18'
    - '38'
    - '58'
    - '78'
    - '98'
    - 'B8'
    - 'D8'
    - 'F8'
    - '1A'
    - '3A'
    - '5A'
    - '7A'
    - '9A'
    - 'BA'
    - 'DA'
    - 'FA'
    - '0x14C2'          # https://github.com/b4rtik/ATPMiniDump/blob/76304f93b390af3bb66e4f451ca16562a479bdc9/ATPMiniDump/ATPMiniDump.c
    - 'FF'
  condition: selection
falsepositives:
- Rare programs that contain the word dump in their name and access lsass
level: high
notes: |
  ### Technical Context
  This detection rule identifies potentially malicious activity targeting the LSASS (Local Security Authority Subsystem Service) process in Windows systems. Specifically, it looks for processes whose image names contain the keyword "dump" that attempt to access LSASS memory. The rule is focused on monitoring process access events where the granted access levels correspond to reading memory or obtaining sensitive information, which can indicate an attempt to extract sensitive credentials from LSASS. The primary data sources for this detection are process access logs that capture details such as the source image attempting the access and the access rights granted.
  By analyzing the detected patterns, incident responders can assess whether the access attempts were legitimate or part of a broader tactic to compromise credentials. Such behavior is often associated with tools used for credential dumping, making early detection crucial for remediation and minimizing potential security breaches.
  ### Investigation Steps
  - Review EDR logs to investigate the process attempting to access LSASS. Check the source image name for the presence of the keyword "dump" and assess its legitimacy.
  - Correlate the time of the detected access event with other security logs across the environment. Use SIEM tools to identify any abnormal activities by the same source process during that timeframe.
  - Analyze the granted access levels associated with the LSASS memory access attempt. Look specifically for elevated privileges, which could indicate malicious intent.
  - If available, query proxy logs and any recent authentication events to see if this process has made external connections or queried credential stores, which could suggest the results of a successful credential dump.
