title: Lsass Memory Dump via Comsvcs DLL
id: a49fa4d5-11db-418c-8473-1e014a8dd462
status: test
description: Detects adversaries leveraging the MiniDump export function from comsvcs.dll
  via rundll32 to perform a memory dump from lsass.
references:
- https://twitter.com/shantanukhande/status/1229348874298388484
- https://modexp.wordpress.com/2019/08/30/minidumpwritedump-via-com-services-dll/
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
date: 2020-10-20
modified: 2023-11-29
tags:
- attack.credential-access
- attack.t1003.001
logsource:
  category: process_access
  product: windows
detection:
  selection:
    TargetImage|endswith: '\lsass.exe'
    SourceImage|endswith: '\rundll32.exe'
    CallTrace|contains: 'comsvcs.dll'
  condition: selection
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This Sigma rule is designed to detect a potentially malicious memory dump of the Local Security Authority Subsystem Service (LSASS) by monitoring the invocation of the `rundll32.exe` process, which is known to be used by adversaries for this purpose. The rule specifically looks for instances where `rundll32.exe` calls the `MiniDump` export function from the `comsvcs.dll` library targeting the `lsass.exe` process. The LSASS process handles security policies and user credentials, making any unauthorized access or memory dump a significant indicator of a potential security breach or credential theft. The primary technical data sources involved in this detection include process access logs that capture specific interactions and call traces between processes on Windows systems.
  ### Investigation Steps
  - Use the EDR tool to query recent process creation events for `rundll32.exe` to identify any suspicious executions in the timeframe surrounding the alert.
  - Investigate the command-line arguments associated with `rundll32.exe` for indications of malicious intent, particularly any references to `comsvcs.dll` or memory dumping operations.
  - Check the process access logs for any memory access events related to `lsass.exe`, and verify if there are any corresponding file writes that could indicate an unauthorized memory dump.
  - Review Windows event logs (e.g., Security, System) to look for abnormal authentication attempts or privilege escalations that could correlate with the execution of the alerting processes.
