title: Function Call From Undocumented COM Interface EditionUpgradeManager
id: fb3722e4-1a06-46b6-b772-253e2e7db933
status: test
description: Detects function calls from the EditionUpgradeManager COM interface.
  Which is an interface that is not used by standard executables.
references:
- https://www.snip2code.com/Snippet/4397378/UAC-bypass-using-EditionUpgradeManager-C/
- https://gist.github.com/hfiref0x/de9c83966623236f5ebf8d9ae2407611
author: oscd.community, Dmitry Uchakin
date: 2020-10-07
modified: 2023-11-30
tags:
- attack.defense-evasion
- attack.privilege-escalation
- attack.t1548.002
logsource:
  category: process_access
  product: windows
detection:
  selection:
    CallTrace|contains: 'editionupgrademanagerobj.dll'
  condition: selection
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  This Sigma rule is designed to detect abnormal function calls originating from the EditionUpgradeManager COM interface, which is typically not utilized by standard executables in Windows environments. The rule focuses on identifying instances where the `editionupgrademanagerobj.dll` library is accessed, signaling potential misuse, such as privilege escalation or evasion tactics commonly leveraged by attackers. This is achieved through monitoring process access logs, specifically looking for entries that indicate interactions with this undocumented COM interface. The detection process relies on a broad range of telemetry data, including process creation logs and command-line parameters, to identify potential threats indicative of unusual behavior associated with this library.
  ### Investigation Steps
  - Utilize EDR tools to inspect the processes that triggered the alert, verifying their legitimacy and examining their execution context.
  - Check the command-line parameters associated with the flagged processes to identify any suspicious arguments or patterns that might indicate malicious intent.
  - Review process access logs for any prior interactions or communications with `editionupgrademanagerobj.dll`, determining if this behavior is consistent or anomalous.
  - Conduct a search within your AV logs to identify any known issues or signatures tied to the use of the EditionUpgradeManager, correlating findings with other alerts for contextual understanding.
