title: LSASS Access From Potentially White-Listed Processes
id: 4be8b654-0c01-4c9d-a10c-6b28467fc651
status: test
description: |
  Detects a possible process memory dump that uses a white-listed filename like TrolleyExpress.exe as a way to dump the LSASS process memory without Microsoft Defender interference
references:
- https://twitter.com/_xpn_/status/1491557187168178176
- https://www.ired.team/offensive-security/credential-access-and-credential-dumping/dump-credentials-from-lsass-process-without-mimikatz
- https://twitter.com/mrd0x/status/1460597833917251595
author: Florian Roth (Nextron Systems)
date: 2022-02-10
modified: 2023-11-29
tags:
- attack.credential-access
- attack.t1003.001
- attack.s0002
logsource:
  category: process_access
  product: windows
detection:
  selection:
    TargetImage|endswith: '\lsass.exe'
    SourceImage|endswith:
    - '\TrolleyExpress.exe'          # Citrix
    - '\ProcessDump.exe'             # Cisco Jabber
    - '\dump64.exe'                  # Visual Studio
    GrantedAccess|endswith:
    - '10'
    - '30'
    - '50'
    - '70'
    - '90'
    - 'B0'
    - 'D0'
    - 'F0'
    - '18'
    - '38'
    - '58'
    - '78'
    - '98'
    - 'B8'
    - 'D8'
    - 'F8'
    - '1A'
    - '3A'
    - '5A'
    - '7A'
    - '9A'
    - 'BA'
    - 'DA'
    - 'FA'
    - '0x14C2'          # https://github.com/b4rtik/ATPMiniDump/blob/76304f93b390af3bb66e4f451ca16562a479bdc9/ATPMiniDump/ATPMiniDump.c
    - 'FF'
  condition: selection
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This Sigma rule is designed to detect potential credential dumping attempts targeting the Local Security Authority Subsystem Service (LSASS) process in Windows environments. Specifically, it identifies instances where potentially white-listed applications, such as TrolleyExpress.exe, ProcessDump.exe, and dump64.exe, access the LSASS process. This is achieved by analyzing process access logs that capture the source and target images involved in the operation. The rule looks for specific access rights typically associated with memory dumping, which include granted access values that suggest a high level of permission. By monitoring for these particular patterns in the logs, the rule can proactively flag suspicious activity that may bypass traditional security measures, such as Microsoft Defender.
  ### Investigation Steps
  - Utilize EDR tools to review recent process access logs that correspond to TrolleyExpress.exe or similar processes to confirm any unauthorized reads from the LSASS process.
  - Check process execution history in the SIEM or endpoint solution to understand the context and behavior of the white-listed applications that triggered the alert.
  - Analyze network traffic through the NDR for any suspicious outbound connections that may indicate data exfiltration following the access to LSASS.
  - Investigate any related account activities in the identity management system or cloud platform logs (AWS, Azure, GCP) for anomalous login attempts or credential misuse following the flagged event.
