title: HackTool - HandleKatz Duplicating LSASS Handle
id: b1bd3a59-c1fd-4860-9f40-4dd161a7d1f5
status: test
description: Detects HandleKatz opening LSASS to duplicate its handle to later dump
  the memory without opening any new handles
references:
- https://github.com/codewhitesec/HandleKatz
author: Bhabesh Raj (rule), @thefLinkk
date: 2022-06-27
modified: 2023-11-28
tags:
- attack.execution
- attack.t1106
- attack.defense-evasion
- attack.t1003.001
logsource:
  category: process_access
  product: windows
detection:
  selection:
    TargetImage|endswith: '\lsass.exe'     # Theoretically, can be any benign process holding handle to LSASS
    GrantedAccess: '0x1440'     # Only PROCESS_DUP_HANDLE, PROCESS_QUERY_LIMITED_INFORMATION, PROCESS_QUERY_INFORMATION
        # Example: C:\Windows\SYSTEM32\ntdll.dll+9d234\|UNKNOWN(00000000001C119B)
    CallTrace|startswith: 'C:\Windows\System32\ntdll.dll+'
    CallTrace|contains: '|UNKNOWN('
    CallTrace|endswith: ')'
  condition: selection
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This Sigma rule is designed to detect the use of the HandleKatz tool, which exploits the Windows Local Security Authority Subsystem Service (LSASS) process. Specifically, it looks for instances where a process attempts to duplicate a handle to the lsass.exe executable without creating new handles. The rule leverages data from process access logs, focusing on access attempts granted specific permissions, such as `PROCESS_DUP_HANDLE` and `PROCESS_QUERY_INFORMATION`. Additionally, the call trace must start with `C:\Windows\System32\ntdll.dll+`, contain the `|UNKNOWN(` segment, and conclude with a closing parenthesis. This combination indicates nefarious activity consistent with memory dumping practices used by attackers to capture sensitive information.
  ### Investigation Steps
  - Review the process access logs in your EDR tool to identify processes that have accessed lsass.exe with `GrantedAccess` set to `0x1440`.
  - Utilize the call trace data to pinpoint the specific calls made to the ntdll.dll that align with the criteria defined in the Sigma rule.
  - Investigate any unusual command-line parameters associated with the identified processes to assess potential malicious intent or unauthorized use.
  - Cross-reference the investigated processes with your endpoint security logs (AV) and network activity logs (NDR/Proxy) to identify any related or subsequent suspicious behavior that may indicate an ongoing compromise.
