title: CMSTP Execution Process Access
id: 3b4b232a-af90-427c-a22f-30b0c0837b95
status: stable
description: Detects various indicators of Microsoft Connection Manager Profile Installer
  execution
references:
- https://web.archive.org/web/20190720093911/http://www.endurant.io/cmstp/detecting-cmstp-enabled-code-execution-and-uac-bypass-with-sysmon/
author: Nik Seetharaman
date: 2018-07-16
modified: 2021-06-27
tags:
- attack.defense-evasion
- attack.t1218.003
- attack.execution
- attack.t1559.001
- attack.g0069
- attack.g0080
- car.2019-04-001
logsource:
  product: windows
  category: process_access
detection:
    # Process Access Call Trace
  selection:
    CallTrace|contains: 'cmlua.dll'
  condition: selection
falsepositives:
- Legitimate CMSTP use (unlikely in modern enterprise environments)
level: high
notes: |
  ### Technical Context
  This Sigma rule is designed to detect the execution of the Microsoft Connection Manager Profile Installer (CMSTP), specifically targeting scenarios where malicious actors may exploit the CMSTP for code execution and User Account Control (UAC) bypass. The rule identifies process access events that interact with the `cmlua.dll`, which is a dynamic link library associated with CMSTP. Observing this specific call trace can indicate abnormal behavior typically associated with an attack vector aimed at evading detection mechanisms. The primary technical data sources leveraged by this rule include Windows process access logs, which provide insights into the activities of running processes and any associated calls that they make to system libraries.
  ### Investigation Steps
  - Review **EDR alerts** for any recent instances of `CMSTP.exe` execution, focusing on the timeline of execution to correlate with any anomalous user activity.
  - Check **process creation logs** for the presence of `cmlua.dll`, identifying when this dynamic link library was accessed and by which processes.
  - Analyze **network logs** for any outbound connections made shortly after CMSTP execution, which may indicate data exfiltration or command and control communication.
  - Inspect **system event logs** for any changes made to user accounts or UAC settings that coincide with the CMSTP activity, highlighting potential privilege escalation attempts.
