title: HackTool - Generic Process Access
id: d0d2f720-d14f-448d-8242-51ff396a334e
status: test
description: Detects process access requests from hacktool processes based on their
  default image name
references:
- https://jsecurity101.medium.com/bypassing-access-mask-auditing-strategies-480fb641c158
- https://www.splunk.com/en_us/blog/security/you-bet-your-lsass-hunting-lsass-access.html
author: Nasreddine Bencherchali (Nextron Systems), Swachchhanda Shrawan Poudel
date: 2023-11-27
tags:
- attack.credential-access
- attack.t1003.001
- attack.s0002
logsource:
  category: process_access
  product: windows
detection:
  selection:
  - SourceImage|endswith:
    - '\Akagi.exe'
    - '\Akagi64.exe'
    - '\atexec_windows.exe'
    - '\Certify.exe'
    - '\Certipy.exe'
    - '\CoercedPotato.exe'
    - '\crackmapexec.exe'
    - '\CreateMiniDump.exe'
    - '\dcomexec_windows.exe'
    - '\dpapi_windows.exe'
    - '\findDelegation_windows.exe'
    - '\GetADUsers_windows.exe'
    - '\GetNPUsers_windows.exe'
    - '\getPac_windows.exe'
    - '\getST_windows.exe'
    - '\getTGT_windows.exe'
    - '\GetUserSPNs_windows.exe'
    - '\gmer.exe'
    - '\hashcat.exe'
    - '\htran.exe'
    - '\ifmap_windows.exe'
    - '\impersonate.exe'
    - '\Inveigh.exe'
    - '\LocalPotato.exe'
    - '\mimikatz_windows.exe'
    - '\mimikatz.exe'
    - '\netview_windows.exe'
    - '\nmapAnswerMachine_windows.exe'
    - '\opdump_windows.exe'
    - '\PasswordDump.exe'
    - '\Potato.exe'
    - '\PowerTool.exe'
    - '\PowerTool64.exe'
    - '\psexec_windows.exe'
    - '\PurpleSharp.exe'
    - '\pypykatz.exe'
    - '\QuarksPwDump.exe'
    - '\rdp_check_windows.exe'
    - '\Rubeus.exe'
    - '\SafetyKatz.exe'
    - '\sambaPipe_windows.exe'
    - '\SelectMyParent.exe'
    - '\SharpChisel.exe'
    - '\SharPersist.exe'
    - '\SharpEvtMute.exe'
    - '\SharpImpersonation.exe'
    - '\SharpLDAPmonitor.exe'
    - '\SharpLdapWhoami.exe'
    - '\SharpUp.exe'
    - '\SharpView.exe'
    - '\smbclient_windows.exe'
    - '\smbserver_windows.exe'
    - '\sniff_windows.exe'
    - '\sniffer_windows.exe'
    - '\split_windows.exe'
    - '\SpoolSample.exe'
    - '\Stracciatella.exe'
    - '\SysmonEOP.exe'
    - '\temp\rot.exe'
    - '\ticketer_windows.exe'
    - '\TruffleSnout.exe'
    - '\winPEASany_ofs.exe'
    - '\winPEASany.exe'
    - '\winPEASx64_ofs.exe'
    - '\winPEASx64.exe'
    - '\winPEASx86_ofs.exe'
    - '\winPEASx86.exe'
    - '\xordump.exe'
  - SourceImage|contains:
    - '\goldenPac'
    - '\just_dce_'
    - '\karmaSMB'
    - '\kintercept'
    - '\LocalPotato'
    - '\ntlmrelayx'
    - '\rpcdump'
    - '\samrdump'
    - '\secretsdump'
    - '\smbexec'
    - '\smbrelayx'
    - '\wmiexec'
    - '\wmipersist'
    - 'HotPotato'
    - 'Juicy Potato'
    - 'JuicyPotato'
    - 'PetitPotam'
    - 'RottenPotato'
  condition: selection
falsepositives:
- Unlikely
level: high
notes: |
  n
  ### Technical Context
  This Sigma rule is designed to detect suspicious access requests to processes commonly associated with hacking tools or techniques that facilitate credential access. Specifically, it targets executable files known for their capability to manipulate or acquire credentials, such as mimikatz or hashcat. The rule monitors process access events on Windows systems, focusing on entries in the process access logs where the `SourceImage` (the path and name of the executable) matches a predefined list of known hacking tools or contains certain keywords (like "mimikatz" or "secretsdump"). The data sources utilized in this detection include the Windows process access logs which capture attempts to interact with or manipulate the memory or state of other processes. This rule is aligned with the MITRE ATT&CK technique T1003.001 (Credential Dumping: LSASS Memory) under the credential access tactic, highlighting its relevance in detecting potential credential theft attempts.
  ### Investigation Steps
  - **Verify the Source Process:** Check the details of the identified process, particularly the `SourceImage`, using EDR tools. Determine if it is associated with legitimate usage or if it corresponds to a known hacking tool.
    
  - **Assess Process Behavior:** Analyze the behavior of the detected processes further using EDR capabilities or Sysmon logs for any related suspicious actions, such as process creation, network connections, or file accesses that may indicate malicious activity.
    
  - **Correlate with User Activity:** Use Windows Event Logs to track the associated user accounts for its recent activities. Investigate account anomalies, such as sign-in attempts from unusual locations or systems that coincide with the alert timeframe.
    
  - **Monitor Network Traffic:** Review network logs to identify any unusual outbound connections that may relate to the detected process. Focus on connections to known malicious IP addresses or domains, especially related to credential exfiltration.
  ### Prioritization
  Given the severity level of "high" for this alert, it indicates that the detected access request may represent a critical threat to sensitive information within the organization, warranting immediate investigation and response due to the potential for credential compromise.
  ### Blind Spots and Assumptions
  This detection rule relies on predefined lists of known hacking tools and may not capture custom or obfuscated tooling that attackers might use to bypass detection. Moreover, if these tools are executed under the guise of legitimate processes or if access requests utilize uncommon privilege escalation methodologies, the rule may fail to trigger. Engineers should consider that legitimate administrative tools or security tools used inappropriately could lead to false negatives or positives.
  > **Disclaimer:** This investigation guide was created using generative AI technology and has not been reviewed for its accuracy and relevance. While every effort has been made to ensure its quality, we recommend validating the content and adapting it to suit specific environment and operational needs. Please communicate any changes to the detection engineering team.
