title: Credential Dumping Attempt Via Svchost
id: 174afcfa-6e40-4ae9-af64-496546389294
status: test
description: Detects when a process tries to access the memory of svchost to potentially
  dump credentials.
references:
- Internal Research
author: Florent Labouyrie
date: 2021-04-30
modified: 2022-10-09
tags:
- attack.t1548
logsource:
  product: windows
  category: process_access
detection:
  selection:
    TargetImage|endswith: '\svchost.exe'
    GrantedAccess: '0x143a'
  filter_main_known_processes:
    SourceImage|endswith:
    - '\services.exe'
    - '\msiexec.exe'
  condition: selection and not 1 of filter_main_*
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This detection rule is designed to identify potential credential dumping attempts targeting the Windows service host process (svchost.exe). It focuses on monitoring access events where a process requests memory access (specifically with a granted access type of '0x143a', which corresponds to read access and potentially provides the ability to dump credentials) from svchost.exe. To implement this detection, relevant data sources include process access logs that capture details about which processes are trying to interact with svchost.exe, along with their associated granted access rights. This allows the rule to discern between legitimate interactions and possibly malicious activity originating from known, parental processes such as services.exe or msiexec.exe, thereby reducing the likelihood of false positives.
  ### Investigation Steps
  - Review the process access logs in the EDR to confirm the processes involved in accessing svchost.exe and verify the granted access level associated with these interactions.
  - Cross-reference the identified processes with your organization's known legitimate applications and services to assess whether the access is authorized or potentially malicious.
  - Use the SIEM to track preceding and subsequent events related to the alert, which may help establish a timeline of activity and provide context for the suspicious behavior.
  - Scan for any unusual or unexpected processes running on the machine, utilizing AV and process monitoring tools, to identify other potential indicators of compromise.
