title: Hacktool Ruler
id: 24549159-ac1b-479c-8175-d42aea947cae
status: test
description: This events that are generated when using the hacktool Ruler by Sensepost
references:
- https://github.com/sensepost/ruler
- https://github.com/sensepost/ruler/issues/47
- https://github.com/staaldraad/go-ntlm/blob/cd032d41aa8ce5751c07cb7945400c0f5c81e2eb/ntlm/ntlmv1.go#L427
- https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-10/security/threat-protection/auditing/event-4776
- https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-10/security/threat-protection/auditing/event-4624
author: Florian Roth (Nextron Systems)
date: 2017-05-31
modified: 2022-10-09
tags:
- attack.discovery
- attack.execution
- attack.t1087
- attack.t1114
- attack.t1059
- attack.t1550.002
logsource:
  product: windows
  service: security
detection:
  selection1:
    EventID: 4776
    Workstation: 'RULER'
  selection2:
    EventID:
    - 4624
    - 4625
    WorkstationName: 'RULER'
  condition: (1 of selection*)
falsepositives:
- Go utilities that use staaldraad awesome NTLM library
level: high
notes: |
  ### Technical Context
  The "Hacktool Ruler" Sigma rule is designed to detect the usage of the Ruler tool developed by Sensepost, which is often used for password harvesting in Windows environments. This detection operates by monitoring specific Windows security event logs, particularly looking for Event IDs 4776, 4624, and 4625 associated with the workstation named 'RULER'. Event ID 4776 indicates a failed NTLM authentication, while Event IDs 4624 and 4625 log successful and failed logon attempts, respectively. By focusing on these events, the rule helps identify potential misuse of the Ruler tool for unauthorized access attempts within the network. Investigating alerts generated by this rule can reveal crucial information about potential credential theft and malicious user activity involving NTLM authentication vulnerabilities.
  ### Investigation Steps
  - Investigate the alerts by querying the EDR for process execution logs that include the Ruler tool to confirm its execution on the identified endpoints.
  - Review related Windows security logs for Event IDs 4776, 4624, and 4625 to validate the logon attempts made by the workstation named 'RULER'.
  - Check network traffic logs (NDR or firewall logs) for unusual authentication requests or connections originating from the 'RULER' workstation to detect suspicious behavior.
  - Examine the AV logs and alerts to see if any malicious activity was flagged related to the Ruler tool's usage or related processes in the environment.
