title: ISO Image Mounted
id: 0248a7bc-8a9a-4cd8-a57e-3ae8e073a073
status: test
description: Detects the mount of an ISO image on an endpoint
references:
- https://www.trendmicro.com/vinfo/hk-en/security/news/cybercrime-and-digital-threats/malicious-spam-campaign-uses-iso-image-files-to-deliver-lokibot-and-nanocore
- https://www.proofpoint.com/us/blog/threat-insight/threat-actor-profile-ta2719-uses-colorful-lures-deliver-rats-local-languages
- https://twitter.com/MsftSecIntel/status/1257324139515269121
- https://github.com/redcanaryco/atomic-red-team/blob/0f229c0e42bfe7ca736a14023836d65baa941ed2/atomics/T1553.005/T1553.005.md#atomic-test-1---mount-iso-image
author: Syed Hasan (@syedhasan009)
date: 2021-05-29
modified: 2023-11-09
tags:
- attack.initial-access
- attack.t1566.001
logsource:
  product: windows
  service: security
  definition: 'The advanced audit policy setting "Object Access > Audit Removable
    Storage" must be configured for Success/Failure'
detection:
  selection:
    EventID: 4663
    ObjectServer: 'Security'
    ObjectType: 'File'
    ObjectName|startswith: '\Device\CdRom'
  filter_main_generic:
    ObjectName:
    - '\Device\CdRom0\autorun.ico'
    - '\Device\CdRom0\setup.exe'
    - '\Device\CdRom0\setup64.exe'
  condition: selection and not 1 of filter_main_*
falsepositives:
- Software installation ISO files
level: medium
notes: |
  ### Technical Context
  This Sigma rule is designed to detect when an ISO image is mounted on a Windows endpoint, which could indicate potential malicious activity, particularly related to the delivery of malware. The rule primarily focuses on the Windows Security Event ID 4663, which is generated when an object, such as a file, is accessed. The detection specifically looks for access attempts to ISO files with a path starting with `\Device\CdRom`. To ensure accuracy, the rule filters out common installation files that are less likely to represent malicious behavior, such as `autorun.ico`, `setup.exe`, and `setup64.exe`. Event logging must be correctly configured to audit the mounting of removable storage, which is a prerequisite for this rule to be effective.
  ### Investigation Steps
  - Review the relevant security logs in the EDR solution to identify the specific endpoint and user account associated with the ISO image mount event. 
  - Cross-reference the mounted ISO file against known malicious samples or sources using threat intelligence feeds.
  - Check additional context in the endpoint's process creation logs for any suspicious processes initiated following the mount event.
  - Inspect network logs from the NGFW or proxy to detect any unusual outbound traffic patterns that may correlate with the use of the mounted ISO image.
