title: Azure AD Health Service Agents Registry Keys Access
id: 1d2ab8ac-1a01-423b-9c39-001510eae8e8
status: test
description: |
  This detection uses Windows security events to detect suspicious access attempts to the registry key values and sub-keys of Azure AD Health service agents (e.g AD FS).
  Information from AD Health service agents can be used to potentially abuse some of the features provided by those services in the cloud (e.g. Federation).
  This detection requires an access control entry (ACE) on the system access control list (SACL) of the following securable object: HKLM:\SOFTWARE\Microsoft\ADHealthAgent.
  Make sure you set the SACL to propagate to its sub-keys.
references:
- https://o365blog.com/post/hybridhealthagent/
- https://github.com/OTRF/Set-AuditRule/blob/c3dec5443414231714d850565d364ca73475ade5/rules/registry/aad_connect_health_service_agent.yml
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research), MSTIC
date: 2021-08-26
modified: 2022-10-09
tags:
- attack.discovery
- attack.t1012
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID:
    - 4656
    - 4663
    ObjectType: 'Key'
    ObjectName: '\REGISTRY\MACHINE\SOFTWARE\Microsoft\ADHealthAgent'
  filter:
    ProcessName|contains:
    - 'Microsoft.Identity.Health.Adfs.DiagnosticsAgent.exe'
    - 'Microsoft.Identity.Health.Adfs.InsightsService.exe'
    - 'Microsoft.Identity.Health.Adfs.MonitoringAgent.Startup.exe'
    - 'Microsoft.Identity.Health.Adfs.PshSurrogate.exe'
    - 'Microsoft.Identity.Health.Common.Clients.ResourceMonitor.exe'
  condition: selection and not filter
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  The Azure AD Health Service Agents Registry Keys Access detection rule focuses on identifying unauthorized access attempts to specific registry keys associated with Azure Active Directory Health services, particularly the AD FS (Active Directory Federation Services). The rule monitors Windows security events, specifically looking for Event IDs 4656 and 4663, which indicate access or modification attempts to the registry path `HKLM:\SOFTWARE\Microsoft\ADHealthAgent`. Unauthorized access to these keys can lead to potential misuse of AD Health agent features, such as compromising information related to federation services in a cloud environment. This detection requires an appropriate configuration of the system access control list (SACL) to monitor these keys' security.
  The detection leverages various technical data sources such as process creation logs and security event logs. By filtering down to specific processes associated with AD Health services, the rule helps in pinpointing suspicious activities that might indicate malicious intent. 
  ### Investigation Steps
  - Review the Windows security event logs for Event IDs 4656 and 4663, specifically focusing on attempts related to the registry key `HKLM:\SOFTWARE\Microsoft\ADHealthAgent`.
  - Utilize EDR tools to analyze processes matching the identified process names to determine if they were executed under suspicious or unauthorized conditions.
  - Cross-reference the activity with cloud platform logs (e.g. Azure AD logs) to see if any abnormal authentication attempts or modifications to federation services are present.
  - Investigate any related network traffic through the NDR (Network Detection and Response) system to identify potentially malicious outbound connections initiated by the suspicious processes.
