title: SMB Create Remote File Admin Share
id: b210394c-ba12-4f89-9117-44a2464b9511
status: test
description: Look for non-system accounts SMB accessing a file with write (0x2) access
  mask via administrative share (i.e C$).
references:
- https://github.com/OTRF/ThreatHunter-Playbook/blob/f7a58156dbfc9b019f17f638b8c62d22e557d350/playbooks/WIN-201012004336.yaml
- https://securitydatasets.com/notebooks/atomic/windows/lateral_movement/SDWIN-200806015757.html?highlight=create%20file
author: Jose Rodriguez (@Cyb3rPandaH), OTR (Open Threat Research)
date: 2020-08-06
modified: 2021-11-27
tags:
- attack.lateral-movement
- attack.t1021.002
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 5145
    ShareName|endswith: 'C$'
    AccessMask: '0x2'
  filter:
    SubjectUserName|endswith: '$'
  condition: selection and not filter
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This Sigma rule aims to detect potentially suspicious activity involving unauthorized file creation on administrative shares, specifically the default administrative share C$. It monitors Windows security logs (specifically EventID 5145) to identify when a non-system account attempts to access the share with write permissions (indicated by an access mask of 0x2). This type of behavior could signify lateral movement or data exfiltration attempts within a network environment, as it allows attackers to create files remotely on systems. By filtering on user accounts that end with the dollar sign ('$'), the rule effectively narrows down potential non-malicious administrative activities that may occur, focusing only on actual users with elevated permissions.
  ### Investigation Steps
  - Review the alerts generated by the rule in the SIEM for any instances of non-system accounts accessing the C$ share.
  - Utilize the EDR tool to check the process activity related to the identified event, specifically looking for unusual command-line usage or processes around the same timeframe.
  - Query firewall logs for any indicative lateral movement patterns or connections to the affected system originated from anomalous internal IP addresses.
  - Analyze VPN logs or proxy traffic to identify if the accessing account was connected remotely or engaged in any suspicious activities prior to the alert.
