title: Denied Access To Remote Desktop
id: 8e5c03fa-b7f0-11ea-b242-07e0576828d9
status: test
description: |
  This event is generated when an authenticated user who is not allowed to log on remotely attempts to connect to this computer through Remote Desktop.
  Often, this event can be generated by attackers when searching for available windows servers in the network.
references:
- https://www.ultimatewindowssecurity.com/securitylog/encyclopedia/event.aspx?eventid=4825
author: Pushkarev Dmitry
date: 2020-06-27
modified: 2021-11-27
tags:
- attack.lateral-movement
- attack.t1021.001
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 4825
  condition: selection
fields:
- EventCode
- AccountName
- ClientAddress
falsepositives:
- Valid user was not added to RDP group
level: medium
notes: |
  ### Technical Context
  This detection rule focuses on identifying unauthorized access attempts to a Remote Desktop Protocol (RDP) session on Windows machines. It specifically looks for Event ID 4825, which is triggered when an authenticated user attempts to connect remotely but lacks the necessary permissions to do so. The significance of this event lies in its potential indication of malicious activities, such as attackers probing the network for available Windows servers or compromised accounts attempting to gain further access. The primary data sources for this rule include Windows security logs that record user authentication events, along with details such as the Account Name and Client Address, which help identify patterns and potential threats based on user behavior.
  ### Investigation Steps
  - Review the specific Event ID 4825 in the Windows security logs to identify the user account and their originating Client Address, noting any unusual access patterns.
  - Cross-reference the user account with the internal Active Directory to confirm their Remote Desktop permissions and ensure they are correctly set for valid use cases.
  - Utilize EDR tools to monitor the user's actions leading up to the RDP access attempt, focusing on any potentially malicious behaviors, such as attempts to exploit other systems.
  - Check firewall and VPN logs to see if there were any unusual connection attempts or patterns from the Client Address reported in the alerts, highlighting potential reconnaissance activity.
