title: DCOM InternetExplorer.Application Iertutil DLL Hijack - Security
id: c39f0c81-7348-4965-ab27-2fde35a1b641
status: test
description: Detects a threat actor creating a file named `iertutil.dll` in the `C:\Program
  Files\Internet Explorer\` directory over the network for a DCOM InternetExplorer
  DLL Hijack scenario.
references:
- https://threathunterplaybook.com/hunts/windows/201009-RemoteDCOMIErtUtilDLLHijack/notebook.html
author: Roberto Rodriguez @Cyb3rWard0g, Open Threat Research (OTR)
date: 2020-10-12
modified: 2022-11-26
tags:
- attack.lateral-movement
- attack.t1021.002
- attack.t1021.003
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 5145
    RelativeTargetName|endswith: '\Internet Explorer\iertutil.dll'
  filter:
    SubjectUserName|endswith: '$'
  condition: selection and not filter
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This Sigma rule is designed to detect potentially malicious activity involving the creation of a file named `iertutil.dll` in the `C:\Program Files\Internet Explorer\` directory. This activity is representative of a DCOM (Distributed Component Object Model) Internet Explorer DLL hijacking scenario, where an attacker might exploit a legitimate process to execute malicious code. The rule specifically monitors Windows security logs for event ID 5145, which signifies file access over the network. By including filtering criteria to ensure that the file creation is not performed by typical system accounts (indicated by `SubjectUserName` ending with a '$'), the rule mitigates common false positives from legitimate administrative actions.
  ### Investigation Steps
  - **Review EDR Alerts:** Utilize your EDR tool to investigate the endpoint associated with the alert for any suspicious process tree behavior or unauthorized changes to the `C:\Program Files\Internet Explorer\` directory.
  - **Analyze Windows Security Logs:** Examine the Windows security event logs, specifically focusing on event ID 5145 entries related to the creation of the `iertutil.dll` file, to gather information about the user account and source IP address involved.
  - **Inspect Network Traffic:** Use NDR tools to analyze incoming traffic that may correlate with the file creation events, looking for any unusual or unauthorized access attempts from external networks.
  - **Check for Lateral Movement:** Investigate any other endpoints for similar file creation events and assess network logs for anomalous DCOM communications, which may indicate lateral movement by the threat actor.
