title: User Couldn't Call a Privileged Service 'LsaRegisterLogonProcess'
id: 6daac7fc-77d1-449a-a71a-e6b4d59a0e54
status: test
description: The 'LsaRegisterLogonProcess' function verifies that the application
  making the function call is a logon process by checking that it has the SeTcbPrivilege
  privilege set. Possible Rubeus tries to get a handle to LSA.
references:
- https://posts.specterops.io/hunting-in-active-directory-unconstrained-delegation-forests-trusts-71f2b33688e1
author: Roberto Rodriguez (source), Ilyas Ochkov (rule), oscd.community
date: 2019-10-24
modified: 2022-12-25
tags:
- attack.lateral-movement
- attack.privilege-escalation
- attack.t1558.003
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 4673
    Service: 'LsaRegisterLogonProcess()'
    Keywords: '0x8010000000000000'         # failure
  condition: selection
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This Sigma rule targets the Windows Event ID 4673, which is generated when a service attempts to call the `LsaRegisterLogonProcess` function. This function is critical for ensuring that only authorized logon processes, which possess the SeTcbPrivilege, can execute actions that require higher privileges. A failure to call this service due to lack of necessary privileges may indicate potential abuse attempts, such as those using Rubeus to manipulate or impersonate authenticated users in Active Directory environments. The rule examines security logs for events related to this function call to help identify unauthorized activities that could lead to lateral movement or privilege escalation within a network.
  ### Investigation Steps
  - Search the EDR logs for Event ID 4673 entries around the time the alert was triggered to identify any attempting processes and their associated users.
  - Review process creation logs to determine the parent-child relationships of the processes involved in the alert, as well as any anomalies in command-line parameters.
  - Utilize the SIEM to correlate this alert with other security events, such as failed logins or unusual service account activities, to identify patterns of potential suspicious behavior.
  - Examine logs from NGFW and Proxy to check for any outbound connections or unusual traffic patterns associated with the user or machine raising this alert, indicating potential exfiltration or lateral movement attempts.
