title: Password Policy Enumerated
id: 12ba6a38-adb3-4d6b-91ba-a7fb248e3199
status: test
description: Detects when the password policy is enumerated.
references:
- https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-10/security/threat-protection/auditing/event-4661
- https://github.com/jpalanco/alienvault-ossim/blob/f74359c0c027e42560924b5cff25cdf121e5505a/os-sim/agent/src/ParserUtil.py#L951
author: Zach Mathis
date: 2023-05-19
tags:
- attack.discovery
- attack.t1201
logsource:
  product: windows
  service: security
  definition: dfd8c0f4-e6ad-4e07-b91b-f2fca0ddef64
detection:
  selection:
    EventID: 4661     # A handle to an object was requested.
    AccessList|contains: '%%5392'     # ReadPasswordParameters
    ObjectServer: 'Security Account Manager'
  condition: selection
level: medium
notes: |
  ### Technical Context
  The "Password Policy Enumerated" detection rule aims to identify attempts to enumerate password policies on Windows systems, specifically through the Security Account Manager (SAM). The rule monitors security event logs for Event ID 4661, which indicates that a request was made for a handle to a sensitive object. Additionally, it checks for specific access rights (identified by the access list containing '%%5392', which corresponds to ReadPasswordParameters) that would indicate an attempt to read password-related configurations. This behavior can be indicative of reconnaissance activities by an attacker seeking to gather information about system security settings, thus posing a risk to the integrity of the enterprise environment.
  The data sources utilized in this rule include Windows security event logs, which record various user and system activities to help identify and respond to anomalous behaviors. By analyzing these logs, security operations teams can swiftly detect and investigate potential password enumeration activities that may signify larger security threats.
  ### Investigation Steps
  - Utilize EDR tools to review the context of the event and correlate it with user behavior trends to assess the legitimacy of the password policy enumeration attempt.
  - Analyze historical security event logs related to Event ID 4661 to identify previous instances of similar activities and determine if this event is part of a broader pattern.
  - Check access logs from the NGFW or Proxy to see if there were any unusual external access attempts that coincide with the timestamp of the security event.
  - Investigate user account details in Active Directory to validate the user account that triggered the event and ensure it is not a compromised account performing reconnaissance actions.
