title: Suspicious Remote Logon with Explicit Credentials
id: 941e5c45-cda7-4864-8cea-bbb7458d194a
status: test
description: Detects suspicious processes logging on with explicit credentials
references:
- https://drive.google.com/file/d/1lKya3_mLnR3UQuCoiYruO3qgu052_iS_/view
author: oscd.community, Teymur Kheirkhabarov @HeirhabarovT, Zach Stanford @svch0st,
  Tim Shelton
date: 2020-10-05
modified: 2022-08-03
tags:
- attack.t1078
- attack.lateral-movement
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 4648
    ProcessName|endswith:
    - '\cmd.exe'
    - '\powershell.exe'
    - '\pwsh.exe'
    - '\winrs.exe'
    - '\wmic.exe'
    - '\net.exe'
    - '\net1.exe'
    - '\reg.exe'
  filter1:
    TargetServerName: 'localhost'
  filter2:
    SubjectUserName|endswith: '$'
    TargetUserName|endswith: '$'
  condition: selection and not 1 of filter*
falsepositives:
- Administrators that use the RunAS command or scheduled tasks
level: medium
notes: |
  ### Technical Context
  This detection rule is designed to identify potentially suspicious remote logon attempts using explicit credentials on Windows systems. The primary indicators for this rule are event logs generated by the Windows Security log, specifically Event ID 4648, which logs instances where a logon attempt is made with explicit user credentials. The rule looks for processes that are typically associated with command-line interface interactions, such as `cmd.exe`, `powershell.exe`, and several other administrative tools. Additionally, the rule focuses on scenarios where the logon is directed at the local host and involves accounts that follow the convention of ending with a dollar sign ($), which indicates service or machine accounts. This behavior can be indicative of lateral movement by an attacker or misuse by internal users.
  ### Investigation Steps
  - Review the Windows Security event logs for Event ID 4648 to identify specific instances of credential usage that triggered this alert.
  - Utilize the EDR tool to analyze the properties and execution context of the identified processes to determine the legitimacy of the remote logon attempt.
  - Examine network traffic logs, specifically from the NGFW and NDR tools, for any unusual inbound or outbound connections related to the identified processes during the time of the alert.
  - Check the proxy logs for any unusual web-based activities or accesses initiated by the accounts involved, particularly around the time of the suspicious logon event.
