title: Remote Task Creation via ATSVC Named Pipe
id: f6de6525-4509-495a-8a82-1f8b0ed73a00
status: test
description: Detects remote task creation via at.exe or API interacting with ATSVC
  namedpipe
references:
- https://web.archive.org/web/20230409194125/https://blog.menasec.net/2019/03/threat-hunting-25-scheduled-tasks-for.html
author: Samir Bousseaden
date: 2019-04-03
modified: 2024-08-01
tags:
- attack.lateral-movement
- attack.persistence
- car.2013-05-004
- car.2015-04-001
- attack.t1053.002
logsource:
  product: windows
  service: security
  definition: 'The advanced audit policy setting "Object Access > Audit Detailed File
    Share" must be configured for Success/Failure'
detection:
  selection:
    EventID: 5145
    ShareName: '\\\\\*\\IPC$'     # looking for the string \\*\IPC$
    RelativeTargetName: atsvc
    AccessList|contains: 'WriteData'
  condition: selection
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  The "Remote Task Creation via ATSVC Named Pipe" detection rule is designed to identify unauthorized or suspicious remote task creation attempts on Windows systems. Specifically, it looks for events relating to the use of the `at.exe` command or APIs that interact with the ATSVC (Async Task Scheduler Service) named pipe. The rule focuses on EventID 5145, which is generated during access attempts to Windows File Shares, particularly when the IPC$ share is involved. The conditions set within the rule capture instances where there is a write access to the ATSVC named pipe, intervening with the normal operation of task scheduling. By monitoring these access patterns, the rule aims to surface potential lateral movement or persistence tactics that attackers might employ within the environment.
  ### Investigation Steps
  - Utilize EDR tools to review the process creation logs around the time of the alert to identify any unusual command-line arguments or unexpected parent processes related to `at.exe`.
  - Check the security logs for any additional EventID 5145 entries, as these may provide context about the source of the access and further clarify whether it was legitimate.
  - Investigate network traffic logs from the NGFW or NDR to ascertain if there were any anomalous connections to local systems leveraging the IPC$ share, especially those originating from known hostnames or users.
  - Review scheduled tasks in the environment to establish if any new or modified tasks correlate with the timing of the alert, paying special attention to those created by unfamiliar accounts or processes.
