title: Reconnaissance Activity
id: 968eef52-9cff-4454-8992-1e74b9cbad6c
status: test
description: Detects activity as "net user administrator /domain" and "net group domain
  admins /domain"
references:
- https://findingbad.blogspot.de/2017/01/hunting-what-does-it-look-like.html
author: Florian Roth (Nextron Systems), Jack Croock (method), Jonhnathan Ribeiro (improvements),
  oscd.community
date: 2017-03-07
modified: 2022-08-22
tags:
- attack.discovery
- attack.t1087.002
- attack.t1069.002
- attack.s0039
logsource:
  product: windows
  service: security
  definition: The volume of Event ID 4661 is high on Domain Controllers and therefore
    "Audit SAM" and "Audit Kernel Object" advanced audit policy settings are not configured
    in the recommendations for server systems
detection:
  selection:
    EventID: 4661
    AccessMask: '0x2d'
    ObjectType:
    - 'SAM_USER'
    - 'SAM_GROUP'
    ObjectName|startswith: 'S-1-5-21-'
    ObjectName|endswith:
    - '-500'
    - '-512'
  condition: selection
falsepositives:
- Administrator activity
level: high
notes: |
  ### Technical Context
  This Sigma rule is designed to detect potential reconnaissance activity within a Windows environment, specifically focusing on attempts to query user and group information from the Security Account Manager (SAM). It looks for specific events logged as Event ID 4661, which indicate that there has been an attempt to read or enumerate user and group accounts in Active Directory. The rule specifically targets access to SAM user and group objects, particularly the administrator account and domain admins group, as indicated by the Security Identifier (SID) patterns related to these objects.
  When an attacker seeks to enumerate users in a domain, they may execute commands like "net user administrator /domain" or "net group domain admins /domain." The collected data from Windows security logs, specifically monitoring for high volumes of Event ID 4661, allows for the identification of such potentially malicious reconnaissance efforts. Monitoring the access mask and object types associated with these events enhances the ability to discern unauthorized information gathering from legitimate administrative actions.
  ### Investigation Steps
  - Review the Event ID 4661 logs using your EDR solution to find instances of the access mask '0x2d' which indicates a read attempt on SAM user and group objects.
  - Analyze the specific ObjectName entries from the logs to identify any queries against the administrator account or domain admins group.
  - Cross-reference the timestamps of the suspicious events with user activity logs in your SIEM to identify if a legitimate user was performing the actions or if they were potentially hazardous.
  - Check the network traffic for commands executed from endpoints to determine if there were any suspicious external access attempts or unauthorized insider activities.
