title: VSSAudit Security Event Source Registration
id: e9faba72-4974-4ab2-a4c5-46e25ad59e9b
status: test
description: Detects the registration of the security event source VSSAudit. It would
  usually trigger when volume shadow copy operations happen.
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1003.002/T1003.002.md#atomic-test-3---esentutlexe-sam-copy
author: Roberto Rodriguez @Cyb3rWard0g, Open Threat Research (OTR)
date: 2020-10-20
modified: 2022-04-28
tags:
- attack.credential-access
- attack.t1003.002
logsource:
  product: windows
  service: security
detection:
  selection:
    AuditSourceName: VSSAudit
    EventID:
    - 4904
    - 4905
  condition: selection
falsepositives:
- Legitimate use of VSSVC. Maybe backup operations. It would usually be done by C:\Windows\System32\VSSVC.exe.
level: informational
notes: |
  ### Technical Context
  This detection rule identifies registration events related to the Volume Shadow Copy Service (VSS), specifically focusing on security event source registration by monitoring Windows Security Event logs. The rule triggers on Event IDs 4904 and 4905, indicating that an application or service is registering or updating its security parameters for shadow copy operations. Tracking these events is crucial, as malicious actors may utilize VSS to create shadow copies of files or to manipulate data during a cyber-attack. The rule's primary data source for detection is the Windows Security log, where these specific events are recorded. By correlating these events with other telemetry, security teams can identify potentially unauthorized actions related to sensitive data and improve overall incident response.
  ### Investigation Steps
  - Review the Windows Security Event logs for Events 4904 and 4905 to confirm the registration of the VSSAudit source and any associated processes that initiated these events.
  - Utilize the EDR tool to analyze process execution paths, focusing on any recent activity involving the `VSSVC.exe` executable and ensure that only authorized backups were performed.
  - Check for any unusual network activity in the NDR logs that may correlate with the timing of the VSS events, as attackers may exfiltrate data after manipulation via shadow copies.
  - Investigate any related log entries in AWS, Azure, or GCP that involve data access or modification, particularly focusing on cloud storage or backup services to understand the scope of the potential incident.
