title: Potential AD User Enumeration From Non-Machine Account
id: ab6bffca-beff-4baa-af11-6733f296d57a
status: test
description: Detects read access to a domain user from a non-machine account
references:
- https://www.specterops.io/assets/resources/an_ace_up_the_sleeve.pdf
- http://www.stuffithoughtiknew.com/2019/02/detecting-bloodhound.html
- https://learn.microsoft.com/en-us/windows/win32/adschema/attributes-all     # For further investigation of the accessed properties
- https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-10/security/threat-protection/auditing/event-4662
author: Maxime Thiebaut (@0xThiebaut)
date: 2020-03-30
modified: 2022-11-08
tags:
- attack.discovery
- attack.t1087.002
logsource:
  product: windows
  service: security
  definition: 'Requirements: The "Read all properties" permission on the user object
    needs to be audited for the "Everyone" principal'
detection:
  selection:
    EventID: 4662
        # Using contains as the data commonly is structured as "%{bf967aba-0de6-11d0-a285-00aa003049e2}"
        # The user class (https://learn.microsoft.com/en-us/windows/win32/adschema/c-user)
    ObjectType|contains: 'bf967aba-0de6-11d0-a285-00aa003049e2'
    AccessMask|endswith:
            # Note: Since the Access Mask can have more than once permission we need to add all permutations that include the READ property
    - '1?'         # This covers all access masks that are 1 bytes or shorter and the "Read Property" itself
    - '3?'         # Read Property + Write Property
    - '4?'         # Read Property + Delete Tree
    - '7?'         # Read Property + Write Property + Delete Tree
    - '9?'         # Read Property + List Object
    - 'B?'         # Read Property + Write Property + List Object
    - 'D?'         # Read Property + Delete Tree + List Object
    - 'F?'         # Covers usage of all possible 2 bytes permissions with any or none of the single byte permissions
  filter_main_machine_accounts:
    SubjectUserName|endswith: '$'     # Exclude machine accounts
  filter_main_msql:
    SubjectUserName|startswith: 'MSOL_'     # https://learn.microsoft.com/en-us/azure/active-directory/hybrid/reference-connect-accounts-permissions#ad-ds-connector-account
  condition: selection and not 1 of filter_main_*
falsepositives:
- Administrators configuring new users.
level: medium
notes: |
  ### Technical Context
  This Sigma rule detects potential Active Directory (AD) user enumeration attempts originating from non-machine accounts. Specifically, it monitors Windows Security Event ID 4662, which logs detailed information about access to AD objects. The rule looks for access attempts where the `ObjectType` indicates a user object, represented by a specific GUID, and examines the `AccessMask` for specific read permissions. To enhance the integrity of detective capabilities, it filters out machine accounts and Azure AD accounts that start with "MSOL_". The detection focuses on scenarios where unauthorized users might attempt to glean information from user accounts, potentially signaling bad actors examining AD for exploitation opportunities.
  ### Investigation Steps
  - Review the specific Event ID 4662 logs in your EDR system to identify the time, user, and object accessed during the enumeration attempt.
  - Cross-reference the user account in the alert with the organization's user registry to determine if the account should have had visibility into the user information accessed.
  - Utilize the SIEM platform to correlate any suspicious user activities within the time frame of the AD enumeration attempt to identify related incidents.
  - Check proxy logs for outbound requests from the account if applicable; this could provide context on potentially malicious behavior following the user enumeration alert.
