title: CobaltStrike Service Installations - Security
id: d7a95147-145f-4678-b85d-d1ff4a3bb3f6
related:
- id: 5a105d34-05fc-401e-8553-272b45c1522d
  type: derived
status: test
description: Detects known malicious service installs that appear in cases in which
  a Cobalt Strike beacon elevates privileges or lateral movement
references:
- https://www.sans.org/webcasts/119395
- https://www.crowdstrike.com/blog/getting-the-bacon-from-cobalt-strike-beacon/
- https://thedfirreport.com/2021/08/29/cobalt-strike-a-defenders-guide/
author: Florian Roth (Nextron Systems), Wojciech Lesicki
date: 2021-05-26
modified: 2022-11-27
tags:
- attack.execution
- attack.privilege-escalation
- attack.lateral-movement
- attack.t1021.002
- attack.t1543.003
- attack.t1569.002
logsource:
  product: windows
  service: security
  definition: The 'System Security Extension' audit subcategory need to be enabled
    to log the EID 4697
detection:
  event_id:
    EventID: 4697
  selection1:
    ServiceFileName|contains|all:
    - 'ADMIN$'
    - '.exe'
  selection2:
    ServiceFileName|contains|all:
    - '%COMSPEC%'
    - 'start'
    - 'powershell'
  selection3:
    ServiceFileName|contains: 'powershell -nop -w hidden -encodedcommand'
  selection4:
    ServiceFileName|base64offset|contains: "IEX (New-Object Net.Webclient).DownloadString('http://127.0.0.1:"
  condition: event_id and 1 of selection*
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This Sigma rule is designed to detect potentially malicious service installations commonly associated with Cobalt Strike activity. When a Cobalt Strike beacon is deployed, it may elevate privileges or facilitate lateral movement by creating services with specific characteristics. The rule looks for Windows Security Event ID 4697, which logs the creation of a new service. It focuses on identifying the presence of suspicious service filenames that contain known indicators of compromise, such as the use of the administrative share (`ADMIN$`), invocation of PowerShell with hidden execution flags, or base64-encoded command strings that download malicious payloads from a local address. By monitoring these indicators, the rule assists analysts in identifying and responding to potential Cobalt Strike threats within the environment.
  ### Investigation Steps
  - Examine the EDR logs for any recent service creation events (Event ID 4697) and note the service names and executable paths for further analysis.
  - Query the SIEM for logs related to the identified services, focusing on the command-line arguments that may reveal suspicious PowerShell invocations or encoded commands.
  - Review network logs in the NDR system to check for any outbound connections that correspond with the timestamps of the service installations, especially those targeting known malicious IP addresses.
  - Conduct a scan with AV tools on the affected endpoints to identify any known malware signatures or suspicious files associated with the reported services.
