title: Register new Logon Process by Rubeus
id: 12e6d621-194f-4f59-90cc-1959e21e69f7
status: test
description: Detects potential use of Rubeus via registered new trusted logon process
references:
- https://posts.specterops.io/hunting-in-active-directory-unconstrained-delegation-forests-trusts-71f2b33688e1
author: Roberto Rodriguez (source), Ilyas Ochkov (rule), oscd.community
date: 2019-10-24
modified: 2022-10-09
tags:
- attack.lateral-movement
- attack.privilege-escalation
- attack.credential-access
- attack.t1558.003
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 4611
    LogonProcessName: 'User32LogonProcesss'
  condition: selection
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This Sigma rule is designed to detect instances of the Rubeus tool being used to establish a new logon process in a Windows environment. Specifically, it monitors for Windows event logs indicating the creation of a new logon process with the EventID 4611, where the logon process name is identified as 'User32LogonProcess'. Rubeus is a common tool in post-exploitation scenarios, particularly for credential access and lateral movement within Active Directory environments. By capturing this logon process, the rule provides insights into potentially malicious activity that may involve elevated privileges or unauthorized access within the enterprise network.
  The technical data sources involved in this detection include Windows Security Event logs, which record various authentication events, specifically focusing on detailed logon information. This information is crucial for incident responders to correlate user actions with potential malicious behavior associated with unauthorized access attempts.
  ### Investigation Steps
  - Review the Windows Security Event logs for EventID 4611 to confirm the creation of a new logon process, specifically noting the process name 'User32LogonProcess'.
  - Utilize the EDR tool to gather related context around the affected user accounts and devices, checking for any anomalous behavior or unusual access patterns prior to the alert.
  - Cross-reference with Active Directory logs to identify any recent changes or unauthorized modifications in group memberships or user account privileges that coincide with the alert.
  - Analyze network traffic logs via NDR or Proxy tools to detect any suspicious outbound connections or command-and-control communication that might indicate further exploitation or lateral movement attempts.
