title: Service Registry Key Read Access Request
id: 11d00fff-5dc3-428c-8184-801f292faec0
status: test
description: |
  Detects "read access" requests on the services registry key.
  Adversaries may execute their own malicious payloads by hijacking the Registry entries used by services.
  Adversaries may use flaws in the permissions for Registry keys related to services to redirect from the originally specified executable to one that they control, in order to launch their own code when a service starts.
references:
- https://center-for-threat-informed-defense.github.io/summiting-the-pyramid/analytics/service_registry_permissions_weakness_check/
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1574.011/T1574.011.md#atomic-test-1---service-registry-permissions-weakness
author: Center for Threat Informed Defense (CTID) Summiting the Pyramid Team
date: 2023-09-28
tags:
- attack.defense-evasion
- attack.persistence
- attack.privilege-escalation
- attack.t1574.011
logsource:
  product: windows
  service: security
  definition: 'Requirements: SACLs must be enabled for "READ_CONTROL" on the registry
    keys used in this rule'
detection:
  selection:
    EventID: 4663
    ObjectName|contains|all:
    - '\SYSTEM\'
    - 'ControlSet\Services\'
    AccessList|contains: '%%1538'     # READ_CONTROL
  condition: selection
falsepositives:
- Likely from legitimate applications reading their key. Requires heavy tuning
level: low
notes: |
  ### Technical Context
  This Sigma rule detects unauthorized or suspicious "read access" requests on service registry keys within the Windows operating system. Adversaries may exploit flaws in the permissions of these registry entries to redirect service executions, potentially allowing them to execute malicious payloads under the guise of legitimate service processes. The rule specifically monitors Event ID 4663, which logs access requests to registry objects. When the logs indicate a request to read from critical service registry keys—including the `ControlSet\Services` path—along with the specified access type of `READ_CONTROL`, the rule triggers an alert. Such activity may indicate an attempt at privilege escalation, persistence, or evasion of security measures.
  ### Investigation Steps
  - Review the alerts generated by the rule in the SIEM for any instances of Event ID 4663 related to registry access.
  - Utilize EDR tools to correlate the identified endpoints with any recent changes made to the service registry keys, focusing on user actions associated with the reads.
  - Examine command-line parameters and process creation logs to track whether any unauthorized executables may be connected to the observed registry read accesses.
  - Investigate the source of these requests using Windows Security and system logs to assess if they are legitimate application behavior or indicative of malicious activity.
