title: Windows Defender Exclusion Registry Key - Write Access Requested
id: e9c8808f-4cfb-4ba9-97d4-e5f3beaa244d
related:
- id: 46a68649-f218-4f86-aea1-16a759d81820
  type: derived
- id: a33f8808-2812-4373-ae95-8cfb82134978
  type: derived
status: test
description: |
  Detects write access requests to the Windows Defender exclusions registry keys. This could be an indication of an attacker trying to request a handle or access the object to write new exclusions in order to bypass security.
references:
- https://www.bleepingcomputer.com/news/security/gootkit-malware-bypasses-windows-defender-by-setting-path-exclusions/
author: '@BarryShooshooga, Nasreddine Bencherchali (Nextron Systems)'
date: 2019-10-26
modified: 2023-11-11
tags:
- attack.defense-evasion
- attack.t1562.001
logsource:
  product: windows
  service: security
  definition: 'Requirements: Audit Policy : Security Settings/Local Policies/Audit
    Policy, Registry System Access Control (SACL): Auditing/User'
detection:
  selection:
    AccessList|contains:
    - '%%4417'         # WriteData
    - '%%4418'         # AppendData
    EventID:
    - 4656         # A handle to an object was requested.
    - 4663         # An attempt was made to access an object.
    ObjectName|contains: '\Microsoft\Windows Defender\Exclusions\'
  condition: selection
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  This Sigma rule aims to detect unauthorized access attempts to Windows Defender exclusion registry keys, specifically looking for write access requests. The rule monitors Windows security event logs, particularly Event IDs 4656 (handle requested) and 4663 (attempt to access an object). These events are triggered when an entity attempts to access or modify an object, such as registry keys. The key focus is on paths that include `\Microsoft\Windows Defender\Exclusions\`, as attackers may exploit this area to add new exclusions and bypass security measures provided by Windows Defender.
  To determine if a potential security incident is occurring, the rule checks for specific Access Rights (WriteData and AppendData) within the access list of these registry keys. If any events match the specified criteria, they may indicate an attempt by a threat actor to disable or evade security controls, prompting an investigation.
  ### Investigation Steps
  - Review the Windows security event logs for Event IDs 4656 and 4663 to identify any suspicious write attempts to the Defender exclusions registry keys.
  - Analyze the EDR logs for related processes that may have initiated these registry write requests, particularly focusing on any unfamiliar or unauthorized applications.
  - Correlate the events with proxy and VPN logs to ensure there are no unusual or unexpected external connections corresponding to the access attempts.
  - Check for other related security alerts, such as those from your AV or NGFW, to gain additional context on the activities surrounding the write access requests.
