title: Remote Service Activity via SVCCTL Named Pipe
id: 586a8d6b-6bfe-4ad9-9d78-888cd2fe50c3
status: test
description: Detects remote service activity via remote access to the svcctl named
  pipe
references:
- https://web.archive.org/web/20230329155141/https://blog.menasec.net/2019/03/threat-hunting-26-remote-windows.html
author: Samir Bousseaden
date: 2019-04-03
modified: 2024-08-01
tags:
- attack.lateral-movement
- attack.persistence
- attack.t1021.002
logsource:
  product: windows
  service: security
  definition: 'The advanced audit policy setting "Object Access > Audit Detailed File
    Share" must be configured for Success/Failure'
detection:
  selection:
    EventID: 5145
    ShareName: '\\\\\*\\IPC$'     # looking for the string \\*\IPC$
    RelativeTargetName: svcctl
    AccessList|contains: 'WriteData'
  condition: selection
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  This Sigma rule is designed to detect unauthorized remote service activity by monitoring access to the `svcctl` named pipe on Windows systems. It specifically looks for Security Event ID 5145, which indicates file share access events. The rule targets attempts to write data (`WriteData`) to the `svcctl` named pipe via the IPC$ share, which is often exploited for remote service control and lateral movement in an enterprise environment. The detection relies on the "Audit Detailed File Share" advanced audit policy being enabled, ensuring that relevant security logs are collected through the Windows Security event logs.
  ### Investigation Steps
  - Use your EDR solution to review the system's process execution history around the time of the alert to identify unusual or unauthorized processes interacting with the `svcctl` named pipe.
  - Analyze Windows Event Logs for Event ID 5145 to find related access events that match the alert parameters, focusing on the user and machine involved in the remote access attempt.
  - Examine network traffic logs via your NDR tools to determine if there were any suspicious or unexpected connections to the impacted system, particularly from remote sources.
  - Cross-reference the access events with Active Directory logs to check if the initiating user has appropriate permissions or if their credentials may have been misused.
