title: Enabled User Right in AD to Control User Objects
id: 311b6ce2-7890-4383-a8c2-663a9f6b43cd
status: test
description: Detects scenario where if a user is assigned the SeEnableDelegationPrivilege
  right in Active Directory it would allow control of other AD user objects.
references:
- https://blog.harmj0y.net/activedirectory/the-most-dangerous-user-right-you-probably-have-never-heard-of/
author: '@neu5ron'
date: 2017-07-30
modified: 2021-12-02
tags:
- attack.persistence
- attack.t1098
logsource:
  product: windows
  service: security
  definition: 'Requirements: Audit Policy : Policy Change > Audit Authorization Policy
    Change, Group Policy : Computer Configuration\Windows Settings\Security Settings\Advanced
    Audit Policy Configuration\Audit Policies\Policy Change\Audit Authorization Policy
    Change'
detection:
  selection_base:
    EventID: 4704
  selection_keywords:
    PrivilegeList|contains: 'SeEnableDelegationPrivilege'
  condition: all of selection*
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This Sigma rule is designed to detect assignments of the `SeEnableDelegationPrivilege` user right in Active Directory (AD). When this privilege is granted, it allows a user to control other AD user objects, raising significant security concerns if assigned improperly. The rule monitors Event ID 4704, which captures changes to user rights assignments, specifically filtering for instances where the `PrivilegeList` field includes the `SeEnableDelegationPrivilege`. This logging is contingent on the active audit policy settings, specifically the Audit Policy for Authorization Policy Changes. Responders should pay careful attention to alerts generated by this rule, as improper configuration of this privilege could lead to unauthorized access and privilege escalation within the AD environment.
  ### Investigation Steps
  - Review the relevant Event ID 4704 logs in the Windows Security log to identify any recent changes to user rights and filter for the `SeEnableDelegationPrivilege`.
  - Utilize EDR tools to investigate the user account's activity surrounding the assignment of this privilege, looking for anomalous behavior or unauthorized actions.
  - Check the Active Directory user object's history and properties to determine if multiple modifications occurred within a short time frame, which may indicate malicious intent.
  - Analyze additional logs from supporting systems like VPN and Proxy to gather context on user actions leading up to and following the assignment of this privilege.
