title: Meterpreter or Cobalt Strike Getsystem Service Installation - Security
id: ecbc5e16-58e0-4521-9c60-eb9a7ea4ad34
related:
- id: 843544a7-56e0-4dcc-a44f-5cc266dd97d6
  type: derived
status: test
description: Detects the use of getsystem Meterpreter/Cobalt Strike command by detecting
  a specific service installation
references:
- https://speakerdeck.com/heirhabarov/hunting-for-privilege-escalation-in-windows-environment
- https://blog.cobaltstrike.com/2014/04/02/what-happens-when-i-type-getsystem/
author: Teymur Kheirkhabarov, Ecco, Florian Roth (Nextron Systems)
date: 2019-10-26
modified: 2023-11-15
tags:
- attack.privilege-escalation
- attack.t1134.001
- attack.t1134.002
logsource:
  product: windows
  service: security
  definition: The 'System Security Extension' audit subcategory need to be enabled
    to log the EID 4697
detection:
  selection_eid:
    EventID: 4697
  selection_cli_cmd:
        # meterpreter getsystem technique 1: cmd.exe /c echo 559891bb017 > \\.\pipe\5e120a
        # cobaltstrike getsystem technique 1: %COMSPEC% /c echo 559891bb017 > \\.\pipe\5e120a
        # cobaltstrike getsystem technique 1b (expanded %COMSPEC%): %COMSPEC% /c echo 559891bb017 > \\.\pipe\5e120a
    ServiceFileName|contains|all:
    - '/c'
    - 'echo'
    - '\pipe\'
    ServiceFileName|contains:
    - 'cmd'
    - '%COMSPEC%'
  selection_cli_rundll:
        # meterpreter getsystem technique 2: rundll32.exe C:\Users\test\AppData\Local\Temp\tmexsn.dll,a /p:tmexsn
    ServiceFileName|contains|all:
    - 'rundll32'
    - '.dll,a'
    - '/p:'
  selection_cli_share:
    ServiceFileName|startswith: '\\\\127.0.0.1\\ADMIN$\'      # https://twitter.com/svch0st/status/1413688851877416960?lang=en
  condition: selection_eid and 1 of selection_cli_*
falsepositives:
- Unlikely
level: high
notes: |
  ### Technical Context
  This detection rule aims to identify the usage of the `getsystem` command commonly associated with Meterpreter and Cobalt Strike, both tools used for privilege escalation in a Windows environment. The rule focuses on logging events related to the installation of services, specifically Event ID 4697, which captures the creation of a new service. It analyzes command-line parameters that might indicate malicious activity, specifically looking for patterns that suggest the execution of commands through `cmd.exe` or `rundll32.exe` involving named pipes or dynamically loaded .dll files. By correlating these command-line patterns with the service installation events, the rule can effectively pinpoint potential unauthorized privilege escalation attempts.
  ### Investigation Steps
  - Leverage your EDR solution to retrieve details about the process that triggered Event ID 4697, specifically focusing on the command-line arguments executed during the relevant timeframe.
  - Utilize AV logs to check for detections related to known malicious patterns typically associated with Meterpreter or Cobalt Strike activities.
  - Examine security logs on the Windows host for other suspicious activities around the same timeframe, such as unexpected user account activity or related service installations.
  - Review network traffic logs from the NGFW and NDR tools for any unusual connections to remote hosts, particularly those involving known Cobalt Strike command-and-control addresses.
