title: Processes Accessing the Microphone and Webcam
id: 8cd538a4-62d5-4e83-810b-12d41e428d6e
status: test
description: Potential adversaries accessing the microphone and webcam in an endpoint.
references:
- https://twitter.com/duzvik/status/1269671601852813320
- https://medium.com/@7a616368/can-you-track-processes-accessing-the-camera-and-microphone-7e6885b37072
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
date: 2020-06-07
modified: 2021-11-27
tags:
- attack.collection
- attack.t1123
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID:
    - 4657
    - 4656
    - 4663
    ObjectName|contains:
    - '\SOFTWARE\Microsoft\Windows\CurrentVersion\CapabilityAccessManager\ConsentStore\microphone\NonPackaged'
    - '\SOFTWARE\Microsoft\Windows\CurrentVersion\CapabilityAccessManager\ConsentStore\webcam\NonPackaged'
  condition: selection
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  This detection rule is designed to identify potential unauthorized access to a system's microphone and webcam by monitoring specific Windows event logs. The rule focuses on Event IDs 4656, 4657, and 4663, which record access attempts, including ongoing operations involving the microphone and webcam ConsentStore paths. By analyzing these events, the rule can reveal instances where processes may be trying to access sensitive hardware without user consent, thus indicating potential surveillance or privacy breaches. Investigators should note that legitimate applications may also trigger these alerts, necessitating further examination to distinguish between benign and malicious activities.
  ### Investigation Steps
  - Review the alerts in your SIEM tool to identify the specific processes that accessed the microphone or webcam, as indicated by the recorded Event IDs.
  - Utilize EDR solutions to investigate the behavior and reputation of the processes that triggered the alerts, checking for any signs of unusual or malicious activity.
  - Cross-reference the access attempts with firewall logs to see if any unauthorized network connections were made while the microphone or webcam was accessed.
  - Examine user activity logs and application usage to determine if the access coincides with legitimate usage patterns or if there are anomalies that warrant deeper investigation.
