title: Possible Impacket SecretDump Remote Activity
id: 252902e3-5830-4cf6-bf21-c22083dfd5cf
status: test
description: Detect AD credential dumping using impacket secretdump HKTL
references:
- https://web.archive.org/web/20230329153811/https://blog.menasec.net/2019/02/threat-huting-10-impacketsecretdump.html
author: Samir Bousseaden, wagga
date: 2019-04-03
modified: 2022-08-11
tags:
- attack.credential-access
- attack.t1003.002
- attack.t1003.004
- attack.t1003.003
logsource:
  product: windows
  service: security
  definition: 'The advanced audit policy setting "Object Access > Audit Detailed File
    Share" must be configured for Success/Failure'
detection:
  selection:
    EventID: 5145
    ShareName: '\\\\\*\\ADMIN$'      # looking for the string  \\*\ADMIN$
    RelativeTargetName|contains|all:
    - 'SYSTEM32\'
    - '.tmp'
  condition: selection
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This detection rule identifies potential credential dumping activities through the use of Impacket's `secretdump` tool, which targets Active Directory environments. Specifically, it looks for Security Event ID 5145, indicating access to shared folders, particularly the ADMIN$ administrative share. The rule further refines its search by examining the files accessed during these events, focusing on those located within the SYSTEM32 directory and temporary files with a .tmp extension. These criteria serve as indicators of attempts to extract credentials from the system. The underlying data sources include Windows Security logs configured to track both successful and failed accesses to file shares, ensuring that any unauthorized or unexpected access attempts can be flagged for review.
  ### Investigation Steps
  - Review EDR logs for the host in question to identify any suspicious process activity around the time of the alert, focusing on processes related to Impacket and their command-line arguments.
  - Investigate recent connections to the ADMIN$ share using Windows Event Logs, specifically filtering for Event ID 5145 to track the users and actions that occurred during the timeframe of interest.
  - Check for any additional alerts or indicators from AV and EDR tools that could reveal malicious behavior or known signatures associated with credential dumping activities.
  - Search through proxy logs for outbound traffic that may have originated from the affected host, particularly focusing on any unusual connections or uploads that coincide with the detected activity.
