title: Service Installed By Unusual Client - Security
id: c4e92a97-a9ff-4392-9d2d-7a4c642768ca
related:
- id: 71c276aa-49cd-43d2-b920-2dcd3e6962d5
  type: similar
status: test
description: Detects a service installed by a client which has PID 0 or whose parent
  has PID 0
references:
- https://www.elastic.co/guide/en/security/current/windows-service-installed-via-an-unusual-client.html
- https://www.x86matthew.com/view_post?id=create_svc_rpc
- https://twitter.com/SBousseaden/status/1490608838701166596
author: Tim Rauch (Nextron Systems), Elastic (idea)
date: 2022-09-15
modified: 2023-01-04
tags:
- attack.privilege-escalation
- attack.t1543
logsource:
  service: security
  product: windows
  definition: 'Requirements: The System Security Extension audit subcategory need
    to be enabled to log the EID 4697'
detection:
  selection_eid:
    EventID: 4697
  selection_pid:
  - ClientProcessId: 0
  - ParentProcessId: 0
  condition: all of selection_*
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This detection rule identifies instances where a Windows service is installed by an unusual client process, specifically looking for cases where the client or its parent process has a Process ID (PID) of 0. In Windows, a PID of 0 is typically indicative of system-level processes which should not be directly involved in service creation. The rule leverages security event logs and focuses on Event ID 4697, which is generated when a new service is installed. Analysts need to be aware that services installed by unfamiliar or unexpected processes may signify attempts at privilege escalation or other malicious activities.
  The primary data sources involved are Windows security logs that capture service installations, alongside process creation logs that document the associated clients. By analyzing these events, incident responders can detect potentially suspicious behavior indicative of malware or unauthorized actions seeking to exploit system vulnerabilities.
  ### Investigation Steps
  - Review Windows Event Log for Event ID 4697 to confirm the installation of a new service and identify the corresponding ClientProcessId and ParentProcessId.
  - Use an Endpoint Detection and Response (EDR) tool to examine the behavior of the identified process, ensuring it is not malicious and does not exhibit unexpected patterns.
  - Check for any related logs in the firewall (NGFW) or proxy to track outbound connections initiated by the service or its parent process, which may reveal further malicious intent.
  - Analyze additional context from other security tools like Antivirus (AV) solutions to see if the client or parent process has been flagged for suspicious activity or is known to be malicious.
