title: Active Directory User Backdoors
id: 300bac00-e041-4ee2-9c36-e262656a6ecc
status: test
description: Detects scenarios where one can control another users or computers account
  without having to use their credentials.
references:
- https://msdn.microsoft.com/en-us/library/cc220234.aspx
- https://adsecurity.org/?p=3466
- https://blog.harmj0y.net/redteaming/another-word-on-delegation/
author: '@neu5ron'
date: 2017-04-13
modified: 2024-02-26
tags:
- attack.t1098
- attack.persistence
logsource:
  product: windows
  service: security
  definition: 'Requirements: Audit Policy : Account Management > Audit User Account
    Management, Group Policy : Computer Configuration\Windows Settings\Security Settings\Advanced
    Audit Policy Configuration\Audit Policies\Account Management\Audit User Account
    Management, DS Access > Audit Directory Service Changes, Group Policy : Computer
    Configuration\Windows Settings\Security Settings\Advanced Audit Policy Configuration\Audit
    Policies\DS Access\Audit Directory Service Changes'
detection:
  selection1:
    EventID: 4738
  filter_empty:
    AllowedToDelegateTo:
    - ''
    - '-'
  filter_null:
    AllowedToDelegateTo:
  selection_5136_1:
    EventID: 5136
    AttributeLDAPDisplayName: 'msDS-AllowedToDelegateTo'
  selection_5136_2:
    EventID: 5136
    ObjectClass: 'user'
    AttributeLDAPDisplayName: 'servicePrincipalName'
  selection_5136_3:
    EventID: 5136
    AttributeLDAPDisplayName: 'msDS-AllowedToActOnBehalfOfOtherIdentity'
  condition: (selection1 and not 1 of filter_*) or 1 of selection_5136_*
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  The "Active Directory User Backdoors" detection rule is designed to identify scenarios where users are granted excessive permissions in Active Directory (AD), specifically in relation to delegation capabilities. It primarily focuses on events associated with user account management and directory service changes. The rule looks for Event IDs 4738 and 5136 that signal updates to user attributes related to delegation, such as `msDS-AllowedToDelegateTo` and `msDS-AllowedToActOnBehalfOfOtherIdentity`. Anomalies are flagged when these attributes are modified without legitimate entries or when a user account is configured to delegate access improperly, allowing potential unauthorized control over another user's or computer's account.
  To effectively use this rule, organizations need to ensure proper auditing is enabled, capturing significant events related to account management and directory service changes. The key data sources include Windows Security logs that record account management actions and changes made within the Active Directory environment, supplemented by Group Policy configurations.
  ### Investigation Steps
  - Review the relevant Windows Security logs, focusing on Event ID 4738 and any associated Event ID 5136 entries, to confirm the attributes that have been changed and the context of those changes.
  - Check for any user accounts that exhibit empty or null values in the `AllowedToDelegateTo` attribute, as this may signify a misconfiguration or malicious activity.
  - Investigate the history of the affected accounts by cross-referencing AD group memberships and permissions, looking for any unauthorized modifications or access rights granted to these users.
  - Utilize EDR tools to assess the behavior of the accounts involved, looking for signs of lateral movement or potential misuse indicating compromise given their altered permissions.
