title: Suspicious Kerberos RC4 Ticket Encryption
id: 496a0e47-0a33-4dca-b009-9e6ca3591f39
status: test
description: Detects service ticket requests using RC4 encryption type
references:
- https://adsecurity.org/?p=3458
- https://www.trimarcsecurity.com/single-post/TrimarcResearch/Detecting-Kerberoasting-Activity
author: Florian Roth (Nextron Systems)
date: 2017-02-06
modified: 2022-06-19
tags:
- attack.credential-access
- attack.t1558.003
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 4769
    TicketOptions: '0x40810000'
    TicketEncryptionType: '0x17'
  reduction:
    ServiceName|endswith: '$'
  condition: selection and not reduction
falsepositives:
- Service accounts used on legacy systems (e.g. NetApp)
- Windows Domains with DFL 2003 and legacy systems
level: medium
notes: |
  ### Technical Context
  This detection rule is designed to identify suspicious Kerberos service ticket requests that utilize RC4 encryption, indicated by specific event parameters in Windows security logs. The rule leverages EventID 4769, which records Kerberos ticket-granting service (TGS) requests, specifically filtering for requests where the `TicketOptions` indicates service tickets and the `TicketEncryptionType` matches the value assigned to RC4 (0x17). In addition, the rule refines this search to exclude legitimate service accounts on legacy systems by requiring that the service name ends with a dollar sign ($), a common convention for machine accounts and services. When the conditions of this rule are met, it may indicate a potential Kerberoasting attack, an exploitation technique where attackers request service tickets to extract hashed credentials.
  ### Investigation Steps
  - Review the logs captured by the Windows EDR to identify the specific accounts making the RC4 ticket requests and correlate them with known service accounts.
  - Check the activity around the affected service names in the SIEM to assess local and network traffic patterns for suspicious behavior or lateral movement attempts.
  - Analyze the command-line arguments and process creation logs on impacted systems to discern whether any unauthorized access or credential-harvesting tools were executed.
  - Cross-reference with other security controls, such as AV logs and proxy logs, to identify any related activities or anomalies that may indicate broader compromise efforts.
