title: Windows Network Access Suspicious desktop.ini Action
id: 35bc7e28-ee6b-492f-ab04-da58fcf6402e
status: test
description: Detects unusual processes accessing desktop.ini remotely over network
  share, which can be leveraged to alter how Explorer displays a folder's content
  (i.e. renaming files) without changing them on disk.
references:
- https://isc.sans.edu/forums/diary/Desktopini+as+a+postexploitation+tool/25912/
author: Tim Shelton (HAWK.IO)
date: 2021-12-06
modified: 2022-01-16
tags:
- attack.persistence
- attack.t1547.009
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 5145
    ObjectType: File
    RelativeTargetName|endswith: '\desktop.ini'
    AccessList|contains:
    - 'WriteData'
    - 'DELETE'
    - 'WriteDAC'
    - 'AppendData'
    - 'AddSubdirectory'
  condition: selection
falsepositives:
- Read only access list authority
level: medium
notes: |
  ### Technical Context
  This Sigma rule is designed to detect suspicious access to the `desktop.ini` file over a network share from unusual processes on Windows systems. The `desktop.ini` file is a configuration file that can be manipulated to change how Windows Explorer displays the contents of a folder without altering the underlying files. This type of behavior may indicate that a malicious actor is attempting to exploit the `desktop.ini` file as part of a post-exploitation persistence technique. The rule specifically looks for Windows Security Event ID 5145, which documents file access activities, focusing on operations where processes are trying to write to, delete, append, or create subdirectories related to the `desktop.ini` file. 
  The detection leverages the information provided by Windows event logs, particularly those related to file system access, making it particularly effective for identifying potentially nefarious actions that could allow unauthorized changes in folder presentation.
  ### Investigation Steps
  - Review the EDR logs to identify the processes that accessed the `desktop.ini` file, paying close attention to the user context and associated command-line parameters.
    
  - Check the timeline of the access event in SIEM, correlating it with other related events, such as process creations or network connections from the same timestamp.
  - Examine file access logs from network shares using Proxy or local file access insights to determine if the access originated from a legitimate user or an unauthorized entity.
  - Investigate the integrity of the `desktop.ini` file against expected baselines using file integrity monitoring tools to identify any unauthorized changes or anomalies.
