title: Win Susp Computer Name Containing Samtheadmin
id: 39698b3f-da92-4bc6-bfb5-645a98386e45
status: test
description: Detects suspicious computer name samtheadmin-{1..100}$ generated by hacktool
references:
- https://twitter.com/malmoeb/status/1511760068743766026
- https://github.com/WazeHell/sam-theadmin/blob/main/sam_the_admin.py
- https://github.com/helloexp/0day/blob/614227a7b9beb0e91e7e2c6a5e532e6f7a8e883c/00-CVE_EXP/CVE-2021-42287/sam-the-admin/sam_the_admin.py
author: elhoim
date: 2022-09-09
modified: 2023-01-04
tags:
- cve.2021-42278
- cve.2021-42287
- attack.persistence
- attack.privilege-escalation
- attack.t1078
logsource:
  service: security
  product: windows
detection:
    # Not adding an EventID on purpose to try to match on any event in security (including use of account), not just 4741 (computer account created)
  selection1:
    SamAccountName|startswith: 'SAMTHEADMIN-'
    SamAccountName|endswith: '$'
  selection2:
    TargetUserName|startswith: 'SAMTHEADMIN-'
    TargetUserName|endswith: '$'
  condition: 1 of selection*
fields:
- EventID
- SamAccountName
- SubjectUserName
- TargetUserName
falsepositives:
- Unknown
level: critical
notes: |
  ### Technical Context
  This Sigma rule is designed to detect suspicious computer names that follow the naming convention "SAMTHEADMIN-{1..100}$," which indicates a pattern often generated by exploit tools such as hacktools. The focus is on identifying these names within Windows security logs, specifically looking for attributes called `SamAccountName` and `TargetUserName`. The rule checks whether these attributes start with 'SAMTHEADMIN-' and end with a dollar sign, which is typical for machine accounts in Windows environments. Detecting such patterns may indicate attempts at privilege escalation or persistence mechanisms employed by attackers.
  The log source for this detection is primarily based on Windows security event logs, enabling analysts to monitor for the creation or use of malicious accounts typically leveraged for unauthorized access. This rule can aid in early detection of threats that may lead to greater security incidents.
  ### Investigation Steps
  - Review recent Windows security logs, focusing on events related to account creation or access, to identify any entries that match the naming pattern "SAMTHEADMIN-*".
  - Utilize EDR tools to examine the process execution history of accounts that match the suspicious naming convention for any unusual activity leading up to the alert.
  - Check AV logs for any detections or alerts related to the use of hacktools or other malicious software associated with the creation of the named accounts.
  - Query cloud platform logs (if applicable) to investigate any remote access attempts or unusual logins tied to the compromised accounts, especially from unfamiliar IP addresses or geographic locations.
