title: NetNTLM Downgrade Attack
id: d3abac66-f11c-4ed0-8acb-50cc29c97eed
related:
- id: d67572a0-e2ec-45d6-b8db-c100d14b8ef2
  type: derived
status: test
description: Detects NetNTLM downgrade attack
references:
- https://www.optiv.com/blog/post-exploitation-using-netntlm-downgrade-attacks
author: Florian Roth (Nextron Systems), wagga
date: 2018-03-20
modified: 2022-10-09
tags:
- attack.defense-evasion
- attack.t1562.001
- attack.t1112
# Windows Security Eventlog: Process Creation with Full Command Line
logsource:
  product: windows
  service: security
  definition: 'Requirements: Audit Policy : Object Access > Audit Registry (Success)'
detection:
  selection:
    EventID: 4657
    ObjectName|contains|all:
    - '\REGISTRY\MACHINE\SYSTEM'
    - 'ControlSet'
    - '\Control\Lsa'
    ObjectValueName:
    - 'LmCompatibilityLevel'
    - 'NtlmMinClientSec'
    - 'RestrictSendingNTLMTraffic'
  condition: selection
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  The "NetNTLM Downgrade Attack" rule is designed to detect potential downgrading of security protocols in Windows environments related to NetNTLM authentication. This attack typically involves manipulating registry settings associated with the Windows local security authority (LSA) that control the minimum security levels for NTLM, such as `LmCompatibilityLevel`, `NtlmMinClientSec`, and `RestrictSendingNTLMTraffic`. By monitoring Windows Security Event Log entries with Event ID 4657, this rule identifies changes to registry keys that may exacerbate security vulnerabilities, allowing for less secure authentication mechanisms. Such downgrades can facilitate unauthorized access and exploitation of network resources.
  ### Investigation Steps
  Investigate the log entries corresponding to Event ID 4657 for any unauthorized changes made to the registry keys associated with NTLM security.
  Correlate the timestamp of any modifications with user activity logs in the EDR to identify any suspicious behavior in the environment.
  Check the status of the affected systems through the NGFW or endpoint solutions for signs of ongoing or past attacks tied to the detected modifications.
  Review proxy logs for any anomalous authentication attempts or network connections that may indicate exploitation of the downgraded security settings.
