title: Mimikatz DC Sync
id: 611eab06-a145-4dfa-a295-3ccc5c20f59a
status: test
description: Detects Mimikatz DC sync security events
references:
- https://twitter.com/gentilkiwi/status/1003236624925413376
- https://gist.github.com/gentilkiwi/dcc132457408cf11ad2061340dcb53c2
- https://blog.blacklanternsecurity.com/p/detecting-dcsync?s=r
- https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-10/security/threat-protection/auditing/event-4662
author: Benjamin Delpy, Florian Roth (Nextron Systems), Scott Dermott, Sorina Ionescu
date: 2018-06-03
modified: 2022-04-26
tags:
- attack.credential-access
- attack.s0002
- attack.t1003.006
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 4662
    Properties|contains:
    - 'Replicating Directory Changes All'
    - '1131f6ad-9c07-11d1-f79f-00c04fc2dcd2'
    - '1131f6aa-9c07-11d1-f79f-00c04fc2dcd2'
    - '9923a32a-3607-11d2-b9be-0000f87a36b2'
    - '89e95b76-444d-4c62-991a-0facbeda640c'
    AccessMask: '0x100'
  filter1:
    SubjectDomainName: 'Window Manager'
  filter2:
    SubjectUserName|startswith:
    - 'NT AUT'
    - 'MSOL_'
  filter3:
    SubjectUserName|endswith: '$'
  condition: selection and not 1 of filter*
falsepositives:
- Valid DC Sync that is not covered by the filters; please report
- Local Domain Admin account used for Azure AD Connect
level: high
notes: |
  ### Technical Context
  The "Mimikatz DC Sync" detection rule is designed to identify potential misuse of Mimikatz, a well-known tool for credential extraction and manipulation, particularly in relation to Active Directory (AD) environments. This rule specifically looks for Windows Security Event ID 4662, which indicates events related to the modification of directory objects. The detection logic focuses on specific properties that suggest an unauthorized or malicious attempt to replicate directory changes, including certain GUIDs that are typical in DC sync operations and an access mask indicative of high privileges. The filtered conditions target accounts often associated with automated services but exclude legitimate instances to reduce false positives.
  Data sources utilized for this detection include Windows security logs that capture events generated by the operating system regarding access and modifications to Active Directory objects. By analyzing these logs, the SOC can quickly identify potential compromises of domain controllers or unauthorized access to sensitive domain data.
  ### Investigation Steps
  - Review the Security Event logs in your EDR for Event ID 4662 that triggered this alert, focusing on the details of the event such as the user account and the properties mentioned in the detection rule.
  - Investigate the account listed in the alert; check if it is a service account or a domain administrative account to determine if the access was inherently legitimate or suspicious.
  - Use the Proxy logs to see if there were any unusual or unexpected external connections from the subject user around the time of the event, as this may provide further context.
  - Verify the account's recent activities against Azure AD logs, specifically for any changes to replication settings or unexpected sign-ins, to assess if there are deeper implications of a potential compromise.
