title: Possible Shadow Credentials Added
id: f598ea0c-c25a-4f72-a219-50c44411c791
status: test
description: Detects possible addition of shadow credentials to an active directory
  object.
references:
- https://www.elastic.co/guide/en/security/8.4/potential-shadow-credentials-added-to-ad-object.html
- https://cyberstoph.org/posts/2022/03/detecting-shadow-credentials/
- https://twitter.com/SBousseaden/status/1581300963650187264?
author: Nasreddine Bencherchali (Nextron Systems), Elastic (idea)
date: 2022-10-17
tags:
- attack.credential-access
- attack.t1556
logsource:
  product: windows
  service: security
  definition: The "Audit Directory Service Changes" logging policy must be configured
    in order to receive events. Audit events are generated only for objects with configured
    system access control lists (SACLs). Audit events are generated only for objects
    with configured system access control lists (SACLs) and only when accessed in
    a manner that matches their SACL settings. This policy covers the following events
    ids - 5136, 5137, 5138, 5139, 5141. Note that the default policy does not cover
    User objects. For that a custom AuditRule need to be setup (See https://github.com/OTRF/Set-AuditRule)
detection:
  selection:
    EventID: 5136
    AttributeLDAPDisplayName: 'msDS-KeyCredentialLink'
        # If you experience a lot of FP you could uncomment the selection below
        # There could be other cases for other tooling add them accordingly
        # AttributeValue|contains: 'B:828'
        # OperationType: '%%14674' # Value Added
    # As stated in the FP sections it's better to filter out the expected accounts that perform this operation to tighten the logic
    # Uncomment the filter below and add the account name (or any other specific field) accordingly
    # Don't forget to add it to the condition section below
    # filter:
        # SubjectUserName: "%name%"
  condition: selection
falsepositives:
- Modifications in the msDS-KeyCredentialLink attribute can be done legitimately by
  the Azure AD Connect synchronization account or the ADFS service account. These
  accounts can be added as Exceptions. (From elastic FP section)
level: high
notes: |
  ### Technical Context
  The Sigma rule titled "Possible Shadow Credentials Added" is designed to detect unauthorized modifications to Active Directory objects, specifically targeting the `msDS-KeyCredentialLink` attribute. This attribute is used for storing key credentials associated with an Active Directory object, and changes to it can indicate the addition of shadow credentials—a method where attackers can create alternative access vectors to gain unauthorized entry into systems. The rule triggers on specific Windows Security Event IDs, particularly Event ID 5136, which logs updates to directory services when modifications are made. For effective detection, it is imperative that the "Audit Directory Service Changes" policy is enforced within the Windows security settings to ensure that relevant audit events are logged.
  The data sources involved in this detection include security logs from Windows, specifically event logs that capture directory service changes. Investigators should ensure that the relevant system access control lists (SACLs) are configured to generate appropriate audit events. This rule serves as an essential alert mechanism when unusual changes to the key credential links are detected, prompting a deeper investigation into potential unauthorized access.
  ### Investigation Steps
  - Review the Windows security event logs for Event ID 5136, focusing on entries that indicate changes to the `msDS-KeyCredentialLink` attribute.
  - Utilize your EDR tool to investigate the context surrounding the detected events, including user activity patterns and any associated process executions.
  - Cross-reference changes with known legitimate users and service accounts, such as the Azure AD Connect synchronization account, to rule out false positives.
  - Assess relevant logs from Active Directory and any connected applications or services to establish the timeline and potential impact of the detected modifications.
