title: Password Protected ZIP File Opened (Suspicious Filenames)
id: 54f0434b-726f-48a1-b2aa-067df14516e4
status: test
description: Detects the extraction of password protected ZIP archives with suspicious
  file names. See the filename variable for more details on which file has been opened.
references:
- https://twitter.com/sbousseaden/status/1523383197513379841
author: Florian Roth (Nextron Systems)
date: 2022-05-09
tags:
- attack.command-and-control
- attack.defense-evasion
- attack.t1027
- attack.t1105
- attack.t1036
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 5379
    TargetName|contains: 'Microsoft_Windows_Shell_ZipFolder:filename'
  selection_filename:
    TargetName|contains:
    - 'invoice'
    - 'new order'
    - 'rechnung'
    - 'factura'
    - 'delivery'
    - 'purchase'
    - 'order'
    - 'payment'
  condition: selection and selection_filename
falsepositives:
- Legitimate used of encrypted ZIP files
level: high
notes: |
  ### Technical Context
  This detection rule identifies the opening of password-protected ZIP files that contain suspicious filenames. The rule utilizes Windows Security event logs, specifically EventID 5379, which trigger when a ZIP file is accessed through the Microsoft Windows Shell ZIP folder functionality. The rule is sensitive to filenames that often correlate with common business transactions, such as "invoice," "payment," or "order." These terms might be leveraged by attackers to masquerade malicious files within potentially legitimate communications, thereby evading traditional detection mechanisms. By targeting specific keywords in filenames while monitoring the associated EventID, the SOC can discern potentially malicious ZIP file access that requires further investigation.
  ### Investigation Steps
  - Review the EDR logs for any processes initiated as a result of the password-protected ZIP file being accessed to ascertain if any malicious behaviors are triggered.
  - Utilize SIEM to search for any previous alerts related to the same user or system that may indicate prior malicious activity, as this can reveal a pattern of behavior.
  - Check the file metadata and attributes in the file system to determine if the ZIP file is part of a larger campaign or is linked to known threat actors.
  - Analyze Proxy logs for any outbound connections made after the ZIP file was opened; this may indicate a command-and-control (C2) interaction or data exfiltration attempt.
