title: Security Eventlog Cleared
id: d99b79d2-0a6f-4f46-ad8b-260b6e17f982
related:
- id: f2f01843-e7b8-4f95-a35a-d23584476423
  type: obsolete
- id: a122ac13-daf8-4175-83a2-72c387be339d
  type: obsolete
status: test
description: One of the Windows Eventlogs has been cleared. e.g. caused by "wevtutil
  cl" command execution
references:
- https://twitter.com/deviouspolack/status/832535435960209408
- https://www.hybrid-analysis.com/sample/027cc450ef5f8c5f653329641ec1fed91f694e0d229928963b30f6b0d7d3a745?environmentId=100
- https://github.com/Azure/Azure-Sentinel/blob/f99542b94afe0ad2f19a82cc08262e7ac8e1428e/Detections/SecurityEvent/SecurityEventLogCleared.yaml
author: Florian Roth (Nextron Systems)
date: 2017-01-10
modified: 2022-02-24
tags:
- attack.defense-evasion
- attack.t1070.001
- car.2016-04-002
logsource:
  product: windows
  service: security
detection:
  selection_517:
    EventID: 517
    Provider_Name: Security
  selection_1102:
    EventID: 1102
    Provider_Name: Microsoft-Windows-Eventlog
  condition: 1 of selection_*
falsepositives:
- Rollout of log collection agents (the setup routine often includes a reset of the
  local Eventlog)
- System provisioning (system reset before the golden image creation)
level: high
notes: |
  ### Technical Context
  This Sigma rule is designed to detect instances where Windows security event logs have been cleared, which can be indicative of malicious activity aimed at obfuscating traces of unauthorized actions. The rule specifically looks for Event ID 517 (indicating a security log clearing event) and Event ID 1102 (which signifies that the event log service has been cleared) from the Windows security log sources. The underlying mechanism involves monitoring for these Events from the Windows Event Log service, particularly focusing on the "Provider_Name" fields that specify they originate from security-related actions. By tracking these events, security analysts can identify potential attempts at log tampering that may accompany other malicious activities.
  ### Investigation Steps
  - Utilize your EDR solution to examine recent processes and identify any commands related to log clearance, such as "wevtutil cl", executed around the time of the event.
  - Cross-reference logged Events (Event ID 517 and Event ID 1102) against authentication logs to check for unusual login patterns or connections that may indicate unauthorized access.
  - Review supplemental logs from your SIEM for any associated alerting incidents or anomalous activity surrounding the time of the log clearance.
  - Investigate the configurations of security log settings in the Windows environment to verify if any legitimate business processes (like agent rollouts or provisioning) could explain the clearing of event logs.
