title: Suspicious Scheduled Task Creation
id: 3a734d25-df5c-4b99-8034-af1ddb5883a4
status: test
description: Detects suspicious scheduled task creation events. Based on attributes
  such as paths, commands line flags, etc.
references:
- https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-10/security/threat-protection/auditing/event-4698
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-12-05
modified: 2022-12-07
tags:
- attack.execution
- attack.privilege-escalation
- attack.persistence
- attack.t1053.005
logsource:
  product: windows
  service: security
  definition: 'The Advanced Audit Policy setting Object Access > Audit Other Object
    Access Events has to be configured to allow this detection. We also recommend
    extracting the Command field from the embedded XML in the event data.'
detection:
  selection_eid:
    EventID: 4698
  selection_paths:
    TaskContent|contains:
    - '\AppData\Local\Temp\'
    - '\AppData\Roaming\'
    - '\Users\Public\'
    - '\WINDOWS\Temp\'
    - 'C:\Temp\'
    - '\Desktop\'
    - '\Downloads\'
    - '\Temporary Internet'
    - 'C:\ProgramData\'
    - 'C:\Perflogs\'
  selection_commands:
    TaskContent|contains:
    - 'regsvr32'
    - 'rundll32'
    - 'cmd.exe</Command>'
    - 'cmd</Command>'
    - '<Arguments>/c '
    - '<Arguments>/k '
    - '<Arguments>/r '
    - 'powershell'
    - 'pwsh'
    - 'mshta'
    - 'wscript'
    - 'cscript'
    - 'certutil'
    - 'bitsadmin'
    - 'bash.exe'
    - 'bash '
    - 'scrcons'
    - 'wmic '
    - 'wmic.exe'
    - 'forfiles'
    - 'scriptrunner'
    - 'hh.exe'
  condition: all of selection_*
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  The "Suspicious Scheduled Task Creation" detection rule identifies potential malicious activities involving the creation of scheduled tasks on Windows systems. It monitors Event ID 4698, which logs the creation of new scheduled tasks, specifically looking for unusual patterns in file paths and command-line arguments often associated with malicious behavior. This rule flags tasks created in commonly exploited directories, such as temporary folders or user-specific directories, as well as detects the use of potentially harmful commands like `powershell`, `cmd.exe`, or `regsvr32`. By analyzing these parameters, the rule assists SOC analysts in identifying possibly malicious scheduled tasks that could indicate privilege escalation or persistence mechanisms employed by an attacker.
  ### Investigation Steps
  - Review the specific Event ID 4698 logs in your SIEM to identify the exact details of the scheduled task creation, including the file path and command used.
  - Utilize the EDR tool to check for any suspicious processes that may have executed around the time of the scheduled task creation, looking for anomalies or known bad signatures.
  - Search through the Proxy logs and VPN connections to identify any unusual network activity that may correlate with the creation of the suspicious task, especially connections to unfamiliar IP addresses or domains.
  - Examine system and user account logs to determine if there were any unauthorized access attempts or privilege escalations associated with the user account responsible for the scheduled task.
