title: Metasploit Or Impacket Service Installation Via SMB PsExec
id: 6fb63b40-e02a-403e-9ffd-3bcc1d749442
related:
- id: 1a17ce75-ff0d-4f02-9709-2b7bb5618cf0
  type: derived
status: test
description: Detects usage of Metasploit SMB PsExec (exploit/windows/smb/psexec) and
  Impacket psexec.py by triggering on specific service installation
references:
- https://bczyz1.github.io/2021/01/30/psexec.html
author: Bartlomiej Czyz, Relativity
date: 2021-01-21
modified: 2022-10-05
tags:
- attack.lateral-movement
- attack.t1021.002
- attack.t1570
- attack.execution
- attack.t1569.002
logsource:
  product: windows
  service: security
  definition: The 'System Security Extension' audit subcategory need to be enabled
    to log the EID 4697
detection:
  selection:
    EventID: 4697
    ServiceFileName|re: '^%systemroot%\\[a-zA-Z]{8}\.exe$'
    ServiceName|re: '(^[a-zA-Z]{4}$)|(^[a-zA-Z]{8}$)|(^[a-zA-Z]{16}$)'
    ServiceStartType: 3      # on-demand start, see https://www.ultimatewindowssecurity.com/securitylog/encyclopedia/event.aspx?eventID=4697
    ServiceType: '0x10'
  filter:
    ServiceName: 'PSEXESVC'
  condition: selection and not filter
fields:
- ComputerName
- SubjectDomainName
- SubjectUserName
- ServiceName
- ServiceFileName
falsepositives:
- Possible, different agents with a 8 character binary and a 4, 8 or 16 character
  service name
level: high
notes: |
  ### Technical Context
  This detection rule identifies the installation of services associated with the use of Metasploit's and Impacket's PsExec capabilities via SMB. The rule specifically focuses on Windows Event ID 4697, which logs service installations. It searches for services that have specific naming patterns; service files are expected to have an 8-character name, while the service names can be 4, 8, or 16 characters long. Moreover, only services with an on-demand start type (ServiceStartType = 3) and a type indicative of being a Win32 service (ServiceType = '0x10’) are flagged. This is a significant detection because both Metasploit and Impacket tools are commonly used by adversaries for lateral movement in a network, highlighting their relevance in the tactic of "Lateral Movement" (Tactic: ATT&CK Tactic: Lateral Movement; Technique: T1021.002 
  - Remote Services: SMB/Windows Admin Shares).
  ### Investigation Steps
  - **Check Service Creation Events**: Review Windows Event Logs for Event ID 4697 to identify details about the service creation context, including the initiating user and system parameters. 
  - **Utilize EDR for Endpoint Context**: Use EDR tools to analyze endpoint behavior and track the execution of the identified service; look for any related malicious artifacts or connections.
  - **Network Connection Analysis**: Investigate network logs from NDR or firewall solutions for unusual SMB or network communication patterns coming from the affected host, which may correlate with lateral movement attempts.
  - **Review Process Creation**: Inspect process creation logs to find any command-line arguments or processes related to PsExec or service installation that might provide further insights into the method of execution used for lateral movement.
  ### Prioritization
  This alert is categorized as high severity due to the malicious nature of the tools being detected, which are specifically aimed at bypassing security controls for lateral movement in a network environment. When this rule is triggered, it should prompt immediate investigation due to the potential compromise of system integrity.
  ### Blind Spots and Assumptions
  The rule may not fire if legitimate service installations use similar naming conventions or if the monitoring for Windows Event ID 4697 is not properly enabled. Additionally, other forms of lateral movement not utilizing the PsExec tool will not be captured by this detection. Assumptions include the enforcement of naming conventions by adversaries, and that unique signaling via SMB traffic will also be present. Adversaries may take measures to obfuscate their service names, or employ alternate methods for service installation not covered by this rule.
  > **Disclaimer:** This investigation guide was created using generative AI technology and has not been reviewed for its accuracy and relevance. While every effort has been made to ensure its quality, we recommend validating the content and adapting it to suit specific environment and operational needs. Please communicate any changes to the detection engineering team.
