title: Transferring Files with Credential Data via Network Shares
id: 910ab938-668b-401b-b08c-b596e80fdca5
related:
- id: 2e69f167-47b5-4ae7-a390-47764529eff5
  type: similar
status: test
description: Transferring files with well-known filenames (sensitive files with credential
  data) using network shares
references:
- https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment
author: Teymur Kheirkhabarov, oscd.community
date: 2019-10-22
modified: 2021-11-30
tags:
- attack.credential-access
- attack.t1003.002
- attack.t1003.001
- attack.t1003.003
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 5145
    RelativeTargetName|contains:
    - '\mimidrv'
    - '\lsass'
    - '\windows\minidump\'
    - '\hiberfil'
    - '\sqldmpr'
    - '\sam'
    - '\ntds.dit'
    - '\security'
  condition: selection
falsepositives:
- Transferring sensitive files for legitimate administration work by legitimate administrator
level: medium
notes: |
  ### Technical Context
  This Sigma rule is designed to detect suspicious file transfers containing sensitive credential data via network shares in a Windows environment. The rule triggers on security event logs, particularly Event ID 5145, which logs attempts to access files. It specifically looks for the use of keyword paths known to host sensitive data, such as `\mimidrv` and `\lsass`, among others. These keywords point to common targets for credential harvesting activities, including process memory dumps and system files critical to authentication processes. By monitoring these logs, the rule helps identify potentially malicious activities aimed at stealing sensitive credential information.
  ### Investigation Steps
  - Utilize EDR tools to analyze process execution history on the endpoint involved in the file transfer, focusing on any processes associated with Event ID 5145.
  - Review security logs from the SIEM or security appliance to correlate the timestamp of the network share access with other potentially suspicious activities for greater context.
  - Check the activity logs of network shares to determine the identity of the user that initiated the transfer and assess if their behavior aligns with normal operational patterns.
  - Search cloud logs (if applicable) for any access attempts or uploads that may coincide with the flagged file transfer, ensuring no additional credential exposure occurred during this timeframe.
