title: Password Change on Directory Service Restore Mode (DSRM) Account
id: 53ad8e36-f573-46bf-97e4-15ba5bf4bb51
related:
- id: b61e87c0-50db-4b2e-8986-6a2be94b33b0
  type: similar
status: stable
description: |
  Detects potential attempts made to set the Directory Services Restore Mode administrator password.
  The Directory Service Restore Mode (DSRM) account is a local administrator account on Domain Controllers.
  Attackers may change the password in order to obtain persistence.
references:
- https://adsecurity.org/?p=1714
- https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-10/security/threat-protection/auditing/event-4794
author: Thomas Patzke
date: 2017-02-19
modified: 2020-08-23
tags:
- attack.persistence
- attack.t1098
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 4794
  condition: selection
falsepositives:
- Initial installation of a domain controller.
level: high
notes: |
  ### Technical Context
  This detection rule monitors changes to the Directory Services Restore Mode (DSRM) administrator password on Domain Controllers. The DSRM account is critical for system recovery but can be a target for persistence by attackers. The rule is based on Windows Security Event ID 4794, which is triggered when a change occurs to a user account's password. By focusing on this specific event, the rule identifies unauthorized attempts to alter the DSRM password, which could indicate malicious activity aimed at gaining further control over the domain environment. It pulls data from Windows security logs to detect potential misuse of administrative privileges in a critical area of the network infrastructure.
  ### Investigation Steps
  - Review the security event logs for Event ID 4794 to confirm the timestamp and details of the password change event.
  - Investigate the source account used for the password change by cross-referencing with EDR logs to identify any unusual activity or other security events.
  - Check for additional authentication attempts or failed logins related to the DSRM account in the authentication logs to uncover potential brute-force attack patterns.
  - Assess any recent changes to domain controller configurations or security policies that may correlate with the unexpected password change for further context.
