title: Azure AD Health Monitoring Agent Registry Keys Access
id: ff151c33-45fa-475d-af4f-c2f93571f4fe
status: test
description: |
  This detection uses Windows security events to detect suspicious access attempts to the registry key of Azure AD Health monitoring agent.
  This detection requires an access control entry (ACE) on the system access control list (SACL) of the following securable object HKLM\SOFTWARE\Microsoft\Microsoft Online\Reporting\MonitoringAgent.
references:
- https://o365blog.com/post/hybridhealthagent/
- https://github.com/OTRF/Set-AuditRule/blob/c3dec5443414231714d850565d364ca73475ade5/rules/registry/aad_connect_health_monitoring_agent.yml
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research), MSTIC
date: 2021-08-26
modified: 2022-10-09
tags:
- attack.discovery
- attack.t1012
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID:
    - 4656
    - 4663
    ObjectType: 'Key'
    ObjectName: '\REGISTRY\MACHINE\SOFTWARE\Microsoft\Microsoft Online\Reporting\MonitoringAgent'
  filter:
    ProcessName|contains:
    - 'Microsoft.Identity.Health.Adfs.DiagnosticsAgent.exe'
    - 'Microsoft.Identity.Health.Adfs.InsightsService.exe'
    - 'Microsoft.Identity.Health.Adfs.MonitoringAgent.Startup.exe'
    - 'Microsoft.Identity.Health.Adfs.PshSurrogate.exe'
    - 'Microsoft.Identity.Health.Common.Clients.ResourceMonitor.exe'
  condition: selection and not filter
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  This detection rule targets suspicious access attempts to the registry key associated with the Azure AD Health Monitoring Agent by monitoring Windows security events. Specifically, it looks for Event IDs 4656 and 4663, which indicate access attempts to the system's Registry. The focus is on the registry path `HKLM\SOFTWARE\Microsoft\Microsoft Online\Reporting\MonitoringAgent` to identify any unauthorized access or manipulation of critical configurations that can affect Azure AD Health functionality. The rule differentiates between legitimate and potentially malicious processes by filtering out specific process names associated with valid Azure AD operations, allowing for the identification of anomalous behavior that may indicate an insider threat or malicious activity targeting the Azure AD infrastructure.
  ### Investigation Steps
  - Review the details of the triggered security event (Event ID 4656 or 4663) in the EDR to understand the context of the access attempt, such as the user account and timestamp.
  - Check the associated process name in the EDR logs to determine if it is one of the known legitimate processes related to Azure AD functions or if it appears unfamiliar or suspicious.
  - Correlate the event with any relevant alerts or incidents from the SIEM that may indicate broader malicious activity within the environment that could involve the tampering of Azure AD components.
  - Examine Windows security logs for additional related events, particularly focusing on recent changes to user permissions or unusual access requests that may provide a fuller picture of the incident.
