title: Kerberoasting Activity - Initial Query
id: d04ae2b8-ad54-4de0-bd87-4bc1da66aa59
status: test
description: |
  This rule will collect the data needed to start looking into possible kerberoasting activity.
  Further analysis or computation within the query is needed focusing on requests from one specific host/IP towards multiple service names within a time period of 5 seconds.
  You can then set a threshold for the number of requests and time between the requests to turn this into an alert.
references:
- https://www.trustedsec.com/blog/art_of_kerberoast/
- https://adsecurity.org/?p=3513
author: '@kostastsale'
date: 2022-01-21
tags:
- attack.credential-access
- attack.t1558.003
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 4769
    Status: '0x0'     # Translated as status from failure code field. Query only for successes
    TicketEncryptionType: '0x17'     # RC4 ticket encryption type
  filter_main_:
    ServiceName|endswith:
    - 'krbtgt'         # Ignore requests for the krbtgt service
    - '$'         # Ignore requests from service names that end with $ which are associated with genuine kerberos traffic
    TargetUserName|contains: '$@'     # Ignore requests from machines
  condition: selection and not 1 of filter_main_*
falsepositives:
- Legacy applications.
level: medium
notes: |
  ### Technical Context
  The Kerberoasting detection rule is designed to identify potential kerberoasting attacks, which involve malicious attempts by an attacker to request Kerberos service tickets for service accounts and then extract the tickets to crack their passwords offline. This rule specifically monitors Windows Security Event logs for Event ID 4769, which indicates that a service ticket has been requested successfully (indicated by the status '0x0') with an encryption type of RC4. The rule focuses on requests made to service names that do not end with '$', which are typically used for administrative or machine accounts, thereby filtering out common administrative traffic. By analyzing requests from a single host to multiple service names within a five-second interval, the rule helps identify suspicious patterns that may indicate kerberoasting activity.
  ### Investigation Steps
  - Review the security logs in your SIEM for Event ID 4769 to identify hosts that are generating multiple ticket requests in rapid succession.
  - Cross-reference the requesting host's IP with endpoint data in your EDR to determine if any unauthorized applications or unusual behaviors are present on that machine.
  - Utilize your AV and threat intelligence tools to check for known indicators of compromise associated with the identified service accounts related to the kerberoasting attempts.
  - Query cloud logs (if applicable) in environments like Azure or AWS for any anomalous login activities or service principal requests that correlate with the timeline of these events.
