title: Potential Credential Dumping Via WER - Application
id: a18e0862-127b-43ca-be12-1a542c75c7c5
status: test
description: Detects Windows error reporting event where the process that crashed
  is lsass. This could be the cause of an intentional crash by techniques such as
  Lsass-Shtinkering to dump credential
references:
- https://github.com/deepinstinct/Lsass-Shtinkering
- https://media.defcon.org/DEF%20CON%2030/DEF%20CON%2030%20presentations/Asaf%20Gilboa%20-%20LSASS%20Shtinkering%20Abusing%20Windows%20Error%20Reporting%20to%20Dump%20LSASS.pdf
- https://learn.microsoft.com/en-us/openspecs/windows_protocols/ms-erref/596a1078-e883-4972-9bbc-49e60bebca55
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-12-07
tags:
- attack.credential-access
- attack.t1003.001
logsource:
  product: windows
  service: application
detection:
  selection:
    Provider_Name: 'Application Error'
    EventID: 1000
    AppName: 'lsass.exe'
    ExceptionCode: 'c0000001'     # STATUS_UNSUCCESSFUL
  condition: selection
falsepositives:
- Rare legitimate crashing of the lsass process
level: high
notes: |
  ### Technical Context
  This Sigma rule is designed to detect potential credential dumping activities targeting the Local Security Authority Subsystem Service (LSASS) process on Windows systems. LSASS is responsible for enforcing security policy on the system and handling authentication and credential processing. The rule's detection is triggered when Windows Error Reporting logs record a crash of the LSASS process (event ID 1000) with a specific exception code indicating an unsuccessful operation. This type of incident could signal an attacker leveraging techniques such as "Lsass-Shtinkering" to intentionally crash LSASS and extract sensitive credentials stored in memory. The primary data sources utilized for this detection include application event logs that provide insights into process errors and crashes on Windows systems.
  ### Investigation Steps
  - Review the EDR logs for any suspicious activity around the time of the LSASS crash, focusing on any unauthorized access attempts or unusual process behavior immediately preceding the event.
  - Check Windows Security logs to identify any successful or failed authentication attempts that coincide with the LSASS error event, which could indicate a credential harvesting attempt.
  - Analyze network traffic through the NDR solution to uncover any connections made by potentially compromised processes, especially those targeting external systems or transferring data unexpectedly.
  - Inspect related application logs, including those from the SIEM, for any unusual command-line parameters used with cmd.exe or PowerShell that may point to illicit activities involving credential access or disruption.
