title: Certificate Use With No Strong Mapping
id: 993c2665-e6ef-40e3-a62a-e1a97686af79
status: test
description: |
  Detects a user certificate that was valid but could not be mapped to a user in a strong way (such as via explicit mapping, key trust mapping, or a SID)
  This could be a sign of exploitation of the elevation of privilege vulnerabilities (CVE-2022-34691, CVE-2022-26931, CVE-2022-26923) that can occur when the KDC allows certificate spoofing by not requiring a strong mapping.
  Events where the AccountName and CN of the Subject do not match, or where the CN ends in a dollar sign indicating a machine, may indicate certificate spoofing.
references:
- https://support.microsoft.com/en-us/topic/kb5014754-certificate-based-authentication-changes-on-windows-domain-controllers-ad2c23b0-15d8-4340-a468-4d4f3b188f16
author: '@br4dy5'
date: 2023-10-09
tags:
- attack.privilege-escalation
logsource:
  product: windows
  service: system
detection:
  selection:
    Provider_Name: 'Kerberos-Key-Distribution-Center'
    EventID:
    - 39
    - 41         # For Windows Server 2008 R2 SP1 and Windows Server 2008 SP2
  condition: selection
falsepositives:
- If prevalent in the environment, filter on events where the AccountName and CN of
  the Subject do not reference the same user
- If prevalent in the environment, filter on CNs that end in a dollar sign indicating
  it is a machine name
level: medium
notes: |
  ### Technical Context
  This detection rule identifies potentially malicious use of certificates that lack strong user mappings within a Windows domain environment. It monitors Kerberos Key Distribution Center (KDC) events, specifically Event IDs 39 and 41, which are triggered during the issuance of Kerberos tickets. The rule focuses on instances where the `AccountName` does not match the `Common Name (CN)` in the Subject field or where the CN ends with a dollar sign, indicating a machine account. Such discrepancies can suggest certificate spoofing and exploit vulnerabilities that allow elevation of privilege, such as CVE-2022-34691, CVE-2022-26931, and CVE-2022-26923, by the KDC when it fails to enforce strong mapping requirements. Overall, this rule serves as an early warning for potential unauthorized access attempts rooted in the misuse of user certificates.
  ### Investigation Steps
  - Review the correlated logs in your EDR solution to analyze the context of the detected certificate use, focusing on user behavior that may appear unusual or indicative of compromise.
  - Cross-reference the event logs to check the relationship between the `AccountName` and the CN to determine if they belong to the same user, as discrepancies may require further scrutiny.
  - Use your SIEM to search for other related security incidents or alerts that occurred around the same timeframe, which may help establish a pattern of malicious activity.
  - Investigate the machine accounts indicated by CNs ending in a dollar sign to assess if they are being used inappropriately or if they relate to legitimate services in your environment.
