title: KDC RC4-HMAC Downgrade CVE-2022-37966
id: e6f81941-b1cd-4766-87db-9fc156f658ee
status: test
description: Detects the exploitation of a security bypass and elevation of privilege
  vulnerability with Authentication Negotiation by using weak RC4-HMAC negotiation
references:
- https://support.microsoft.com/en-us/topic/kb5021131-how-to-manage-the-kerberos-protocol-changes-related-to-cve-2022-37966-fd837ac3-cdec-4e76-a6ec-86e67501407d
author: Florian Roth (Nextron Systems)
date: 2022-11-09
tags:
- attack.privilege-escalation
logsource:
  product: windows
  service: system
detection:
  selection:
    EventID: 42
    Provider_Name: 'Kerberos-Key-Distribution-Center'
    Level: 2      # Error
  condition: selection
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  The KDC RC4-HMAC Downgrade detection rule is designed to identify potential attempts to exploit a vulnerability (CVE-2022-37966) in the Kerberos authentication protocol. Specifically, it targets instances where weak RC4-HMAC is negotiated during authentication, enabling a security bypass that could lead to privilege escalation. This detection is primarily focused on monitoring EventID 42 generated by the Kerberos Key Distribution Center (KDC) on Windows systems, indicating an error in authentication negotiation. By analyzing the logs for specific error conditions, the rule can flag attacks that rely on downgrading secure authentication processes to weaker algorithms, which might signify malicious activity aimed at compromising system integrity.
  ### Investigation Steps
  - Review the KDC EventID 42 logs in the Windows Event Viewer to identify the specific instances of RC4-HMAC negotiation errors and gather details about the affected users and systems.
  - Utilize EDR tools to examine any associated processes running around the time of the detected events to determine if there are any suspicious activities linked with the users experiencing authentication failures.
  - Check system and application logs for any unusual authentication patterns or spikes in errors that may indicate a broader attack against the Kerberos protocol.
  - Conduct a review of network traffic through the NGFW and NDR tools to identify any anomalies or unauthorized access attempts targeting the KDC or related systems.
