title: No Suitable Encryption Key Found For Generating Kerberos Ticket
id: b1e0b3f5-b62e-41be-886a-daffde446ad4
status: test
description: |
  Detects errors when a target server doesn't have suitable keys for generating kerberos tickets.
  This issue can occur for example when a service uses a user account or a computer account that is configured for only DES encryption on a computer that is running Windows 7 which has DES encryption for Kerberos authentication disabled.
references:
- https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2008-r2-and-2008/dd348773(v=ws.10)
- https://learn.microsoft.com/en-us/troubleshoot/windows-server/windows-security/kdc-event-16-27-des-encryption-disabled
author: '@SerkinValery'
date: 2024-03-07
tags:
- attack.credential-access
- attack.t1558.003
logsource:
  product: windows
  service: system
detection:
  selection:
    Provider_Name: 'Microsoft-Windows-Kerberos-Key-Distribution-Center'
    EventID:
    - 16         # KDCEVENT_NO_KEY_INTERSECTION_TGS
    - 27         # KDCEVENT_UNSUPPORTED_ETYPE_REQUEST_TGS
  condition: selection
falsepositives:
- Unknown
level: low
notes: |
  ### Technical Context
  This Sigma rule identifies specific error events generated by the Microsoft Windows Kerberos Key Distribution Center (KDC) when a service attempts to generate Kerberos tickets but fails due to incompatible encryption key configurations. Specifically, it looks for Event IDs 16 and 27, which indicate that the target server does not possess suitable keys for the requested encryption type. This scenario commonly arises when a user or computer account is limited to DES encryption, but the operating system—such as Windows 7—has DES encryption disabled. Detecting this issue is crucial as it can signify improper configurations leading to authentication failures, potentially leaving the system vulnerable to credential-related attacks.
  ### Investigation Steps
  - Review the specific Event IDs (16 and 27) from the Windows Event Logs to confirm the presence and frequency of the errors related to Kerberos ticket generation.
  - Cross-reference affected accounts with account configuration settings in Active Directory to determine if they are limited to unsupported encryption types.
  - Utilize EDR tools to investigate if there have been any potentially malicious attempts to manipulate or access service tickets associated with the flagged accounts.
  - Check relevant systems and applications for any misconfigurations and ensure that encryption policies align with organizational security standards, particularly for Kerberos authentication protocols.
