title: DNS Query for Anonfiles.com Domain - DNS Client
id: 29f171d7-aa47-42c7-9c7b-3c87938164d9
related:
- id: 065cceea-77ec-4030-9052-fc0affea7110
  type: similar
status: test
description: Detects DNS queries for anonfiles.com, which is an anonymous file upload
  platform often used for malicious purposes
references:
- https://www.trendmicro.com/vinfo/us/security/news/ransomware-spotlight/ransomware-spotlight-blackbyte
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023-01-16
tags:
- attack.exfiltration
- attack.t1567.002
logsource:
  product: windows
  service: dns-client
  definition: 'Requirements: Microsoft-Windows-DNS Client Events/Operational Event
    Log must be enabled/collected in order to receive the events.'
detection:
  selection:
    EventID: 3008
    QueryName|contains: '.anonfiles.com'
  condition: selection
falsepositives:
- Rare legitimate access to anonfiles.com
level: high
notes: |
  ### Technical Context
  This Sigma rule aims to detect DNS queries for the domain "anonfiles.com," an anonymous file upload platform often exploited for malicious activities, such as data exfiltration and distributing ransomware. The rule specifically targets the Windows DNS Client logs, looking for EventID 3008, which signifies a DNS query made by the client. It checks if the query contains the string ".anonfiles.com," which could indicate potential attempts to access this domain for illicit purposes. To effectively utilize this detection, organizations must ensure that the Microsoft-Windows-DNS Client Events and Operational Event Log are enabled and configured to gather relevant logs.
  By identifying queries to known malicious domains, incident responders can proactively investigate and mitigate potential security incidents before they escalate. Analysts should prioritize any alerts generated by this rule, given its association with known threats and high-risk activities in the cybersecurity landscape.
  ### Investigation Steps
  - Review the DNS query logs in the DNS-client to confirm the occurrence of queries to "anonfiles.com" and identify the originating hosts. 
  - Check the Process Creation logs on the affected endpoints to see if any suspicious processes were spawned around the same time as the detected DNS queries. 
  - Analyze network traffic logs from the EDR and NDR tools to investigate any outgoing connections to "anonfiles.com," especially those that may have transferred sensitive data.
  - Consult with the Proxy logs to assess whether users accessed "anonfiles.com" via web traffic, which may provide context regarding the intention behind the query.
