title: DNS Query To Ufile.io - DNS Client
id: 090ffaad-c01a-4879-850c-6d57da98452d
related:
- id: 1cbbeaaf-3c8c-4e4c-9d72-49485b6a176b
  type: similar
status: test
description: Detects DNS queries to "ufile.io", which was seen abused by malware and
  threat actors as a method for data exfiltration
references:
- https://thedfirreport.com/2021/12/13/diavol-ransomware/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023-01-16
modified: 2023-09-18
tags:
- attack.exfiltration
- attack.t1567.002
logsource:
  product: windows
  service: dns-client
  definition: 'Requirements: Microsoft-Windows-DNS Client Events/Operational Event
    Log must be enabled/collected in order to receive the events.'
detection:
  selection:
    EventID: 3008
    QueryName|contains: 'ufile.io'
  condition: selection
falsepositives:
- DNS queries for "ufile" are not malicious by nature necessarily. Investigate the
  source to determine the necessary actions to take
level: low
notes: |
  ### Technical Context
  This detection rule identifies potential data exfiltration attempts by monitoring DNS queries specifically targeting the domain "ufile.io." The rule operates by analyzing EventID 3008 from the DNS Client logs on Windows systems, focusing on queries that contain the specified domain name. "Ufile.io" has been associated with malware and malicious actors for data exfiltration activities, making its detection crucial for protecting sensitive information. By capturing these DNS queries, the rule helps organizations identify abnormal or suspicious behavior that could indicate an ongoing security incident or an attempt to transfer data outside the network.
  This rule relies on logs generated by the Microsoft-Windows-DNS Client Events, requiring appropriate logging settings to be enabled for accurate monitoring. The output of this detection rule will trigger alerts for further investigation, allowing analysts to scrutinize the nature of the DNS queries to determine their legitimacy.
  ### Investigation Steps
  - Review the source of the DNS query by correlating it with the endpoint logs in the EDR system to identify any processes or applications initiating the requests.
  - Check for additional network activity associated with the DNS queries in the NDR logs, looking for patterns that might indicate malicious behavior or connections to known C2 servers.
  - Analyze the command line parameters and process execution history on the endpoint to establish if any unauthorized activities occurred around the time of the DNS query.
  - Examine web proxy logs for requests made to "ufile.io" from the same source to assess if the query resulted in actual data transfer or interactions with the domain.
