title: Suspicious Cobalt Strike DNS Beaconing - DNS Client
id: 0d18728b-f5bf-4381-9dcf-915539fff6c2
related:
- id: f356a9c4-effd-4608-bbf8-408afd5cd006
  type: similar
status: test
description: Detects a program that invoked suspicious DNS queries known from Cobalt
  Strike beacons
references:
- https://www.icebrg.io/blog/footprints-of-fin7-tracking-actor-patterns
- https://www.sekoia.io/en/hunting-and-detecting-cobalt-strike/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023-01-16
tags:
- attack.command-and-control
- attack.t1071.004
logsource:
  product: windows
  service: dns-client
  definition: 'Requirements: Microsoft-Windows-DNS Client Events/Operational Event
    Log must be enabled/collected in order to receive the events.'
detection:
  selection_eid:
    EventID: 3008
  selection_query_1:
    QueryName|startswith:
    - 'aaa.stage.'
    - 'post.1'
  selection_query_2:
    QueryName|contains: '.stage.123456.'
  condition: selection_eid and 1 of selection_query_*
falsepositives:
- Unknown
level: critical
notes: |
  ### Technical Context
  This detection rule identifies suspicious DNS query patterns indicative of Cobalt Strike beaconing behaviors. Cobalt Strike is a legitimate penetration testing tool that is frequently misused by threat actors to establish command and control (C2) communication during cyber intrusions. The rule monitors for specific DNS requests generated by the Windows DNS Client that resemble known indicators of compromised environments. It focuses on Event ID 3008, which captures DNS query logs, to detect requests with specific patterns, such as those that start with "aaa.stage.", contain the fragment ".stage.123456.", or follow similar suspicious formats. By analyzing these query parameters, the rule aims to highlight potential malicious activity that could signify a compromised machine attempting to communicate with its C2 infrastructure.
  ### Investigation Steps
  - Use EDR tools to investigate the endpoints that generated the suspicious DNS queries and analyze the process tree for any anomalous activity or known malicious processes.
  - Review the logs from the DNS Client in the Windows event log to identify the timestamps and frequency of the suspicious DNS queries to establish a timeline of the potential incident.
  - Cross-reference any associated IP addresses with threat intelligence feeds or reputation databases to assess the likelihood of them being malicious or linked to known threat actors.
  - Check proxy logs for additional context on outbound connections from the affected hosts, which can provide insights into any further communications with potentially malicious domains.
