title: Delete Volume Shadow Copies Via WMI With PowerShell
id: 87df9ee1-5416-453a-8a08-e8d4a51e9ce1
status: stable
description: Shadow Copies deletion using operating systems utilities via PowerShell
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1490/T1490.md
- https://www.fortinet.com/blog/threat-research/stomping-shadow-copies-a-second-look-into-deletion-methods
author: frack113
date: 2021-06-03
modified: 2023-10-27
tags:
- attack.impact
- attack.t1490
logsource:
  product: windows
  category: ps_classic_start
detection:
  selection:
    Data|contains|all:
    - 'Get-WmiObject'
    - 'Win32_ShadowCopy'
    Data|contains:
    - 'Delete()'
    - 'Remove-WmiObject'
  condition: selection
falsepositives:
- Legitimate Administrator deletes Shadow Copies using operating systems utilities
  for legitimate reason
level: high
notes: |
  ### Technical Context
  This Sigma rule is designed to identify potential malicious activity related to the deletion of Volume Shadow Copies via Windows Management Instrumentation (WMI) commands executed through PowerShell. Specifically, it looks for instances where the 'Get-WmiObject' command is used in conjunction with the 'Win32_ShadowCopy' class, particularly looking for actions like 'Delete()' or 'Remove-WmiObject'. Volume Shadow Copies are often targeted by malicious actors to erase forensic artifacts that could be used in investigations following a compromise. By monitoring PowerShell activity for these specific commands, the rule helps detect attempts to manipulate or destroy these backup snapshots, which highlights a high-risk scenario for potential data loss and cover-up actions.
  ### Investigation Steps
  - Review EDR logs to identify the user account associated with the PowerShell execution and assess whether there are other suspicious activities by the same user.
  - Examine PowerShell command history to verify the context of the command, looking for any preceding commands that could indicate a malicious intent or provide additional context.
  - Check Windows Event Logs for related events, specifically focusing on event IDs associated with PowerShell and shadow copy manipulations, to gather a timeline of the actions taken.
  - Investigate any relevant file access logs or changes in backup configurations on critical systems to determine if shadow copies were altered or deleted as part of a broader attack.
