title: Nslookup PowerShell Download Cradle
id: 999bff6d-dc15-44c9-9f5c-e1051bfc86e1
related:
- id: 1b3b01c7-84e9-4072-86e5-fc285a41ff23
  type: similar
status: test
description: Detects a powershell download cradle using nslookup. This cradle uses
  nslookup to extract payloads from DNS records.
references:
- https://twitter.com/Alh4zr3d/status/1566489367232651264
author: Sai Prashanth Pulisetti @pulisettis, Aishwarya Singam
date: 2022-12-10
modified: 2025-02-25
tags:
- attack.execution
- attack.t1059.001
logsource:
  product: windows
  category: ps_classic_start
detection:
  selection:
    Data|contains|all:
    - 'powershell'
    - 'nslookup'
    - '[1]'
    Data|contains:
    - '-q=txt http'
    - '-querytype=txt http'
    - '-type=txt http'
  condition: selection
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  The "Nslookup PowerShell Download Cradle" detection rule monitors for potentially malicious uses of PowerShell where attackers leverage the nslookup command to extract payloads hosted on DNS servers. Specifically, the rule identifies instances where PowerShell scripts include command-line arguments that configure nslookup to lookup text (TXT) records associated with HTTP, thus indicating a connection to an external server for downloading malicious content. The primary data sources for this detection are PowerShell execution logs, which capture the commands being run along with their parameters. By flagging the use of "nslookup" in conjunction with specific query types, this rule aims to identify legitimate vs. potentially harmful activity, providing essential insights for incident response efforts.
  ### Investigation Steps
  - Review PowerShell logs utilizing an EDR tool to identify the execution context of the detected commands and to capture related parent processes.
  - Analyze network traffic logs from your NDR solution to determine if there were any outbound connections made to suspicious or known malicious domains during the timeframe of the alert.
  - Check DNS logs for the queried TXT records associated with the detected nslookup command; this will help assess whether the requested data was legitimate or linked to malicious activity.
  - Utilize threat intelligence platforms to correlate the identified domains and IPs against known malicious indicators, aiding in assessing the severity of the threat.
