title: Use Get-NetTCPConnection
id: b366adb4-d63d-422d-8a2c-186463b5ded0
status: test
description: Adversaries may attempt to get a listing of network connections to or
  from the compromised system they are currently accessing or from remote systems
  by querying for information over the network.
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1049/T1049.md#atomic-test-2---system-network-connections-discovery-with-powershell
author: frack113
date: 2021-12-10
modified: 2023-10-27
tags:
- attack.discovery
- attack.t1049
logsource:
  product: windows
  category: ps_classic_start
detection:
  selection:
    Data|contains: 'Get-NetTCPConnection'
  condition: selection
falsepositives:
- Unknown
level: low
notes: |
  ### Technical Context
  The Sigma rule titled "Use Get-NetTCPConnection" is designed to detect potential reconnaissance activities by adversaries attempting to gather information about network connections on a compromised Windows system. The primary focus of this rule is the use of the PowerShell command `Get-NetTCPConnection`, which enables users to list detailed information about active TCP connections, both incoming and outgoing. By monitoring process creation logs for instances of this command, the Security Operations Center (SOC) can identify when a user or adversary is attempting to enumerate current network connections, which may indicate malicious intent.
  This rule relies on the Windows event logs specifically capturing PowerShell activity, categorized under the `ps_classic_start`. These logs provide vital information about executed commands, including the command strings that were run, which are essential for identifying suspicious querying behavior on network connections.
  ### Investigation Steps
  - Review PowerShell logs in the EDR to identify other potentially malicious commands executed around the same time as `Get-NetTCPConnection`. This can provide context and help establish a behavioral pattern.
  - Analyze network traffic logs from the NGFW to assess if there were any unusual outbound connections that coincide with the execution of the command, which could indicate data exfiltration or lateral movement attempts.
  - Cross-reference the user accounts involved in the execution of the command with the organization's user behavior baseline. Look for deviations or activity during off-hours.
  - Examine the system's Windows event logs for related activities to better understand the sequence of actions leading up to the command execution, helping identify the possible attack vector.
