title: Tamper Windows Defender - PSClassic
id: ec19ebab-72dc-40e1-9728-4c0b805d722c
related:
- id: 14c71865-6cd3-44ae-adaa-1db923fae5f2
  type: similar
status: test
description: Attempting to disable scheduled scanning and other parts of Windows Defender
  ATP or set default actions to allow.
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.001/T1562.001.md
author: frack113, Nasreddine Bencherchali (Nextron Systems)
date: 2021-06-07
modified: 2024-01-02
tags:
- attack.defense-evasion
- attack.t1562.001
logsource:
  product: windows
  category: ps_classic_provider_start
detection:
  selection_set_mppreference:
    Data|contains: 'Set-MpPreference'
  selection_options_bool_allow:
    Data|contains:
    - '-dbaf $true'
    - '-dbaf 1'
    - '-dbm $true'
    - '-dbm 1'
    - '-dips $true'
    - '-dips 1'
    - '-DisableArchiveScanning $true'
    - '-DisableArchiveScanning 1'
    - '-DisableBehaviorMonitoring $true'
    - '-DisableBehaviorMonitoring 1'
    - '-DisableBlockAtFirstSeen $true'
    - '-DisableBlockAtFirstSeen 1'
    - '-DisableCatchupFullScan $true'
    - '-DisableCatchupFullScan 1'
    - '-DisableCatchupQuickScan $true'
    - '-DisableCatchupQuickScan 1'
    - '-DisableIntrusionPreventionSystem $true'
    - '-DisableIntrusionPreventionSystem 1'
    - '-DisableIOAVProtection $true'
    - '-DisableIOAVProtection 1'
    - '-DisableRealtimeMonitoring $true'
    - '-DisableRealtimeMonitoring 1'
    - '-DisableRemovableDriveScanning $true'
    - '-DisableRemovableDriveScanning 1'
    - '-DisableScanningMappedNetworkDrivesForFullScan $true'
    - '-DisableScanningMappedNetworkDrivesForFullScan 1'
    - '-DisableScanningNetworkFiles $true'
    - '-DisableScanningNetworkFiles 1'
    - '-DisableScriptScanning $true'
    - '-DisableScriptScanning 1'
    - '-MAPSReporting $false'
    - '-MAPSReporting 0'
    - '-drdsc $true'
    - '-drdsc 1'
    - '-drtm $true'
    - '-drtm 1'
    - '-dscrptsc $true'
    - '-dscrptsc 1'
    - '-dsmndf $true'
    - '-dsmndf 1'
    - '-dsnf $true'
    - '-dsnf 1'
    - '-dss $true'
    - '-dss 1'
  selection_options_actions_func:
    Data|contains:
    - 'HighThreatDefaultAction Allow'
    - 'htdefac Allow'
    - 'LowThreatDefaultAction Allow'
    - 'ltdefac Allow'
    - 'ModerateThreatDefaultAction Allow'
    - 'mtdefac Allow'
    - 'SevereThreatDefaultAction Allow'
    - 'stdefac Allow'
  condition: selection_set_mppreference and 1 of selection_options_*
falsepositives:
- Legitimate PowerShell scripts that disable Windows Defender for troubleshooting
  purposes. Must be investigated.
level: high
notes: |
  ### Technical Context
  This Sigma rule aims to detect attempts to disable critical components of Windows Defender, specifically through the use of PowerShell commands. It identifies Windows Defender tampering by monitoring PowerShell logs for specific command-line arguments that suggest disabling features such as real-time monitoring, scheduled scanning, and other protective measures. The primary technical data sources leveraged in this detection are PowerShell logs, particularly those generated by the Windows logging of PowerShell command execution (PSClassic). By filtering for keywords and arguments like 'Set-MpPreference' and parameters indicating a change to default actions (e.g., 'HighThreatDefaultAction Allow'), this rule effectively flags potential tampering. This detection aligns with the MITRE ATT&CK framework under the tactic of "Defense Evasion" and the technique T1562.001, which focuses on disabling security features.
  ### Investigation Steps
  - **Review PowerShell Logs:** Use Windows Event Logs to filter for PowerShell execution logs focusing on instances where 'Set-MpPreference' was invoked, including the command line parameters used.
  - **Correlate with EDR Alerts:** Investigate any related alerts from the Endpoint Detection and Response (EDR) system that are triggered around the same time to get insights into potential malicious behavior.
  - **Examine related events:** Look for recent changes in the Windows Defender configuration or other related system logs that might provide context about the user or process making the changes.
  - **Validate to exclude false positives:** Determine if the PowerShell commands were executed legitimately, for instance, during troubleshooting activities, to avoid misattributing benign actions as threats.
  ### Prioritization
  This alert has a high severity level in an enterprise environment due to the critical nature of Windows Defender in protecting against malware and ensuring system integrity. Disabling its features significantly heightens the risk of system compromise.
  ### Blind Spots and Assumptions
  This detection rule may not fire if the tampering is achieved through alternative means, such as registry modifications or direct manipulation of system settings without using PowerShell. Additionally, legitimate administrative actions during troubleshooting could be misconstrued as threats unless properly investigated. It's assumed that all environments will have PowerShell logging enabled; if not, this rule may fail to capture relevant events.
  > **Disclaimer:** This investigation guide was created using generative AI technology and has not been reviewed for its accuracy and relevance. While every effort has been made to ensure its quality, we recommend validating the content and adapting it to suit specific environment and operational needs. Please communicate any changes to the detection engineering team.
