title: Suspicious Non PowerShell WSMAN COM Provider
id: df9a0e0e-fedb-4d6c-8668-d765dfc92aa7
status: test
description: Detects suspicious use of the WSMAN provider without PowerShell.exe as
  the host application.
references:
- https://twitter.com/chadtilbury/status/1275851297770610688
- https://bohops.com/2020/05/12/ws-management-com-another-approach-for-winrm-lateral-movement/
- https://github.com/bohops/WSMan-WinRM
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
date: 2020-06-24
modified: 2024-12-27
tags:
- attack.execution
- attack.t1059.001
- attack.lateral-movement
- attack.t1021.003
logsource:
  product: windows
  service: powershell-classic
detection:
  selection:
    Data|contains: 'ProviderName=WSMan'
  filter_main_ps:
    Data|contains:
    - 'HostApplication=powershell'
    - 'HostApplication=C:\Windows\System32\WindowsPowerShell\v1.0\powershell'
    - 'HostApplication=C:\Windows\SysWOW64\WindowsPowerShell\v1.0\powershell'
            # In some cases powershell was invoked with inverted slashes
    - 'HostApplication=C:/Windows/System32/WindowsPowerShell/v1.0/powershell'
    - 'HostApplication=C:/Windows/SysWOW64/WindowsPowerShell/v1.0/powershell'
  filter_main_host_application_null:
        # Note: Since we're using the raw data field to match. There is no easy way to filter out cases where the "HostApplication" field is null (i.e doesn't exist). We're practically forced to use a regex.
        # If you're already mapping and extracting the field, then obviously use that directly.
    Data|re: 'HostId=[a-zA-Z0-9-]{36}\s+EngineVersion='
  condition: selection and not 1 of filter_main_*
falsepositives:
- Unknown
level: medium
notes: |
  n
  ### Technical Context
  This Sigma rule is designed to detect suspicious usage of the Windows Management Instrumentation (WSMAN) COM provider without PowerShell being the host application. The rule checks system logs for occurrences where WSMAN is invoked, particularly focusing on the absence of the legitimate PowerShell host application. Instead, it identifies any other process that attempts to use the WSMAN provider, indicating potential lateral movement or malicious execution, which is addressed in the MITRE ATT&CK framework under the "Execution" tactic (T1059.001) and "Lateral Movement" technique (T1021.003). The detection leverages Windows Security Log data, specifically looking for relevant parameters in log messages that indicate how WSMAN is being utilized.
  ### Investigation Steps
  - **Review Event Logs:** Check the Windows Event Logs, specifically the Security and Sysmon logs, for events related to the detected WSMAN usage. Pay particular attention to the user account and the originating system to assess the context of the activity.
    
  - **Correlate Process Information:** Utilize an EDR solution to analyze the processes associated with the suspicious WSMAN calls. Determine if any other known malicious processes or behaviors are linked to the system and user.
  - **Examine Remote Connections:** Utilize logs from VPN and network firewalls to review any remote connections made to the system where the alert was triggered. Look for unusual IP addresses or connection attempts during the timeframe of the alerts.
  - **Verify with Threat Intelligence:** Cross-reference the activity against known indicators of compromise (IoCs) using threat intelligence platforms to assess if the observed behavior is related to any documented threats or vulnerabilities.
  ### Prioritization
  This alert is classified as medium severity due to the potential implications of unauthorized lateral movement or malicious execution attempts in the environment. Immediate investigation is warranted to determine if this behavior is benign or represents an emerging threat.
  ### Blind spots and Assumptions
  This rule may not fire if the adversary attempts to obfuscate their use of the WSMAN provider by using legitimate PowerShell instances or if they employ custom or less common scripting tools that do not trigger logging for WSMAN usage. Additionally, environments not thoroughly mapping necessary fields in security logs may miss such events entirely. It is assumed that users actively utilizing WSMAN for benign purposes are sufficiently covered by communication and training policies.
  > **Disclaimer:** This investigation guide was created using generative AI technology and has not been reviewed for its accuracy and relevance. While every effort has been made to ensure its quality and reliability, we recommend validating the content and adapting it to suit specific environment and operational needs. Please communicate any changes to the detection engineering team.
