title: Suspicious PowerShell Download
id: 3236fcd0-b7e3-4433-b4f8-86ad61a9af2d
related:
- id: 65531a81-a694-4e31-ae04-f8ba5bc33759
  type: derived
status: test
description: Detects suspicious PowerShell download command
references:
- https://www.trendmicro.com/en_us/research/22/j/lv-ransomware-exploits-proxyshell-in-attack.html
author: Florian Roth (Nextron Systems)
date: 2017-03-05
modified: 2023-10-27
tags:
- attack.execution
- attack.t1059.001
logsource:
  product: windows
  category: ps_classic_start
detection:
  selection_webclient:
    Data|contains: 'Net.WebClient'
  selection_download:
    Data|contains:
    - '.DownloadFile('
    - '.DownloadString('
  condition: all of selection_*
falsepositives:
- PowerShell scripts that download content from the Internet
level: medium
notes: |
  ### Technical Context
  This detection rule identifies suspicious PowerShell commands that utilize the WebClient class to download files from the internet. It targets the use of specific PowerShell functions, namely `.DownloadFile` and `.DownloadString`, which are often leveraged by attackers to retrieve malicious payloads or scripts. By monitoring Windows process creation logs, particularly those related to PowerShell executions, this rule can pinpoint potentially harmful activities. The rule effectively filters through data generated by PowerShell, ensuring that only commands indicative of abnormal behavior are flagged for further investigation.
  The alerts generated by this rule can serve as early indicators of an ongoing threat, especially when tied to known malicious patterns or uncommon use cases within the environment. Investigators should be aware that while legitimate PowerShell usage can involve file downloads, this detection aims to capture non-standard activity that may signify a compromise or informed attack strategy.  
  ### Investigation Steps
  - Review the PowerShell execution logs in the EDR to identify the context and parameters of the detected commands, including the user account and system involved.
  - Analyze the internet traffic to and from the affected machine using Proxy and NDR logs, looking for connections to unusual or known malicious IP addresses.
  - Check the integrity of the downloaded file, if available, using AV solutions to determine if it has been flagged as a threat or is behaving suspiciously.
  - Investigate any related events or alerts in the SIEM for additional context, such as prior authentication failures or other anomalous activities around the same timeframe.
