title: NTLM Logon
id: 98c3bcf1-56f2-49dc-9d8d-c66cf190238b
status: test
description: Detects logons using NTLM, which could be caused by a legacy source or
  attackers
references:
- https://twitter.com/JohnLaTwC/status/1004895028995477505
author: Florian Roth (Nextron Systems)
date: 2018-06-08
modified: 2024-07-22
tags:
- attack.lateral-movement
- attack.t1550.002
logsource:
  product: windows
  service: ntlm
  definition: Requires events from Microsoft-Windows-NTLM/Operational
detection:
  selection:
    EventID: 8002
  condition: selection
falsepositives:
- Legacy hosts
level: low
notes: |
  ### Technical Context
  This detection rule focuses on logons using NTLM (NT LAN Manager) authentication, particularly looking for Event ID 8002 in Windows logs. NTLM is often utilized by legacy systems and applications that might not support more secure authentication protocols, making it a potential vector for unauthorized access. The rule aims to highlight instances of NTLM logons, which could indicate lateral movement by attackers or activities from older systems that may not comply with modern security standards. The primary data source for this detection is the Microsoft-Windows-NTLM/Operational event log, which captures specific NTLM authentication events in the environment.
  ### Investigation Steps
  - Examine the original source of the NTLM logon events in the EDR solution to assess whether the activity originates from a legitimate legacy host or if it appears anomalous.
  - Review user activity and access patterns within the SIEM to identify any unusual logon attempts or lateral movement following the NTLM authentication, especially across sensitive or critical systems.
  - Utilize the Proxy logs to track where the authenticated user may be attempting to access, determining if there are any malicious or unauthorized destinations involved.
  - Check cloud platform logs (AWS, GCP, Azure) for any corresponding activity that aligns with the NTLM logon event, focusing on potential unauthorized resource access or configuration changes related to the user.
