title: Potential Remote Desktop Connection to Non-Domain Host
id: ce5678bb-b9aa-4fb5-be4b-e57f686256ad
status: test
description: Detects logons using NTLM to hosts that are potentially not part of the
  domain.
references:
- n/a
author: James Pemberton
date: 2020-05-22
modified: 2021-11-27
tags:
- attack.command-and-control
- attack.t1219
logsource:
  product: windows
  service: ntlm
  definition: Requires events from Microsoft-Windows-NTLM/Operational
detection:
  selection:
    EventID: 8001
    TargetName|startswith: 'TERMSRV'
  condition: selection
fields:
- Computer
- UserName
- DomainName
- TargetName
falsepositives:
- Host connections to valid domains, exclude these.
- Host connections not using host FQDN.
- Host connections to external legitimate domains.
level: medium
notes: |
  ### Technical Context
  This detection rule identifies potential unauthorized Remote Desktop Protocol (RDP) connections to hosts that are not part of the organization’s domain. It specifically looks for NTLM authentication events, particularly Event ID 8001, that involve target names prefixed with "TERMSRV," which indicates a remote desktop session. By tracking these connections, the rule can help identify potential lateral movement by malicious actors attempting to access non-domain resources using NTLM. The primary data sources for this detection are Windows event logs related to NTLM, specifically the Microsoft-Windows-NTLM/Operational logs.
  ### Investigation Steps
  - Review EDR logs to identify the source of the RDP connection attempts and determine the legitimacy of the user trying to access the non-domain host.
  - Analyze NTLM authentication logs to check for additional context around the user and their previous authentication patterns.
  - Utilize proxy logs to uncover if any web traffic corresponds with the time of the unauthorized RDP connection and assess any unusual activity.
  - Query cloud platform logs (e.g., AWS, Azure) for any recent activity related to the target host, to identify if it has been used in prior legitimate sessions or has any associated alerts.
