title: NTLM Brute Force
id: 9c8acf1a-cbf9-4db6-b63c-74baabe03e59
status: test
description: Detects common NTLM brute force device names
references:
- https://www.varonis.com/blog/investigate-ntlm-brute-force
author: Jerry Shockley '@jsh0x'
date: 2022-02-02
tags:
- attack.credential-access
- attack.t1110
logsource:
  product: windows
  service: ntlm
  definition: Requires events from Microsoft-Windows-NTLM/Operational
detection:
  selection:
    EventID: 8004
  devicename:
    WorkstationName:
    - 'Rdesktop'
    - 'Remmina'
    - 'Freerdp'
    - 'Windows7'
    - 'Windows8'
    - 'Windows2012'
    - 'Windows2016'
    - 'Windows2019'
  condition: selection and devicename
falsepositives:
- Systems with names equal to the spoofed ones used by the brute force tools
level: medium
notes: |
  ### Technical Context
  The NTLM Brute Force detection rule aims to identify potential credential theft attempts via brute force attacks targeting NTLM authentication on Windows systems. Specifically, it looks for EventID 8004, which captures authentication failures, while also filtering for known common workstation names frequently exploited by brute force tools. These names include 'Rdesktop', 'Remmina', and various versions of Windows (7, 8, 2012, 2016, 2019). By monitoring these criteria, the rule helps in recognizing unusual access patterns that typically indicate brute force attacks on NTLM authentication, allowing incident responders to take appropriate action before significant compromise occurs.
  ### Investigation Steps
  - Check the relevant EDR logs for detailed information about authentication attempts and the associated source IP addresses to determine if they originate from internal or external threats. 
  - Correlate alerts with network logs to identify any unusual traffic patterns that might indicate lateral movement or unauthorized access attempts from the flagged workstation names.
  - Review VPN logs to confirm if any remote connections were made during the time frame of the detected alert, and assess if those connections were legitimate.
  - Search the SIEM for historical data related to the device names identified in the alert to identify potential false positives or recurring patterns of malicious behavior.
