title: A Rule Has Been Deleted From The Windows Firewall Exception List
id: c187c075-bb3e-4c62-b4fa-beae0ffc211f
status: test
description: Detects when a single rules or all of the rules have been deleted from
  the Windows Defender Firewall
references:
- https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2008-r2-and-2008/dd364427(v=ws.10)
author: frack113
date: 2022-02-19
modified: 2024-08-29
tags:
- attack.defense-evasion
- attack.t1562.004
logsource:
  product: windows
  service: firewall-as
detection:
  selection:
    EventID:
    - 2006         # A rule has been deleted in the Windows Defender Firewall exception list
    - 2052         # A rule has been deleted in the Windows Defender Firewall exception list. (Windows 11)
  filter_main_generic:
    ModifyingApplication|startswith:
    - 'C:\Program Files (x86)\'
    - 'C:\Program Files\'
    - 'C:\Windows\WinSxS\'
  filter_main_svchost:
    ModifyingApplication: 'C:\Windows\System32\svchost.exe'
  filter_optional_msmpeng:
    ModifyingApplication|startswith: 'C:\ProgramData\Microsoft\Windows Defender\Platform\'
    ModifyingApplication|endswith: '\MsMpEng.exe'
  filter_main_null:
    ModifyingApplication:
  filter_main_empty:
    ModifyingApplication: ''
  condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
level: medium
notes: |
  ### Technical Context
  This detection rule identifies instances where a rule has been deleted from the Windows Firewall exception list, which can indicate attempts at evading network defenses or making unauthorized changes to firewall settings. It specifically looks for Windows Event IDs 2006 and 2052, which signal the deletion of firewall rules on various Windows operating systems, including Windows 11. The rule further refines detection by filtering out modifications made by known benign applications like Windows services and Microsoft Defender components, thus reducing false positives. Authorized programs such as services running from specific system directories, like `C:\Program Files` or `C:\Windows`, are excluded from triggering alerts, allowing incident responders to focus on potentially malicious modifications.
  ### Investigation Steps
  - Review the specific Event IDs (2006 or 2052) generated by the Windows Firewall to confirm the deletion action and its context.
  - Utilize EDR tools to trace back the modifying application’s activity and verify whether this action was initiated from a legitimate process or potentially malicious software.
  - Check the Windows Firewall log for additional details around the time of the deletion, such as if there were other concurrent system changes or unusual network traffic patterns.
  - Investigate related network connections through the NGFW or proxy logs to identify any suspicious outbound communications that may correlate with the firewall rule deletion.
