title: Uncommon New Firewall Rule Added In Windows Firewall Exception List
id: cde0a575-7d3d-4a49-9817-b8004a7bf105
status: experimental
description: Detects when a rule has been added to the Windows Firewall exception
  list
references:
- https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2008-r2-and-2008/dd364427(v=ws.10)
author: frack113
date: 2022-02-19
modified: 2024-08-29
tags:
- attack.defense-evasion
- attack.t1562.004
logsource:
  product: windows
  service: firewall-as
detection:
  selection:
    EventID:
    - 2004         # A rule has been added to the Windows Defender Firewall exception list
    - 2071         # A rule has been added to the Windows Defender Firewall exception list. (Windows 11)
    - 2097
  filter_main_block:
    Action: 2     # Block
  filter_main_generic:
    ApplicationPath|startswith:
    - 'C:\Program Files (x86)\'
    - 'C:\Program Files\'
    - 'C:\Windows\System32\'
    - 'C:\Windows\SysWOW64\'
    - 'C:\Windows\WinSxS\'
  filter_optional_msmpeng:
    ModifyingApplication|startswith: 'C:\ProgramData\Microsoft\Windows Defender\Platform\'
    ModifyingApplication|endswith: '\MsMpEng.exe'
  filter_main_covered_paths:
        # This filter is added to avoid duplicate alerting from 9e2575e7-2cb9-4da1-adc8-ed94221dca5e
    ApplicationPath|contains:
    - 'C:\PerfLogs\'
    - 'C:\Temp\'
    - 'C:\Tmp\'
    - 'C:\Users\Public\'
    - 'C:\Windows\Tasks\'
    - 'C:\Windows\Temp\'
    - '\AppData\Local\Temp\'
  filter_optional_no_path:
        # This filter filters a lot of FPs related to Windows Services
    ModifyingApplication:
    - 'C:\Windows\System32\svchost.exe'
    - 'C:\Windows\System32\dllhost.exe'
    ApplicationPath: ''
  filter_main_null:
    ApplicationPath:
  condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
level: medium
notes: |
  ### Technical Context
  This Sigma rule is designed to detect when a new rule has been added to the Windows Firewall exception list, which can be a precursor to malicious activity such as unauthorized access or evasion of security measures. It specifically looks for certain Windows Event IDs associated with firewall changes, particularly those reflecting added exceptions that may potentially compromise system security. The rule examines application paths to determine the legitimacy of the modifying applications and applies filters to ignore common benign exceptions often created by Windows services or well-known software installation paths. The monitoring of such events is crucial for maintaining a robust security posture, as any unauthorized changes to the firewall settings can indicate an attempt to bypass defenses.
  ### Investigation Steps
  - Utilize the EDR tool to review the event logs associated with the detected Event IDs (2004, 2071, 2097) for additional context on the modification.
  - Investigate the ApplicationPath of the modifying application to determine if it originates from a known safe location or if it indicates potentially malicious activity.
  - Check the network activity logs in the NGFW to identify any connections made by applications that have been newly added to the firewall exception list.
  - Confirm the user or process that initiated the change by correlating the firewall event logs with user activity records to assess the legitimacy of the action taken.
