title: New Firewall Rule Added In Windows Firewall Exception List Via WmiPrvSE.EXE
id: eca81e8d-09e1-4d04-8614-c91f44fd0519
status: experimental
description: |
  Detects the addition of a new "Allow" firewall rule by the WMI process (WmiPrvSE.EXE).
  This can occur if an attacker leverages PowerShell cmdlets such as "New-NetFirewallRule", or directly uses WMI CIM classes such as "MSFT_NetFirewallRule".
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1562.004/T1562.004.md#atomic-test-24---set-a-firewall-rule-using-new-netfirewallrule
- https://malware.news/t/the-rhysida-ransomware-activity-analysis-and-ties-to-vice-society/72170
- https://cybersecuritynews.com/rhysida-ransomware-attacking-windows/
author: frack113, Nasreddine Bencherchali (Nextron Systems)
date: 2024-05-10
tags:
- attack.defense-evasion
- attack.t1562.004
logsource:
  product: windows
  service: firewall-as
detection:
  selection:
    EventID:
    - 2004         # A rule has been added to the Windows Defender Firewall exception list
    - 2071         # A rule has been added to the Windows Defender Firewall exception list. (Windows 11)
    - 2097
    Action: 3     # Allow
    ModifyingApplication|endswith: ':\Windows\System32\wbem\WmiPrvSE.exe'
  condition: selection
falsepositives:
- Administrator scripts or activity.
level: medium
notes: |
  ### Technical Context
  This detection rule identifies the addition of new "Allow" firewall rules in the Windows Firewall exception list via the Windows Management Instrumentation (WMI) process, specifically `WmiPrvSE.EXE`. The rule is triggered by specific event IDs (2004, 2071, and 2097) associated with firewall modifications, filtering for entries that show a modification action classified as "Allow." This method can often be exploited by attackers through tools such as PowerShell cmdlets (like `New-NetFirewallRule`) or by manipulating WMI Common Information Model (CIM) classes (`MSFT_NetFirewallRule`). By monitoring this activity, security teams can detect potentially unauthorized changes that could aid in stealthy network access or other malicious actions.
  ### Investigation Steps
  - Review EDR logs to identify the timeline and process tree for the `WmiPrvSE.EXE` instance that triggered the firewall modification, looking for any suspicious parent processes.
  - Leverage firewall logs to analyze the specific rule added, including its parameters and any possible associations with known malicious activities.
  - Cross-reference the modification times with user activity logs from the event source to determine if administrative scripts or unauthorized user actions were in play.
  - Check Proxy and VPN logs for unusual traffic patterns that might suggest exploitation of newly opened ports or services following the firewall rule change.
