title: Windows Firewall Settings Have Been Changed
id: 00bb5bd5-1379-4fcf-a965-a5b6f7478064
status: test
description: Detects activity when the settings of the Windows firewall have been
  changed
references:
- https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2008-r2-and-2008/dd364427(v=ws.10)
author: frack113, Nasreddine Bencherchali (Nextron Systems)
date: 2022-02-19
modified: 2023-04-21
tags:
- attack.defense-evasion
- attack.t1562.004
logsource:
  product: windows
  service: firewall-as
detection:
  selection:
    EventID:
    - 2002         # A Windows Defender Firewall setting has changed.
    - 2083         # A Windows Defender Firewall setting has changed. (Windows 11)
    - 2003         # A Windows Firewall setting in the profile has changed
    - 2082         # A Windows Defender Firewall setting in the %1 profile has changed. (Windows 11)
    - 2008          # Windows Firewall Group Policy settings have changed. The new settings have been applied
            # - 2010  # Network profile changed on an interface.
  condition: selection
level: low
notes: |
  ### Technical Context
  This Sigma rule is designed to detect unauthorized changes to Windows Firewall settings, which can be indicative of potential attacks, such as configurations being altered by an intruder in an effort to evade detection. The rule flags specific Event IDs related to changes in firewall settings, including alterations directly made to the Windows Defender Firewall or Group Policy settings. These events are crucial because they provide insights into activities like the modification of allowed or blocked applications, network traffic rules, and other security settings that could affect the overall security posture of the system. The relevant data sources for this rule include Windows event logs that specifically track firewall configuration changes.
  ### Investigation Steps
  - Review Windows Event Logs for the captured Event IDs (2002, 2003, 2008) to determine the source and nature of the settings change.
  - Utilize EDR tools to analyze the process context surrounding the event, checking for any unusual or unauthorized processes that may have initiated the firewall changes.
  - Cross-reference proxy and VPN logs to identify if there were any suspicious connections or data exfiltration attempts occurring around the time of the firewall modifications.
  - Assess the current firewall rules and compare them with a known baseline configuration to pinpoint any unauthorized or unexpected changes that may have been made.
