title: New Firewall Rule Added In Windows Firewall Exception List For Potential Suspicious
  Application
id: 9e2575e7-2cb9-4da1-adc8-ed94221dca5e
related:
- id: cde0a575-7d3d-4a49-9817-b8004a7bf105
  type: derived
status: experimental
description: Detects the addition of a new rule to the Windows Firewall exception
  list for an application located in a potentially suspicious location.
references:
- https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2008-r2-and-2008/dd364427(v=ws.10)
- https://app.any.run/tasks/7123e948-c91e-49e0-a813-00e8d72ab393/#
author: frack113
date: 2023-02-26
modified: 2024-05-10
tags:
- attack.defense-evasion
- attack.t1562.004
logsource:
  product: windows
  service: firewall-as
detection:
  selection:
    EventID:
    - 2004         # A rule has been added to the Windows Defender Firewall exception list. (Windows 10)
    - 2071         # A rule has been added to the Windows Defender Firewall exception list. (Windows 11)
    - 2097
    ApplicationPath|contains:
    - ':\PerfLogs\'
    - ':\Temp\'
    - ':\Tmp\'
    - ':\Users\Public\'
    - ':\Windows\Tasks\'
    - ':\Windows\Temp\'
    - '\AppData\Local\Temp\'
  filter_main_block:
    Action: 2     # Block
  condition: selection and not 1 of filter_main_*
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  This Sigma rule is designed to detect potentially suspicious activity related to the Windows Firewall by monitoring for newly added rules that permit applications situated in specific atypical directories. The focus is on applications located in directories that are common targets for malware, such as `Temp`, `AppData`, or `PerfLogs`, which could indicate an attempt to bypass security controls. The rule leverages Windows security event logs, specifically looking at Event IDs 2004, 2071, and 2097, which signify the addition of new exceptions to the Windows Firewall. When these events are logged, it signifies that an application has been granted network permissions, potentially allowing it to communicate externally—a key vector for data exfiltration, lateral movement, or command-and-control communications.
  ### Investigation Steps
  - Review the associated Event IDs in the Windows Defender Firewall logs to identify which application was added and its originating directory to assess the legitimacy of the change.
  - Utilize the EDR tool to analyze the process behavior of the newly added application, checking for any suspicious activities such as anomalous network connections or unexpected file modifications.
  - Examine other security logs (e.g., AV, NDR) for any related alerts or events that might indicate malicious behavior associated with the application or the directory it is stored in.
  - Verify user activity logs to determine who made the change to the firewall settings and whether this aligns with typical user behavior, helping establish if this activity was authorized or indicative of a compromise.
