title: Suspicious Usage of CVE_2021_34484 or CVE 2022_21919
id: 52a85084-6989-40c3-8f32-091e12e17692
status: test
description: During exploitation of this vulnerability, two logs (Provider_Name:Microsoft-Windows-User
  Profiles Service) with EventID 1511 and 1515 (maybe lot of false positives with
  this event) are created. Moreover, it appears the directory \Users\TEMP is created
  may be created during the exploitation. Viewed on 2008 Server
references:
- https://packetstormsecurity.com/files/166692/Windows-User-Profile-Service-Privlege-Escalation.html
author: Cybex
date: 2022-08-16
modified: 2023-05-02
tags:
- attack.execution
logsource:
  product: windows
  service: application
detection:
  selection:
    EventID: 1511
    Provider_Name: 'Microsoft-Windows-User Profiles Service'
  condition: selection
falsepositives:
- Corrupted user profiles - 
  https://social.technet.microsoft.com/wiki/contents/articles/3571.windows-user-profiles-service-event-1511-windows-cannot-find-the-local-profile-and-is-logging-you-on-with-a-temporary-profile.aspx
level: low
notes: |
  ### Technical Context
  This detection rule identifies suspicious activity related to the exploitation of known vulnerabilities CVE-2021-34484 and CVE-2022-21919, particularly focusing on Windows Event IDs 1511 and 1515 logged by the Microsoft-Windows-User Profiles Service. When these vulnerabilities are exploited, they can trigger specific event logs indicating potential privilege escalation attempts or manipulation of user profiles. Additionally, the creation of the temporary directory `\Users\TEMP` may signify exploitation attempts, as this behavior is atypical under normal circumstances. By analyzing these indicators in Windows event logs, security teams can pinpoint efforts to exploit these vulnerabilities and take further precautionary measures.
  ### Investigation Steps
  - Review the Windows event logs for Event IDs 1511 and 1515 from the Microsoft-Windows-User Profiles Service to determine the context of the events.
  - Check EDR logs for any unusual process creations or command-line arguments originating from the same timeframe as the suspicious events.
  - Investigate the creation and contents of the `\Users\TEMP` directory to identify any unexpected files or artifacts created during the timeframe of concern.
  - Correlate findings with historical data and alerts from AV and NGFW tools to identify any previous indicators related to this issue or the specific vulnerabilities referenced.
