title: Windows Update Error
id: 13cfeb75-9e33-4d04-b0f7-ab8faaa95a59
status: stable
description: |
  Detects Windows update errors including installation failures and connection issues. Defenders should observe this in case critical update KBs aren't installed.
references:
- https://github.com/nasbench/EVTX-ETW-Resources/blob/f1b010ce0ee1b71e3024180de1a3e67f99701fe4/ETWProvidersManifests/Windows10/1903/W10_1903_Pro_20200714_18362.959/WEPExplorer/Microsoft-Windows-WindowsUpdateClient.xml
author: frack113
date: 2021-12-04
modified: 2023-09-07
tags:
- attack.impact
- attack.resource-development
- attack.t1584
logsource:
  product: windows
  service: system
detection:
  selection:
    Provider_Name: Microsoft-Windows-WindowsUpdateClient
    EventID:
    - 16         # Unable to Connect: Windows is unable to connect to the automatic updates service and therefore cannot download and install updates according to the set schedule
    - 20         # Installation Failure: Windows failed to install the following update with error
    - 24         # Uninstallation Failure: Windows failed to uninstall the following update with error
    - 213         # Revert Failure: Windows failed to revert the following update with error
    - 217         # Commit Failure: Windows failed to commit the following update with error
  condition: selection
falsepositives:
- Unknown
level: informational
notes: |
  ### Technical Context
  The "Windows Update Error" detection rule identifies specific event logs generated by the Windows Update Client that indicate various types of failures during the update process. By monitoring for Event IDs related to connection issues, installation failures, uninstallation failures, revert failures, and commit failures, it helps Security Operations Center (SOC) analysts ensure that critical updates are applied in a timely manner. This rule leverages data from Windows system logs, specifically events logged under the Microsoft-Windows-WindowsUpdateClient provider, to detect potential issues that could leave systems vulnerable due to missing critical updates or configurations.
  This rule is essential for maintaining the overall security posture of the enterprise by ensuring that vital Windows updates are successfully installed, as failures could lead to exposure to known vulnerabilities. Analysts should pay close attention to the identified event IDs, as they indicate specific reasons for update failures and can aid in diagnosing underlying issues that may require remediation.
  ### Investigation Steps
  - Review the specific event logs in the Windows Event Viewer under the "Applications and Services Logs" > "Microsoft" > "Windows" > "WindowsUpdateClient" section for the relevant Event IDs (16, 20, 24, 213, 217).
  - Utilize your Endpoint Detection and Response (EDR) tool to correlate the identified update failures with system activity or any recent changes made to the system configuration.
  - Check the network connectivity and proxy logs stored in your firewall or Proxy device logs to ensure that the endpoints have appropriate access to the update services.
  - Assess the security posture of affected systems by running vulnerability scans to identify any potential threats stemming from pending updates or missed patches.
