title: Removal Of SD Value to Hide Schedule Task - Registry
id: acd74772-5f88-45c7-956b-6a7b36c294d2
related:
- id: 526cc8bc-1cdc-48ad-8b26-f19bff969cec
  type: similar
status: test
description: Remove SD (Security Descriptor) value in \Schedule\TaskCache\Tree registry
  hive to hide schedule task. This technique is used by Tarrask malware
references:
- https://www.microsoft.com/security/blog/2022/04/12/tarrask-malware-uses-scheduled-tasks-for-defense-evasion/
author: Sittikorn S
date: 2022-04-15
modified: 2023-02-08
tags:
- attack.defense-evasion
- attack.t1562
logsource:
  product: windows
  category: registry_delete
detection:
  selection:
    EventType: DeleteKey
    TargetObject|contains|all:
    - '\SOFTWARE\Microsoft\Windows NT\CurrentVersion\Schedule\TaskCache\Tree\'
    - 'SD'
  condition: selection
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  This detection rule identifies potential attempts to conceal scheduled tasks in a Windows environment by monitoring deletions of Security Descriptor (SD) values in the registry under the path `\SOFTWARE\Microsoft\Windows NT\CurrentVersion\Schedule\TaskCache\Tree\`. The rule specifically triggers when there is an `EventType` of `DeleteKey` and the target object includes the SD value. Such behavior is indicative of tactics employed by the Tarrask malware, which leverages scheduled tasks for evasion from security controls. By manipulating registry settings, attackers can potentially hide malicious tasks that would otherwise be flagged during routine security assessments.
  This detection utilizes registry deletion logs as the primary data source, enabling it to alert on unauthorized changes to the scheduled tasks configuration. Analysts responding to alerts generated by this rule should therefore focus on registry activity within Windows systems, leveraging data to understand the context of the removed SD values.
  ### Investigation Steps
  - Review the relevant registry logs to identify the specific `DeleteKey` events associated with the `SD` value in the scheduled tasks registry path.
  - Utilize EDR tools to investigate the process activity around the time of the registry change, checking for any associated processes that may correlate with known malicious behavior.
  - Examine scheduled tasks on affected systems to identify any tasks that might be hidden or altered, looking for unfamiliar or unexpected entries.
  - Consult additional threat intelligence sources to gather context around the Tarrask malware and its behavioral patterns, aiding in understanding the broader impact on the organization.
