title: Suspicious Rejected SMB Guest Logon From IP
id: 71886b70-d7b4-4dbf-acce-87d2ca135262
status: test
description: Detect Attempt PrintNightmare (CVE-2021-1675) Remote code execution in
  Windows Spooler Service
references:
- https://twitter.com/KevTheHermit/status/1410203844064301056
- https://web.archive.org/web/20210629055600/https://github.com/hhlxf/PrintNightmare/
- https://web.archive.org/web/20210701042336/https://github.com/afwu/PrintNightmare
author: Florian Roth (Nextron Systems), KevTheHermit, fuzzyf10w
date: 2021-06-30
modified: 2023-01-02
tags:
- attack.credential-access
- attack.t1110.001
logsource:
  product: windows
  service: smbclient-security
detection:
  selection:
    EventID: 31017
    UserName: ''
    ServerName|startswith: '\1'
  condition: selection
fields:
- Computer
- User
falsepositives:
- Account fallback reasons (after failed login with specific account)
level: medium
notes: |
  ### Technical Context
  This Sigma rule is designed to detect suspicious SMB guest logon attempts that may indicate an exploitation attempt using the PrintNightmare vulnerability (CVE-2021-1675). The rule focuses on Windows SMB client security logs, specifically looking for Event ID 31017, which indicates a rejected logon attempt from a guest account. The filtering is based on the username being empty and the server name starting with a backslash, indicating that the logon attempt is targeting a local or remote print service. By monitoring these events, the rule helps identify potentially malicious activities attempting to exploit the Windows Spooler Service, allowing incident responders to investigate further.
  ### Investigation Steps
  - Use EDR to search for any recent Event ID 31017 entries across all endpoints to identify the source of the rejected logons.
  - Analyze network logs to check for unusual SMB traffic originating from the IP address that made the guest logon attempts, as this can provide insight into possible lateral movement.
  - Examine Windows Security logs to correlate failed logon attempts with other suspicious activities, such as process creation events, on the involved systems.
  - Review endpoint and server configurations for improperly set permissions or policies that might allow guest logins, assessing whether any policy adjustments are needed to mitigate future risks.
