title: Password Dumper Remote Thread in LSASS
id: f239b326-2f41-4d6b-9dfa-c846a60ef505
status: stable
description: |
  Detects password dumper activity by monitoring remote thread creation EventID 8 in combination with the lsass.exe process as TargetImage.
  The process in field Process is the malicious program. A single execution can lead to hundreds of events.
references:
- https://jpcertcc.github.io/ToolAnalysisResultSheet/details/WCE.htm
author: Thomas Patzke
date: 2017-02-19
modified: 2021-06-21
tags:
- attack.credential-access
- attack.s0005
- attack.t1003.001
logsource:
  product: windows
  category: create_remote_thread
detection:
  selection:
    TargetImage|endswith: '\lsass.exe'
    StartModule: ''
  condition: selection
falsepositives:
- Antivirus products
level: high
notes: |
  ### Technical Context
  The detection rule focuses on identifying potential malicious activities associated with password dumping utilities that target the Local Security Authority Subsystem Service (LSASS) process in Windows environments. It primarily tracks the creation of remote threads within the LSASS process, specifically monitoring for Event ID 8. By analyzing this event alongside the targeted `lsass.exe` process, the rule can pinpoint when a suspicious application attempts to access sensitive authentication data. Such activity often indicates the use of password dumpers, which can compromise credentials that are critical for network security. The primary data source examined in this rule is process creation logs, which capture relevant details about thread initiation and the executing processes.
  ### Investigation Steps
  - Use the EDR solution to correlate the alert with recent activity on the affected system, looking for any unusual process executions involving `lsass.exe` or other suspicious activities.
  - Investigate command-line parameters of the identified processes for any indicators of malicious intent or known password dumping tools, particularly those associated with the `TargetImage`.
  - Review historical logs from the SIEM for instances of process creation events related to the same source IP or user credentials that triggered the alert.
  - Check network traffic through the NDR to identify any communication with known command-and-control servers or unusual external connections made by the involved processes.
