title: HackTool - CACTUSTORCH Remote Thread Creation
id: 2e4e488a-6164-4811-9ea1-f960c7359c40
status: test
description: Detects remote thread creation from CACTUSTORCH as described in references.
references:
- https://twitter.com/SBousseaden/status/1090588499517079552     # Deleted
- https://github.com/mdsecactivebreach/CACTUSTORCH
author: '@SBousseaden (detection), Thomas Patzke (rule)'
date: 2019-02-01
modified: 2023-05-05
tags:
- attack.defense-evasion
- attack.execution
- attack.t1055.012
- attack.t1059.005
- attack.t1059.007
- attack.t1218.005
logsource:
  product: windows
  category: create_remote_thread
detection:
  selection:
    SourceImage|endswith:
    - '\System32\cscript.exe'
    - '\System32\wscript.exe'
    - '\System32\mshta.exe'
    - '\winword.exe'
    - '\excel.exe'
    TargetImage|contains: '\SysWOW64\'
    StartModule:
  condition: selection
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  The Sigma rule titled "HackTool 
  - CACTUSTORCH Remote Thread Creation" is designed to detect the malicious use of remote thread creation through specific Windows executables commonly associated with both legitimate and illegitimate scripts. The rule looks for instances where processes such as `cscript.exe`, `wscript.exe`, `mshta.exe`, `winword.exe`, and `excel.exe` create remote threads targeting DLLs located in the `SysWOW64` directory, indicating potential exploitation by the CACTUSTORCH tool. This behavior can often be linked to various forms of attack, including defense evasion and remote code execution, as it leverages scripting engines and Office applications to inject malicious code into other processes.
  To bolster its effectiveness, the rule taps into logs generated by the Windows operating system, particularly those documenting remote thread creation events. By analyzing these logs, security teams can identify unauthorized thread creation activities that could signify an active compromise, positioning themselves to respond appropriately before significant damage occurs.
  ### Investigation Steps
  - Review EDR logs to locate the specific instances of remote thread creation associated with the identified source images (`cscript.exe`, `wscript.exe`, `mshta.exe`, `winword.exe`, and `excel.exe`).
  - Analyze the command-line parameters of the processes to ascertain whether any suspicious scripts or commands were executed, hinting at potential exploitation or malicious activity.
  - Inspect the associated process behavior in the context of network activity, utilizing NDR tools to identify unusual outbound connections or communication patterns that may suggest a compromise.
  - Check the logs from NGFW and Proxy for any sign of data exfiltration or callbacks to known malicious infrastructure linked to CACTUSTORCH activities, as these can help confirm whether a breach occurred.
