title: Remote Thread Creation In Uncommon Target Image
id: a1a144b7-5c9b-4853-a559-2172be8d4a03
related:
- id: f016c716-754a-467f-a39e-63c06f773987
  type: obsolete
status: experimental
description: Detects uncommon target processes for remote thread creation
references:
- https://web.archive.org/web/20220319032520/https://blog.redbluepurple.io/offensive-research/bypassing-injection-detection
author: Florian Roth (Nextron Systems)
date: 2022-03-16
modified: 2024-07-15
tags:
- attack.defense-evasion
- attack.privilege-escalation
- attack.t1055.003
logsource:
  product: windows
  category: create_remote_thread
detection:
  selection:
    TargetImage|endswith:
    - '\calc.exe'
    - '\calculator.exe'
    - '\mspaint.exe'
    - '\notepad.exe'
    - '\ping.exe'
    - '\sethc.exe'
    - '\spoolsv.exe'
    - '\wordpad.exe'
    - '\write.exe'
  filter_main_csrss:
    SourceImage: 'C:\Windows\System32\csrss.exe'
  filter_optional_aurora_1:
    StartFunction: 'EtwpNotificationThread'
  filter_optional_aurora_2:
    SourceImage|contains: 'unknown process'
  filter_optional_vmtoolsd:
    SourceImage: 'C:\Program Files\VMware\VMware Tools\vmtoolsd.exe'
    StartFunction: 'GetCommandLineW'
    TargetImage:
    - 'C:\Windows\System32\notepad.exe'
    - 'C:\Windows\System32\spoolsv.exe'
  filter_optional_xerox_pjems:
    SourceImage: 'C:\Program Files\Xerox\XeroxPrintExperience\CommonFiles\XeroxPrintJobEventManagerService.exe'
    StartFunction: 'LoadLibraryW'
    TargetImage: 'C:\Windows\System32\spoolsv.exe'
  condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  This detection rule is designed to identify remote thread creation attempts in uncommon target processes, specifically focusing on popular Windows applications like calculator, notepad, and paint. Remote thread creation can be an indicator of malicious activity, such as privilege escalation or laterally spreading malware. The rule looks for process creation logs specifically looking for instances where these benign applications are targeted by `csrss.exe`, the client-server runtime subsystem, which is a critical system process. 
  The rule leverages several filters to reduce false positives, focusing on scenarios where the thread is initiated by known safe sources, such as `vmtoolsd.exe` and `XeroxPrintJobEventManagerService.exe`. If these known processes are not in play and remote threads are detected in the targeted applications, the alert is triggered, suggesting potentially suspicious behavior that warrants further investigation.
  ### Investigation Steps
  - Review the recent process creation and remote thread events in the EDR system to understand the context of the alert.
  - Examine the command-line parameters passed to the suspicious processes, especially focusing on any unusual arguments.
  - Utilize the SIEM to correlate the event timestamps with other logs, such as firewall or VPN logs, to identify any related suspicious activities.
  - Check the source of the process that initiated the remote thread creation to ascertain its legitimacy and possible compromise.
