title: WinDivert Driver Load
id: 679085d5-f427-4484-9f58-1dc30a7c426d
status: test
description: Detects the load of the Windiver driver, a powerful user-mode capture/sniffing/modification/blocking/re-injection
  package for Windows
references:
- https://reqrypt.org/windivert-doc.html
- https://rastamouse.me/ntlm-relaying-via-cobalt-strike/
author: Florian Roth (Nextron Systems)
date: 2021-07-30
modified: 2024-11-23
tags:
- attack.collection
- attack.defense-evasion
- attack.t1599.001
- attack.t1557.001
logsource:
  category: driver_load
  product: windows
detection:
  selection:
  - ImageLoaded|contains:
    - '\WinDivert.sys'
    - '\WinDivert64.sys'
              # Other used names
    - '\NordDivert.sys'
    - '\lingtiwfp.sys'
    - '\eswfp.sys'
  - Hashes|contains:
    - 'IMPHASH=0604bb7cb4bb851e2168d5c7d9399087'
    - 'IMPHASH=2e5f0e649d97f32b03c09e4686d0574f'
    - 'IMPHASH=52f8aa269f69f0edad9e8fcdaedce276'
    - 'IMPHASH=c0e5d314da39dbf65a2dbff409cc2c76'
    - 'IMPHASH=58623490691babe8330adc81cd04a663'
    - 'IMPHASH=8ee39b48656e4d6b8459d7ba7da7438b'
    - 'IMPHASH=45ee545ae77e8d43fc70ede9efcd4c96'
    - 'IMPHASH=a1b2e245acd47e4a348e1a552a02859a'
    - 'IMPHASH=2a5f85fe4609461c6339637594fa9b0a'
    - 'IMPHASH=6b2c6f95233c2914d1d488ee27531acc'
    - 'IMPHASH=9f2fdd3f9ab922bbb0560a7df46f4342'
    - 'IMPHASH=d8a719865c448b1bd2ec241e46ac1c88'
    - 'IMPHASH=0ea54f8c9af4a2fe8367fa457f48ed38'
    - 'IMPHASH=9d519ae0a0864d6d6ae3f8b6c9c70af6'
    - 'IMPHASH=a74929edfc3289895e3f2885278947ae'
    - 'IMPHASH=a66b476c2d06c370f0a53b5537f2f11e'
    - 'IMPHASH=bdcd836a46bc2415773f6b5ea77a46e4'
    - 'IMPHASH=c28cd6ccd83179e79dac132a553693d9'
  condition: selection
falsepositives:
- Legitimate WinDivert driver usage
level: high
notes: |
  ### Technical Context
  The "WinDivert Driver Load" detection rule identifies the loading of the WinDivert driver, which is commonly used for network packet capture and manipulation on Windows systems. By monitoring driver load events, this rule specifically looks for the presence of the WinDivert driver binaries and related filenames within the system logs, as well as specific import hashes associated with known malicious variants. The primary log sources include driver load events generated by the Windows operating system, allowing for the detection of potential misuse of WinDivert for nefarious purposes such as active reconnaissance or data exfiltration.
  The detection mechanism focuses on the presence of specific strings indicating WinDivert or its variants, as well as known import hashes linked to this driver, which might indicate either legitimate use or potential exploitation by malware. Analysts should consider both the legitimate applications of this driver and the context in which it is loaded to effectively differentiate between normal and suspicious activity.
  ### Investigation Steps
  - Review endpoint EDR logs for the driver load events to confirm the loading of any instances of WinDivert or associated files.
  - Check command-line parameters in recent process creations on affected systems that may indicate unauthorized manipulation of network traffic.
  - Analyze network traffic recorded by your NDR tool for any unusual patterns that coincide with the driver load, indicating potential misuse.
  - Consult cloud logging services (if applicable) for any recent deployments or changes that may involve the usage of the WinDivert driver in remote or virtualized environments.
