title: Vulnerable HackSys Extreme Vulnerable Driver Load
id: 295c9289-acee-4503-a571-8eacaef36b28
status: test
description: Detects the load of HackSys Extreme Vulnerable Driver which is an intentionally
  vulnerable Windows driver developed for security enthusiasts to learn and polish
  their exploitation skills at Kernel level and often abused by threat actors
references:
- https://github.com/hacksysteam/HackSysExtremeVulnerableDriver
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-08-18
modified: 2024-11-23
tags:
- attack.privilege-escalation
- attack.t1543.003
logsource:
  product: windows
  category: driver_load
detection:
  selection:
  - ImageLoaded|endswith: '\HEVD.sys'
  - Hashes|contains:
    - 'IMPHASH=f26d0b110873a1c7d8c4f08fbeab89c5'           # Version 3.0
    - 'IMPHASH=c46ea2e651fd5f7f716c8867c6d13594'           # Version 3.0
  condition: selection
falsepositives:
- Unlikely
level: high
notes: |
  ### Technical Context
  This Sigma rule is designed to detect the loading of the HackSys Extreme Vulnerable Driver (HEVD.sys), which is a known intentionally vulnerable driver used for educational purposes in security testing. This driver can be employed maliciously by attackers aiming to exploit weaknesses at the kernel level for privilege escalation. The rule inspects Windows driver load logs to identify instances where the driver HEVD.sys is loaded, filtering based on specific hash values to ensure that it captures the correct, potentially malicious versions of the driver. By leveraging data from the log source category "driver_load," this rule effectively identifies potential misuse of a known vulnerable component.
  ### Investigation Steps
  - Investigate the event logs that triggered the alert in your SIEM to confirm the loading of HEVD.sys and identify any related process behavior.
  - Use EDR tools to perform a comprehensive review of the system where the alert occurred, focusing on recent process creations, command-line arguments, and any associated parent-child process relationships.
  - Check for any unusual or unauthorized activities in Network Detection and Response (NDR) logs that might indicate lateral movement or other malicious actions coinciding with the driver load.
  - Analyze endpoint protection (AV) and threat intelligence feeds for recent indicators of compromise associated with the usage of the HackSys Extreme Vulnerable Driver to determine if there are broader implications for the environment.
