title: A Member Was Removed From a Security-Enabled Global Group
id: 02c39d30-02b5-45d2-b435-8aebfe5a8629
related:
- id: 9cf01b6c-e723-4841-a868-6d7f8245ca6e
  type: obsolete
status: stable
description: Detects activity when a member is removed from a security-enabled global
  group
references:
- https://www.cisecurity.org/controls/cis-controls-list/
- https://www.pcisecuritystandards.org/documents/PCI_DSS_v3-2-1.pdf
- https://nvlpubs.nist.gov/nistpubs/CSWP/NIST.CSWP.04162018.pdf
- https://www.ultimatewindowssecurity.com/securitylog/encyclopedia/event.aspx?eventID=4729
- https://www.ultimatewindowssecurity.com/securitylog/encyclopedia/event.aspx?eventID=633
author: Alexandr Yampolskyi, SOC Prime
date: 2023-04-26
tags:
- attack.persistence
- attack.t1098
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID:
    - 633         # Security Enabled Global Group Member Removed
    - 4729         # A member was removed from a security-enabled global group
  condition: selection
falsepositives:
- Unknown
level: low
notes: |
  ### Technical Context
  This detection rule is designed to identify when a member is removed from a security-enabled global group within a Windows environment. Specifically, it looks for events logged by the security service that correspond to Event IDs 633 and 4729, which indicate that a user has been removed from a group that has security implications. This action may be legitimate, such as during organizational changes, but it can also indicate potential insider threats or misconfigurations. The primary data sources involved in this detection include Windows Security Logs, which record access and modification events related to user account management and group membership alterations.
  ### Investigation Steps
  - Review the Windows Security Event logs using your EDR tool to confirm the details of the member removal event, including the identity of the user removed and the timestamp of the action.
  - Check for any recent changes in group memberships by correlating the events around Event ID 4729 to identify patterns that may suggest unusual or unauthorized activity.
  - Assess user activity leading up to the removal, utilizing logs from proxy and VPN to determine whether the user had any suspicious access or actions prior to being removed from the group.
  - Consult with IT and HR teams to validate whether the removal aligns with approved personnel changes or organizational restructuring, ensuring there is no miscommunication or oversight.
