title: A Security-Enabled Global Group Was Deleted
id: b237c54b-0f15-4612-a819-44b735e0de27
related:
- id: 9cf01b6c-e723-4841-a868-6d7f8245ca6e
  type: obsolete
status: stable
description: Detects activity when a security-enabled global group is deleted
references:
- https://www.cisecurity.org/controls/cis-controls-list/
- https://www.pcisecuritystandards.org/documents/PCI_DSS_v3-2-1.pdf
- https://nvlpubs.nist.gov/nistpubs/CSWP/NIST.CSWP.04162018.pdf
- https://www.ultimatewindowssecurity.com/securitylog/encyclopedia/event.aspx?eventID=4730
- https://www.ultimatewindowssecurity.com/securitylog/encyclopedia/event.aspx?eventID=634
author: Alexandr Yampolskyi, SOC Prime
date: 2023-04-26
tags:
- attack.persistence
- attack.t1098
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID:
    - 4730         # A security-enabled global group was deleted
    - 634         # Security Enabled Global Group Deleted
  condition: selection
falsepositives:
- Unknown
level: low
notes: |
  ### Technical Context
  This detection rule targets the deletion of security-enabled global groups within a Windows environment. Specifically, the rule monitors event logs for Event IDs 4730 and 634, which correspond to activities where a security-enabled global group was deleted. These events are significant in identifying potential malicious actions, such as unauthorized access or malicious changes to permissions that could impact security posture. By analyzing these events, security teams can uncover whether the deletion was legitimate or the result of an intrusion attempt.
  The primary data sources utilized in this rule are security logs from Windows systems. These logs capture crucial information about security events, including user actions and system changes. Recognizing the deletion of security groups is essential for understanding the overall security landscape and maintaining the integrity of access control mechanisms within the network.
  ### Investigation Steps
  - **Review Security Logs:** Check the Windows security logs for Event IDs 4730 and 634, noting the timestamp and user account that initiated the deletion to establish context.
  - **Correlate with User Activity:** Use the EDR tool to correlate the event with other user activity leading up to the deletion, especially looking for any unusual logins or privilege escalations.
  - **Analyze Group Memberships:** Investigate the memberships of the deleted group to determine what access may have been revoked and whether sensitive resources were involved.
  - **Conduct a Change Review:** Conduct a review of recent changes in the environment, including any administrator actions, and cross-reference with other logs (e.g., SIEM, cloud logs) for any abnormal behavior.
