title: Successful Overpass the Hash Attempt
id: 192a0330-c20b-4356-90b6-7b7049ae0b87
status: test
description: Detects successful logon with logon type 9 (NewCredentials) which matches
  the Overpass the Hash behavior of e.g Mimikatz's sekurlsa::pth module.
references:
- https://web.archive.org/web/20220419045003/https://cyberwardog.blogspot.com/2017/04/chronicles-of-threat-hunter-hunting-for.html
author: Roberto Rodriguez (source), Dominik Schaudel (rule)
date: 2018-02-12
modified: 2021-11-27
tags:
- attack.lateral-movement
- attack.s0002
- attack.t1550.002
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 4624
    LogonType: 9
    LogonProcessName: seclogo
    AuthenticationPackageName: Negotiate
  condition: selection
falsepositives:
- Runas command-line tool using /netonly parameter
level: high
notes: |
  ### Technical Context
  The "Successful Overpass the Hash Attempt" detection rule identifies instances of logon type 9, which refers to "New Credentials" in Windows environments. This type of logon is indicative of techniques employed in lateral movement attacks, such as those executed by the Mimikatz tool's sekurlsa::pth module. The rule specifically monitors Event ID 4624, which logs successful logon attempts, while focusing on distinct attributes like the LogonType, LogonProcessName, and AuthenticationPackageName. By leveraging these details, the rule is designed to highlight unauthorized credential usage that could lead to privilege escalation and further compromise within the network.
  To effectively respond to alerts generated by this rule, incident responders should consider the context of the environment and investigate the sources of the logins. These sources include security logs, process creation logs, and network-related activity that may provide additional indicators of compromise or normal user behavior.
  ### Investigation Steps
  - Examine the security logs to identify the specific Event ID 4624 entries related to the alerts, focusing on timestamps and associated usernames to determine the legitimacy of the logon.
  - Utilize EDR tools to trace the processes running on the host at the time of the logon event, looking for instances of Mimikatz or any other anomalous processes that may indicate a compromise.
  - Review command-line arguments and parameters associated with the logon attempts, especially for cases where tools like "runas" were used, to assess whether they align with expected operational behavior.
  - Correlate network activity logs (from the NGFW or NDR) to determine if there were any unusual access attempts to other systems immediately following the logon event that could suggest lateral movement.
