title: Successful Account Login Via WMI
id: 5af54681-df95-4c26-854f-2565e13cfab0
status: stable
description: Detects successful logon attempts performed with WMI
references:
- Internal Research
author: Thomas Patzke
date: 2019-12-04
modified: 2024-01-17
tags:
- attack.execution
- attack.t1047
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 4624
    ProcessName|endswith: '\WmiPrvSE.exe'
  condition: selection
falsepositives:
- Monitoring tools
- Legitimate system administration
level: low
notes: |
  ### Technical Context
  This detection rule focuses on identifying successful logon attempts that utilize Windows Management Instrumentation (WMI), specifically tracking processes run by `WmiPrvSE.exe`. WMI is a powerful feature in Windows operating systems that allows for the management and monitoring of system resources. By analyzing security event logs for Event ID 4624, which indicates a successful user logon, this rule can detect when such logins are performed via the WMI provider service. The key aspect of this detection involves parsing logs for instances where the process name ends with `WmiPrvSE.exe`, which can indicate potentially unauthorized or malicious activity, particularly if occurring in unusual contexts.
  ### Investigation Steps
  - Review the contextual details of the detected WMI logon attempt in the EDR tool to check the account used and any associated activities. This can help determine if the logon is legitimate or requires further investigation.
  - Cross-reference the logon timestamp with other security logs to identify any preceding or following suspicious activity that may indicate a compromised account.
  - Utilize network traffic analysis tools (NDR) to monitor any unusual outbound connections that might coincide with the usage of WMI for logon, which could signify an attacker leveraging these methods for lateral movement or data exfiltration. 
  - Check relevant process creation logs for additional activity generated by `WmiPrvSE.exe`, specifically any command line arguments that may provide insight into the purpose of the logon attempt and whether it was part of standard operations.
