title: A Member Was Added to a Security-Enabled Global Group
id: c43c26be-2e87-46c7-8661-284588c5a53e
related:
- id: 9cf01b6c-e723-4841-a868-6d7f8245ca6e
  type: obsolete
status: stable
description: Detects activity when a member is added to a security-enabled global
  group
references:
- https://www.cisecurity.org/controls/cis-controls-list/
- https://www.pcisecuritystandards.org/documents/PCI_DSS_v3-2-1.pdf
- https://nvlpubs.nist.gov/nistpubs/CSWP/NIST.CSWP.04162018.pdf
- https://www.ultimatewindowssecurity.com/securitylog/encyclopedia/event.aspx?eventID=4728
- https://www.ultimatewindowssecurity.com/securitylog/encyclopedia/event.aspx?eventID=632
author: Alexandr Yampolskyi, SOC Prime
date: 2023-04-26
tags:
- attack.persistence
- attack.t1098
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID:
    - 4728         # A member was added to a security-enabled global group
    - 632         # Security Enabled Global Group Member Added
  condition: selection
falsepositives:
- Unknown
level: low
notes: |
  ### Technical Context
  This detection rule identifies events where a member is added to a security-enabled global group in a Windows environment. The primary log sources for this rule are Windows Security logs, specifically looking for Event IDs 4728 and 632. Event ID 4728 indicates that a security principal (user or group) has been added to a group that has security permissions. Event ID 632 provides similar information but may pertain to a slightly different context or source. Detection of these events can signal potential changes in user permissions which may be associated with privilege escalation or unauthorized access risks, and therefore warrant further investigation.
  The rule is designed to catch such modifications in group membership, enabling security operations teams to monitor for unusual or unauthorized changes that could indicate malicious insider activity or external threats aiming to compromise system security.
  ### Investigation Steps
  - Examine the Security logs on the affected Windows machine using your EDR tool to identify the specific user or group that was added to the security-enabled global group.
  - Cross-reference the timestamps of the events with user activity logs from your SIEM to identify if the changes align with any legitimate administrative activities or if they appear suspicious.
  - Utilize your AV and threat intelligence tools to check if the affected user or group has been associated with known malicious activities or compromised credentials.
  - Analyze related network traffic using NDR tools to determine if there are abnormal connections or methodical access attempts following the group membership change, indicating potential exploitation.
