title: Outgoing Logon with New Credentials
id: def8b624-e08f-4ae1-8612-1ba21190da6b
status: test
description: Detects logon events that specify new credentials
references:
- https://go.recordedfuture.com/hubfs/reports/mtp-2021-0914.pdf
author: Max Altgelt (Nextron Systems)
date: 2022-04-06
tags:
- attack.defense-evasion
- attack.lateral-movement
- attack.t1550
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 4624
    LogonType: 9
  condition: selection
falsepositives:
- Legitimate remote administration activity
level: low
notes: |
  ### Technical Context
  This Sigma rule identifies instances of logon events in a Windows environment where new credentials are used to establish a remote session. Specifically, it captures Windows Security Event ID 4624, which corresponds to successful logon attempts, filtered to include only those events categorized as Logon Type 9. This type is indicative of remote interactive logons, which often suggest scenarios where users are accessing systems from remote locations using different credentials than what is typically used. Data sources involved in this detection include Windows Security logs, which capture detailed information about user logon events alongside associated metadata such as the account being used and the source IP address. By monitoring this activity, analysts can detect potentially unauthorized access attempts that may signify lateral movement within the enterprise network.
  ### Investigation Steps
  - Use your EDR solution to search for the specific Event ID 4624 around the time of the alert to gather additional context on the logon event, including the user account, source IP, and any related process activity. 
  - Check the Windows event logs for other related logon types or suspicious activities that occurred shortly before or after the identified logon event to establish a timeline of events.
  - Review firewall logs from your NGFW or VPN logs to identify any unusual remote connections that coincide with the detected logon event, paying particular attention to unexpected IP addresses or locations.
  - Utilize threat intelligence from your AV or security feeds to determine if the account used in the logon attempt has been associated with known threat actors or if there are alerts related to similar activities in your environment.
