title: HackTool - DiagTrackEoP Default Named Pipe
id: 1f7025a6-e747-4130-aac4-961eb47015f1
status: test
description: Detects creation of default named pipe used by the DiagTrackEoP POC,
  a tool that abuses "SeImpersonate" privilege.
references:
- https://github.com/Wh04m1001/DiagTrackEoP/blob/3a2fc99c9700623eb7dc7d4b5f314fd9ce5ef51f/main.cpp#L22
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-08-03
modified: 2023-08-07
tags:
- attack.privilege-escalation
logsource:
  product: windows
  category: pipe_created
  definition: 'Note that you have to configure logging for Named Pipe Events in Sysmon
    config (Event ID 17 and Event ID 18). The basic configuration is in popular sysmon
    configuration (https://github.com/SwiftOnSecurity/sysmon-config), but it is worth
    verifying. You can also use other repo, e.g. https://github.com/Neo23x0/sysmon-config,
    https://github.com/olafhartong/sysmon-modular. How to test detection? You can
    check powershell script from this site https://svch0st.medium.com/guide-to-named-pipes-and-hunting-for-cobalt-strike-pipes-dc46b2c5f575'
detection:
  selection:
    PipeName|contains: 'thisispipe'     # Based on source code
  condition: selection
falsepositives:
- Unlikely
level: critical
notes: |
  ### Technical Context
  The Sigma rule titled "HackTool 
  - DiagTrackEoP Default Named Pipe" is designed to detect the creation of a specific named pipe, identified as "thisispipe." This named pipe is associated with the DiagTrackEoP proof-of-concept (PoC), which exploits the "SeImpersonate" privilege on Windows systems to facilitate unauthorized privilege escalation. The rule relies on Windows event logs, particularly those generated by Sysmon for named pipe events (Event ID 17 and Event ID 18). It is essential to ensure that Sysmon is configured correctly to capture these events, as the logging setup can directly impact the effectiveness of this detection.
  By monitoring named pipe creations, this detection rule helps identify potentially malicious activity related to process execution and privilege escalation. Analysts should note that while this rule is robust, false positives are unlikely due to the specific nature of the named pipe being detected.
  ### Investigation Steps
  - Review the EDR tool for any recent processes that created named pipes, particularly filtering for events related to "thisispipe."
  - Examine Sysmon logs in your SIEM for Event IDs 17 and 18 to trace back the creation of the named pipe and identify the parent processes involved.
  - Inspect the command line arguments of the detected processes to determine whether they exhibit any suspicious behavior that correlates with known attack techniques.
  - Check for additional activity in established logs, such as Windows Event Logs or security logs, to find any correlation with the detected event and investigate user account actions around the same timeframe.
