title: CobaltStrike Named Pipe Pattern Regex
id: 0e7163d4-9e19-4fa7-9be6-000c61aad77a
related:
- id: 85adeb13-4fc9-4e68-8a4a-c7cb2c336eb7     # Patterns
  type: similar
- id: d5601f8c-b26f-4ab0-9035-69e11a8d4ad2     # Generic
  type: similar
status: test
description: Detects the creation of a named pipe matching a pattern used by CobaltStrike
  Malleable C2 profiles
references:
- https://svch0st.medium.com/guide-to-named-pipes-and-hunting-for-cobalt-strike-pipes-dc46b2c5f575
- https://gist.github.com/MHaggis/6c600e524045a6d49c35291a21e10752
author: Florian Roth (Nextron Systems)
date: 2021-07-30
modified: 2022-12-31
tags:
- attack.defense-evasion
- attack.privilege-escalation
- attack.t1055
logsource:
  product: windows
  category: pipe_created
  definition: 'Note that you have to configure logging for Named Pipe Events in Sysmon
    config (Event ID 17 and Event ID 18). The basic configuration is in popular sysmon
    configuration (https://github.com/SwiftOnSecurity/sysmon-config), but it is worth
    verifying. You can also use other repo, e.g. https://github.com/Neo23x0/sysmon-config,
    https://github.com/olafhartong/sysmon-modular You can also use other repo, e.g.
    https://github.com/Neo23x0/sysmon-config, https://github.com/olafhartong/sysmon-modular.
    How to test detection? You can always use Cobalt Strike, but also you can check
    powershell script from this site https://svch0st.medium.com/guide-to-named-pipes-and-hunting-for-cobalt-strike-pipes-dc46b2c5f575'
detection:
  selection:
  - PipeName|re: '\\mojo\.5688\.8052\.(?:183894939787088877|35780273329370473)[0-9a-f]{2}'
  - PipeName|re: '\\wkssvc_?[0-9a-f]{2}'
  - PipeName|re: '\\ntsvcs[0-9a-f]{2}'
  - PipeName|re: '\\DserNamePipe[0-9a-f]{2}'
  - PipeName|re: '\\SearchTextHarvester[0-9a-f]{2}'
  - PipeName|re: '\\mypipe-(?:f|h)[0-9a-f]{2}'
  - PipeName|re: '\\windows\.update\.manager[0-9a-f]{2,3}'
  - PipeName|re: '\\ntsvcs_[0-9a-f]{2}'
  - PipeName|re: '\\scerpc_?[0-9a-f]{2}'
  - PipeName|re: '\\PGMessagePipe[0-9a-f]{2}'
  - PipeName|re: '\\MsFteWds[0-9a-f]{2}'
  - PipeName|re: '\\f4c3[0-9a-f]{2}'
  - PipeName|re: '\\fullduplex_[0-9a-f]{2}'
  - PipeName|re: '\\msrpc_[0-9a-f]{4}'
  - PipeName|re: '\\win\\msrpc_[0-9a-f]{2}'
  - PipeName|re: '\\f53f[0-9a-f]{2}'
  - PipeName|re: '\\rpc_[0-9a-f]{2}'
  - PipeName|re: '\\spoolss_[0-9a-f]{2}'
  - PipeName|re: '\\Winsock2\\CatalogChangeListener-[0-9a-f]{3}-0,'
  condition: selection
falsepositives:
- Unknown
level: critical
notes: |
  ### Technical Context
  This Sigma rule is designed to detect the creation of named pipes that match specific regex patterns commonly used by Cobalt Strike's Malleable Command and Control (C2) profiles. Named pipes are a mechanism for inter-process communication on Windows systems, and the creation of suspicious named pipes can indicate an attempt to evade detection or escalate privileges by malicious actors. The rule looks for named pipes with various patterns that are indicative of Cobalt Strike, a popular penetration testing and post-exploitation tool that is often abused by threat actors. The primary sources of telemetry for this detection are Windows Sysmon logs, particularly focusing on Event ID 17 (Pipe Created) and Event ID 18 (Pipe Connected). This detection relates to the MITRE ATT&CK technique T1055 (Process Injection), as it identifies mechanisms utilized for evade detection and lateral movement.
  ### Investigation Steps
  - **Check Sysmon Logs**: Investigate Sysmon logs for Event ID 17 and look for any named pipes that match the specified patterns.
  - **Correlate with EDR Data**: Use EDR tools to trace the process tree that created the suspicious named pipe and identify any related or anomalous processes that might indicate malicious activity.
  - **Analyze Network Traffic**: Review network logs to determine if any unusual network connections or data exfiltration attempts correlate with the timing of the named pipe creation.
  - **Review User Activity**: Check user activity logs and correlated events within the timeframe of the rule trigger to assess if any legitimate user actions could have led to the named pipe creation.
  ### Prioritization
  Given the critical severity level of this alert, the detection of named pipes used by Cobalt Strike indicates a probable ongoing attack or active exploitation within the environment, necessitating immediate investigation to prevent further potential damage.
  ### Blind spots and Assumptions
  This rule may not fire if the logging for Sysmon named pipe events is not properly configured or if other non-malicious applications use similar naming conventions. It is also possible for adversaries to obfuscate their named pipe patterns to evade detection. Furthermore, if a system is compromised but not actively being used for malicious purposes at the time of monitoring, the rule may fail to trigger.
  > **Disclaimer:** This investigation guide was created using generative AI technology and has not been reviewed for its accuracy and relevance. While every effort has been made to ensure its quality, we recommend validating the content and adapting it to suit specific environment and operational needs. Please communicate any changes to the detection engineering team.
