title: HackTool - CoercedPotato Named Pipe Creation
id: 4d0083b3-580b-40da-9bba-626c19fe4033
status: test
description: Detects the pattern of a pipe name as used by the hack tool CoercedPotato
references:
- https://blog.hackvens.fr/articles/CoercedPotato.html
- https://github.com/hackvens/CoercedPotato
author: Florian Roth (Nextron Systems)
date: 2023-10-11
tags:
- attack.defense-evasion
- attack.privilege-escalation
- attack.t1055
logsource:
  product: windows
  category: pipe_created
  definition: 'Note that you have to configure logging for Named Pipe Events in Sysmon
    config (Event ID 17 and Event ID 18). The basic configuration is in popular sysmon
    configuration (https://github.com/SwiftOnSecurity/sysmon-config), but it is worth
    verifying. You can also use other repo, e.g. https://github.com/Neo23x0/sysmon-config,
    https://github.com/olafhartong/sysmon-modular. How to test detection? You can
    check powershell script from this site https://svch0st.medium.com/guide-to-named-pipes-and-hunting-for-cobalt-strike-pipes-dc46b2c5f575'
detection:
  selection:
    PipeName|contains: '\coerced\'
  condition: selection
falsepositives:
- Unknown
level: high
notes: |
  ### Technical Context
  The Sigma rule titled "HackTool 
  - CoercedPotato Named Pipe Creation" is designed to detect the creation of named pipes that are indicative of the CoercedPotato hacking tool. This tool is associated with techniques used for privilege escalation and evading defense mechanisms by leveraging Windows named pipes. The key indicator for this detection is the presence of the string `\coerced\` in the pipe name. To capture these events, it is essential to configure your Sysmon logging settings appropriately to include Event IDs 17 and 18, which pertain to named pipe creations. Analysts should ensure that Sysmon is set up correctly, as outlined in various widely-used configurations available on GitHub, to facilitate effective detection of this potential threat.
  ### Investigation Steps
  - Query the EDR solution for any recent processes that have created named pipes containing the string `\coerced\`. Pay special attention to the user context and process parentage to assess the legitimacy of the activities.
  - Review Sysmon logs specifically for Event IDs 17 and 18 to identify the time and attributes of the created named pipes. This will help correlate the named pipe activity with potential malicious actions.
  - Inspect the source and behavior of any processes associated with the named pipes. Utilize the antivirus and threat intelligence feeds to check for any known indicators of compromise related to CoercedPotato.
  - If the detection is confirmed, analyze network traffic through NDR tools to identify potential lateral movements or connections to known malicious external hosts during the time frame of the named pipe creation event.
