title: PUA - PAExec Default Named Pipe
id: f6451de4-df0a-41fa-8d72-b39f54a08db5
status: test
description: Detects PAExec default named pipe
references:
- https://github.com/microsoft/Microsoft-365-Defender-Hunting-Queries/blob/efa17a600b43c897b4b7463cc8541daa1987eeb4/Command%20and%20Control/C2-NamedPipe.md
- https://github.com/poweradminllc/PAExec
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-10-26
tags:
- attack.execution
- attack.t1569.002
logsource:
  category: pipe_created
  product: windows
  definition: 'Note that you have to configure logging for Named Pipe Events in Sysmon
    config (Event ID 17 and Event ID 18). The basic configuration is in popular sysmon
    configuration (https://github.com/SwiftOnSecurity/sysmon-config), but it is worth
    verifying. You can also use other repo, e.g. https://github.com/Neo23x0/sysmon-config,
    https://github.com/olafhartong/sysmon-modular. How to test detection? You can
    check powershell script from this site https://svch0st.medium.com/guide-to-named-pipes-and-hunting-for-cobalt-strike-pipes-dc46b2c5f575'
detection:
  selection:
    PipeName|startswith: '\PAExec'
  condition: selection
falsepositives:
- Unknown
level: medium
notes: |
  ### Technical Context
  This Sigma rule is designed to detect the creation of named pipes initiated by PAExec, a tool often used for executing processes across machines on a network. Named pipes are a method of inter-process communication on Windows, and when pa_exec utilizes them, it typically follows a particular naming convention that begins with `\PAExec`. This rule watches for events related to named pipe creation by monitoring Sysmon logs, specifically Events 17 and 18, which relate to the creation and deletion of named pipes. Analysts should ensure that logging for Named Pipe Events is properly configured in Sysmon to capture these indicative logs, as they provide insight into potential lateral movement within a network or other unauthorized access attempts through PAExec.
  ### Investigation Steps
  - Review Sysmon logs for Event ID 17 and focus on entries where the `PipeName` starts with `\PAExec` to identify anomalies related to named pipe activity.
  - Utilize EDR solutions to investigate the processes associated with the named pipe creations, checking for any unusual parent-child process relationships that could indicate malicious behavior.
  - Investigate network activity to determine if any unusual connections have been initiated in conjunction with the PAExec activity, focusing on internal traffic patterns.
  - Check for existing alerts or prior incidents involving PAExec or similar tools, to ascertain whether this may be a recurring issue or a potential false positive.
