title: HackTool - EfsPotato Named Pipe Creation
id: 637f689e-b4a5-4a86-be0e-0100a0a33ba2
status: test
description: Detects the pattern of a pipe name as used by the hack tool EfsPotato
references:
- https://twitter.com/SBousseaden/status/1429530155291193354?s=20
- https://github.com/zcgonvh/EfsPotato
author: Florian Roth (Nextron Systems)
date: 2021-08-23
modified: 2023-12-21
tags:
- attack.defense-evasion
- attack.privilege-escalation
- attack.t1055
logsource:
  product: windows
  category: pipe_created
  definition: 'Note that you have to configure logging for Named Pipe Events in Sysmon
    config (Event ID 17 and Event ID 18). The basic configuration is in popular sysmon
    configuration (https://github.com/SwiftOnSecurity/sysmon-config), but it is worth
    verifying. You can also use other repo, e.g. https://github.com/Neo23x0/sysmon-config,
    https://github.com/olafhartong/sysmon-modular. How to test detection? You can
    check powershell script from this site https://svch0st.medium.com/guide-to-named-pipes-and-hunting-for-cobalt-strike-pipes-dc46b2c5f575'
detection:
  selection:
    PipeName|contains:
    - '\pipe\'
    - '\pipe\srvsvc'          # more specific version (use only this one if the other causes too many false positives)
  filter_optional_ctx:
    PipeName|contains: '\CtxShare'
  filter_optional_default:
    PipeName|startswith: '\pipe\'     # excludes pipes that start with \pipe\*
  condition: selection and not 1 of filter_optional_*
falsepositives:
- \pipe\LOCAL\Monitorian     # https://github.com/emoacht/Monitorian
level: high
notes: |
  ### Technical Context
  The Sigma rule for detecting named pipe creation associated with the hack tool EfsPotato focuses on identifying specific patterns in named pipe names that indicate potential misuse. Named pipes are a method of inter-process communication in Windows, and EfsPotato uses these pipes to facilitate privilege escalation in a compromised environment. The rule looks for pipe names containing elements like `\pipe\` and specifically `\pipe\srvsvc`, as these are indicative of the EfsPotato tool's behavior. The rule requires the logging of named pipe events configured in Sysmon, specifically Event IDs 17 and 18, to function effectively. Investigators should ensure that appropriate Sysmon configurations are in place to enable the capture of this data.
  ### Investigation Steps
  - Use your EDR solution to query for any recent process creations that involve named pipes, focusing on those that include `\pipe\srvsvc`. This will help to identify any processes that spawned EfsPotato or similar tools.
  - Review Sysmon logs, specifically Event IDs 17 and 18, to confirm the creation of named pipes matching the specified patterns and correlate these events against other logs for unusual activity.
  - Investigate any user accounts associated with the relevant named pipe activity by checking authentication logs through your SIEM or Active Directory. Look for signs of privilege escalation or suspicious logins.
  - Examine network logs from your NGFW or Proxy server to detect outbound connections from systems that created the suspicious named pipes. This could reveal if any data exfiltration or lateral movement occurred.
